{
    "87942": [
        "Обратный ход",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Возере растут лотосы. Засутки каждый лотос делится пополам, ивместо одного лотоса появляются два. Ещё через сутки каждый изполучившихся лотосов делится пополам итак далее. Через 30суток озеро полностью покрылось лотосами. Через какое время озеро было заполнено наполовину?",
        "Подсказка: Обратите внимание, засутки число лотосов удваивается.",
        "Решение: Если вы прочтёте условие задачи внимательно, топоймёте, что озеро было заполнено наполовину через 29суток. Засутки дотого, как озеро заполнится, оно будет заполнено ровно наполовину.",
        "Ответ: Через 29суток."
    ],
    "88262": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Можно ли выложить в ряд все 28 косточек домино согласно правилам игры так, чтобы на одном конце ряда оказалось 5, а на другом 6 очков?",
        "Решение: См. задачу 30291.",
        "Ответ: Нельзя."
    ],
    "64536": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: На доске были записаны числа 3, 9 и 15. Разрешалось сложить два записанных числа, вычесть из этой суммы третье, а результат записать на доску вместо того числа, которое вычиталось. После многократного выполнения такой операции на доске оказались три числа, наименьшее из которых было 2013. Каковы были два остальных числа?",
        "Решение: Заметим, что 9 – 3 = 6 и 15 – 9 = 6. Покажем, что в любой момент одно из чисел на доске будет на 6 меньше второго и на 6 больше третьего.    Действительно, пусть это свойство выполнено, и на доске записаны числа x – 6, x и x + 6. Если сложить два крайних числа и вычесть среднее, то тройка чисел не изменится. Если сложить первых два числа и вычесть третье, то получится тройка x – 6, x и x – 12, а если сложить два последних числа и вычесть первое, то получится тройка x + 12, x и x + 6. Во всех случаях указанное свойство сохраняется, поэтому оно будет выполняться после каждого шага. Значит, искомые числа: 2013 + 6 = 2019 и 2019 + 6 = 2025.",
        "Ответ: 2019 и 2025."
    ],
    "64554": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: ",
        "Условие: На экране компьютера – число 12. Каждую секунду число на экране умножают или делят либо на 2, либо на 3. Результат действия возникает на экране вместо записанного числа. Ровно через минуту на экране появилось число. Могло ли это быть число 54?",
        "Решение: Заметим, что 12 = 22·31, то есть суммарный показатель степени множителей (двоек и троек) равен 3. Независимо от произведённого действия, при каждой смене числа суммарный показатель степени множителей изменяется на 1. Всего должно произойти 60 таких изменений. Следовательно, через 60 секунд суммарный показатель степени должен быть той же чётности, что и в исходном числе 12.    Но 54 = 21·33, то есть этот показатель равен 4 – чётному числу. Значит, получить число 54 ровно через минуту невозможно.",
        "Ответ: Не могло."
    ],
    "64896": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3+",
        "Классы: 7,8,9,10,11",
        "Условие: На столе выложены в ряд 64 гирьки, причём масса двух любых соседних гирек отличается на 1 г. Требуется разложить гирьки на две кучки с равными массами и равным количеством гирь. Всегда ли это удастся?",
        "Решение: Разобьём все гири на четвёрки гирь, стоящих подряд. Рассмотрим любую из этих четвёрок. Положим первые две гири в разные кучки (большую – в первую кучку, а меньшую – во вторую) и следующие две гири также положим в разные кучки, но наоборот (меньшую – в первую кучку, а большую – во вторую). Так как модуль разности между массами первой и второй гирь равен модулю разности между массами третьей и четвёртой гирь, то мы положили в обе кучки по две гири одинакого суммарного веса. Так же поступим с остальными четвёрками.",
        "Ответ: Всегда."
    ],
    "64959": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: В одной из вершин шестиугольника лежит золотая монета, а в остальных ничего не лежит. Кощей Бессмертный чахнет над златом и каждое утро снимает с одной вершины произвольное количество монет, после чего тут же кладёт на соседнюю вершину в шесть раз больше монет. Если к исходу какого-то дня во всех вершинах будет поровну монет, Кощей станет Властелином Мира. Докажите, что хоть злата у него сколько угодно, но Властелином Мира ему не бывать.",
        "Решение: Занумеруем вершины шестиугольника, начиная с той, где лежит монета, последовательными натуральными числами от 1 до 6. По условию разность между числом монет в нечётных вершинах и числом монет в чётных вершинах каждый день меняется на число, кратное 7.     В начальный момент эта разность равнялась 1. Поэтому сделать её равной нулю Кощею не удастся. Тем более ему не удастся уравнять количество монет во всех   вершинах."
    ],
    "65057": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В трёх клетках клетчатого листа записаны числа, а остальные клетки пусты. Разрешается выбрать два числа из разных непустых клеток и записать в пустую клетку их сумму; также можно выбрать числа а, b, c из трёх разных непустых клеток и записать в пустую клетку число ab + с². Докажите, что при помощи нескольких таких операций можно записать в одну из клеток квадрат суммы трёх исходных чисел (какими бы они ни были).",
        "Решение: Пусть записаны числа a, b, c. Последовательно составим a + b, b + c, a + c, (a + b)с + a², (b + c)a + b², (c + a)b + c², (a + b)с + a² + (b + c)a + b² и (a + b)с + a² + (b + c)a + b² + (c + a)b + c² = (a + b + c)²."
    ],
    "65294": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: В окружность вписан неправильный многоугольник. Если вершина A разбивает дугу, заключенную между двумя другими вершинами, на две неравные части, то такая вершина A называется неустойчивой. Каждую секунду какая-нибудь неустойчивая вершина перепрыгивает в середину своей дуги. В результате каждую секунду образуется новый многоугольник. Докажите, что сколько бы секунд ни прошло, многоугольник никогда не будет равным исходному.",
        "Решение: Рассмотрим длины дуг между соседними точками. В силу неравенства a² + b² > (a+b/2)² (при a ≠ b) сумма квадратов этих дуг каждую секунду уменьшается. Следовательно, многоугольник никогда не станет таким же, как был."
    ],
    "65424": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: На доске записаны числа 20 и 100. Разрешается дописать на доску произведение любых двух имеющихся на ней чисел. Можно ли такими операциями когда-нибудь получить на доске число 50...0 (2015 нулей)?",
        "Решение: Так как 20 = 2²·5, 100 = 2²·5², то изначально на доске записаны числа, в разложении которых простые множители двоек не меньше, чем пятерок. При умножении двух чисел, обладающим этим свойством, получится число с этим же свойством, то есть оно будет выполняться для всех чисел, записанных на доске. В разложении числа 50...0 на простые множители количество пятерок на 1 больше, чем количество двоек, поэтому его получить нельзя.",
        "Ответ: Нельзя."
    ],
    "103893": [
        "Перебор случаев",
        "Сложность: 2",
        "Классы: 6",
        "Условие: Кузнечик прыгает вдоль прямой вперёд  на 80см или назад на 50см. Может ли он  менее чем за 7прыжков удалиться от начальной точки ровно на 1м 70см?",
        "Подсказка: По условию не обязательно двигаться вперёд!",
        "Решение: После нескольких неудачных попыток удалиться на 1м 70см вперёд может показаться, что ответ — ''нет''.  Заметим, что удалиться на 1м 70см не означает обязательно удалиться вперёд.  Попробуем удалиться назад.",
        "Ответ: Да, может.  Например, 5 прыжков назад и 1 вперёд."
    ],
    "65507": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Двенадцать стульев стоят в ряд. Иногда на один из свободных стульев садится человек. При этом ровно один из его соседей (если они были) встаёт и уходит.   Какое наибольшее количество человек могут одновременно оказаться сидящими, если вначале все стулья были пустыми?",
        "Решение: Оценка. Все стулья одновременно занять невозможно, так как в тот момент, когда сядет человек на последний незанятый стул, один из его соседей встанет. Следовательно, одновременно сидящих может быть не больше чем 11.",
        "Ответ: 11."
    ],
    "65590": [
        "Выделение полного квадрата. Суммы квадратов",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Петя записал несколько алгебраических выражений, возвёл каждое из них в квадрат и сложил результаты.   Могло ли у него в итоге получиться выражение x² + y² + z² + 3y + 4x + xz + 1?",
        "Решение: Если выражение x² + y² + z² + 3y + 4x + xz + 1 равно сумме квадратов нескольких алгебраических выражений, то при любых x, y и z его значение  неотрицательно. Но, например, при x = z = 0, y = –1, x² + y² + z² + 3y + 4x + xz + 1 = 1 – 3 + 1 < 0.",
        "Ответ: Не могло."
    ],
    "65616": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Изначально на экране компьютера – какое-то простое число. Каждую секунду число на экране заменяется на число, полученное из предыдущего прибавлением его последней цифры, увеличенной на 1. Через какое наибольшее время на экране возникнет составное число?",
        "Решение: Пусть изначально на экране – число 2, тогда получим следующую цепочку: 2 – 5 – 11 – 13 – 17 – 25.    Шестое число – составное, значит, в этом случае пройдёт 5 секунд. Докажем, что в остальных случаях потребуется не больше чем 5 секунд.     Действительно, если на экране было нечётное простое число, не оканчивающееся на 9, то его последняя цифра будет изменяться по циклу:   1 – 3 – 7 – 5 – 1. Значит, не позже чем через 4 секунды появится число, оканчивающееся на 5. Так как оно не равно пяти, то является составным.     Если же на экране было простое число, оканчивающееся на 9, то каждую секунду будет прибавляться по 10. Так как 10 при делении на 3 даёт остаток 1, то   прибавив 10 один или два раза, мы обязательно получим число, кратное 3. В этом случае для появления составного числа на экране потребуется не более 2 секунд.",
        "Ответ: Через 5 секунд."
    ],
    "65662": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Шагреневая кожа исполняет желания, но после каждого желания её площадь уменьшается: либо на 1 дм² в обычном случае, либо в два раза – если желание было заветное. Десять желаний уменьшили площадь кожи втрое, следующие несколько – еще всемеро, а еще через несколько желаний кожа вообще пропала. Какова первоначальная площадь кожи?",
        "Решение: Пусть первоначальная площадь кожи равна S дм² (S > 0). После того, как площадь уменьшилась втрое,   а затем  еще всемеро, она стала равна S/21 дм². Это число должно быть целым, иначе делением пополам и вычитанием 1 невозможно получить 0.    Рассмотрим первые 10 желаний. Среди них не может быть более одного заветного, так как после них площадь уменьшилась втрое, а S/4  < S/3. Рассмотрим два случая.    1) Заветных желаний не было. Тогда S – 10 = S/3, то есть S = 15. Но это число не кратно 7, что противоречит условию уменьшения площади в 7 раз.    2) Пусть сначала было k обычных желаний, затем – заветное, а затем – еще 9 – k обычных. Тогда ½ (S – k) – (9 – k) = S/3, откуда S = 3(18 – k).  Учитывая, что k – целое число от 0 до 9, находим единственное значение k, для которого S кратно 7: k = 4. Следовательно, S = 42.",
        "Ответ: 42 дм²."
    ],
    "66131": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: Зубной врач запретил Соне съедать больше десяти карамелек в день, причём, если в какой-то день она съедает больше семи карамелек, то в следующие два дня ей нельзя съедать более пяти карамелек за день. Какое наибольшее количество карамелек Соня сможет съесть за 25 дней, следуя указаниям зубного врача?",
        "Решение: Если Соня съест в какой-то день (кроме двух последних) больше 7 карамелек, то в следующие два дня она съест не больше 5 + 5 = 10, а за 3 дня – не больше 20 конфет. Значит, в эти три дня ей выгоднее было съедать по 7 конфет.     Отсюда следует, что в первые 23 дня Соне выгоднее съедать по 7 конфет. В последние два дня она может съесть 7 + 10 = 17 конфет (это выгоднее, чем 10 + 5).     Таким образом, наибольшее количество съеденных конфет равно 24·7 + 10 = 178.",
        "Ответ: 178 карамелек."
    ],
    "77890": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: 12 полей расположены по кругу: на четырёх соседних полях стоят четыре разноцветных фишки: красная, жёлтая, зелёная и синяя.  Одним ходом можно передвинуть любую фишку с поля, на котором она стоит, через четыре поля на пятое (если оно свободно) в любом из двух возможных направлений. После нескольких ходов фишки стали опять на те же четыре поля. Как они могут при этом переставиться?",
        "Решение: Ответ:",
        "Ответ: Источники и прецеденты использования"
    ],
    "79529": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Над строкой из четырёх чисел 1, 9, 8, 8 проделаем следующую операцию: между каждыми двумя соседними числами впишем число, которое получится в результате вычитания левого числа из правого. Над новой строкой проделаем ту же операцию и т.д. Найдите сумму чисел строки, которая получится после ста таких операций.",
        "Решение: Посмотрим, как изменяется сумма чисел строки после одной операции. Пусть",
        "Ответ: 726"
    ],
    "79549": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Часть клеток бесконечной клетчатой бумаги покрашена в красный цвет, остальные  — в белый (не обязательно в шахматном порядке). По красным клеткам прыгает  кузнечик, по белым — блоха, причём каждый прыжок может быть сделан на любое расстояние по вертикали или горизонтали. Докажите, что кузнечик и блоха могут оказаться рядом, сделав в общей сложности (в сумме) не более трёх прыжков.",
        "Решение: Докажем сначала, что если кузнечик и блоха сидят на одной линии (вертикали или горизонтали), то они могут оказаться рядом, сделав в общей сложности не более двух прыжков. Действительно, на этой линии есть клетки обоих цветов, а значит, есть соседние клетки, одна из которых покрашена в красный цвет, а другая в белый. Следовательно, кузнечик может прыгнуть в одну из них, а блоха— в другую. Итак, если кузнечик и блоха сидят на одной линии, то они могут оказаться рядом, сделав в сумме не более двух прыжков.  Докажем теперь, что кузнечик и блоха могут за один прыжок оказаться на одной линии. Для этого проведём вертикаль, на которой сидит кузнечик, и горизонталь, на которой сидит блоха. Так как клетка их пересечения покрашена в один из цветов, то либо кузнечик, либо блоха могут прыгнуть в эту клетку. После этого прыжка они окажутся на одной линии.  Итак, где бы ни сидели кузнечик и блоха, они могут за один прыжок оказаться на одной линии, а потом не более чем за два прыжка оказаться рядом,т.е. они могут оказаться рядом не более чем за три прыжка."
    ],
    "88269": [
        "Подсчет двумя способами",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: На кошачьей выставке в ряд сидят 10 котов и 19 кошек, причём рядом с каждой кошкой сидит более толстый кот.   Докажите, что рядом с каждым котом сидит кошка, которая тоньше него.",
        "Решение: Проведём ккаждой кошке стрелочку от сидящего рядом с ней более толстого, чем она, кота. Число стрелочек – 19: столько, сколько кошек. Но, с другой стороны, откаждого кота не может идти больше двух стрелок, так как стрелки направлены на соседних кошек, да ещё не на всех, а только на более худых. Следовательно, стрелки ведут от всех котов, что и требовалось."
    ],
    "88282": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: В небольшом шотландском городке стояла школа, в которой учились ровно 1000 школьников. Укаждого изних был шкаф для одежды – всего 1000 шкафов, причём шкафы были пронумерованы числами о 1 до 1000. А ещё в этой школе жили привидения – ровно 1000 привидений. Каждый школьник, уходя из школы, запирал свой шкаф, а ночью привидения начинали играть сошкафами, то отпирая, то запирая их. Однажды вечером школьники, как обычно, оставили запертыми все шкафы. Ровно в полночь появились привидения. Сначала первое привидение открыло все шкафы; потом второе привидение закрыло те шкафы, номер которых делился на 2; затем третье привидение поменяло позиции (то есть открыло  шкаф, если он был закрыт, и закрыло – если он был открыт) тех шкафов,  номер которых делился на 3; следом за ним четвёртое привидение поменяло  позиции тех шкафов, номер которых делился на 4 и т.д. Как только тысячное привидение поменяло позицию тысячного шкафа, пропел петух, и все привидения срочно убрались восвояси. Не скажете ли вы, сколько осталось открытых шкафов после посещения привидений?",
        "Решение: Если номер шкафа C не является точным квадратом, то он имеет чётное число делителей (см. задачу 30365). Такой шкаф поменяет позиции чётное число раз и в итоге окажется закрытым. Если же номер шкафа C является точным квадратом, то число его различных делителей будет нечётно, и шкаф в итоге окажется открытым. Количество точных квадратов среди первой тысячи чисел – 31. Значит, и открытых шкафов будет 31.",
        "Ответ: 31 шкаф."
    ],
    "35744": [
        "Подсчет двумя способами",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Ковровая дорожка покрывает лестницу из 9 ступенек.  Длина и высота лестницы равны 2 метрам.  Хватит ли этой ковровой дорожки, чтобы покрыть  лестницу из 10 ступенек длиной и высотой 2 метра?",
        "Подсказка: Длина горизонтальных участков дорожки равна 2 метрам,  и длина вертикальных участков дорожки также равна 2 метрам.",
        "Решение: Пусть дорожка покрывает лестницу с некоторым количеством ступенек,  длина и высота которой равна 2 метрам.  Мысленно спроектируем дорожку на горизонталь и на вертикаль.  Суммарная длина горизонтальных участков дорожки равна длине лестницы,  т.е. 2 метрам,  а длина вертикальных участков дорожки равна высоте лестницы,  т.е. также равна 2 метрам.    Таким образом, для того, чтобы покрыть данную лестницу  вне зависимости от числа ее ступенек, дорожка должна иметь  длину не меньше 2+2=4 метров.",
        "Ответ: хватит."
    ],
    "104110": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Пете мама тоже дала денег накарандаши. Условия рекламной акции такие же   как в задаче  104109).  Петя постарался купить как можно больше карандашей иврезультате он смог купить на12 карандашей больше, чем просила мама. Насколько карандашей мама давала денег?",
        "Решение: Повторяя рассуждения задачи  104109, можно убедиться, что, если мама дала Пете денег на 49 карандашей, то он смог купить 61 карандаш, то есть на 12 карандашей больше, чем просила мама. Значит, 49 – один из ответов.     Аналогично можно проверить, что если бы мама дала Пете денег на 50  карандашей, то он смог бы купить 66 карандашей, то есть на 16 карандашей больше, чем просила мама. А если бы мама дала Пете денег на 48 карандашей, то он смог бы купить 59 карандашей, то есть только на 11 карандашей больше, чем просила мама.    Ясно, что, чем больше денег даст мама Пете, тем больше он сможет выиграть из-за акции. Следовательно, мама не могла ему дать денег ни больше, ни меньше, чем на 49 карандашей, а значит, 49 – единственный ответ.",
        "Ответ: На 49 карандашей."
    ],
    "107723": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Все натуральные числа от 1 до 1000 включительно разбиты на две группы: чётные и нечётные.   В какой из групп сумма всех цифр, используемых для записи чисел, больше и на сколько?",
        "Решение: Сумма цифр числа 1 равна сумме цифр числа 1000; остальные числа разобьём на 499 пар: {2, 3}, {4, 5}, ..., {998, 999}. В каждой паре сумма цифр нечётного числа на 1 больше чем сумма цифр чётного.",
        "Ответ: Сумма цифр нечётных чисел больше на 499."
    ],
    "111638": [
        "Обратный ход",
        "Сложность: 3+",
        "Классы: 6,7,8,9",
        "Условие: Мальвина дала Буратино задание: Сосчитай кляксы в своей тетрадке, прибавь к их числу 7, раздели на 8, умножь на 6 и отними 9. Если сделаешь всё правильно, получишь простое число. Буратино всё перепутал. Кляксы он подсчитал точно, но потом умножил их количество на 7, вычел из результата 8, затем разделил на 6 и прибавил 9. Какой ответ получился у Буратино?",
        "Решение: Рассмотрим вычисления по плану Мальвины. Соседние операции раздели на 8 и умножь на 6 заменим на одну операцию умножения на ¾. Если бы после умножения на ¾ получалось дробное число, то, вычтя из него 9, мы бы снова получили дробное число, а должны получить простое (то есть целое), значит, при умножении на ¾ мы получаем целое число, причём кратное 3. Тогда после вычитания 9 получится число, также кратное 3. Единственное простое число, кратное 3, это само число 3. Значит, по плану Мальвины в конце должно было получиться 3. Произведя операции в обратном порядке, найдём число клякс: (3 + 9) : 6·8 – 7 = 9. Следовательно,   Буратино получил число (9·7 – 8) : 6 + 9 = 18&frac16;.",
        "Ответ: 18&frac16;."
    ],
    "32049": [
        "Выделение полного квадрата. Суммы квадратов",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Известно, что число a + 1/a   – целое. Докажите, что число a² + 1/a² – тоже целое.",
        "Решение: a² + 1/a² = (a + 1/a)² – 2."
    ],
    "115461": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Дан такой набор из 2009 чисел, что если каждое число в наборе заменить на сумму остальных чисел, то получится тот же набор.   Найдите произведение всех чисел набора.",
        "Решение: См. задачу 109925.",
        "Ответ: 0."
    ],
    "78191": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3+",
        "Классы: 9",
        "Условие: Даны 12 чисел,",
        "Решение: Докажем сначала, что среди этих чисел найдётся покрайней мере3 отрицательных. Для этого разобьём данные числа натри четвёрки подряд идущих чисел идокажем, что вкаждой четвёрке встретится хотябы одно отрицательное число. Предположим, что внекоторой четвёрке"
    ],
    "78194": [
        "Обратный ход",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: Доказать, что шахматную доску размером 4 на 4 нельзя обойти ходом шахматного  коня, побывав на каждом поле ровно один раз.",
        "Решение: Во-первых заметим, что в диаметрально противоположные угловые клетки ходом коня можно попасть только из двух клеток. Поэтому, если обход и существует, то начальной и конечной клеткой такого обхода должны быть соседние по стороне угловые клетки, причем третьими с начала и с конца пути должны быть оставшиеся угловые клетки, диаметрально противоположные началу и концу соответственно. Но заметим, что, начав из любой клетки внутреннего квадратика 2×2, нельзя оказаться в соседней с ней клетке того же квадратика, побывав во всех клетках доски, кроме угловых и клеток внутреннего квадратика. А значит, искомого обхода не существует."
    ],
    "78532": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3+",
        "Классы: 7",
        "Условие: При каких натуральных",
        "Решение: См. решение задачи",
        "Ответ: При всех натуральных"
    ],
    "78538": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: Доказать, что любое чётное число 2",
        "Решение: Занумеруем точки с целыми неотрицательными координатами ("
    ],
    "78562": [
        "Подсчет двумя способами",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Бумажный квадрат был проколот в 1965 точках. Из точек-проколов и вершин квадрата никакие три не лежат на одной прямой. Потом сделали несколько прямолинейных не пересекающихся между собой разрезов, каждый из которых начинался и кончался только в проколотых точках или вершинах квадрата. Оказалось, что квадрат разрезан на треугольники, внутри которых проколов нет. Сколько было сделано разрезов и сколько получилось треугольников?",
        "Решение: Ответ:",
        "Ответ: n"
    ],
    "35552": [
        "Обратный ход",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: На прямой отметили несколько точек. После этого между каждыми двумя соседними точками добавили по точке. Такую операцию повторили три раза, и в результате на прямой оказалось 65 точек. Сколько точек было вначале?",
        "Подсказка: Если на прямой было n точек, то за одну операцию добавилась n – 1 точка.",
        "Решение: Если в конце было 65 точек, то перед этим было 33 (а добавилось 32) точки. Аналогично после первой операции было 17 точек, а до нее – 9.",
        "Ответ: 9 точек."
    ],
    "78622": [
        "Подсчет двумя способами",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: Семь школьников решили за воскресенье обойти семь кинотеатров. Во всех них сеансы начинаются в 9.00, 10.40, 12.20, 14.00, 15.40, 17.20, 19.00 и 20.40 (8 сеансов). На каждый сеанс шестеро шли вместе, а кто-нибудь один (не обязательно один и тот же) шел в другой кинотеатр. К вечеру каждый побывал в каждом кинотеатре. Докажите, что в каждом кинотеатре был сеанс, на котором не был ни один из этих школьников.",
        "Решение: Предположим противное. Пусть внекотором кинотеатре накаждом сеансе кто-то был. Тогда вовремя каждого сеанса одна изгрупп (один человек или шесть человек) сидела вэтом кинотеатре, адругая группа— водном изоставшихся. Таким образом, всего вдругих кинотеатрах они посетили неболее восьми сеансов. Сдругой стороны, вкаждом изкинотеатров группа школьников должна побывать неменее двух раз (так как заодин раз все школьники посетить кинотеатр немогут, акаждый школьник посетил вкаждом кинотеатре хотябы один сеанс). Следовательно, общее число посещений других кинотеатров неменьше, чем"
    ],
    "78704": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 11",
        "Условие: Колода перфокарт четырёх цветов разложена в один ряд. Если две перфокарты одного цвета лежат рядом или через одну, то можно выбрасывать ту из них, которая левее. Кроме того, можно подкладывать справа любое количество перфокарт из других колод. Доказать, что можно подкладывать и выбрасывать перфокарты таким образом, чтобы в конце концов их осталось только четыре.",
        "Решение: Покажем, что если вколоде лежат перфокарты"
    ],
    "78708": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 8",
        "Условие: С числом",
        "Решение: Мы будем доказывать утверждение задачи для любого числа"
    ],
    "79538": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Калькулятор выполняет пять операций: сложение, вычитание, умножение, деление и извлечение квадратного корня. Найдите формулу, по которой на этом калькуляторе можно определить наименьшее из двух произвольных чисел",
        "Решение: Ответ:",
        "Ответ: a"
    ],
    "79571": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3+",
        "Классы: 9",
        "Условие: Докажите, что из 53 различных натуральных чисел, не превосходящих в сумме 1990, всегда можно выбрать  2 числа, составляющих в сумме 53.",
        "Решение: Допустим, что такой набор, из которого выбраны 2 числа, составляющие в сумме  53, не нашёлся.  Пусть"
    ],
    "32024": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Для того, чтобы застеклить 15 окон различных размеров и   форм, заготовлено 15 стекол в точности по окнам (окна такие, что   в каждом окне должно быть одно стекло). Стекольщик, не зная, что   стекла подобраны, работает так: он подходит к очередному окну и   перебирает неиспользованные стекла до тех пор, пока не найдет   достаточно большое (то есть либо в точности подходящее, либо   такое, из которого можно вырезать подходящее), если же такого   стекла нет, то переходит к следующему окну, и так, пока не   обойдет все окна. Составлять стекло из нескольких частей нельзя.   Какое максимальное число окон может остаться незастекленными?",
        "Решение: Покажем сначала, что если в какой-либо момент осталось \t\t\t\tне меньше 8 окон (и, соответственно, не меньше 8 стекол), то \t\t\t\tстекло для какого-нибудь окна из оставшихся можно подобрать. \t\t\t\tДействительно, разобрано не больше семи стекол, значит хотя бы \t\t\t\tодно из восьми стекол, предназначавшихся заранее для восьми \t\t\t\tоставшихся окон, осталось. Его-то и можно вставить в «свое \t\t\t\tокно. Поэтому больше семи окон остаться незастекленными не может."
    ],
    "32058": [
        "Процессы и операции",
        "Сложность: 4",
        "Классы: 7,8,9,10",
        "Условие: Между соседними лагерями 1 день пути. Экспедиции   требуется перенести 1 банку консервов в лагерь, находящийся в   5 днях пути от базового и вернуться обратно. При этом:",
        "Решение: Предположим, что в каждом лагере имеется торговая палатка, где  \t\t\t\tпродаются доставленные консервы.  Пусть цена одной банки в базовом  \t\t\t\tлагере равна одному рублю, а в каждом следующем — в три раза  \t\t\t\tбольше, чем в предыдущем. В таком случае цена банок, доставленных  \t\t\t\tв любой из лагерей не меньше, чем цена банок, взятых для этого из  \t\t\t\tбазового лагеря. Действительно, для переноски банки из некоторого  \t\t\t\tлагеря в следующий мы должны взять по крайней мере три банки, две  \t\t\t\tиз которых будут съедены на пути туда и обратно соответственно.  \t\t\t\tСтоимость банки в пятом лагере будет при этом 3"
    ],
    "32841": [
        "Процессы и операции",
        "Сложность: 4",
        "Классы: 7,8,9,10",
        "Условие: При организации экспедиции на Эверест участниками было установлено  четыре высотных лагеря (не считая базового), на растоянии дня пути друг  от друга, после чего все спустились вниз. Пересчитав запасы, руководитель  решил, что надо занести еще один баллон кислорода в четвертый лагерь, а  потом всем опять вернуться вниз на отдых. При этом каждый участник",
        "Решение: Заметим, что для того, чтобы из одного высотного лагеря перенести один баллон в следующий, требуется 3 баллона: один, собственно, нужно занести, и еще два тратит участник экспедиции по пути туда и обратно. Следовательно, для выполнения задачи нужно доставить не меньше трех баллонов в третий лагерь; для этого нужно доставить не меньше 3*3=9 баллонов во второй лагерь; рассуждая аналогично, получаем, что из базового лагеря нужно унести не меньше 81 баллона. Легко показать, что имея в базовом лагере 81 баллон, можно выполнить поставленную задачу.",
        "Ответ: 81 баллон."
    ],
    "35587": [
        "Подсчет двумя способами",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Несколько шестиклассников и семиклассников обменялись рукопожатиями. При этом оказалось, что каждый шестиклассник пожал руку семи семиклассникам, а каждый семиклассник пожал руку шести шестиклассникам. Кого было больше - шестиклассников или семиклассников?",
        "Подсказка: Как связано число рукопожатий между шестиклассниками и семиклассниками с числом семиклассников?",
        "Решение: Заметим, что общее число рукопожатий между учениками разных классов в шесть раз больше числа семиклассников и в семь раз больше числа шестиклассников.",
        "Ответ: Семиклассников."
    ],
    "32070": [
        "Обратный ход",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Точку внутри квадрата соединили с вершинами – получились четыре треугольника, один из которых равнобедренный с углами при основании (стороне квадрата) 15°. Докажите, что противоположный ему треугольник правильный.",
        "Решение: Обозначим наш квадрат ABCD, а данную внутри него точку M. Пусть ∠MDC = ∠MCD = 15°.     Решим обратную задачу. Построим на стороне AB квадрата равносторонний треугольник ABN так, чтобы вершина N лежала внутри квадрата (см. рис.)."
    ],
    "35555": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Найдите количество перестановок     a",
        "Подсказка: Можно закодировать нужные перестановки,    например, таким образом:    каждое a",
        "Решение: После каждого числа в перестановке, о которой идет речь в условии,    следует либо большее его число, либо на единицу меньшее.    Каждое a",
        "Ответ: 2"
    ],
    "60299": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Из чисел от 1 до 2n выбрано n + 1 число. Докажите, что среди выбранных чисел найдутся два, одно из которых делится на другое.",
        "Решение: Рассмотрим наибольшие нечётные делители выбранных чисел. У чисел от 1 до 2"
    ],
    "66125": [
        "Выделение полного квадрата. Суммы квадратов",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Простым или составным является число 100² + 201?",
        "Решение: 100² + 201 = 100² + 2·100 + 1 = 101².",
        "Ответ: Составным."
    ],
    "64538": [
        "Процессы и операции",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Саша начертил квадрат размером 6×6 клеток и поочередно закрашивает в нём по одной клетке. Закрасив очередную клетку, он записывает в ней число – количество закрашенных клеток, соседних с ней. Закрасив весь квадрат, Саша складывает числа, записанные во всех клетках. Докажите, что в каком бы порядке Саша ни красил клетки, у него в итоге получится одна и та же сумма. (Соседними считаются клетки, имеющие общую сторону.)",
        "Решение: Рассмотрим все единичные отрезки, которые являются общими сторонами для двух клеток. Таких отрезков ровно шестьдесят – 30 вертикальных и 30 горизонтальных. Если отрезок разграничивает две закрашенные клетки, то будем говорить, что он окрашен. Заметим, что когда Саша пишет какое-то число в клетке, он указывает количество отрезков, которые не были окрашены до закрашивания этой клетки, а теперь стали окрашенными. Когда Саша приступает к суммированию, окрашены все 60 отрезков, то есть сумма чисел, которые записывает Саша, всегда будет равна 60."
    ],
    "64947": [
        "Процессы и операции",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Гномы сели за круглый стол и голосованием решили много вопросов. По каждому вопросу можно было голосовать за, против или воздержаться. Если оба соседа какого-либо гнома по какому-нибудь вопросу выбрали один и тот же вариант ответа, то при голосовании по следующему вопросу он выберет этот же вариант. А если  они выбрали два разных варианта, то при голосовании по следующему вопросу гном выберет третий вариант. Известно, что по вопросу Блестит ли золото? все гномы проголосовали за, а по вопросу Страшен ли Дракон? Торин воздержался.  Сколько могло быть гномов?",
        "Решение: Если по какому-либо вопросу гномы проголосовали единогласно, то после этого они всегда будут голосовать точно так же. Поэтому вопрос о Драконе обсуждался раньше чем вопрос о золоте.     Возможно, что перед вопросом о золоте гномы уже несколько раз  единогласно голосовали за. Рассмотрим последний вопрос, по которому был несогласный гном (голосовал не за; такой вопрос был – например, вопрос о Драконе). Пусть этот гном голосовал против. Для того, чтобы его соседи в следующий раз проголосовали за, гномы, сидящие от него через одного, должны были воздержаться. Аналогично гномы, сидящие от них через одного, должны были голосовать против, и так далее. Получаем цепочку ...П?В?П?В?..., где П и В обозначают голосовавших против и воздержавшихся, а знаки вопроса – гномов, мнение которых нас не интересует. В случае, если несогласный гном воздержался, получаем такую же цепочку.     Если количество гномов чётно, то цепочка замкнётся, а это значит, что в ней одинаковое количество В и П. Тогда количество гномов, обозначенных В и П, чётно, а количество всех гномов – вдвое больше.     Если же количество гномов нечётно, то расставив по кругу В и П, мы продолжим их ставить вместо знаков вопроса, то есть гномы расположатся по кругу парами: ...ВВППВВПП... . Это противоречит тому, что их количество нечётно.     Осталось показать на примере, что любое количество гномов, кратное  4, удовлетворяет условию задачи. Для этого, пусть они сначала проголосуют про дракона так: ...ВВППВВПП... (один из В – это Торин), а потом про золото единогласно за.",
        "Ответ: Любое число, кратное 4."
    ],
    "64965": [
        "Процессы и операции",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На экране компьютера сгенерирована некоторая конечная последовательность нулей и единиц. С ней можно производить следующую операцию: набор цифр 01 заменять на набор цифр 1000. Может ли такой процесс замен продолжаться бесконечно или  когда-нибудь он обязательно прекратится?",
        "Решение: Первый способ. Каждую операцию можно понимать как ход  какой-то единицы: единица меняется местами со стоящим перед нею нулём, а потом после нуля появляются ещё два нуля. Пусть ежеминутно делается один такой ход, и процесс продолжается бесконечно долго. Тогда найдутся единицы, которые ходили  бесконечное число раз. Рассмотрим самую левую из них и покрасим её в красный цвет. Все единицы левее красной через несколько минут перестанут перемещаться. После этого красная единица каждым своим ходом будет перемещаться  ближе к началу последовательности, то есть сделает ещё лишь конечное  число ходов, что противоречит её выбору.",
        "Ответ: Процесс прекратится."
    ],
    "88280": [
        "Подсчет двумя способами",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: В сказочной стране Перра-Терра среди прочих обитателей проживают Карабасы и Барабасы. Каждый Карабас знаком с шестью Карабасами и девятью Барабасами. Каждый Барабас знаком с десятью Карабасами исемью Барабасами. Кого вэтой стране больше – Карабасов или Барабасов?",
        "Подсказка: Вспомните задачу 88268.",
        "Решение: Мысленно натянем ниточки между каждым Карабасом и знакомым с ним Барабасом. Тогда от каждого Карабаса протянется 9 ниточек, а от каждого Барабаса – 10 ниточек. Значит, числю ниток одновременно будет в 9 раз больше числа Карабасов и в 10 раз больше числа Барабасов. Следовательно, Карабасов в 10/9 раза больше, чем Барабасов.",
        "Ответ: Карабасов."
    ],
    "78134": [
        "Симметрия и инволютивные преобразования",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Дана следующая треугольная таблица чисел:",
        "Решение: Нас интересуют не сами числа, а их остатки от деления на 1958. Поэтому  будем записывать в таблицу остатки от деления на 1958. Первая строка таблицы  при симметрии относительно среднего числа 1958/2 = 979 преобразуется следующим образом: остаток k переходит в –k (сумма чисел, равноудалённых от концов строки, делится на 1958). Следовательно, при симметрии относительно прямой, проходящей через средние числа, таблица преобразуется так, что остаток k переходит в –k. Если в какой-то строке таблицы стоят числа a1, a2, ..., an, сумма которых равна S, то в следующей строке стоят числа a1 + a2, a2 + a3, ..., an–1 + an, сумма которых равна 2S – a1 – an. В нашей таблице a1 + an = 0, поэтому при переходе к следующей строке сумма остатков каждый раз удваивается. В первой строке сумма остатков равна 979, поэтому во всех остальных строках сумма остатков равна 0. В частности, в последней строке стоит число, кратное 1958."
    ],
    "78482": [
        "Подсчет двумя способами",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Какое наибольшее число клеток может пересечь прямая, проведённая на листе клетчатой бумаги размером",
        "Решение: Пусть"
    ],
    "78567": [
        "Подсчет двумя способами",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Даны двадцать карточек. Каждая из цифр от нуля до девяти включительно написана  на двух из этих карточек (на каждой карточке – только одна цифра). Можно ли  расположить эти карточки в ряд так, чтобы нули стояли рядом, между единицами  лежала ровно одна карточка, между двойками – две, и так далее до девяток,  между которыми должно быть девять карточек?",
        "Решение: Предположим, что карточки расположены требуемым образом. Назовём отрезком набор карточек, расположенных между двумя одинаковыми карточками, а длиной такого отрезка – количество других карточек, расположенных между ними. Подсчитаем сумму длин всех отрезков двумя способами. С одной стороны,  она равна 0 + 1 + 2 + ... 9 = 45, то есть нечётна. С другой стороны, если на отрезке между карточками с цифрами a встречается ровно одна карточка с цифрой b, то на отрезке между карточками с цифрой b встречается ровно одна карточка с цифрой a. Поэтому каждая пара цифр (a, b) даёт чётный вклад в сумму длин всех отрезков (0 или 2). Следовательно, сумма длин всех отрезков чётна. Противоречие.",
        "Ответ: Нельзя."
    ],
    "79281": [
        "Процессы и операции",
        "Сложность: 4",
        "Классы: 8",
        "Условие: Несколько стеклянных шариков разложено в три кучки. Мальчик, располагающий неограниченным запасом шариков, может за один ход взять по одному шарику из каждой кучки или же добавить из своего запаса в одну из кучек столько шариков, сколько в ней уже есть. Доказать, что за несколько ходов мальчик может добиться того, что в каждой кучке не останется ни одного шарика.",
        "Решение: Достаточно показать, что мальчик может свести к ситуации, когда в каждой кучке по 2 шарика. Если в какой-то кучке 1 шарик, то мальчик может удвоить количество шариков в этой кучке. Если же во всех кучках не меньше двух шариков, то он может забрать из всех кучек по одному шарику. Тогда через каждые четыре хода, если он ещё к этому времени не успеет получить желаемый результат, количество шариков в самой большой кучке уменьшается, конечно если оно больше двух, поскольку больше трёх кучек, состоящих из одного шарика, у мальчика быть не может. Если же в самой большой кучке всего два шарика, тогда мальчик может дополнить удвоением все оставшиеся кучки из одного шарика и получить желаемый результат.  Когда мальчик добьётся того, чтобы во всех кучках стало ровно по два шарика, за следующие два хода он сможет забрать их все."
    ],
    "79479": [
        "Подсчет двумя способами",
        "Сложность: 4",
        "Классы: 10",
        "Условие: Доказать, что в любой группе из 12 человек можно выбрать двоих, а среди  оставшихся 10 человек еще пятерых так, чтобы каждый из этих пятерых удовлетворял  следующему условию: либо он дружит с обоими выбранными вначале, либо не дружит  ни с одним из них.",
        "Решение: Предположим, что это не так. Выбрав любых двух человек A  и B, среди оставшихся десятерых выберем таких людей C1, C2, ..., Ck, каждый из которых знает ровно одного в этой паре. В силу предположения k ≥ 6. Подсчитаем число N троек{A, В, Ci} двумя способами. Всего имеется 12·11 : 2 = 66 пар {A, В}, и каждой паре отвечает не менее шести человек Сi, поэтому   N ≥ 6·66 = 396. С другой стороны, Ci можно фиксировать и искать для него такие пары {A, В}, в которых он знает ровно одного человека. Если у Сi есть n знакомых, то число искомых пар {A, В} равно n(11 − n) ≤ 30. Выбрать же Сi можно 12 способами, откуда N ≤ 5·6·12 = 360. Противоречие."
    ],
    "103767": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 4",
        "Классы: 7",
        "Условие: В спортклубе тренируются 100 толстяков весом от1 до 100кг. На какое наименьшее число команд их можно разделить так, чтобы ни в одной команде не было двух толстяков, один из которых весит вдвое больше другого?",
        "Подсказка: Рассмотрите все пары толстяков, которые не должны  оказаться в  одной команде. Кроме того,  можно считать, что все100 толстяков разного веса.",
        "Решение: Заметим,  что  наличие толстяков одинакового веса только упрощает задачу. Действительно, с каждым толстяком можно поместить в команду всех толстяков того же веса. При этом условие задачи по-прежнему будет выполнено. Значит, можно считать, что все 100 толстяков разного  веса.",
        "Ответ: На две команды."
    ],
    "103949": [
        "Подсчет двумя способами",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Игорь закрасил в квадрате 6×6 несколько клеток. После этого оказалось, что во всех квадратиках 2×2 одинаковое число закрашенных клеток и во всех полосках 1×3 одинаковое число закрашенных клеток. Докажите, что старательный Игорь закрасил все клетки.",
        "Решение: Пусть в каждом квадратике 2×2 закрашено m клеток, а в каждой полоске 1×3 – n клеток. Поскольку квадрат 6×6 разбивается на 9 квадратиков, то всего закрашено 9m клеток. Аналогично получаем, что всего закрашено 12n клеток. Значит, 9m = 12n, то есть    3m = 4n. Но 0 < m ≤ 4, 0 < n ≤ 3, поэтому m = 4, n = 3, что и требовалось."
    ],
    "103826": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 2",
        "Классы: 6",
        "Условие: Расположите в кружочках (вершинах правильного десятиугольника) числа от 1 до 10 так, чтобы для любых двух соседних чисел их сумма была равна сумме двух чисел, им противоположных (симметричных относительно центра окружности).",
        "Ответ: Числа нужно расположить по кругу, например, в следующем порядке: 1, 4, 5, 8, 9, 2, 3, 6, 7, 10."
    ],
    "109470": [
        "Процессы и операции",
        "Сложность: 2+",
        "Классы: 5,6,7,8",
        "Условие: На столе лежат в ряд пять монет: средняя – орлом вверх, а остальные – решкой вверх.   За одну операцию разрешается одновременно перевернуть ровно три монеты, лежащие рядом. Можно ли, выполнив такую    операцию несколько раз, добиться того, чтобы все пять монет лежали орлом вверх?",
        "Решение: Сначала перевернём первые 3 монеты,  тогда первые две будут лежать орлом вверх, а следуюшие три– решкой вверх.  Теперь перевернем последние три монеты, в результате все пять монет лягут орлом вверх.",
        "Ответ: да, можно."
    ],
    "32101": [
        "Процессы и операции",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В алфавите племени Мумбу-Юмбу есть лишь две буквы A и Б. Два разных слова обозначают одно и то же понятие, если одно из них может быть получено из другого с помощью следующих операций:     1) в любом месте слова комбинацию букв АБА можно заменить на БАБ;     2) из любого места можно выкидывать две одинаковые буквы, идущие подряд.     а) Может ли дикарь племени сосчитать все пальцы на своей руке?     б) А дни недели?",
        "Решение: б) Пусть мы имеем Мумбу-Юмбовское слово, состоящее не менее чем из четырёх букв. Если в слове есть две одинаковые буквы, идущие подряд, то их можно выкинуть. В противном случае в этом слове буквы чередуются. Значит, начало этого слова имеет вид либо АБАБ, либо БАБА. Начало АБАБ можно заменить на БАББ и далее на более короткое БА. Аналогично, БАБА заменяется на АБ. ,br>    Таким образом, любое слово, состоящее не менее чем из четырех букв можно сократить, то есть любое понятие можно выразить словом, состоящим не более чем из трёх букв.      Слова АБА и БАБ по условию означают одно и то же, кроме того, слова ББ и АА также означают одно и то же, так оба они могут быть получены вычеркиванием пары одинаковых букв из слова ААББ.    Поэтому в языке Мумбу-Юмбу может быть выражено не более шести различных понятий: А, Б, АА, АБ, БА и АБА. Поэтому дни недели дикарь племени сосчитать не сможет.",
        "Ответ: а) Сможет; б) не сможет."
    ],
    "35166": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: На собеседовании десяти человекам был предложен тест, состоящий из нескольких  вопросов. Известно, что любые пять человек ответили вместе на все вопросы (то есть на каждый вопрос хоть один из пяти дал правильный ответ), а любые четыре – нет. При каком минимальном количестве вопросов это могло быть?",
        "Подсказка: Для каждого вопроса количество людей, не ответивших на него, не больше четырёх.",
        "Решение: По условию для каждой четвёрки людей найдется вопрос, на который они не ответили. С другой стороны, количество людей, не ответивших на этот вопрос, не больше четырёх. Поэтому число вопросов  не меньше числа четвёрок, которые можно выбрать из 10 человек, то есть     Наоборот, если в тесте было 210 вопросов (столько, сколько имеется четвёрок людей), причем на каждый вопрос не ответила своя четвёрка, то условие задачи выполняется.",
        "Ответ: При 210 вопросах."
    ],
    "58169": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Квадратный лист клетчатой бумаги разбит на меньшие квадраты отрезками, идущими по сторонам клеток.   Докажите, что сумма длин этих отрезков делится на 4. (Длина стороны клетки равна 1.)",
        "Решение: См. задачу 79321."
    ],
    "64523": [
        "Процессы и операции",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Замок обнесён круговой стеной с девятью башнями, на которых дежурят рыцари. По истечении каждого часа все они переходят на соседние башни, причём каждый рыцарь движется либо все время по часовой стрелке, либо против. За ночь каждый рыцарь успевает подежурить на каждой башне. Известно, что был час, когда на каждой башне дежурили хотя бы два рыцаря, и был час, когда ровно на пяти башнях дежурили ровно по одному рыцарю. Докажите, что был час, когда на одной из башен вообще не было рыцарей.",
        "Решение: Представим себе, что рыцари стоят на 18 площадках, расположенных на двух круговых платформах, которые каждый час поворачиваюся в противоположных направлениях на 40°. По условию в некоторый момент на пяти площадках никого не было, а на соответствующих площадках (в тех же башнях) было по одному рыцарю. Разберём два случая.     1) Пустые площадки есть на обеих платформах. Тогда в некоторый момент они окажутся в одной башне, то есть на этой башне рыцарей не будет.     2) Все пустые площадки находятся на одной платформе, а все одинокие рыцари – на другой. Поскольку башен всего 9 < 5 + 5, в каждый момент найдётся башня, где окажутся и пустая площадка и одинокий рыцарь. Но это противоречит условию."
    ],
    "116147": [
        "Подсчет двумя способами",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Можно ли в клетки квадрата 10×10 поставить некоторое количество звёздочек так, чтобы в каждом квадрате 2×2 было ровно две звёздочки, а в каждом прямоугольнике 3×1 – ровно одна звёздочка? (В каждой клетке может стоять не более одной звёздочки.)",
        "Решение: Первый способ. Пусть так расставить звёздочки удалось. Квадрат 10×10 можно разбить на 25 непересекающихся квадратов 2×2. Так как в каждом из них – по две звёздочки, то всего звёздочек 50. С другой стороны, 99 клеток исходного квадрата можно разбить на 33 непересекающихся прямоугольника 3×1. В каждом из них – по одной звёздочке, поэтому всего в квадрате – не больше 34 звёздочек. Противоречие.",
        "Ответ: Нельзя."
    ],
    "78116": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Доказать, что число всех цифр в последовательности",
        "Решение: См. решение задачи"
    ],
    "78128": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Доказать, что число всех цифр в последовательности",
        "Решение: Сопоставим цифре числа из первой последовательности нуль числа из второй последовательности следующим образом. Напишем после данной цифры нуль. В результате получим число из второй последовательности с отмеченным нулём. Нашей цифре мы сопоставляем именно этот нуль. Наоборот, нулю числа из второй последовательности сопоставим цифру числа из первой последовательности следующим образом. Отметим цифру, которая стоит перед данным нулём, и после этого нуль вычеркнем. В результате получим число из первой последовательности с отмеченной цифрой. Нашему нулю мы сопоставляем именно эту цифру. Эти операции взаимно обратны, поэтому мы получаем взаимно однозначное соответствие между цифрами числа первой последовательности и нулями чисел второй последовательности."
    ],
    "78236": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Собралось n человек. Некоторые из них знакомы между собой, причём каждые два незнакомых имеют ровно двух общих знакомых, а каждые два знакомых не имеют общих знакомых. Доказать, что каждый из присутствующих знаком с одинаковым числом человек.",
        "Решение: Пусть кто-то из собравшихся – назовём его X – имеет m знакомых: a1, a2, ..., am. По условию, никакие два человека из a1, a2, ..., am друг с другом не знакомы. Значит, для каждых двух человек ai, aj должен найтись ещё один общий знакомый кроме X. Этот человек не знаком с X; при этом разным парам (ai, aj) должны соответствовать разные люди (если бы один и тот же человек был общим знакомым одновременно для двух таких пар, то он имел бы с X более двух общих знакомых). Мы видим, что число всех людей, не знакомых с X, не меньше, чем число ½ m(m – 1) пар из людей a1, a2, ..., am.     С другой стороны, каждый человек, не знакомый с X, имеет с ним ровно двух общих знакомых – разумеется, из числа a1, a2, ..., am. При этом разным людям соответствуют разные пары. Таким образом, число людей, не знакомых с X, не больше, чем ½ m(m – 1). Следовательно, n = 1 + m + ½ m(m – 1). Мы получили квадратное уравнение относительно m. Легко видеть, что оно имеет только один положительный корень, а это и означает, что каждый имеет одинаковое число знакомых."
    ],
    "78249": [
        "Обратный ход",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: В автобусе без кондуктора едут 4",
        "Решение: Так как проезд в автобусе стоит 5 копеек, а ни у кого из пассажиров, по условию, нет монет мельче 10 копеек, то после оплаты проезда каждый пассажир должен получить сдачу, т.е. после оплаты проезда у каждого на руках должна остаться хотя бы одна монета. Таким образом, после оплаты на руках у пассажиров должно остаться не меньше, чем 4"
    ],
    "78499": [
        "Подсчет двумя способами",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Какое наибольшее число точек самопересечения может иметь замкнутая 14-звенная ломаная, проходящая по линиям клетчатой бумаги так, что ни на какой линии не лежит более одного звена ломаной?",
        "Решение: Покажем сначала, что любая замкнутая 14-звенная  ломаная имеет 7 горизонтальных и 7 вертикальных звеньев. Действительно, из  каждой вершины ломаной выходят одно вертикальное и одно горизонтальное звено.  По всем 14 вершинам мы насчитаем, таким образом, 14 горизонтальных и 14  вертикальных звеньев. Но при таком подсчёте каждое звено мы учли дважды.  Значит, имеется 7 горизонтальных и 7 вертикальных звеньев.    Занумеруем теперь горизонтальные звенья нашей ломаной ``сверху вниз'' и  выясним, сколько точек самопересечения может лежать на каждом звене. На  первом и седьмом звеньях вовсе нет точек самопересечения, так как выше  первого и ниже седьмого звена нет вершин ломаной. Ясно, кроме того, что на  втором и шестом звеньях может быть не больше двух, а на третьем и пятом  звеньях— не больше четырёх точек самопересечения— по числу вершин  ломаной, лежащих сверху (соответственно, снизу) от этих звеньев. На четвёртом  звене может быть не более шести точек самопересечения.  Покажем, что на  четвёртом звене может лежать"
    ],
    "78576": [
        "Процессы и операции",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: На лист клетчатой бумаги размером n×n клеток кладутся чёрные и белые кубики, причём каждый кубик занимает ровно одну клетку. Первый слой кубиков положили произвольно, а затем вспомнили, что каждый чёрный кубик должен граничить с чётным числом белых, а каждый белый — с нечётным числом чёрных. Кубики во второй слой положили так, чтобы для всех кубиков первого слоя выполнялось это условие. Если для всех кубиков второго слоя это условие уже выполняется, то больше кубиков не кладут, если же нет, то кладут третий слой так, чтобы чтобы для всех кубиков второго слоя выполнялось это условие, и так далее. Существует ли такое расположение кубиков первого слоя, что этот процесс никогда не кончится?",
        "Решение: Подложим под первый слой ещё один – нулевой – совпадающий с первым. Это не повлияет на требуемую чётность, а значит, и на дальнейший процесс. Предположим, что этот процесс бесконечен. Количество возможных пар слоев конечно, следовательно, найдутся такие i и j (i < j), что i-й слой совпадает с j-м, а (i+1)-й – с (j+1)-м. Очевидно, каждый слой однозначно восстанавливается по двум следующим, поэтому (i–1)-й слой совпадает с (j–1)-м, (i–2)-й – с (j–2)-м и т. д. В частности, первый слой совпадает с (j–i+1)-м, а нулевой – с (j–i)-м. Значит, (j–i+1)-й слой совпадает с (j–i)-м, и класть его было не нужно. Противоречие."
    ],
    "78664": [
        "Процессы и операции",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Из пункта A одновременно вылетают 100 самолетов (флагманский и 99  дополнительных). С полным баком горючего самолет может пролететь 1000 км. В полёте самолеты могут передавать друг другу горючее. Самолет, отдавший горючее другим, совершает планирующую посадку. Каким образом надо совершать перелёт, чтобы флагман пролетел возможно дальше?",
        "Решение: Опишем оптимальную процедуру обмена горючим. Сначала вылетают 100 самолётов с полным баком. Как только появляется возможность, один из самолётов разливает горючее другим, после чего становится 99 самолётов с полным баком,  а освободившийся самолёт совершает посадку. До этого момента самолёты  пролетят 1000·1/100 км. Аналогичным образом, когда появляется возможность, ещё один самолёт разливает своё горючее оставшимся (доэтого момента самолёты пролетят ещё 1000·1/99 км) и т.д. В последний раз горючее переливается флагману.  В результате этого процесса флагман пролетит   1000·(1 + 1/2 + ... + 1/100) ≈ 5187 км.    Теперь покажем оптимальность описанной выше процедуры. Примем за единицу горючего бак самолёта, за единицу времени – время, за которое самолёт пролетает 1000 км, за единицу расстояния – 1000 км. Если в воздухе находится N самолётов, то скорость сгорания горючего равна N. Если общий объём горючего в баках равен V, то в воздухе находится не менее чем  самолётов, а значит, и скорость сжигания горючего не меньше чем .  Забудем теперь о самолётах, а будем помнить только то, что скорость сжигания горючего не меньше верхней целой части объёма горючего. Нам надо, чтобы горючее горело как можно дольше. Но тогда его невыгодно жечь быстрее, чем со скоростью .  Действительно, если некоторое время мы жгли горючее быстрее, чем со скоростью ,  то при сжигании горючего со скоростью  за это время мы сожгли бы меньше горючего, а значит, тот же объём горючего закончится через большее время."
    ],
    "32136": [
        "Подсчет двумя способами",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: На сторонах шестиугольника было записано шесть чисел, а в каждой вершине – число, равное сумме двух чисел на смежных с ней сторонах. Затем все числа на сторонах и одно число в вершине стерли. Можно ли восстановить число, стоявшее в вершине?",
        "Решение: Пусть ABCDEF – данный шестиугольник, и нам нужно восстановить   число в вершине A. Заметим, что сумма чисел в вершинах A, C и E равна сумме чисел в вершинах B, D и F: обе эти суммы равны сумме чисел, стоявших исходно на всех сторонах шестиугольника. Поэтому, чтобы восстановить число в вершине A нужно из суммы чисел в вершинах B, D и F вычесть числа в вершинах C и E.",
        "Ответ: Можно."
    ],
    "31365": [
        "Подсчет двумя способами",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Когда встречаются два жителя Цветочного города,  один  отдает другому монету в 10 копеек, а тот ему- 2  монеты  по  5  копеек. Могло ли случиться так, что за день каждый из 1990 жителей города отдал ровно 10 монет?",
        "Решение: Нет. Общее число отданных монет должно делиться на 3."
    ],
    "34882": [
        "Процессы и операции",
        "Сложность: 2+",
        "Классы: ",
        "Условие: По окружности, сделанной из проволоки, двигаются бусинки с одинаковой   угловой скоростью, некоторые - по часовой стрелке, некоторые -  против.   При столкновении две бусинки разлетаются в разные стороны с прежними   скоростями.   Докажите, что в некоторый момент начальное расположение бусинок   повторится.",
        "Подсказка: Можно считать, что столкновение - просто переобозначение бусинок.",
        "Решение: Будем считать,   что в момент   столкновения бусинки продолжают движение, не замечая друг друга.   Таким образом,   при столкновении  просто переобозначим бусинки.   Ясно, что через время,   за которое одна бусинка прошла бы полный круг   при отсутствии столкновений, начальная расположение повторится   (при этом не обязательно, правда, каждая бусинка придет на   свое начальное место)."
    ],
    "86099": [
        "Подсчет двумя способами",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: На острове Невезения с населением 96 человек правительство решило провести пять реформ. Каждой реформой недовольна ровно половина всех граждан. Гражданин выходит на митинг, если он недоволен более чем половиной всех реформ. Какое максимальное число людей правительство может ожидать на митинге?",
        "Решение: Пусть x – число людей, вышедших на митинг. Рассмотрим общее число недовольств. С одной стороны, каждой реформой недовольно ровно 48 жителей, а значит, общее число недовольств равно 48·5 = 240. С другой стороны, каждый вышедший на митинг недоволен хотя бы тремя реформами. Следовательно, общее число недовольств не меньше 3x. Таким образом, 240 ≥ 3x, откуда x ≤ 80.     Приведём пример, когда на площадь выйдет ровно 80 человек. Выберем среди жителей острова 80 человек и разобьём их на пять групп по 16 человек (оставшиеся 16 человек составляют правительство). Пусть против первой реформы возражают люди из первых трёх групп, против второй – люди из второй, третьей и четвёртой групп, против третьей – люди из третьей, четвёртой и пятой групп, против четвёртой – люди из четвёртой, пятой и первой групп, а против пятой – люди из пятой, первой и второй групп. Тогда против каждой реформы возражают ровно 3·16 = 48 человек, и на митинг выйдут выбранные 80 человек.",
        "Ответ: 80 человек."
    ],
    "79608": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 4+",
        "Классы: 8,9",
        "Условие: Каково наименьшее число гирь в наборе, который можно разложить и на 3, и на 4, и на 5 кучек равной массы?",
        "Решение: Ответ:",
        "Ответ: m"
    ],
    "34891": [
        "Подсчет двумя способами",
        "Сложность: 2+",
        "Классы: ",
        "Условие: В квадрате 2000*2000 расставлены числа так, что в любом квадрате       2*2 сумма левого верхнего числа и правого нижнего числа равна       сумме левого нижнего числа и правого верхнего числа. Докажите,  что       сумма       чисел, стоящих в левом верхнем и правом нижнем углах квадрата       2000*2000, равна сумме чисел, стоящих в двух других углах.",
        "Подсказка: Сложите равенства, отвечающие всем квадратам 2*2.",
        "Решение: Для каждого квадратика 2*2 рассмотрим равенство a+c=b+d,       где a и с - числа, стоящие в левом верхнем и правом нижнем углах       квадратика, а b и d - числа, стоящие в левом нижнем и правом    верхнем       углах. По условию это выражение равно 0.          Если сложить все такие равенства для всевозможных квадратиков     2*2,       содержащихся в квадрате 2*2, то все числа, кроме стоящих в       угловых клетках, сократятся, и окажется, что сумма чисел,       стоящих в левом верхнем и правом нижнем углах большого квадрата,  и       сумма чисел, стоящих в его правом верхнем и левом нижнем углах,       равны, что и требовалось доказать."
    ],
    "108407": [
        "Процессы и операции",
        "Сложность: 4+",
        "Классы: 7,8,9",
        "Условие: Среди 300 учеников одной математической школы некоторые путают лево и право, некоторые не путают, а некоторые делают все наоборот, чем им говорят. Первого сентября всех учеников выстроили в одну шеренгу (плечом к плечу) и скомандовали нале-во! По этой команде все одновременно повернулись на 90°,  кто налево, а кто направо. Ровно через секунду каждый, кто оказался лицом к лицу к соседу, понимает, что не прав, и поворачивается кругом (на 180°). Как долго это может продолжаться?",
        "Ответ: 299 секунд."
    ],
    "34899": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 2+",
        "Классы: ",
        "Условие: Докажите, что число разложений натурального числа n   в сумму различных натуральных слагаемых равно   числу разложений числа n в сумму   нечетных (возможно, повторяющихся) натуральных слагаемых.",
        "Подсказка: Найдите соответствие между разложениями первого и второго видов.",
        "Решение: Пусть имеется разложение   n=(a"
    ],
    "34901": [
        "Подсчет двумя способами",
        "Сложность: 2+",
        "Классы: ",
        "Условие: В таблицу n*n записаны n",
        "Подсказка: Рассмотрите циклические сдвиги столбцов.",
        "Решение: Назовем циклическим сдвигом такое преобразование таблицы:   первый столбец переставляется на место второго, второй -   на место третьего, и т.д., наконец, последний - на место первого.   Обозначим через s"
    ],
    "78571": [
        "Процессы и операции",
        "Сложность: 5",
        "Классы: 8,9,10,11",
        "Условие: Посередине между двумя параллельными улицами стоят в один ряд одинаковые дома  со стороной, равной a. Расстояние между улицами – 3a, а расстояние между двумя соседними домами – 2a (см. рис.).",
        "Решение: Проведём две прямые x и y параллельно улицам через края домов (прямую x ближе к той улице, на которой стоят полицейские).   Соединим точку, в которой находится гангстер, отрезками со всеми точками, в которых находятся полицейские. Занумеруем эти отрезки целыми числами от –∞ до +∞ в том порядке, в котором расположены полицейские на первой улице. Пусть xi и yi – точки, в которых i-й отрезок пересекает прямые x и y. Заметим, что точки xi расположены с интервалом 6a, а точки yi – с интервалом 3a. Поэтому в начальный момент все эти точки расположены на стенах домов, то есть ни один полицейский гангстера не видит. Ясно, что все точки xi движутся с одинаковой постоянной скоростью. В частности, все они неподвижны, если гангстер движется навстречу полицейским со скоростью 2v, и в этом случае полицейские никогда не увидят гангстера. Если же гангстер движется навстречу полицейским со скоростью v/2, то неподвижны точки xi, и полицейские также не увидят гангстера. Докажем, что других возможностей у гангстера нет.     Предположим, что точки x0 и y0   движутся (тогда движутся и все остальные точки). Рассмотрим большой отрезок времени T. В течение времени T более половины времени точка x0 и не лежала на сторонах домов, и более половины времени точка y0 не лежала на сторонах домов. Тогда найдётся момент времени, когда ни одна из точек x0 и y0 не лежала на сторонах домов. Докажем, что в этот момент один из полицейских видит гангстера. Рассмотрим тот отрезок прямой x между домами, на котором находится точка x0. Как сказано выше, точки xi расположены с интервалом 6a, а точки yi – с интервалом 3a. Поэтому на отрезке прямой y, расположенном напротив рассматриваемого отрезка прямой x, найдётся одна из точек yi. По той же причине точки x–i и y–i расположены на одном и том же промежутке между домами. Тогда полицейский с номером –i видит гангстера.",
        "Ответ: Гангстер должен двигаться навстречу полицейским со скоростью 2v или v/2."
    ],
    "32036": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Петя написал на гранях кубика натуральные числа от 1 до  6. Вася кубика не видел, но утверждает, что",
        "Решение: В наборе натуральных чисел от 1 до 6 можно найти пять \t\t\t\tпар соседних чисел: 1 и 2, 2 и 3, 3 и 4, 4 и 5, 5 и 6. Каждая \t\t\t\tтакая пара может быть написана либо на двух соседних гранях \t\t\t\tкубика, либо на двух противоположных. Но пар противоположных \t\t\t\tграней у кубика всего три. Поэтому их могут занимать не более \t\t\t\tтрех пар соседних чисел. Значит, по крайней мере две такие пары \t\t\t\tзанимают соседние грани. Следовательно, можно утверждать, что \t\t\t\tВася прав в обоих случаях."
    ],
    "87992": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Одно трехзначное число состоит изразличных цифр, следующих впорядке возрастания, авего названии все слова начинаются содной итойже буквы. Другое трехзначное число, наоборот, состоит изодинаковых цифр, новего названии все слова начинаются сразных букв. Какие это числа?",
        "Подсказка: Заметьте, числа равны ичисла начинаются содной итойже буквы— это два совершенно разных утверждения.",
        "Решение: Эти числа, соответственно, 147 и111. Задача решается простым перебором вариантов, которых нетак уж много.",
        "Ответ: 147 и111."
    ],
    "88081": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Напишите встрочку первые 10 простых чисел. Как вычеркнуть 6цифр, чтобы получилось наибольшее возможное число?",
        "Подсказка: Заметьте, первые 10простых чисел составят 16-значное  число.",
        "Решение: Вот первые десять простых чисел, записанных подряд:   2357111317192329",
        "Ответ: Получится число 7317192329."
    ],
    "88129": [
        "Задачи на движение",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: У Буратино и Пьеро был велосипед, накотором они отправились в соседнюю деревню. Ехали по очереди, но всякий раз, когда один ехал, другой шёл пешком,  а не бежал. При этом они ухитрились прибыть в деревню почти в 2 раза  быстрее, чем если бы оба шли пешком. Как им это удалось?",
        "Подсказка: Попробуйте организовать путешествие так, чтобы и Буратино и Пьеро ровно по полдороги проехали на велосипеде.",
        "Решение: Буратино проехал на велосипеде полдороги, слез с него и дальше пошёл пешком. А Пьеро первую половину пути прошёл пешком, затем дошёл до велосипеда, сел на него и поехал. Таким образом они и сэкономили время."
    ],
    "78204": [
        "Перебор случаев",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Указать все денежные суммы, выраженные целым числом рублей, которые могут быть  представлены как чётным, так и нечётным числом денежных билетов. (В обращении имелись билеты достоинством в 1, 3, 5, 10, 25, 50 и 100 рублей.)",
        "Решение: Предположим сначала, что мы имеем денежную сумму в 10 рублей или больше. Покажем, что любая такая сумма может быть представлена как чётным, так и нечётным количеством денежных билетов. Именно, любая чётная денежная сумма (в 10 рублей или более) представляется, с одной стороны, чётным числом билетов достоинством в 1 рубль, а с другой – одним билетом в 10 рублей и ещё чётным числом билетов по одному рублю. Точно так же, любая нечётная денежная сумма (в 10 рублей или более) представляется, с одной стороны, нечётным числом билетов по одному рублю, а с другой – одним билетом в 10 рублей и ещё нечётным числом билетов по одному рублю.    Рассмотрим теперь денежные суммы, меньшие 10 рублей. Для представления этих сумм в нашем распоряжении имеются лишь билеты достоинством в 1, 3, 5 рублей – все нечётные. Понятно, что нечётное число нечётных билетов могут составить лишь нечётную сумму; следовательно, никакую чётную сумму, меньшую 10 рублей, нельзя представить нечётным числом билетов. Аналогично чётное число нечётных билетов могут составить лишь чётную сумму; следовательно, никакую нечётную сумму, меньшую 10 рублей, нельзя представить чётным числом билетов.",
        "Ответ: Все суммы, не меньшие 10 рублей."
    ],
    "32062": [
        "Процессы и операции",
        "Сложность: 2",
        "Классы: 7,8,9",
        "Условие: В компании из k человек (k>3) у каждого появилась  новость, известная ему одному. За один телефонный разговор двое  сообщают друг другу все известные им новости. Докажите, что за  2k–4 разговора все они могут узнать все новости.",
        "Решение: Передача информации может быть осуществлена следующим \t\t\t\tобразом. Рассмотрим некоторых четверых людей в компании — \t\t\t\tназовем их A, B, C, D. Пусть сначала все члены компании, \t\t\t\tкроме B, C и D звонят A и сообщают ему свои новости. \t\t\t\tЭто потребует k–4 звонка. Затем между собой говорят A и B, \t\t\t\tа также C и D. После этого A говорит с C, а B с D, \t\t\t\tв результате чего все четверо будут знать все новости. За \t\t\t\tоставшиеся 2n–4 звонка A сообщает их всем остальным."
    ],
    "32092": [
        "Числовые таблицы и их свойства",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: В каждой клетке прямоугольной таблицы размером M×K написано число. Сумма чисел в каждой строке и в каждом столбце равна 1.   Докажите, что M = K.",
        "Решение: Найдём сумму всех чисел таблицы двумя способами. Поскольку таблица содержит M строк и сумма чисел каждой строки равна 1, то вся сумма равна M. Аналогично, считая эту же сумму по столбцам, получим в результате K."
    ],
    "61078": [
        "Тождественные преобразования",
        "Сложность: 2",
        "Классы: 7,8,9,10,11",
        "Условие: Докажите равенство (a2 + b2)(u2 + v2) = (au + bv)2 + (av – bu)2.",
        "Решение: (a2 + b2)(u2 + v2) = a2u2 + b2u2 + a2v2 + b2v2 = (a2u2 + 2abuv + b2v2) + (b2u2 – 2abuv + a2v2) = (au + bv)2 + (bu – av)2."
    ],
    "61419": [
        "Раскладки и разбиения",
        "Сложность: 2",
        "Классы: 8,9,10",
        "Условие: Найдите число всех диаграмм Юнга с весом s, если   а) s = 4; б) s = 5; в) s = 6; г) s = 7.    Определение диаграмм Юнга смотри в справочнике.",
        "Решение: Достаточно перечислить все способы разбить указанные веса в сумму натуральных слагаемых, расположенных в неубывающем порядке.",
        "Ответ: а) 5; б) 7;  в) 11; г) 15 диаграмм."
    ],
    "87936": [
        "Арифметика. Устный счет и т.п.",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Дедка вдвое сильнее Бабки, Бабка втрое сильнее Внучки, Внучка вчетверо сильнее Жучки, Жучка впятеро сильнее Кошки, Кошка вшестеро сильнее Мышки. Дедка, Бабка, Внучка, Жучка иКошка вместе сМышкой могут вытащить Репку, абез Мышки— немогут.  Сколько надо позвать Мышек, чтобы они смогли сами вытащить Репку?",
        "Подсказка: Скольких Мышек заменяет Кошка? АВнучка?",
        "Решение: Кошка заменяет 6Мышек. Жучка заменяет 56 Мышек. Внучка  заменяет",
        "Ответ: 1237Мышек."
    ],
    "87961": [
        "Арифметика. Устный счет и т.п.",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Чук иГек вместе смамой наряжали елку. Чтобы они неподрались, мама выделила каждому избратьев поодинаковому числу веточек ипоодинаковому числу игрушек. Чук попробовал накаждую ветку повесить поодной игрушке, ноему нехватило для этого одной ветки. Гек попробовал накаждую ветку повесить подве игрушки, ноодна ветка унего оказалась пустой. Как вы думаете, сколько веток исколько игрушек выделила мама сыновьям?",
        "Подсказка: Попробуйте поступить как Чук— повесить накаждую ветку поодной игрушке.",
        "Решение: Попробуем поступить, как Чук,— повесим накаждую ветку поодной игрушке, тогда одна игрушка останется лишней. Теперь возьмём две игрушки— одну, оставшуюся лишней, адругую снимем содной изветок. Если теперь эти игрушки повесить вторыми натеветки, накоторых остались игрушки отпервого раза, тогда надвух ветках будут висеть игрушки иодна ветка останется пустой. Еслибы, кроме  этих трех веток, былибы ещё ветки, тонаэтих лишних ветках виселобы поодной игрушке, что противоречит условию. Таким образом, веток было3, аигрушек, соответственно,4.",
        "Ответ: 3ветки, 4игрушки."
    ],
    "88071": [
        "Деление с остатком",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Найдите все натуральные числа, при делении которых на 7 в частном получится то же число, что и в остатке.",
        "Подсказка: При делении числа на 7 возможны только 7 разных остатков.",
        "Решение: Остаток при делении на7 не может превышать 6, таким образом, интересующие нас числа можно представить в виде 7a + a = 8a, где a = 1, 2, ..., 6. Итак, вот эти числа: 8, 16, 24, 32, 40, 48.",
        "Ответ: 8, 16, 24, 32, 40, 48."
    ],
    "88120": [
        "Числовые таблицы и их свойства",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Можно ли таблицу 5×5 заполнить числами так, чтобы сумма чисел в каждой строке была положительной, а сумма чисел в каждом столбце – отрицательной?",
        "Подсказка: Попробуйте сосчитать сумму всех чисел втаблице.",
        "Решение: Если бы это было возможно, то сумма всех чисел таблицы, подсчитанная по строкам, былабы положительной, а по столбцам – отрицательной, что невозможно.",
        "Ответ: Нельзя."
    ],
    "88124": [
        "Задачи на движение",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Расстояние между Атосом и Арамисом, скачущими по одной дороге, равно 20 лье. За час Атос покрывает 4 лье, а Арамис – 5 лье.   Какое расстояние будет между ними через час?",
        "Подсказка: Заметьте, ничего не сказано о том, в одну или разные стороны скачут мушкетёры.",
        "Решение: Мушкетёры могли ехать:     а) в разные стороны, навстречу друг другу;     б) в разные стороны, удаляясь друг от друга;     в) в одну сторону – Атос за Арамисом;     г) в одну сторону – Арамис за Атосом.   Соответственно задача допускает четыре разных ответа. Например, в случае а) за час расстояние уменьшится на 9 лье и составит 11 лье. Аналогично находятся остальные ответы.",
        "Ответ: 11, 29, 21 или 19 лье."
    ],
    "104052": [
        "Обратный ход",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: Крестьянин, покупая товары, уплатил первому купцу половину своих денег и ещё 1 рубль; потом уплатил второму купцу половину оставшихся денег да ещё 2 рубля и, наконец, уплатил третьему купцу половину оставшихся да ещё 1 рубль. После этого денег у крестьянина не осталось. Сколько рублей у него было первоначально?",
        "Решение: Перед приходом к третьему купцу у крестьянина был 1 рубль и ещё столько же - всего 2 рубля. Перед приходом ко второму купцу у него было 2 + 2 = 4 рубля и ещё столько же - всего 8 рублей. Наконец, перед приходом к первому купцу крестьянин имел 8 + 1 = 9 и ещё столько же; значит, первоначально у крестьянина было 18 рублей.",
        "Ответ: 18 рублей."
    ],
    "88147": [
        "Числовые таблицы и их свойства",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Попробуйте быстро найти сумму всех цифр вэтой таблице:",
        "Решение: Рассмотрим суммы чисел по столбцам. Две последовательные цифры в столбцах дают в сумме 10, значит, сумма цифр в каждом столбце будет 30. А всего столбцов 15.",
        "Ответ: 450."
    ],
    "35211": [
        "Подсчет двумя способами",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Обозначим через d",
        "Подсказка: Подсчитайте число жителей Москвы двумя способами.",
        "Решение: Ясно, что c"
    ],
    "35678": [
        "Перебор случаев",
        "Сложность: 3",
        "Классы: 6,7,8,9",
        "Условие: Николай с сыном и Петр с сыном были на рыбалке. Николай поймал столько же рыб, сколько и его сын, а Петр – втрое больше, чем его сын. Всего было поймано 25 рыб. Как зовут сына Петра?",
        "Подсказка: На рыбалку пошли либо три, либо четыре человека. Вопрос задачи должен прояснить ситуацию.",
        "Решение: Имеется три возможности: 1) на рыбалку ходили четыре разных человека – Николай, Петр и их сыновья; 2) Петр – сын Николая; 3) Николай – сын Петра.    В первом случае каждая пара отец – сын поймала чётное число рыб, что противоречит условию.     Во втором случае общее число рыб у Петра и Николая в 6 раз больше, чем у сына Петра, то есть общее число рыб должно делиться на 7. Это тоже противоречит условию.    Значит, остается единственная возможность: Николай – сын Петра. (То, что этот случай не противоречит условию, убедитесь сами.)",
        "Ответ: Николай."
    ],
    "60665": [
        "Подсчет двумя способами",
        "Сложность: 3",
        "Классы: 7,8,9,10",
        "Условие: Имеется много одинаковых квадратов. В вершинах каждого из них в произвольном порядке написаны числа 1, 2, 3 и 4. Квадраты сложили в стопку и написали сумму чисел, попавших в каждый из четырёх углов стопки. Может ли оказаться  так, что     а) в каждом углу стопки сумма равна 2004?     б) в каждом углу стопки сумма равна 2005?",
        "Решение: а) Сумма всех чисел должна делиться на 1 + 2 + 3 + 4 = 10. Но 2004·4 не делится на 10.",
        "Ответ: а) Не может; б) может."
    ],
    "65584": [
        "Выделение полного квадрата. Суммы квадратов",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: В выражении x6 + x4 + xA замените А на одночлен так, чтобы получился полный квадрат. Найдите как можно больше решений.",
        "Решение: Так как данное выражение является трёхчленом, то оно станет полным квадратом в одном из трёх случаев.     1) x6 и x4 – квадраты двух чисел, а xA – удвоенное произведение этих чисел. Получаем   x6 + x4 ± 2x5 = (x³ ± x²)², то есть А = ± 2x4.    2) x4 и xA – квадраты двух чисел, а x6 – удвоенное произведение этих чисел. Получаем x6 + x4 + ¼ x8 = (x² + ½ x4)2, то есть А = ¼ x7.    3) x6 и xA – квадраты двух чисел, а x4 – удвоенное произведение этих чисел. Получаем   x6 + x4 + ¼ x2 = (x³ + ½ x)², то есть А = ¼ x.",
        "Ответ: А = ± 2x4, ½ x7, ¼ x."
    ],
    "102809": [
        "Процессы и операции",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: На доске написано число 12. В течение каждой минуты число либо умножают, либо делят либо на 2, либо на 3, и результат записывают на доску вместо исходного числа. Докажите, что число, которое будет написано на доске ровно через час, не будет равно 54.",
        "Решение: После каждой операции меняется чётность общего количества двоек и троек в разложении на простые множители числа на доске. В начале это число нечётно (равно 3), так как 12 = 2·2·3. Поэтому через 60 операций (секунд) оно должно быть нечётным, но в разложении 54 = 2·3·3·3 четыре множителя."
    ],
    "30314": [
        "Перебор случаев",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: а) В магазине Все для чая есть 5 разных чашек и 3 разных блюдца. Сколькими способами можно купить чашку с блюдцем?",
        "Решение: а) Выберем чашку. В комплект к ней можно выбрать любое из трёх блюдец. Поэтому есть 3 разных комплекта, содержащих выбранную чашку.  Поскольку чашек всего 5, то число различных комплектов равно 5·3 = 15.",
        "Ответ: а) 15; б) 60; в) 47 способами."
    ],
    "103807": [
        "Обратный ход",
        "Сложность: 3",
        "Классы: 7",
        "Условие: Два пирата играли на золотые монеты. Сначала первый проиграл половину своих монет (отдал второму), потом второй проиграл половину своих, потом снова первый проиграл половину своих. В результате у первого оказалось 15 монет, а у второго— 33. Сколько монет было у первого пирата до начала игры?",
        "Подсказка: Попробуйте проследить ''с конца'', сколько у какого пирата было монет после каждой игры.",
        "Решение: Попробуем проследить ''с конца'', сколько у какого пирата было монет после каждой игры. В последней игре первый проиграл второму половину своих монет, после чего у него осталось 15монет. Но это ровно столько, сколько он только что отдал второму! Значит, перед этим у первого было",
        "Ответ: 24"
    ],
    "31355": [
        "Обратный ход",
        "Сложность: 3",
        "Классы: 5,6,7,8",
        "Условие: В 15-этажном доме имеется лифт с двумя кнопками: +7 и –9   (см. задачу 31354). Можно ли проехать с 3-го этажа на 12-й?",
        "Решение: Первый способ. С 3-го этажа за один ход можно попасть только на 10-й, оттуда – только на 1-й, потом – на 8-й, на 15-й, на 6-й, на 13-й, на 4-й, на 11-й, на 2-й и наконец на 9-й. А с 9-го этажа никуда проехать нельзя.",
        "Ответ: Нельзя."
    ],
    "32006": [
        "Подсчет двумя способами",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: а) Можно ли занумеровать рёбра куба натуральными числами от 1 до 12 так, чтобы для каждой вершины куба сумма номеров рёбер, которые в ней сходятся, была одинаковой?",
        "Решение: а) Предположим, что это возможно, и сумма номеров рёбер, сходящихся в каждой из восьми вершин, равна x. Сложив эти суммы для всех вершин, получим 8x. С другой стороны, эта сумма равна удвоенной сумме номеров всех рёбер, так как номер каждого ребра входит в неё дважды. Вычислим эту сумму: 2·(1 + 2 + ... + 12) = 156. Отсюда следует, что 8x = 156, то есть x – не целое. Противоречие.",
        "Ответ: а) Нельзя; б) можно."
    ],
    "32040": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Автобусные билеты имеют номера от 000000 до 999999. Билет называется счастливым, если сумма первых трёх цифр его номера равна сумме последних трёх его цифр. Докажите, что:     а) число всех счастливых билетов чётно;     б) сумма номеров всех счастливых билетов делится на 999.",
        "Решение: а) Укажем два способа разбиения счастливых билетов на пары."
    ],
    "32061": [
        "Перебор случаев",
        "Сложность: 3",
        "Классы: 5,6,7,8",
        "Условие: За круглым столом сидело а) 15; б) 20 человек. Они хотят  пересесть так, чтобы те, кто раньше сидел рядом, теперь сидели бы  через два человека. Возможно ли это?",
        "Решение: а) Пронумеруем все места за столом по кругу и всех  \t\t\t\tсидящих соответственно занимаемым местам. Будем считать, что нам  \t\t\t\tудалось всех пересадить требуемым образом. Без ограничения  \t\t\t\tобщности можно считать, что человек 1 остался сидеть на своем  \t\t\t\tместе. Если это не так, то этого можно добиться поворотом стола;  \t\t\t\tпри этом условие задачи нарушиться, очевидно, не может. Человек 2  \t\t\t\tможет сидеть либо на месте 4, либо на месте 13. Разберем первый  \t\t\t\tиз этих случаев (рис. a). В этом случае для третьего есть  \t\t\t\tединственное место, удовлетворяющее условию — 7. Далее, 4-й может  \t\t\t\tсидеть только на месте 10, 5-й — на месте 13. При этом для 6-го  \t\t\t\tединственное возможное место — 1. Но оно уже занято первым.  \t\t\t\tЗначит, рассадить людей требуемым образом не удастся. Второй  \t\t\t\tслучай разбирается аналогично."
    ],
    "34921": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3",
        "Классы: ",
        "Условие: а) На отрезке [0, 1] задано такое множество M, являющееся объединением нескольких отрезков, что расстояние между любыми двумя точками из M не равно 1/10. Докажите, что сумма длин отрезков, составляющих M, не больше ½.",
        "Подсказка: . При сдвиге на 1/10 точка множества M не может перейти в другую точку множества M.",
        "Решение: а) Разобьём отрезок [0, 1] на пять отрезков длины &frac15;. Пусть A = M ∩ [0, 1/10], B = M ∩ [1/10, &frac15;]. Через A' обозначим множество, полученное из A сдвигом на 1/10 (он совмещает отрезок [0, 1/10] с отрезком [1/10, &frac15;]). Множества A' и B не пересекаются, иначе между некоторыми двумя точками из множеств A и B расстояние было бы равно 1/10. Поэтому сумма длин отрезков, составляющих множества B и A не превосходит 1/10. Рассуждая таким же образом и для других отрезков длины &frac15;, получим требуемое.     б) Контрпример. Возьмём M = [0, &frac15; – 1/100] ∪ [&frac25;, &frac35; – 1/100] ∪ [&frac45;, 1 – 1/100].",
        "Ответ: б) Неверно."
    ],
    "34922": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3",
        "Классы: ",
        "Условие: Пусть p – простое число, большее 2, а m/n = 1 + ½ + &frac13; + ... + 1/p–1. Докажите, что m делится на p.",
        "Подсказка: Сгруппируйте первое слагаемое с последним, второе – с предпоследним и т.д.",
        "Решение: Достаточно доказать это утверждение для несократимой дроби m/n. В сумме 1 + ½ + &frac13; + ... + 1/p–1 сгруппируем первое слагаемое с последним, второе – с предпоследним и т.д. Получим p–1/2 сумм вида 1/k + 1/p–k = p/k(p–k). При приведении суммы таких дробей к общему знаменателю в числителе останется число, кратное p, а в знаменателе – (p – 1)!. Поскольку p просто, оно не сократится при приведении к несократимому виду."
    ],
    "32013": [
        "Подсчет двумя способами",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Можно ли в прямоугольной таблице 5×10 так расставить числа, чтобы сумма чисел каждой строки равнялась бы 30, а сумма чисел каждого столбца равнялась бы 10?",
        "Решение: Предположим, что такая таблица существует, и подсчитаем, чему равняется сумма всех ее чисел. С одной стороны, таблица содержит 5 строк, сумма чисел в каждой из которых – 30, значит, искомая сумма равна 150. С другой стороны, в таблице 10 столбцов, сумма чисел в каждом из которых – 10. Отсюда общая сумма равна 100. Противоречие."
    ],
    "35139": [
        "Подсчет двумя способами",
        "Сложность: 3",
        "Классы: 9,10,11",
        "Условие: Какое наибольшее количество непересекающихся диагоналей можно провести в выпуклом n-угольнике (допускаются диагонали, имеющие общую вершину)?",
        "Решение: Каждая проведённая диагональ увеличивает число многоугольников-частей на 1. Поэтому проведя k непересекающихся диагоналей, мы разрежем n-угольник на k + 1 многоугольников. Оценим их количество.",
        "Ответ: n – 3 диагонали."
    ],
    "35411": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: На окружности отмечено 2000 синих и одна красная точка. Рассматриваются всевозможные выпуклые многоугольники с вершинами в этих точках. Каких многоугольников больше – тех, у которых есть красная вершина, или тех, у которых нет?",
        "Подсказка: Каждому многоугольнику с вершинами только в синих точках поставим в соответствие многоугольник, в котором кроме этих синих вершин присутствует красная вершина.",
        "Решение: Условимся называть многоугольник с вершинами только в синих точках многоугольником типа А, а многоугольник, среди вершин которого есть красная – типа B. Каждому многоугольнику типа А поставим в соответствие многоугольник типа B, вершинами которого являются все вершины исходного многоугольника и красная вершина. При этом соответствии различным многоугольникам типа А соответствуют различные многоугольники типа B. С другой стороны, треугольник с двумя синими и одной красной вершиной не соответствует никакому  многоугольнику типа А. Таким образом, многоугольников типа B больше, чем многоугольников типа А.",
        "Ответ: Тех, у которых красная вершина есть."
    ],
    "35574": [
        "Подсчет двумя способами",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Можно ли расставить по кругу семь целых неотрицательных чисел так, чтобы сумма каких-то трёх расположенных подряд чисел была равна 1, каких-то трёх подряд расположенных – 2, ... , каких-то трёх подряд расположенных – 7?",
        "Подсказка: Если бы это было возможно, то в сумме 1 + 2 + ... + 7 каждое из  семи чисел, расставленных по кругу, встречалось бы три раза.",
        "Решение: Предположим, что это возможно. Имеется всего семь различных сумм из трёх стоящих подряд чисел. Тогда среди этих семи сумм каждое из чисел 1, 2, ... , 7 должно  встретиться по разу. Сложим все эти семь сумм. С одной стороны, результат равен 1 + 2 + ... + 7 = 28, а с другой стороны, результат должен делиться на 3, так как каждое из чисел на окружности входит ровно в три тройки идущих подряд чисел. Но 28 не делится на 3. Противоречие.",
        "Ответ: Нельзя."
    ],
    "35683": [
        "Перебор случаев",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Буквы русского алфавита занумерованы в соответствии с таблицей:",
        "Подсказка: Имеются три варианта расшифровки каждой буквы.  Сделайте расшифровку каждой буквы в трех вариантах,   после чего произведите поиск осмысленной расшифровки.",
        "Решение: Каждую букву шифрованного сообщения расшифруем в трех вариантах,    предполагая последовательно, что соответствующая буква шифрующей    последовательности есть буква А, Б или буква В:"
    ],
    "35730": [
        "Итерации",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: На доске записаны два числа a и b (a > b). Их стирают и заменяют числами a+b/2 и a–b/2. С вновь записанными числами поступают аналогичным образом. Верно ли, что после нескольких стираний разность между записанными на доске числами станет меньше 1/2002?",
        "Подсказка: Проделайте операцию два раза и посмотрите, что происходит с числами.",
        "Решение: Проделав указанную операцию дважды, мы получим числа a/2, b/2. Значит, после 2k операций получатся числа 2–ka, 2–kb. Но при достаточно больших k   2–ka – 2–kb < 1/2002.",
        "Ответ: Верно."
    ],
    "35767": [
        "Процессы и операции",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Имеется полоска 1×99, разбитая на 99 клеток 1×1, которые раскрашены через одну в чёрный и белый цвет. Разрешается перекрашивать одновременно все клетки любого клетчатого прямоугольника 1×k. За какое наименьшее число перекрашиваний можно сделать всю полоску одноцветной?",
        "Подсказка: Каждое перекрашивание разрушает не более двух границ между клетками разных цветов.",
        "Решение: Оценка. Назовём перемычкой отрезок, разделяющий две клетки разных цветов. В начале у нас имеется 98 перемычек. Каждое перекрашивание изменяет число перемычек не более чем на 2. Значит, 48 перекрашиваний не хватит.    Алгоритм. Перекрасим все клетки со второй по 98-ю, затем все клетки с третьей по 97-ю, ..., наконец, одну 50-ю клетку. После этого полоска станет одноцветной.",
        "Ответ: За 49 перекрашиваний."
    ],
    "60433": [
        "Подсчет двумя способами",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: В классе имеется a1 учеников, получивших в течение года хотя бы одну двойку, a2 учеников, получивших не менее двух двоек, ..., ak учеников, получивших не менее k двоек. Сколько всего двоек в этом классе? (Предполагается, что ни у кого нет более k двоек.)",
        "Решение: Количество учеников, получивших ровно одну двойку, равно a1 – a2, ровно две двойки – a2 – a3, и т. д. Поэтому общее количество двоек равно   (a1 – a2) + 2(a2 – a3) + 3(a3 – a4) + ... + (k – 1)(ak–1 – ak) + kak = a1 + (2a2 – a2) + (3a3 – 2a3) + (kak – (k–1)ak) =  a1 + a2 + ... + ak.",
        "Ответ: a"
    ],
    "65421": [
        "Процессы и операции",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Петя разрезал прямоугольный лист бумаги по прямой на две части. Затем одну часть снова разрезал по прямой на две. Потом одну из получившихся частей опять разрезал на две части, и так далее, всего он резал бумагу сто раз. Потом Петя подсчитал суммарное количество вершин у всех получившихся многоугольников – получилось всего 302 вершины. Могло ли так быть?",
        "Решение: После ста разрезов получился 101 многоугольник. А у каждого – не менее 3 вершин.",
        "Ответ: Не могло."
    ],
    "87940": [
        "Подсчет двумя способами",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Три купчихи – Сосипатра Титовна, Олимпиада Карповна и Поликсена Уваровна – сели пить чай. Олимпиада Карповна и Сосипатра Титовна выпили вдвоём 11 чашек, Поликсена Уваровна и Олимпиада Карповна – 15, а Сосипатра Титовна и Поликсена Уваровна – 14. Сколько чашек чая выпили все три купчихи вместе?",
        "Подсказка: Заметьте, чашка, выпитая каждой купчихой, фигурировала в условии задачи дважды.",
        "Решение: Если мы сложим все учтённые чашки, то получим удвоенную сумму выпитых чашек.  Значит, нужно разделить эту сумму пополам.",
        "Ответ: 20 чашек."
    ],
    "77985": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3",
        "Классы: 9",
        "Условие: На окружности даны точки A1, A2,..., A16. Построим все возможные выпуклые многоугольники, вершины которых находятся среди точек A1, A2,..., A16. Разобьём эти многоугольники на две группы. В первую группу будут входить все многоугольники, у которых A1 является вершиной. Во вторую группу входят все многоугольники, у которых A1 в число вершин не входит. В какой группе больше многоугольников?",
        "Решение: Каждому многоугольнику, не имеющего вершины A1, сопоставим многоугольник с вершиной A1, просто добавив A1 к его вершинам. Обратная операция (отбрасывание вершины A1) невозможна для треугольников.",
        "Ответ: В первой."
    ],
    "78055": [
        "Перебор случаев",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Пять человек играют несколько партий в домино (два на два) так, что каждый  играющий имеет каждого из остальных один раз партнёром и два раза противником. Найти количество сыгранных партий и все способы распределения играющих.",
        "Решение: Можно считать, что 1-й и 2-й сыграли против 3-го и 4-го. Тогда в партии, где 1-й был партнёром 5-го, против них обязательно играл 2-й, а также ровно один из пары {3, 4} (можно считать, что это 3-й).     3-й игрок уже был два раза противником 1-го, поэтому против 1-го и 4-го играют 2-й и 5-й. После этого 2-й не может играть против 1-го, поэтому против 1-го и 3-го играют 4-й и 5-й. Остаётся последняя партия: 2-й и 4-й играют против 3-го и 5-го.",
        "Ответ: 5 партий; распределение играющих единственно (с точностью до нумерации)."
    ],
    "78654": [
        "Обратный ход",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: В шахматном турнире участвовало 12 человек. После окончания турнира каждый участник составил 12 списков. В первый список входит только он сам, во второй -- он и те, у кого он выиграл, в третий — все люди из второго списка и те, у кого они выиграли, и т.д. В 12 список входят все люди из одиннадцатого списка и те, у кого они выиграли. Известно, что для любого участника турнира в его двенадцатый список попал человек, которого не было в его одиннадцатом списке. Сколько ничейных партий было сыграно в турнире?",
        "Решение: Ответ:",
        "Ответ: k"
    ],
    "78740": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Масса каждой из 19 гирь не больше 70 г и равна целому числу граммов. Доказать, что из этих гирь нельзя составить более 1230 различных по массе наборов.",
        "Решение: Разобьём все наборы надве части: те, вкоторых неболее семнадцати гирь ивсе остальные. Масса каждого набора изпервой части непревосходит"
    ],
    "78805": [
        "Процессы и операции",
        "Сложность: 3",
        "Классы: 8",
        "Условие: На конгресс приехали 1000 делегатов из разных стран. Каждый делегат знает несколько языков. Известно, что любые трое могут разговаривать между собой без помощи остальных. (При этом, возможно, одному из них придётся переводить разговор двух других.) Доказать, что всех делегатов можно расселить в 500 комнатах так, чтобы в каждой комнате располагались 2 делегата и при этом они могли бы поговорить между собой.",
        "Решение: Выберем каких-то трёх делегатов конгресса; среди них найдутся двое, знающие  один язык— их-то мы и поместим в одном номере гостиницы. Из оставшихся 998 делегатов снова отберем троих, среди которых снова найдутся двое, которых можно будет разместить в одном номере— и т.д., пока у нас не останутся всего 4 делегата"
    ],
    "79294": [
        "Выделение полного квадрата. Суммы квадратов",
        "Сложность: 3",
        "Классы: 7,8,9,10",
        "Условие: Найти все действительные решения уравнения с четырьмя неизвестными:  x² + y² + z² + t² = x(y + z + t).",
        "Решение: Уравнение можно переписать в виде  x²/4 + (x/2 − y)² + (x/2 − z)² + (x/2 − t)² = 0. Поэтому x = 0, x = 2y, x = 2z и x = 2t.",
        "Ответ: x = y = z = t = 0."
    ],
    "79607": [
        "Подсчет двумя способами",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Каждый участник двухдневной олимпиады в первый день решил столько же задач,  сколько все остальные в сумме – во второй день.   Докажите, что все участники решили поровну задач.",
        "Решение: Пусть во второй день все участники в сумме решили N задач. Рассмотрим какого-нибудь участника; пусть он во второй день решил m задач. Тогда во  второй день все остальные в сумме решили N – m задач. Следовательно, в первый день этот участник решил N – m задач, а значит, всего он решил  m + (N – m) = N задач. Итак, каждый участник решил всего задач столько же, сколько и все участники во второй день, то есть все участники решили поровну задач."
    ],
    "88268": [
        "Подсчет двумя способами",
        "Сложность: 3",
        "Классы: 5,6,7",
        "Условие: На кошачьей выставке каждый посетитель погладил ровно трех кошек. При этом  оказалось, что каждую кошку погладили ровно три посетителя.",
        "Решение: Если мы мысленно натянем ниточки между каждой кошкой и погладившим её посетителем, тогда откаждой кошки будут протянуты 3 ниточки  и от каждого посетителя тоже3. Значит, число ниток одновременно в 3 раза больше числа посетителей и в 3 раза больше числа кошек. Отсюда следует, что число кошек равно числу посетителей."
    ],
    "88092": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Простые числа имеют только два различных делителя – единицу и само это число. А какие числа имеют только три различных делителя?",
        "Подсказка: Заметьте, обычно всякому делителю m соответствует парный делитель  – M/m.",
        "Решение: У любого числа M всегда есть делители 1 и M. Если у M  есть делитель m, то есть и делитель M/m. Значит, чтобы число M имело три различных делителя, необходимо выполнение условий: m = M/m (то есть M = m²) и m – простое число. Отсюда следует, что ровно потри различных делителя имеют квадраты простых чисел.",
        "Ответ: Квадраты простых чисел."
    ],
    "104109": [
        "Процессы и операции",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Мама дала Васе денег на30 карандашей. Оказалось, что в магазине  карандашная фабрика проводит рекламную акцию: в обмен на чек о покупке набора  из 20 карандашей возвращают 25% стоимости набора, а в обмен на чек  о покупке набора из 5 карандашей – 10%. Какое наибольшее число карандашей  может купить Вася?",
        "Решение: Заметим, что 25% от стоимости20 карандашей – это стоимость5 карандашей, а 10% от стоимости 5 карандашей – это половина стоимости карандаша. Ясно, что для получения максимальной скидки Вася должен действовать так: пока хватает денег, покупать набор из 20 карандашей и сразу обменивать чек; если не хватает денег на 20 карандашей, но хватает на 5, покупать набор из 5 карандашей и сразу обменивать чеки; в крайнем случае покупать отдельные карандаши.     Действуя таким образом, Вася сначала купит коробку из 20 карандашей  и получит стоимость 5 карандашей (после этого у него останется стоимость 15 карандашей). Потом он купит три набора из 5 карандашей и получит стоимость 1,5 карандашей. На эти деньги он сможет купить только один карандаш. Итого: 36 карандашей.",
        "Ответ: 36 карандашей."
    ],
    "107621": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3",
        "Классы: 7,8,9,10",
        "Условие: Каких чисел больше среди всех чисел от 100 до 999: тех, у которых средняя цифра больше обеих крайних, или тех, у которых средняя цифра меньше обеих крайних?",
        "Решение: Заметим, что если у числа a средняя цифра больше обеих крайних, то у числа 999 – a средняя цифра меньше обеих крайних. Поэтому среди чисел от 100 до 999 – 100 = 899 одинаковое количество чисел с наибольшей средней цифрой и с наименьшей средней цифрой (их можно разбить на пары). Но остались ещё числа от 900 до 999. Ясно, что среди них нет чисел с наибольшей средней цифрой, но есть с наименьшей, например 901. Поэтому больше тех чисел, у которых средняя цифра меньше обеих крайних.",
        "Ответ: Тех, у которых средняя цифра меньше обеих крайних."
    ],
    "111233": [
        "Перебор случаев",
        "Сложность: 3",
        "Классы: 5,6,7,8",
        "Условие: Каждый из четырех инопланетян умеет писать только две буквы.  Кра умеет писать",
        "Решение: Последние две буквы могли быть написаны только Кра и Крю, поэтому единственную букву",
        "Ответ: Решение"
    ],
    "111243": [
        "Подсчет двумя способами",
        "Сложность: 3",
        "Классы: 6,7,8,9",
        "Условие: Можно ли в кружочки на пятиконечной звезде (см. рисунок)  расставить",
        "Решение: Предположим, что числа удалось расставить требуемым образом.  Пусть",
        "Ответ: нет, нельзя."
    ],
    "88102": [
        "Подсчет двумя способами",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Дано 25 чисел. Какие бы три из них мы ни выбрали, среди оставшихся найдётся такое четвёртое, что сумма этих четырёх чисел будет положительна. Верно ли, что сумма всех чисел положительна?",
        "Решение: Вот пример: 24 числа равны –1, а одно число равно 5. Тогда условие выполняется, а общая сумма равна –19.",
        "Ответ: Неверно."
    ],
    "116845": [
        "Процессы и операции",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: В клетках квадрата 3×3 расставлены числа (рис. слева).   Разрешается к числам, стоящим в двух соседних клетках, одновременно прибавлять одно и то же число, не обязательно положительное. Можно ли в какой-то момент получить такой квадрат с числами, как на рисунке справа? (Клетки считаются соседними, если имеют общую сторону.)",
        "Решение: Раскрасим все клетки в шахматном порядке (см. рисунок).",
        "Ответ: Нельзя."
    ],
    "116861": [
        "Процессы и операции",
        "Сложность: 3",
        "Классы: 5,6",
        "Условие: На доске записано число 61. Каждую минуту число стирают с доски и записывают на это место произведение его цифр, увеличенное на 13. После первой минуты на доске записано 19 (6·1 + 13 = 19). Какое число можно будет прочитать на доске через час?",
        "Решение: Рассмотрим числа, которые будут записаны на доске, через нескольких первых минут:",
        "Ответ: 16."
    ],
    "108405": [
        "Процессы и операции",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: С помощью волшебного банкомата можно поменять любую купюру на любое конечное число купюр меньшего достоинства. Получив 1000 франков одной бумажкой, сможете ли Вы каждый месяц платить квартплату? (Дело происходит в Швейцарии, где квартплата постоянна, а жизнь бесконечна.)",
        "Решение: Если можно обойтись некоторой монетой, то хватит и одной монеты меньшего достоинства. Спускаясь, получим, что хватит и одного сантима, что неверно.",
        "Ответ: Нет."
    ],
    "88247": [
        "Подсчет двумя способами",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Рита, Люба иВаря решали задачи. Чтобы дело шло быстрее, они купили конфет иусловились, что закаждую решённую задачу девочка, решившая её первой, получает четыре конфеты, решившая второй— две, арешившая последней—одну.  Девочки говорят, что каждая изних решила все задачи иполучила 20конфет, причём одновременных решений небыло. Они ошибаются. Как вы думаете, почему?",
        "Подсказка: Заметьте, зарешение каждой задачи все три девочки вместе получали 7 конфет.",
        "Решение: Если зарешение каждой задачи все три девочки вместе получали 7конфет (первая— 4, вторая— 2, третья— 1конфету), значит, сумма всех полученных ими конфет должна обязательно делиться на7, но60 на7 неделится. Следовательно, девочки ошиблись.",
        "Ответ: Сумма конфет, полученных всеми девочками, должна делиться насумму конфет, получаемых заодну задачу, т.е. должна быть кратна7."
    ],
    "32107": [
        "Подсчет двумя способами",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: По окончании конкурса бальных танцев, в котором участвовали 7 мальчиков и 8 девочек, каждый (каждая) назвал (назвала) количество своих партнерш (партнеров): 3, 3, 3, 3, 3, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6. Не ошибся ли кто-нибудь из них?",
        "Решение: Сумма чисел, названных всеми мальчиками, должна равняться сумме чисел, названных всеми девочками. Действительно, обе эти суммы должны равняться количеству пар, образовавшихся во время конкурса. Поскольку сумма всех названных чисел равна 74, то каждая из сумм чисел, названных мальчиками и девочками в отдельности, должна равняться 37.     Пусть число 5 назвал мальчик. Тогда сумма чисел, названных девочками, кратна 3 и, значит, не равна 37."
    ],
    "34925": [
        "Подсчет двумя способами",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На плоскости дана несамопересекающаяся замкнутая ломаная, никакие три вершины которой не лежат на одной прямой. Назовём пару несоседних звеньев особой, если продолжение одного из них пересекает другое звено. Докажите, что число особых пар чётно.",
        "Подсказка: Можно использовать следующее соображение: ломаная заходит в некоторую область столько же раз, сколько выходит.",
        "Решение: Рассмотрим два соседних звена ломаной AB и BC. Продолжим эти звенья за вершину B и получим лучи BM и BN, которые образуют угол MBN (точки M и N выбираются достаточно далеко на сторонах угла). Так как точки A и C лежат вне этого угла, ломаная пересекает стороны угла чётное число раз: сколько раз она зайдёт в него, столько же раз и выйдет. Образуем подобные углы при всех вершинах. Суммарное число пересечений сторон этих углов со звеньями ломаной будет чётным, а оно, очевидно, равно числу особых пар звеньев."
    ],
    "35362": [
        "Подсчет двумя способами",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: У Царя Гвидона было 5 сыновей. Среди его потомков 100 имели каждый ровно по 3 сына, а остальные умерли бездетными.   Сколько потомков было у царя Гвидона?",
        "Подсказка: При подсчете потомков не забудьте о сыновьях Гвидона.",
        "Решение: Всякий потомок Царя Гвидона – это либо сын одного из его потомков, либо сын самого Гвидона. Из условия следует, что у всех потомков Гвидона было в общей сложности 300 сыновей. А у самого Гвидона было 5 сыновей, следовательно, всего потомков было 305.",
        "Ответ: 305."
    ],
    "35488": [
        "Подсчет двумя способами",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: На шахматной доске расставлены 8 ладей так, что они не бьют друг друга.  Докажите, что на полях чёрного цвета расположено чётное число ладей.",
        "Подсказка: Введите координаты на шахматной доске и подсчитайте сумму координат всех ладей.",
        "Решение: Первый способ. Пронумеруем все вертикали, начиная с самой левой, и все горизонтали, начиная с самой нижней, числами от 1 до 8. Тем самым каждой ладье приписывается пара координат. Сумму этих координат назовем весом ладьи. На каждой вертикали и на каждой горизонтали стоит по одной ладье (поскольку ладьи не бьют друг друга), поэтому сумма S координат всех ладей равна 2·(1 + 2 + ... + 8), то есть чётна. С другой стороны, чтобы вычислить сумму S, нужно просуммировать веса всех ладей. Однако вес ладьи, стоящей на чёрной клетке, чётен, а вес ладьи, стоящей на белой клетке, нечётен. Поскольку S чётно, то количество нечётных слагаемых-весов чётно, то есть число ладей на чёрных полях чётно."
    ],
    "60661": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3+",
        "Классы: 7,8,9,10",
        "Условие: Назовём шестизначное число счастливым, если сумма его первых трёх цифр равна сумме последних трёх цифр. Докажите, что сумма всех счастливых чисел делится на 13. (Числа, записываемые менее, чем шестью цифрами, в этой задаче также считаются шестизначными.)",
        "Решение: Разобьём номера всех счастливых билетов на две группы. В первую группу отнесём номера, которые состоят из двух равных трёхзначных чисел (например, 765765). Все остальные номера отнесём ко второй группе. Поскольку   abcabc = abc·1001 = abc·7·11·13, то каждый номер из первой группы делится на 13, а, значит, делится на 13 и сумма всех номеров из первой группы. Рассмотрим номер abcdef из второй группы (abc ≠ def). Вместе с этим номером во второй группе находится и номер  defabc. Таким образом, все номера из второй группы разбиваются на пары. Сумма номеров в каждой паре делится на 13, так как abcdef + defabc = (abc + def)·1001.  Поэтому делится на 13 и сумма всех номеров из второй группы."
    ],
    "64318": [
        "Итерации",
        "Сложность: 3+",
        "Классы: ",
        "Условие: Докажите, что для чисел Люка Ln (см. задачу 60585) выполнено соотношение",
        "Решение: Согласно формулам Ln = Fn+1 + Fn–1 (см. задачу 60585 а),    (см. задачу 60567 а) и   (см. задачу 60564)"
    ],
    "64331": [
        "Подсчет двумя способами",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: На белых и чёрных клетках доски 10×10 стоит по одинаковому количеству ладей так, что никакие две ладьи друг друга не бьют.   Докажите, что на эту доску можно поставить еще одну ладью так, чтобы она не била никакую из уже стоящих.",
        "Решение: Так как ладьи друг друга не бьют, то на каждой горизонтали и на каждой вертикали расположено не более чем по одной ладье. Если бы ладей было 10, то на чёрных клетках стояло бы чётное число ладей (см. замечание к задаче 35488), что не так. Значит, общее число ладей не больше восьми.      Следовательно, найдутся, по крайней мере, две свободные вертикали и две свободные горизонтали, на пересечении которых мы сможем поставить даже две ладьи."
    ]
}