{
    "56540": [
        "Вписанный угол (прочее)",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: Биссектриса внешнего угла при вершине"
    ],
    "53936": [
        "Вписанный угол, опирающийся на диаметр",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Окружность, построенная на биссектрисе AD треугольника ABC как  на диаметре, пересекает стороны AB и AC соответственно в точках M и N, отличных от A. Докажите, что AM = AN.",
        "Подсказка: Прямоугольные треугольники AMD и AND равны."
    ],
    "53154": [
        "Касающиеся окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Окружность радиуса 1 касается окружности радиуса 3 в точке C. Прямая, проходящая через точку C, пересекает окружность меньшего радиуса в точке A, а большего радиуса – в точке B. Найдите AC, если AB = 2.",
        "Подсказка: Соедините центры окружностей с точкой касания и рассмотрите подобные треугольники.",
        "Решение: Пусть O1 и O2 – центры меньшей и большей окружностей соответственно. Поскольку ∠ACO1 = ∠BCO2 и треугольники AO1C и BO2C равнобедренные, то эти треугольники подобны и коэффициент подобия равен отношению радиусов окружностей, то есть 1/3.     Если окружности касаются внутренним образом, то AC = ½ AB = , что невозможно, так как хорда AC меньшей окружности не может быть больше диаметра этой окружности.     Значит, окружности касаются внешним образом, и AC = ¼ AB = .",
        "Ответ: ."
    ],
    "53155": [
        "Касающиеся окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Окружность радиуса 2 касается окружности радиуса 4 в точке B. Прямая, проходящая через точку  B , пересекает окружность меньшего радиуса в точке A, а большего радиуса – в точке C. Найдите BC, если AC = 3",
        "Подсказка: См. задачу 53154.",
        "Ответ: 2"
    ],
    "53160": [
        "Окружность, вписанная в угол",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В равнобедренном треугольнике ABC ∠B = arctg 8/15. Окружность радиуса 1, вписанная в угол C, касается стороны CB в точке M и отсекает от основания отрезок KE. Известно, что MB = 15/8. Найдите площадь треугольника KMB, если известно, что точки A, K, E, B следуют на основании AB в указанном порядке.",
        "Подсказка: Докажите, что центр окружности принадлежит основанию треугольника.",
        "Решение: Пусть O – центр данной окружности. Из прямоугольного  треугольника OMB находим, что tg∠MBO = OM/MB = 8/15 = tg∠B. Поэтому ∠MBO = ∠B. Поскольку лучи BO и BA расположены по одну сторону от прямой BC, то центр O лежит на стороне AB.     По теореме Пифагора OB² = OM² + MB² = (17/8)².    Пусть h – высота треугольника OMB (см. рис.). Тогда OB·h = OM·MB, откуда h = 15/17, SKMB = ½ (KO + OB)h = 375/272.",
        "Ответ: 375/272."
    ],
    "53161": [
        "Окружность, вписанная в угол",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В равнобедренном треугольнике MPK с основанием PM ∠P = arctg 5/12. Окружность, вписанная в угол K, касается стороны KP в точке A и отсекает от основания отрезок HE. Известно, что центр окружности удалён от вершины K на расстояние 13/24 и AP = 6/5. Найдите площадь треугольника HAE.",
        "Подсказка: См. задачу 53160.",
        "Ответ: 3/13."
    ],
    "53185": [
        "Общая касательная к двум окружностям",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На плоскости даны две окружности радиусов 4 и 3 с центрами в точках",
        "Решение: Опустим перпендикуляр",
        "Ответ: 14."
    ],
    "53205": [
        "Вписанный угол, опирающийся на диаметр",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Дан прямоугольный треугольник ABC с прямым углом при вершине C. ∠A = α, биссектриса угла B пересекает катет AC в точке K. На стороне BC как на диаметре построена   окружность, которая пересекает гипотенузу AB в точке M. Найдите   угол AMK.",
        "Подсказка: Пусть F и P – проекции точки K на AB и CM. Тогда KF = KC и KP = FM.",
        "Решение: Опустим перпендикуляры KF и KP на прямые AB и CM соответственно. Тогда tg∠AKM = KF/FM = KC/KP = 1/cos α.",
        "Ответ: 1/cos α."
    ],
    "53303": [
        "Угол между касательной и хордой",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В треугольнике ABC проведены высоты BB1 и CC1.   Докажите, что касательная в точке A к описанной окружности параллельна прямой B1C1, а B1C1 ⊥ OA (O – центр описанной окружности).",
        "Решение: На данной касательной возьмём точку M так, чтобы точки M и C лежали по разные стороны от прямой AB. Тогда ∠MAB = ∠C = ∠B1C1A. Следовательно,  B1C1 || AM ⊥ AO."
    ],
    "53516": [
        "Вписанный угол, опирающийся на диаметр",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В трапеции ABCD диагональ AC перпендикулярна боковой стороне CD, а диагональ DB перпендикулярна боковой стороне AB.  Продолжения боковых сторон AB и DC пересекаются в точке K,  образуя треугольник AKD с углом 45° при вершине K. Площадь  трапеции ABCD равна P. Найдите площадь треугольника AKD.",
        "Подсказка: Площадь четырёхугольника равна половине произведения его диагоналей на синус угла между ними.",
        "Решение: Пусть M – точка пересечения диагоналей трапеции. ∠AMB = ∠AKD как углы с взаимно перпендикулярными сторонами.",
        "Ответ: 2P."
    ],
    "53937": [
        "Диаметр, основные свойства",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Найдите внутри треугольника ABC все такие точки P, чтобы общие  хорды каждой пары окружностей, построенных на отрезках PA, PB и PC как на диаметрах, были равны.",
        "Подсказка: Докажите, что окружности с диаметрами AP и BP пересекаются на  стороне AB.",
        "Решение: Пусть C1 – отличная от A точка пересечения со стороной AB окружности, построенной на отрезке AP как на диаметре. Поскольку точка C1 лежит на окружности с диаметром AP, то ∠AC1P = 90°. Значит, эта точка лежит и на окружности с диаметром BP.     Аналогично окружности с диаметрами AP и CP пересекаются на стороне AC (в точке B1), а окружности с диаметрами CP и BP – на стороне BC (в точке A1).   По условию PA1 = PB1 = PC1, поэтому точка P равноудалена от всех сторон треугольника ABC. Следовательно, P – точка пересечения  биссектрис этого треугольника.",
        "Ответ: Точка пересечения биссектрис треугольника ABC."
    ],
    "53561": [
        "Касающиеся окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Центры трёх попарно касающихся друг друга внешним образом окружностей расположены в точках A, B, C, ∠ABC = 90°. Точки касания – K, P и M; точка P лежит на стороне AC. Найдите угол KPM.",
        "Подсказка: Выразите искомый угол через острые углы треугольника ABC.",
        "Решение: Обозначим ∠BAC = α, ∠ACB = γ (α + γ = 90°).     Пусть точка K лежит на отрезке AB. Из равнобедренных треугольников KAP и MCP находим, что ∠APK = 90° – α/2, ∠MPC = 90° – γ/2.     Значит, ∠KPM = 180° – (∠APK + ∠MPC) = ½ (α + γ) = 45°.",
        "Ответ: 45°."
    ],
    "53712": [
        "Признаки и свойства касательной",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Из конца A диаметра AC окружности опущен перпендикуляр AP на касательную, проведённую через лежащую на окружности точку B, отличную от A и C. Докажите, что AB – биссектриса угла PAC.",
        "Подсказка: Соедините точку B с центром окружности.",
        "Решение: Пусть O – центр окружности. Тогда ∠BAO = ∠ABO = 90° – ABP = ∠PAB."
    ],
    "53920": [
        "Хорды и секущие (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Найдите угол между радиусами OA и OB, если расстояние от  центра O окружности до хорды AB: а) вдвое меньше AB; б) вдвое меньше OA.",
        "Подсказка: Опустите перпендикуляр из центра окружности на хорду AB.",
        "Решение: Опустим перпендикуляр OM из центра окружности на хорду AB.",
        "Ответ: а) 90°; б) 120°."
    ],
    "53921": [
        "Диаметр, хорды и секущие",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Равные хорды окружности с центром O пересекаются в точке M.  Докажите, что MO – биссектриса угла между ними.",
        "Решение: Пусть AB и CD – равные хорды окружности с центром O, пересекающиеся в точке M, а точка O лежит внутри угла DMB. Поскольку равные хорды удалены от центра окружности на равные расстояния, то точка O, лежащая внутри угла DMB, равноудалена от его сторон. Следовательно, она лежит на биссектрисе этого угла."
    ],
    "53933": [
        "Вписанный угол, опирающийся на диаметр",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что окружность, построенная на боковой стороне равнобедренного треугольника как на диаметре, проходит через середину основания.",
        "Подсказка: Высота равнобедренного треугольника, проведённая к основанию, является также медианой.",
        "Решение: Пусть окружность, построенная на боковой стороне AB равнобедренного треугольника ABC как на диаметре, пересекает основание AC в точке  M, отличной от A. Поскольку точка M лежит на окружности с диаметром AB, то ∠AMB = 90°. Поэтому BM – высота треугольника ABC, а так как высота равнобедренного треугольника, опущенная на основание, является медианой, то M – середина основания AC."
    ],
    "53934": [
        "Вписанный угол, опирающийся на диаметр",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Окружность, построенная на стороне треугольника как на диаметре, проходит через середину другой стороны. Докажите, что треугольник равнобедренный.",
        "Подсказка: Если высота треугольника является также медианой, то треугольник равнобедренный.",
        "Решение: Пусть окружность, построенная на стороне AB треугольника ABC,   пересекает сторону AC в её середине M. Поскольку точка M лежит на окружности с диаметром AB, то ∠AMB = 90°. Поэтому BM – высота и медиана треугольника ABC. Следовательно, треугольник ABC – равнобедренный."
    ],
    "53963": [
        "Окружность, вписанная в угол",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Две прямые касаются окружности с центром O в точках A и B и пересекаются в точке C. Найдите угол между этими прямыми, если ∠ABO = 40°.",
        "Подсказка: CO – биссектриса угла ACB.",
        "Решение: Поскольку CO – биссектриса угла ACB, а треугольник ABC – равнобедренный, то CO ⊥ AB. Углы ABO и BCO равны, так как каждый из них в сумме с углом BOC составляет 90°. Следовательно, ∠ACB = 2∠BCO = 2·40° = 80°.",
        "Ответ: 80°."
    ],
    "53964": [
        "Две касательные, проведенные из одной точки",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Две прямые, пересекающиеся в точке C, касаются окружности с центром O в точках A и B. Известно, что ∠ACB = 120°. Докажите, что AC + BC = OC.",
        "Подсказка: BC – катет прямоугольного треугольника OBC, лежащий против  угла в 30°."
    ],
    "56541": [
        "Углы, опирающиеся на равные дуги и равные хорды",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: Вершина",
        "Решение: Проведем диаметр"
    ],
    "53965": [
        "Окружность, вписанная в угол",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Окружность касается двух параллельных прямых и их секущей.   Докажите, что отрезок секущей, заключённый между параллельными прямыми, виден из центра окружности под прямым углом.",
        "Подсказка: Центр окружности, вписанной в угол, лежит на биссектрисе угла.",
        "Решение: Обозначим через A и B точки пересечения прямой c с  параллельными прямыми a и b соответственно. Пусть окружность с  центром O касается прямых a и b соответственно в точках M и N. Тогда AO – биссектриса угла BAM, а BO – биссектриса угла ABN. Поскольку ∠BAM + ∠ABN = 180°, то   ∠BAO + ∠ABO = ½ ∠BAM + ½ ∠ABN = ½ (∠BAM + ∠ABN) = 90°. Следовательно, ∠AOB = 180° – (∠BAO + ∠ABO) = 90°."
    ],
    "53977": [
        "Признаки и свойства касательной",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Две прямые, проходящие через точку M, лежащую вне окружности с центром O, касаются окружности в точках A и B. Отрезок OM делится окружностью пополам. В каком отношении отрезок OM делится прямой  AB?",
        "Подсказка: В прямоугольном треугольнике AMO катет OA равен половине  гипотенузы OM. Если K – середина OM, то треугольник AOK – равносторонний.",
        "Решение: Биссектриса равнобедренного треугольника AMB, проведённая из вершины M, является высотой. Поэтому AB ⊥ MO. Пусть окружность пересекает отрезок OM в точке K. В прямоугольном треугольнике AMO катет OA равен половине гипотенузы MO, значит, ∠AMO = 30°, а ∠AOM = 60°. Поскольку угол между равными сторонами OA и OK   равнобедренного треугольника AOK равен 60°, то треугольник – равносторонний. Его высота AP является медианой, поэтому   OP = KP = ½ OK = ¼ OM. Следовательно,   OP : MP = 1 : 3.",
        "Ответ: 1 : 3, считая от точки O."
    ],
    "53993": [
        "Общая касательная к двум окружностям",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Прямая, проходящая через центры двух окружностей называется их линией центров.   Докажите, что общие внешние (внутренние) касательные к двум окружностям пересекаются на линии центров этих окружностей.",
        "Подсказка: Центр окружности, вписанной в угол, лежит на биссектрисе этого  угла.",
        "Решение: Пусть общие внешние касательные к двум окружностям разного радиуса пересекаются в точке M. Поскольку эти окружности вписаны в угол с вершиной M, то их центры лежат на биссектрисе этого угла, а так как через две различные точки (в данном случае – центры окружностей) проходит только одна прямая, то линия центров лежит на указанной биссектрисе.     Аналогично доказывается утверждение для общих внутренних касательных (в этом случае радиусы окружностей могут быть равными)."
    ],
    "54057": [
        "Вписанный угол, опирающийся на диаметр",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Окружность, построенная на стороне треугольника как на диаметре, высекает на двух других сторонах равные отрезки.  Докажите, что треугольник равнобедренный.",
        "Подсказка: Воспользуйтесь признаком равенства прямоугольных треугольников по катету и гипотенузе.",
        "Решение: Пусть окружность, построенная на стороне BC треугольника ABC как на диаметре, пересекает стороны AB и BC соответственно в точках M и N, причём  BM = CN. Тогда отрезок BC виден из этих точек под прямым углом.     Прямоугольные треугольники BMC и CNB равны по  гипотенузе и катету, поэтому ∠B = ∠C."
    ],
    "55487": [
        "Две касательные, проведенные из одной точки",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В прямоугольный треугольник с гипотенузой, равной 26, вписана окружность радиуса 4. Найдите периметр треугольника.",
        "Подсказка: См. задачу 55404.",
        "Решение: Расстояние от вершины прямого угла данного треугольника до точки касания вписанной окружности с катетом треугольника равно радиусу вписанной окружности (r = 4).     С другой стороны, это расстояние равно p – c, где p – полупериметр треугольника, а c – гипотенуза.  Следовательно, 4 = p – 26, то есть p = 30.",
        "Ответ: 60."
    ],
    "56549": [
        "Углы, опирающиеся на равные дуги и равные хорды",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Окружность разделена на равные дуги n диаметрами. Докажите, что основания перпендикуляров, опущенных из произвольной точки M, лежащей внутри окружности, на эти диаметры, являются вершинами правильного многоугольника.",
        "Решение: Основания перпендикуляров, опущенных из точки M на диаметры, лежат на окружности S с диаметром OM (O — центр исходной окружности). Точки пересечения данных диаметров с окружностью S, отличные от точки O, делят ее на n дуг. Так как на все дуги, не содержащие точкуO, опираются углы 180°/n, то угловые величины этих дуг равны 360°/n. Поэтому угловая величина дуги, на которой лежит точка O, также равна 360°/n. Следовательно, основания перпендикуляров делят окружностьS на n равных дуг."
    ],
    "56556": [
        "Величина угла между двумя хордами и двумя секущими",
        "Сложность: 3",
        "Классы: 8",
        "Условие: По стороне правильного треугольника катится окружность радиуса, равного его высоте. Докажите, что угловая величина дуги, высекаемой на окружности сторонами треугольника, всегда равна",
        "Решение: Обозначим угловую величину дуги, высекаемой сторонами треугольника"
    ],
    "61335": [
        "Окружности (прочее)",
        "Сложность: 3",
        "Классы: 9,10,11",
        "Условие: Рассмотрим окружность радиуса 1. Опишем около нее и впишем в нее правильные  n-угольники. Обозначим их периметры через Pn (для описанного) и pn (для вписанного).   а) Найдите P4, p4, P6 и p6.   б) Докажите, что справедливы следующие рекуррентные соотношения:  P2n = ,p2n = (n ≥ 3).   в) Найдите P96 и p96. Докажите неравенства 310/71 < π < 31/7.",
        "Решение: б) Обозначим через",
        "Ответ: в) P96 ≈ 6,285429, p96 ≈ 6,282064."
    ],
    "76505": [
        "Общая касательная к двум окружностям",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: К двум окружностям, касающимся извне, проведены общие внешние касательные и точки касания соединены между собой. Доказать, что в полученном четырёхугольнике суммы противоположных сторон равны.",
        "Решение: Пусть"
    ],
    "78656": [
        "Вписанный угол равен половине центрального",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: Можно ли вписать в окружность выпуклый семиугольник",
        "Решение: Предположим, что выпуклый семиугольник",
        "Ответ: нет, нельзя."
    ],
    "108022": [
        "Вспомогательная окружность",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В остроугольном треугольнике соединены основания высот. Оказалось, что в полученном треугольнике две стороны параллельны сторонам исходного треугольника. Докажите, что третья сторона также параллельна одной из сторон исходного треугольника.",
        "Решение: Пусть AA1, BB1 и CC1 – высоты треугольника ABC, A1C1 || AC и A1B1 || AB."
    ],
    "108603": [
        "Угол между касательной и хордой",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Около треугольника ABC описана окружность с центром O. Вторая окружность, проходящая через точки A, B, O, касается прямой AC в точке A.   Докажите, что AB = AC.",
        "Решение: Из теоремы об угле между касательной и хордой следует, что   ∠CAO = ∠BOA = ∠OAB. Поэтому равнобедренные треугольники AOC и AOB равны. Следовательно, AB = AC."
    ],
    "108651": [
        "Углы, опирающиеся на равные дуги и равные хорды",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: BD – биссектриса треугольника ABC. Описанная окружность  треугольника  BDC  пересекает отрезок AB в точке E,   описанная окружность треугольника ABD пересекает отрезок BC в точке F. Докажите, что AE = CF.",
        "Подсказка: Равные вписанные углы опираются на равные хорды.",
        "Решение: Поскольку BD – биссектриса вписанного в окружность угла ABF, то AD = DF. Аналогично ED = DC. Четырёхугольник BCDE – вписанный, поэтому ∠ADE = ∠B. Аналогично ∠CDF = ∠B. Значит, треугольники ADE и FDC равны по двум сторонам и углу между ними. Следовательно, AE = CF."
    ],
    "108955": [
        "Диаметр, основные свойства",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Биссектриса угла A треугольника ABC пересекает серединный перпендикуляр к стороне AB в точке X, серединный перпендикуляр к стороне AC – в точке Y, а описанную окружность треугольника – в точке Z. Точки A, X, Y и Z лежат на биссектрисе в порядке перечисления. Докажите, что AX = YZ.",
        "Решение: Пусть указанные в условии серединные перпендикуляры пересекаются в центре O описанной окружности треугольника ABC. Перпендикуляр, опущенный из точки O на хорду AZ проходит через её середину P. Если M и N – середины сторон AB и AC соответственно, то   ∠OXY = ∠AXM = 90° – ∠MAX = 90° – ½ ∠A, ∠OYX = ∠NYA = 90° – ∠NAY = 90° – ½∠A = ∠OXY. Значит, треугольник OXY – равнобедренный. Его высота OP является медианой, поэтому PX = PY, то есть P – середина XY. Следовательно, AX = AP – PX = ZP – PY = YZ."
    ],
    "111457": [
        "Произведение длин отрезков хорд и длин отрезков секущих",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Основания равнобочной трапеции относятся как 3:2. На большем основании как на диаметре построена окружность, высекающая на меньшем основании отрезок, равный половине этого основания. В каком отношении окружность делит боковые стороны трапеции?",
        "Решение: Пусть окружность с центром",
        "Ответ: 1:2."
    ],
    "111463": [
        "Угол между касательной и хордой",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В равнобедренном треугольнике ABC угол при вершине B равен α. В точке C проведена касательная к описанной окружности этого треугольника, пересекающая продолжение биссектрисы BD угла B в точке E. Найдите отношение площади треугольника CDE к площади треугольника ABC.",
        "Решение: Обозначим CD = AD = a. По теореме об угле между касательной и хордой ∠DCE = ∠ACE = α.     Из прямоугольных треугольников CDE и BCD находим, что  DE = a tg α, BD = a ctg α/2.     Следовательно,",
        "Ответ: ½ tg α tg α/2."
    ],
    "111551": [
        "Вписанный угол, опирающийся на диаметр",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Центр окружности радиуса 5, описанной около равнобедренной трапеции, лежит на большем основании, а меньшее основание равно 6. Найдите  площадь трапеции.",
        "Решение: Пусть центр окружности, описанной около равнобедренной трапеции",
        "Ответ: 32.00"
    ],
    "115310": [
        "Углы, опирающиеся на равные дуги и равные хорды",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: ABCD – выпуклый четырёхугольник, AB = BC и AD = DC. На диагонали AC нашлась такая точка K,   что AK = BK и четырёхугольник KBCD – вписанный.  Докажите, что BD = CD.",
        "Решение: Обозначим ∠ABK = ∠BAC = ∠BCA = α, ∠DAC = ∠DCA = β. Тогда  ∠BAD = α + β, ∠ABD = ∠ABK + ∠KBD = ∠ABK + ∠KCD = α + β. Значит, треугольник ADB – равнобедренный. Следовательно, BD = AD = CD."
    ],
    "115574": [
        "Вписанный угол, опирающийся на диаметр",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На катетах прямоугольного треугольника как на диаметрах построены окружности. Найдите их общую хорду, если катеты равны 3 и 4.",
        "Решение: Пусть CD – общая хорда окружностей, построенных на катетах AC = 3 и BC = 4 прямоугольного   треугольника ABC как на диаметрах. Тогда   ∠ADC = ∠BDC = 90° как вписанные углы, опирающиеся на диаметр. Значит, точка D лежит на гипотенузе AB, а CD – высота прямоугольного треугольника ABC, проведённая из вершины прямого угла.     По теореме Пифагора AB = 5, а так как 2 SABC = AC·BC = AB·CD, то CD = 3·4 : 5.",
        "Ответ: 2,4."
    ],
    "56672": [
        "Касающиеся окружности",
        "Сложность: 2",
        "Классы: 8",
        "Условие: Две окружности касаются в точке",
        "Решение: ПустьM— точка пересечения прямойCB и  касательной к окружностям в точкеA. ТогдаMC = MA = MB (равенство отрезков касательных). Поэтому  точкаA лежит на окружности с диаметромCB."
    ],
    "116095": [
        "Радикальная ось",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Расстояние между центрами окружностей больше суммы их радиусов.   Докажите, что середины отрезков четырёх общих касательных этих окружностей лежат на одной прямой.",
        "Решение: Поскольку расстояние между центрами окружностей больше суммы их радиусов, окружности расположены одна вне другой, поэтому у них есть две внешние и две внутренние  общие касательные.     Пусть прямая касается данных окружностей в точках A и B, а M – середина отрезка AB. Тогда MA = MB, то есть отрезки касательных, проведённых к окружностям из точки M, равны. Значит, точка M лежит на радикальной оси данных окружностей.     То же верно для середин отрезков остальных трёх касательных."
    ],
    "116308": [
        "Угол между касательной и хордой",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На стороне AB треугольника ABC взята такая точка D, что окружность, проходящая через точки A, C и D, касается прямой BC.   Найдите AD, если AC = 9, BC = 12 и CD = 6.",
        "Решение: Треугольник ABC подобен треугольнику CBD по двум углам с коэффициентом подобия AC/CD = 3/2. Значит, AB = 3/2 BC = 18, BD = &frac23; BC = 8,  AD = AB – BD = 10.",
        "Ответ: 10."
    ],
    "116309": [
        "Угол между касательной и хордой",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На стороне AC треугольника ABC взята такая точка D, что окружность, проходящая через точки A, B и D, касается прямой BC.   Найдите AD, если AB = 18, AC = 36 и BD = 15.",
        "Подсказка: См. задачу 116308.",
        "Ответ: 11."
    ],
    "102318": [
        "Вычисление длин дуг",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите или опровергните следующее утверждение: периметр ромба с диагоналями длины 1 и 3 больше длины окружности радиуса 1.",
        "Подсказка: Воспользуйтесь неравенством",
        "Решение: Половины диагоналей ромба равны",
        "Ответ: Утверждение верно."
    ],
    "32831": [
        "Концентрические окружности",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Федя К. вышел из некоторой точки, прошел 1км на север, затем  - 1км на восток, затем - 1км на юг и вернулся в исходную точку.",
        "Ответ: а) Например, на Южном полюсе."
    ],
    "35439": [
        "Вычисление длин дуг",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: В прямоугольном листе бумаги сделали несколько непересекающихся    круглых дыр. На дырявом листке отметили две точки, находящиеся     на расстоянии d друг от друга.     Докажите, что на дырявом листке можно нарисовать кривую длины     меньше 1,6d,     соединяющую данные точки.",
        "Подсказка: Соедините точки прямой. Если по пути попадается дырка, то нужно    просто ее обойти по дуге.",
        "Решение: Соединим две данные точки отрезком.    Будем идти из одной точки до другой вдоль этого отрезка пока не    достигнем  участка"
    ],
    "52499": [
        "Величина угла между двумя хордами и двумя секущими",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Дан вписанный четырехугольник",
        "Подсказка: Угол между секущими равен полуразности высекаемых дуг.  Угол между пересекающимися хордами равен полусумме высекаемых дуг.",
        "Решение: Пусть биссектриса угла"
    ],
    "56684": [
        "Две касательные, проведенные из одной точки",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Из точки",
        "Решение: Точки"
    ],
    "56707": [
        "Окружности (прочее)",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Две окружности имеют радиусы",
        "Решение: Пусть окружности с центрами"
    ],
    "102268": [
        "Центральный угол. Длина дуги и длина окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На координатной плоскости (",
        "Подсказка: Решив систему уравнений, найдите координаты точек пересечения прямой и окружности. Затем, применив теореме косинусов, найдите угол между радиусами окружности, проведёнными в найденные точки пересечения.",
        "Решение: Решив систему уравнений",
        "Ответ: $\\frac{2\\pi }{3}+ 4\\sqrt{2-\\sqrt{3}}$  -->"
    ],
    "32119": [
        "Касающиеся окружности",
        "Сложность: 3+",
        "Классы: 6,7,8,9",
        "Условие: Можно ли на плоскости нарисовать 12 окружностей так, чтобы каждая касалась ровно пяти других?",
        "Решение: Требуемое расположение показано на рисунке.",
        "Ответ: Можно."
    ],
    "52339": [
        "Вписанный угол равен половине центрального",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите, что вписанный угол равен половине соответствующего центрального угла (или дуги) окружности.",
        "Подсказка: Разберите три случая: центр окружности лежит на стороне угла, внутри угла, вне угла.",
        "Решение: Пусть центр O окружности лежит на стороне AB вписанного угла BAC (рис. слева). Поскольку BOC – внешний угол равнобедренного треугольника AOC, то ∠BOC = ∠BAC + ∠ACO = 2∠BAC. Следовательно,  ∠BAC = ½ ∠BOC, то есть вписанный угол BAC равен половине центрального угла BOC, или половине дуги BC, не содержащей точки A."
    ],
    "52352": [
        "Вписанный угол, опирающийся на диаметр",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В треугольнике ABC на стороне AC как на диаметре построена  окружность, которая пересекает сторону AB в точке M, а сторону BC – в точке N. Известно, что AC = 2, AB = 3, AM : MB = 2 : 3. Найдите AN.",
        "Подсказка: AB·CM = BC·AN.",
        "Решение: Поскольку точки M и N лежат на окружности с диаметром AC, то ∠AMC = ∠ANC = 90°.     По теореме Пифагора MC² = AC² – AM² = 2² – (6/5)² = 64/25, BC² = MC² + BM² = 64/25 + (9/5)² = 29/5.     Следовательно, AN = 2SABC/BC = AM·MC/BC = .",
        "Ответ: ."
    ],
    "35078": [
        "Теорема о длинах касательной и секущей; произведение всей секущей на ее внешнюю часть",
        "Сложность: 2+",
        "Классы: 9",
        "Условие: Две окружности пересекаются в точках A и B.  К этим окружностям проведена общая касательная, которая касается  окружностей в точках C и D.  Докажите, что прямая AB делит отрезок CD пополам.",
        "Подсказка: На самом деле верен более общий факт: отрезки касательных,  проведенных из любой точки (лежащей вне окружностей) прямой AB  к данным окружностям, равны.  Доказательство можно вывести из теоремы о касательной и секущей  (квадрат длины касательной равен произведению длин отрезков  секущей) или используя подобие треугольников.",
        "Решение: Пусть прямая AB пересекает отрезок CD в точке O.  Отрезок OC является отрезком касательной, проведенной из точки O к  первой окружности. Секущая OA пересекает первую окружность в  точках A и B.  Воспользуемся тем фактом, что  квадрат длины касательной равен произведению длин отрезков  секущей. Имеем: OC"
    ],
    "52459": [
        "Произведение длин отрезков хорд и длин отрезков секущих",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Дан угол с вершиной O и окружность, касающаяся его сторон в точках A и B. Из точки A параллельно OB проведён луч,  пересекающий окружность в точке C. Прямая OC пересекает окружность в  точке E. Прямые AE и OB пересекаются в точке K. Докажите, что OK = KB.",
        "Подсказка: Треугольник KOA подобен треугольнику KEO.",
        "Решение: Треугольники KOA и KEO подобны по двум углам (∠EOK = ∠ACE = ∠OAK). Поэтому   KE : OK = OK : AK. Отсюда следует, что OK² = EK·AK. С другой стороны, по теореме о касательной и секущей EK·AK = KB². Следовательно, OK = KB."
    ],
    "52461": [
        "Теорема о длинах касательной и секущей; произведение всей секущей на ее внешнюю часть",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В равнобедренном треугольнике ABC проведены биссектрисы AD, BE, CF.   Найдите BC, если известно, что AB = AC = 1, а вершина A лежит на окружности, проходящей через точки D, E и F.",
        "Подсказка: Примените свойство биссектрисы треугольника и теорему о касательной и секущей.",
        "Решение: Пусть BC = x. По свойству биссектрисы треугольника  CE : AE = x : 1, откуда CE = x/1+x. Поскольку CD² = CE·AC, то &nbspx²/4 = x/1+x. Из этого уравнения находим, что x = .",
        "Ответ: ."
    ],
    "52579": [
        "Касающиеся окружности",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Через точку касания двух окружностей проведена секущая. Докажите, что радиусы и касательные, проведённые через концы образовавшихся хорд, параллельны.",
        "Подсказка: Докажите равенство углов, образованных соответствующими радиусами с секущей. Не забудьте рассмотреть оба возможных случая: внешнего и внутреннего касания окружностей.",
        "Решение: Рассмотрим случай внешнего касания. Пусть O1 и O2 – центры окружностей, M – точка касания, A1 и A2 — соответственно точки  пересечения окружностей с секущей. Тогда ∠O1A1M = ∠O1MA1 = ∠O2MA2 = ∠O2A2M. Поскольку накрест лежащие углы равны, то прямые O1A1 и O2A2 параллельны. Следовательно, параллельны и перпендикулярные им касательные.     Аналогичное доказательство проходит и для случая внутреннего касания окружностей."
    ],
    "52715": [
        "Касающиеся окружности",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Три окружности радиусов 1, 2 и 3 касаются друг друга внешним образом. Найдите радиус окружности, проходящей через точки касания этих окружностей.",
        "Решение: Пусть C, B и A – центры окружностей радиусов 1, 2 и 3 соответственно (рис. слева). Линия центров двух касающихся окружностей   проходит через точку их касания, значит, точки M, N и K касания   окружностей лежат на сторонах треугольника ABC. Пусть точка K лежит на отрезке AC, точка M – на отрезке AB, точка N – на отрезке BC. Тогда AB = 5, AC = 4, BC = 3.     Треугольник ABC прямоугольный, так как AC² + BC² = AB², значит, радиус его вписанной окружности равен ½ (AB + BC – AB) = 1.     Докажем, что окружность, проходящая через точки K, M, N, и есть  вписанная окружность треугольника ABC. Действительно, если вписанная  окружность треугольника ABC касается стороны AB в точке M1 (рис. справа), то AM1 = 4 – 1 = AM, значит, точка M1 совпадает с точкой M. Аналогично доказывается, что вписанная окружность треугольника ABC касается его сторон AC и BC соответственно в точках K и N.",
        "Ответ: 1."
    ],
    "35559": [
        "Общая касательная к двум окружностям",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: На плоскости нарисованы две окружности (см. рис.). Существует ли некоторая точка, лежащая вне каждой из этих окружностей, для которой любая прямая, проходящая через неё, пересекает хотя бы одну из окружностей?",
        "Подсказка: Если точка расположена близко к окружности, то почти все    прямые, проходящие через нее, пересекают эту окружность.",
        "Решение: Проведём одну внутреннюю и одну внешнюю общие касательные к окружностям (на картинке это красные прямые). Обозначим их точки касания с первой окружностью через K и L, а точку пересечения этих прямых – через M. Рассмотрим любую точку, лежащую внутри маленького криволинейного треугольника KLM. Нетрудно убедиться, что она обладает требуемым свойством.",
        "Ответ: существует."
    ],
    "52753": [
        "Касающиеся окружности",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В треугольнике ABC сторона BC равна a, радиус вписанной  окружности равен r.   Найдите радиусы двух равных окружностей, касающихся друг друга, если одна из них касается сторон BC и BA, а другая – BC и CA.",
        "Решение: Обозначим через x искомый радиус.",
        "Ответ: ar/a+2r."
    ],
    "52761": [
        "Хорды и секущие (прочее)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Окружность с центром, расположенным внутри прямого угла, касается одной стороны угла, пересекает другую сторону в точках A и B и биссектрису угла в точках C и D. AB = , CD = . Найдите радиус окружности.",
        "Решение: Пусть K – вершина данного прямого угла, M – точка касания, O – центр окружности, R – её радиус, P и Q – основания перпендикуляров, опущенных из O на AB и CD, F – точка пересечения OM и CD. Тогда  MK² = OP² = R² – 3/2, OQ² = R² – 7/4, MK = MF = MO – OF = MO – OQ, или      Отсюда",
        "Ответ: ."
    ],
    "52764": [
        "Хорды и секущие (прочее)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На плоскости дан прямой угол. Окружность с центром, расположенным вне этого угла, касается продолжения одной из его сторон, пересекает другую сторону в точках A и B и пересекает биссектрису этого угла в точках C и D. AB = 4, CD = 2. Найдите радиус окружности.",
        "Решение: См. задачу 52761.",
        "Ответ: 3."
    ],
    "52771": [
        "Две касательные, проведенные из одной точки",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Выпуклый четырёхугольник ABCD описан вокруг окружности с центром в точке O, при этом AO = OC = 1, BO = OD = 2.   Найдите периметр четырёхугольника ABCD.",
        "Подсказка: Данный четырёхугольник – ромб.",
        "Решение: Пусть M и N – точки касания окружности со сторонами AB и BC соответственно.     Треугольники AMO и CNO равны по гипотенузе и катету, поэтому AM = CN, а так как BM = BN, то AB = BC. Аналогично BC = CD = AD. Значит,  ABCD – ромб, а O – точка пересечения его  диагоналей. Следовательно, AB² = AO² + BO² = 5.",
        "Ответ: 4."
    ],
    "52772": [
        "Две касательные, проведенные из одной точки",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В выпуклый четырёхугольник ABCD вписана окружность с центром в точке O, причём AO = OC, BC = 5, CD = 12, а угол DAB прямой.   Найдите площадь четырёхугольника ABCD.",
        "Подсказка: Докажите равенство треугольников DAB и DCB.",
        "Решение: Пусть M и N – точки касания вписанной окружности со сторонами AB и BC соответственно. Треугольники AMO и CNO равны по катету и гипотенузе. Поэтому AM = CN, а так как BM = BN, то AB = BC = 5. Аналогично AD = DC = 12. Поэтому треугольники DAB и DCB равны по трём сторонам. Следовательно,  SABCD = 2SDAB = 60.",
        "Ответ: 60."
    ],
    "52773": [
        "Касающиеся окружности",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Дана окружность с центром в точке O и радиусом 2. Из конца отрезка OA, пересекающегося с окружностью в точке M, проведена касательная AK к окружности, ∠OAK = 60°. Найдите радиус окружности, касающейся отрезков AK, AM и дуги MK.",
        "Решение: Пусть O1 – центр второй окружности, r – её радиус,  F – точка касания с отрезком AM, P – с дугой MK. Тогда  OO1 = OP + PO1 = 2 + r, O1O² = OF² + O1F², или (2 + r)² = 1/3 (4 – 3r)² + r².     Из этого уравнения находим, что r = 2 ± 4/3. Поскольку r < 4/3, то подходит только меньший корень.",
        "Ответ: 2 – 4/3."
    ],
    "52776": [
        "Касающиеся окружности",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Через точку A окружности радиуса 10 проведены две взаимно перпендикулярные хорды AB и AC.  Вычислите радиус окружности, касающейся данной окружности и построенных хорд, если AB = 16.",
        "Решение: Пусть O – центр первой окружности, K – середина AB.     Из прямоугольного треугольника ABC находим, что AC = 12. Заметим, что вершина O1 квадрата AKO1N находится на расстоянии 8 как от прямых AB и AC, так и от первой окружности (OO1 = 8 – 6 = 10 – 8). Следовательно, O1 – центр второй окружности, а её радиус равен 8.",
        "Ответ: 8."
    ],
    "52782": [
        "Касающиеся окружности",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На отрезке AB = 2R как на диаметре построена окружность. Вторая окружность того же радиуса, что и первая, имеет центр в точке A. Третья окружность касается первой окружности внутренним образом, а второй – внешним образом, а также отрезка AB. Найдите радиус третьей окружности.",
        "Решение: Пусть O – центр первой окружности, O1 – центр третьей окружности, M – её точка касания с прямой AB, x – её радиус. Тогда OO1 = R –  x, MO1 = x,  AO1 = R + x, OM² = O1O² – O1M² = R² – 2Rx, AM2 + O1M² = O1A², или (R +  )² + x² = (R + x)², откуда x = .",
        "Ответ: ."
    ],
    "52784": [
        "Касающиеся окружности",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На отрезке AC дана точка B, причём AB = 14, BC = 28. На отрезках AB, BC, AC как на диаметрах построены полуокружности в одной полуплоскости относительно прямой AB. Найдите радиус  окружности, касающейся всех трёх полуокружностей.",
        "Подсказка: Примените формулу Герона или теорему Пифагора.",
        "Решение: Пусть точки O1, O2 и O – центры данных полуокружностей с диаметрами AB, BC, AC соответственно, x – радиус искомой окружности, O3 – её центр. Тогда  OO1 = 14, OO2 = 7, O1O3 = 7 + x, OO3 = 21 – x, O2O3 = 14 + x.",
        "Ответ: 6."
    ],
    "52556": [
        "Хорды и секущие (прочее)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Хорда стягивает дугу в 90° и равна 16. Найдите её расстояние от центра.",
        "Подсказка: Основание перпендикуляра, опущенного из центра окружности на указанную хорду, делит её пополам.",
        "Решение: Пусть M – основание перпендикуляра, опущенного из центра O  окружности на хорду AB. Тогда M – середина AB и прямоугольный треугольник OMA – равнобедренный. Следовательно, OM = MA = 8.",
        "Ответ: 8."
    ],
    "52792": [
        "Биссектриса делит дугу пополам",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В треугольнике ABC BC = 4, AB = 2  .  Известно, что центр окружности, проходящей через середины сторон треугольника, лежит на биссектрисе угла C. Найдите AC.",
        "Решение: Пусть A1, B1 и C1 – середины BC, AC и AB соответственно,   O – центр данной окружности.     Поскольку треугольники A1B1C1 и B1A1C равны, то радиусы данной окружности ω и описанной окружности ω1 треугольника A1B1C равны.    Пусть прямая OC пересекает ω1 в точке M.  Тогда MA1 = MB1 и OA1 = OB1. Поэтому если точки O и M не совпадают, то OC ⊥ A1B1, а так как CO – биссектриса угла C, то  CA1 = CB1 и AC = BC = 4, AC + BC = 4 + 4 = 8 < AB, что невозможно. Значит, точки M и O совпадают, то есть центр ω лежит на ω1. Поэтому ∠A1OB1 + ∠A1CB1 = 180°, то есть   2∠C + ∠C = 180°, ∠C = 60°.    По теореме косинусов AC² + 16 – 4AC = 76, откуда AC = 10.",
        "Ответ: 10."
    ],
    "52901": [
        "Общая касательная к двум окружностям",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Расстояние между центрами двух окружностей, лежащих одна вне другой, равно 65; длина их общей внешней касательной (между точками касания) равна 63; длина их общей внутренней касательной равна 25. Найдите радиусы окружностей.",
        "Подсказка: Опустите перпендикуляр из центра одной окружности на радиус (или его продолжение) другой окружности, проведённый в точку касания с общей внешней (или внутренней) касательной.",
        "Решение: Пусть O1 и O – центры окружностей, A и B – точки касания с общей внешней касательной, C и D – с внутренней, r и R (r < R) – радиусы окружностей.     Опустим перпендикуляры O1K на OB и  OP на продолжение O1C. Тогда   (R – r)² = OK² = O1O² – O1K² = 65² – 63² = 128·2 = 16²,   (R + r)² = O1P² = O1O² – OP² = 65² – 25² = 40·90 = 60².",
        "Ответ: 38 и 22."
    ],
    "52925": [
        "Две касательные, проведенные из одной точки",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В трапеции ABCD с основаниями AD и BC боковая сторона  AB равна 2. Биссектриса угла BAD пересекает прямую BC в точке  E. В треугольник ABE вписана окружность, касающаяся стороны AB в точке M и стороны BE в точке H, MH = 1. Найдите угол BAD.",
        "Подсказка: Воспользуйтесь подобием треугольников BMH и BAE.",
        "Решение: Поскольку BE || AD, то ∠AEB = ∠EAD = ∠BAE. Поэтому треугольник ABE – равнобедренный. Следовательно, BE = AB = 2 и MH || AE.     Обозначим BM = BH = x. Пусть K – точка касания данной окружности со стороной AE. Тогда AK = AM = 2 – x, AE = 4 – 2x.     Из подобия равнобедренных треугольников MBH и ABE следует, что MH : AE = BM : AB, или 1/4–2x = x/2, или x² – 2x + 1 = 0.     Отсюда x = 1, то есть эти треугольники –  равносторонние. Следовательно, ∠BAD = 2∠BAE = 120°.",
        "Ответ: 120°."
    ],
    "52958": [
        "Углы, опирающиеся на равные дуги и равные хорды",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Диагонали выпуклого четырёхугольника ABCD, вписанного в окружность, пересекаются в точке E. Известно, что диагональ BD является биссектрисой угла ABC и что BD = 25, а CD = 15. Найдите BE.",
        "Подсказка: Треугольники BCD и CED подобны.",
        "Ответ: 16."
    ],
    "56654": [
        "Окружности (прочее)",
        "Сложность: 2",
        "Классы: 7",
        "Условие: Две окружности пересекаются в точках"
    ],
    "52560": [
        "Хорды и секущие (прочее)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: В окружности, радиус которой 1,4, определите расстояние от центра до хорды, если она отсекает дугу в 120°.",
        "Подсказка: Катет, лежащий против угла в 30°, равен половине гипотенузы.",
        "Решение: Пусть M – основание перпендикуляра, опущенного из центра O на хорду AB. Тогда OM – катет прямоугольного треугольника OMA, лежащий против угла в 30°. Следовательно, OM = ½ OA = 0,7.",
        "Ответ: 0,7."
    ],
    "52959": [
        "Углы, опирающиеся на равные дуги и равные хорды",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Диагональ MP выпуклого четырёхугольника MNPQ, вписанного в  окружность, является биссектрисой угла NMQ и пересекается с диагональю NQ в точке T. Найдите NP, если MT = 5, TP = 4.",
        "Подсказка: Треугольники MNP и NTP подобны.",
        "Ответ: 6."
    ],
    "52562": [
        "Центральный угол. Длина дуги и длина окружности",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Угловая величина дуги равна 110°. Найдите угол между хордой и продолжением радиуса, проведённого в конец дуги.",
        "Решение: Пусть O – центр окружности, AB – хорда. Искомый угол – смежный для угла при основании равнобедренного треугольника с углом   110° при вершине.",
        "Ответ: 145°."
    ],
    "52601": [
        "Окружность, вписанная в угол",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Из концов дуги в 200° проведены касательные до взаимного пересечения. Найдите угол между ними.",
        "Подсказка: Проведите радиусы в точки касания.",
        "Решение: Пусть A и B – точки касания, O – центр данной окружности, M – точка пересечения касательных. Тогда   ∠AOB = 360° – 200° = 160°.     Поскольку OA ⊥ AM и   OB ⊥ BM, то ∠AMB = 180° – ∠AOB = 180° – 160° = 20°.",
        "Ответ: 20°."
    ],
    "52602": [
        "Окружность, вписанная в угол",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Угол между двумя касательными, проведёнными из одной точки к окружности, равен 70°.   Найдите угловые величины дуг, заключённых между точками касания.",
        "Подсказка: Найдите угловую величину соответствующего центрального угла.",
        "Решение: Угловая величина меньшей дуги равна угловой величине центрального угла, то есть 180° – 70° = 110°.",
        "Ответ: 110°, 250°."
    ],
    "52603": [
        "Окружность, вписанная в угол",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Хорда делит окружность в отношении 11 : 16. Найдите угол между  касательными, проведёнными из концов этой хорды.",
        "Подсказка: Найдите угловую величину соответствующего центрального угла.",
        "Решение: Угловая величина меньшей из двух дуг равна 11/27·360° = 11/3·40° = 146°40'. Следовательно, угол между касательными равен 180° – 146°40' = 33°20'.",
        "Ответ: 33°20'."
    ],
    "52884": [
        "Признаки и свойства касательной",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: К окружности радиуса 36 проведена касательная из точки, удаленной от центра на расстояние, равное 85. Найдите длину касательной.",
        "Подсказка: Радиус, проведённый в точку касания, перпендикулярен касательной.",
        "Ответ: 77."
    ],
    "52885": [
        "Две касательные, проведенные из одной точки",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Из общей точки проведены к окружности две касательные. Радиус окружности равен 11, а сумма касательных равна 120.   Найдите расстояние от центра до общей точки касательных.",
        "Решение: Длина каждой касательной равна 60. Квадрат искомого расстояния равен 60² + 11² = 61².",
        "Ответ: 61."
    ],
    "53958": [
        "Признаки и свойства касательной",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что касательные к окружности, проведённые через концы диаметра, параллельны.",
        "Подсказка: Касательная к окружности перпендикулярна радиусу, проведённому в точку касания.",
        "Решение: Пусть AB – диаметр окружности. Касательные, проведённые к   окружности в точках A и B, перпендикулярны прямой AB.  Следовательно, они параллельны."
    ],
    "35717": [
        "Хорды и секущие (прочее)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Из произвольной точки круглого бильярдного стола пущен шар.   Докажите, что внутри стола найдётся такая окружность,   что траектория шара её ни разу не пересечёт.",
        "Подсказка: Почти всегда годится некоторая окружность с центром в центре бильярдного стола.",
        "Решение: Заметим, что при отражении от круглой стенки   угол падения шара (то есть угол между звеном и перпендикуляром   к касательной к окружности бильярда в точке падения шара)   равен углу отражения (то есть угол между следующим звеном   и тем же перпендикуляром). Заметим, что расстояние от центра   круга до звена ломаной из траектории не меняется.   Если это расстояние R>0, то годится любая окружность   с центром в центре бильярдного стола и радиусом r<R, например r=R/2.   Если R=0, то траекторией шара является один из диаметров стола,   всё остальное пространство свободно и там можно разместить   какую-нибудь окружность."
    ],
    "56656": [
        "Окружности (прочее)",
        "Сложность: 2",
        "Классы: 7",
        "Условие: Пусть"
    ],
    "56539": [
        "Вписанный угол (прочее)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Центр вписанной окружности треугольника"
    ],
    "77971": [
        "Касающиеся окружности",
        "Сложность: 2+",
        "Классы: 9",
        "Условие: Три окружности попарно касаются друг друга. Через три точки касания проводим окружность. Доказать, что эта окружность перпендикулярна к каждой из трёх исходных. (Углом между двумя окружностями в точке их пересечения называется угол, образованный их касательными в этой точке.)",
        "Решение: Пусть"
    ],
    "103965": [
        "Центральный угол. Длина дуги и длина окружности",
        "Сложность: 2+",
        "Классы: 6,7,8,9",
        "Условие: Монету в 1 копейку обкатывают вокруг такой же монеты.",
        "Решение: Объясним ответ на примере пункта б). Фиксируем верх и низ и будем считать, что в начале копейка находилась сверху относительно полдоллара. Обкатывать монету будем по часовой стрелке. Отметим на копейке точку, в которой  она касается полдоллара. Посмотрим, где эта точка окажется после четверти оборота меньшей монеты вокруг большей. Так как скольжения нет, точка касания  проезжает по копейке и по полдоллара одинаковое расстояние. Длина четверти  окружности большей монеты равна длине половине окружности меньшей, следовательно  точка касания монет после четверти оборота окажется диаметрально противоположна отмеченной точке. Значит, отмеченная точка окажется на копейке справа, а в начале она была снизу. Таким образом, за четверть оборота вокруг полдоллара  копейка повернулась на три четверти оборота вокруг себя. А за полный оборот  она сделает три оборота вокруг своей оси.",
        "Ответ: а) два оборота; б)три оборота."
    ],
    "53616": [
        "Две касательные, проведенные из одной точки",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: В треугольник ABC со сторонами AB = 5, BC = 7, CA = 10 вписана окружность. Прямая, пересекающая стороны AB и BC в точках M и K, касается этой окружности. Найдите периметр треугольника MBK.",
        "Решение: Аналогично задаче 52710 докажем, что искомый периметр в два раза больше отрезка между вершиной B и точкой касания вписанной окружности со стороной AB, то есть равен 5 + 7 – 10 (см. задачу 55404).",
        "Ответ: 2."
    ],
    "55686": [
        "Окружности (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что при параллельном переносе окружность переходит в окружность.",
        "Подсказка: При параллельном переносе сохраняются расстояния между точками.",
        "Решение: Пусть"
    ],
    "56655": [
        "Касающиеся окружности",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Две окружности радиусов",
        "Решение: См. решение задачи 52700.",
        "Ответ: 2."
    ],
    "115458": [
        "Углы, опирающиеся на равные дуги и равные хорды",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Диагонали трапеции",
        "Решение: Первый способ."
    ],
    "35413": [
        "Пересекающиеся окружности",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: На плоскости нарисовано пять различных окружностей. Известно, что каждые четыре из них имеют общую точку.   Докажите, что все пять окружностей проходят через одну точку.",
        "Подсказка: Рассмотрите три точки пересечения трёх четвёрок окружностей. Эти точки лежат на двух окружностях, то есть некоторые две из этих точек совпадают.",
        "Решение: Обозначим окружности цифрами 1, 2, 3, 4, 5. Пусть A – общая точка окружностей 1, 2, 3, 4; B – общая точка окружностей 1, 2, 3, 5; C – общая точка окружностей 1, 2, 4, 5. Как видно, каждая из точек A, B, C принадлежит окружностям 1 и 2. Поскольку две различные окружности пересекаются не более, чем по двум точкам, некоторые две из точек A, B, C совпадают. Через эту пару совпадающих точек и проходят все пять окружностей."
    ],
    "52599": [
        "Углы, опирающиеся на равные дуги и равные хорды",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Дана окружность с хордой и касательной, причём точка касания лежит на меньшей из двух дуг, стягиваемых хордой.   Найдите на касательной точку, из которой хорда видна под наибольшим углом.",
        "Подсказка: Докажите, что искомая точка – точка касания. Используйте свойство внешнего угла треугольника.",
        "Решение: Пусть M – точка касания, AB – хорда, X – произвольная точка касательной, отличная от M. Предположим, что отрезок AX пересекает дугу AMB в точке K. Тогда AKB – внешний угол треугольника AXB. Поэтому ∠AMB = ∠AKB > ∠AXB.",
        "Ответ: Точка касания."
    ],
    "52561": [
        "Центральный угол. Длина дуги и длина окружности",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Какова угловая величина дуги, если радиус, проведённый в её конец, составляет с её хордой угол в 40°?",
        "Подсказка: Угловая величина дуги равна угловой величине соответствующего центрального угла.",
        "Решение: Пусть O – центр окружности, AB – хорда. Угловая величина дуги равна угловой величине центрального угла AOB, то есть   180° – 2·40° = 100°.",
        "Ответ: 100°."
    ],
    "52737": [
        "Касающиеся окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Две равные касающиеся окружности с центрами O1 и O2 касаются внутренним образом окружности радиуса R с центром O.   Найдите периметр треугольника OO1O2.",
        "Подсказка: Линия центров двух касающихся окружностей проходит через их точку касания.",
        "Решение: Пусть r – радиус меньших окружностей. Тогда   OO1 = OO2 = R – r, O1O2 = 2r. Следовательно, искомый периметр равен 2(R – r) + 2r = 2R.",
        "Ответ: 2R."
    ],
    "52879": [
        "Диаметр, хорды и секущие",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: AB и CD – две параллельные хорды, расположенные по разные  стороны от центра O окружности радиуса 15. AB = 18, CD = 24.   Найдите расстояние между хордами.",
        "Решение: Через центр O окружности проведём диаметр, перпендикулярный данным хордам. Он пересекает хорды AB и CD в их серединах M и N. Заметим, что   15² = 12² + 9². Поэтому прямоугольные треугольники OMB и OND имеют катеты 12 и 9, а искомое расстояние MN = OM + ON = 12 + 9 = 21.",
        "Ответ: 21."
    ],
    "52880": [
        "Диаметр, хорды и секущие",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Две параллельные хорды AB и CD расположены по одну сторону от центра O окружности радиуса 30. AB = 48, CD = 36.   Найдите расстояние между хордами.",
        "Решение: См. задачу 52879.",
        "Ответ: 6."
    ],
    "52975": [
        "Теорема о длинах касательной и секущей; произведение всей секущей на ее внешнюю часть",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В квадрат ABCD со стороной a вписана окружность, которая касается стороны CD в точке E.   Найдите хорду, соединяющую точки, в которых окружность пересекается с прямой AE.",
        "Решение: Пусть PE – искомая хорда, M – точка касания окружности со стороной AD (см. рис.). Тогда AM = a/2, AE² = AD² + DE² = 5a²/4.     По теореме о касательной и секущей",
        "Ответ: ."
    ],
    "53289": [
        "Окружность, вписанная в угол",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Из точки A, находящейся вне окружности радиуса r, проведены  к этой окружности касательные AB и AC (B и C – точки касания), причём ∠BAC = α. Найдите площадь треугольника ABC.",
        "Решение: AB = AC = r ctg α/2. Следовательно, SABC = ½ AB·AC sin α = ½ r² ctg² α/2 sin α = r² cos² α/2 ctgα/2.",
        "Ответ: r² cos²  α/2 ctgα/2."
    ],
    "53663": [
        "Касающиеся окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В вершинах A, B, C и D четырёхугольника ABCD находятся   центры четырёх окружностей. Каждыые две окружности, центры которых расположены в соседних вершинах, касаются друг друга внешним образом. Известны три стороны четырёхугольника: AB = 2, BC = 3, CD = 5. Найдите сторону AD.",
        "Подсказка: Суммы противоположных сторон данного четырёхугольника равны между собой.",
        "Решение: Каждая сторона четырёхугольника ABCD равна сумме радиусов двух соседних окружностей, поэтому суммы противоположных сторон этого четырёхугольника равны, откуда AD = AB + CD – BC = 4.",
        "Ответ: 4."
    ],
    "53924": [
        "Диаметр, основные свойства",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Две хорды окружности взаимно перпендикулярны.   Докажите, что расстояние от точки их пересечения до центра окружности равно расстоянию между их серединами.",
        "Подсказка: Пусть O – центр окружности, AB и CD – данные хорды, M и N – их середины, K – точка пересечения хорд. Докажите равенство прямоугольных треугольников KOM и NMO.",
        "Решение: Пусть O – центр окружности, AB и CD – данные хорды, не являющиеся диаметрами, M и N – их середины, K – точка пересечения хорд."
    ],
    "53940": [
        "Вписанный угол, опирающийся на диаметр",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Окружность, построенная на катете прямоугольного треугольника как на диаметре, делит гипотенузу пополам. Найдите углы треугольника.",
        "Подсказка: Если медиана треугольника является его высотой, то треугольник равнобедренный.",
        "Решение: Пусть окружность, построенная как на диаметре на катете AC  прямоугольного треугольника ABC, пересекает гипотенузу AB в её  середине M. Тогда   ∠AMC = 90°. Значит, CM – высота и медиана треугольника ABC. Поэтому треугольник ABC равнобедренный. Следовательно, AC = BC, ∠A = ∠B = 45°.",
        "Ответ: 45°, 45°, 90°."
    ],
    "53962": [
        "Признаки и свойства касательной",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Расстояние от точки M до центра O окружности равно диаметру  этой окружности. Через точку M проведены две прямые, касающиеся окружности в точках A и B. Найдите углы треугольника AOB.",
        "Подсказка: В прямоугольном треугольнике OAM катет OA вдвое меньше  гипотенузы OM, поэтому ∠AMO = 30°.",
        "Решение: В прямоугольном треугольнике OAM катет OA вдвое меньше  гипотенузы OM, поэтому ∠AMO = 30°, а ∠AOM = 60°. Из равенства прямоугольных треугольников OAM и OBM следует, что ∠BOM = ∠AOM = 60°.     Значит, ∠AOB = ∠BOM + ∠AOM = 120°, а так как треугольник AOB – равнобедренный, то ∠BAO = ∠ABO = 30°.",
        "Ответ: 30°, 30°, 120°."
    ],
    "55705": [
        "Окружности (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что при центральной симметрии окружность переходит в окружность.",
        "Подсказка: Рассмотрите  образы  центра  и  произвольной  точки   данной окружности при симметрии относительно данной точки.",
        "Решение: Пусть при симметрии относительно  точки"
    ],
    "108430": [
        "Центральный угол. Длина дуги и длина окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В треугольнике ABC угол C – прямой. Из центра C   радиусом AC описана дуга, пересекающая гипотенузу в точке D, а катет CB – в точке E.   Найдите угловые величины  дуг AD и DE, если ∠B = 40°.",
        "Подсказка: Треугольник ACD – равнобедренный.",
        "Решение: ∠A = 90° – ∠B = 50°, ∠ACD = 180° – 2∠A = 80°, ∠DCB = 90° – ∠ACD = 10°.",
        "Ответ: 80°, 10°."
    ],
    "52386": [
        "Углы, опирающиеся на равные дуги и равные хорды",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Во вписанном четырёхугольнике ABCD, диагонали которого пересекаются в точке K, известно, что AB = a, BK = b, AK = c, CD = d. Найдите AC.",
        "Подсказка: Треугольник ABK подобен треугольнику DCK.",
        "Решение: Из подобия треугольников ABK и DCK (по двум углам) следует, что AB : CD = BK : CK. Поэтому   CK = CD·BK/AB = db/a.     Следовательно, AC = AK + KC = c + db/a = ac+bd/a.",
        "Ответ: ac+bd/a."
    ],
    "52598": [
        "Величина угла между двумя хордами и двумя секущими",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Окружность разделена точками A, B, C, D так, что &smile;AB : &smile; BC : &smile; CD : &smile; DA = 3 : 2 : 13 : 7. Хорды AD и BC продолжены до пересечения в точке M.  Найдите угол AMB.",
        "Решение: ∠AMB = ½ (&smile;DC – &smile;AB) =   ½·10/25·360° = 72°",
        "Ответ: 72°."
    ],
    "52433": [
        "Теорема о длинах касательной и секущей; произведение всей секущей на ее внешнюю часть",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Из внешней точки проведены к окружности секущая, длина которой равна 12, и касательная, равная 2/3 внутреннего отрезка секущей.   Найдите длину касательной.",
        "Подсказка: Если длина касательной равна 2x, то 4x² = 12(12 – 3x).",
        "Ответ: 6."
    ],
    "52533": [
        "Диаметр, хорды и секущие",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Дана окружность с центром O. На продолжении хорды AB за точку B отложен отрезок BC, равный радиусу. Через точки C и O проведена секущая CD (D – точка пересечения с окружностью, лежащая вне отрезка CO). Докажите, что ∠AOD = 3∠ACD.",
        "Подсказка: Треугольники OBC и AOB — равнобедренные, ABO – внешний угол треугольника OBC, AOD – внешний угол треугольника AOC.",
        "Решение: Пусть ∠ACD = α. Так как BC = OB, то BOC = α. Поэтому ∠ABO = 2α.     Из равнобедренного треугольника BOA находим, что   ∠BAO = ∠ABO = 2α.     Тогда ∠AOD = ∠CAO + ∠ACD = 3α, так как AOD – внешний угол треугольника OAC."
    ],
    "52712": [
        "Две касательные, проведенные из одной точки",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В треугольник со сторонами 6, 10 и 12 вписана окружность. К окружности проведена касательная, пересекающая две бóльшие стороны.   Найдите периметр отсечённого треугольника.",
        "Подсказка: Расстояние от вершины треугольника до ближайшей точки касания с вписанной окружностью равно разности полупериметра и противолежащей стороны.",
        "Решение: Пусть K – точка касания вписанной в треугольник ABC окружности со стороной AB (AB = 10, AC = 12, BC = 6). Если p – полупериметр треугольника, то  AK = p – BC = 14 – 6 = 8, а длина отрезка AK равна полупериметру отсечённого треугольника.",
        "Ответ: 16."
    ],
    "52717": [
        "Касающиеся окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Три окружности разных радиусов попарно касаются друг друга внешним образом. Отрезки, соединяющие их центры, образуют прямоугольный треугольник. Найдите радиус меньшей окружности, если радиусы большей и средней равны 6 и 4.",
        "Решение: Пусть x – радиус меньшей окружности. Стороны получившегося треугольника равны 10, 6 + x и 4 + x.     Поскольку 10 – наибольшая сторона, это гипотенуза. Значит, (x + 6)² + (x + 4)² = 100, откуда x = 2.",
        "Ответ: 2."
    ],
    "52719": [
        "Касающиеся окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Три окружности радиусов 6, 7 и 8 попарно касаются друг друга внешним образом. Найдите площадь треугольника с вершинами  в центрах этих окружностей.",
        "Решение: Линия центров двух касающихся окружностей проходит через их точку касания, поэтому стороны треугольника с вершинами в центрах окружностей равны 13, 14 и 15. Пусть",
        "Ответ: 84."
    ],
    "52735": [
        "Касающиеся окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Две окружности радиуса r касаются друг друга. Кроме того, каждая из них касается извне третьей окружности радиуса R в точках A и B соответственно.   Найдите радиус r, если AB = 12, R = 8.",
        "Решение: Пусть O1 и O2 – центры окружностей радиуса r, O – центр окружности радиуса R. Тогда треугольники OAB и OO1O2 подобны.  Поэтому OA : OO1 = AB : O1O2, или 8/8+r = 12/2r. Отсюда r = 24.",
        "Ответ: 24."
    ],
    "52736": [
        "Касающиеся окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Две окружности радиуса r касаются друг друга. Кроме того, каждая из них касается изнутри третьей окружности радиуса R в точках A и B соответственно. Найдите радиус R, если AB = 11, r = 5.",
        "Решение: Пусть O1 и O2 – центры окружностей радиуса r, O – центр окружности радиуса R. Тогда треугольники OAB и OO1O2 подобны.  Поэтому OA : OO1 = AB : O1O2, или R/R–5 = 11/10. Отсюда R = 55.",
        "Ответ: 55."
    ],
    "52758": [
        "Признаки и свойства касательной",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Окружность касается большего катета прямоугольного треугольника, проходит через вершину противолежащего острого угла и имеет центр на гипотенузе треугольника. Найдите радиус окружности, если катеты равны 5 и 12.",
        "Подсказка: Расстояние от вершины меньшего острого угла до центра окружности равно разности гипотенузы и радиуса окружности.",
        "Решение: Пусть центр O окружности лежит на гипотенузе AB, BC = 5, AC = 12. Тогда AB² = 5² + 12² = 13².     Пусть K – точка касания окружности с катетом AC, R – искомый радиус. Из подобия треугольников AKO и ACB получаем, что R : 5 = (13 – R) : 13, откуда  R = 65/18.",
        "Ответ: 65/18."
    ],
    "52770": [
        "Вписанный угол, опирающийся на диаметр",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В четырёхугольнике ABCD ∠DAB = ∠DBC = 90°. Кроме того, DB = a, DC = b.   Найдите расстояние между центрами двух окружностей, одна из которых проходит через точки D, A, B, а другая – через точки B, C, D.",
        "Подсказка: Центр описанной окружности прямоугольного треугольника совпадает с серединой гипотенузы.",
        "Решение: Центры описанных окружностей треугольников DAB и BCD – это середины M и N отрезков DB и DC. MN – средняя линия треугольника DBC. Следовательно, MN² = ½ BC² = ¼ (b² – a²).",
        "Ответ: ."
    ],
    "52794": [
        "Касающиеся окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В окружности радиуса R проведён диаметр и на нём взята точка A на расстоянии a от центра.   Найдите радиус окружности, которая касается этого диаметра в точке A и изнутри касается данной окружности.",
        "Решение: Пусть x – искомый радиус.     По теореме Пифагора (R – x)² = x² + a², откуда x = R²–a²/2R .",
        "Ответ: R²–a²/2R ."
    ],
    "53931": [
        "Вписанный угол, опирающийся на диаметр",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: На катете AC прямоугольного треугольника ABC как на диаметре  построена окружность, пересекающая гипотенузу AB в точке K.   Найдите CK, если AC = 2 и ∠A = 30°.",
        "Подсказка: ∠AKC = 90°.",
        "Ответ: 1."
    ],
    "52873": [
        "Касающиеся окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Две окружности касаются внешним образом. Прямая, проведённая через точку касания, образует в окружностях хорды, одна из которых равна 13/5 другой. Найдите радиусы окружностей, если расстояние между центрами равно 36.",
        "Подсказка: Соедините центры окружностей с соответствующими концами хорд и рассмотрите подобные треугольники.",
        "Решение: Пусть O1 и O2 – центры окружностей, K – точка касания окружностей, AK и KB – хорды, AK = 5/13 BK.     AO1K и BO2K – равнобедренные треугольники с равными углами при основаниях. Поэтому они подобны с коэффициентом подобия AK/KB = 5/13. Следовательно, KO1 = 5/18 O1O2 = 10, KO2 = 36 – 10 = 26.",
        "Ответ: 10 и 26."
    ],
    "52878": [
        "Пересекающиеся окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Радиусы двух пересекающихся окружностей равны 13 и 15, а общая хорда равна 24. Найдите расстояние между центрами.",
        "Решение: Пусть окружность радиуса 13 с центром  O1  и окружность радиуса 15 с центром O2 пересекаются в точках A и B. Точки O1 и O2 – равноудалены от концов отрезка AB, поэтому прямая O1O2 – серединный перпендикуляр к отрезку AB.   Пусть M – середина AB. По теореме Пифагора O1M² = 13² – 12² = 25,  O2M² = 15² – 12² = 81.    Если точки O1 и O2 лежат по разные стороны от прямой AB (рис. слева), то O1O2 = MO1 + MO2 = 5 + 9 = 14.    Если же точки O1 и O2 лежат по одну сторону от прямой AB (рис. справа), то O1O2 = MO2 – MO1 = 9 – 5 = 4.",
        "Ответ: 14 или 4."
    ],
    "52882": [
        "Диаметр, хорды и секущие",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Радиус окружности равен 25; две параллельные хорды равны 14 и 40. Найдите расстояние между ними.",
        "Решение: Квадраты расстояний от центра окружности до данных хорд равны 25² – 20² = 15², 25² – 7² = 24².     Если хорды расположены по разные стороны от центра (рис. слева), то  расстояние между ними равно 24 + 15 = 39, а если по одну (рис. справа), – то   24 – 15 = 9.",
        "Ответ: 39 или 9."
    ],
    "52886": [
        "Две касательные, проведенные из одной точки",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: К окружности радиуса 7 проведены две касательные из одной точки, удалённой от центра на расстояние, равное 25.   Найдите расстояние между точками касания.",
        "Решение: Пусть MA и MB – данные касательные, O – центр окружности, K – середина AB. Тогда MA² = OM² – OA² = 24².    Поскольку OM·AK = 2SOAM = AM·AO, то AB = 2AK = 2AM/OM·AO = 13,44.",
        "Ответ: 13,44."
    ],
    "52891": [
        "Диаметр, основные свойства",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Катеты AC и CB прямоугольного треугольника ABC равны 15 и 8 соответственно. Из центра C радиусом CB описана дуга, отсекающая от гипотенузы часть BD. Найдите BD.",
        "Решение: Опустим перпендикуляр CP на хорду BD. Тогда P – середина BD. Поскольку BC·AC = 2SABC = AB·CP, то CP = 120/17.  По теореме Пифагора  PB² = BC² – CP² = (8 – 120/17)(8 + 120/17) = (64/17)². Следовательно,   BD = 2PB = 128/17.",
        "Ответ: 128/17."
    ],
    "52897": [
        "Вписанный угол, опирающийся на диаметр",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Радиус окружности равен R. Найдите хорду, проведённую из конца данного диаметра через середину перпендикулярного к нему радиуса.",
        "Решение: Пусть AB – диаметр, OK – перпендикулярный ему радиус, AC – хорда, проходящая через середину M радиуса OK. Тогда AM² = R² + (R/2)² = 5/4 R².     Поскольку ∠ACB = 90°, то треугольники AOM и ACB подобны. Следовательно, AC : AB = AO : AM, откуда AC = .",
        "Ответ: ."
    ],
    "52898": [
        "Признаки и свойства касательной",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В прямоугольном треугольнике ABC AC = 16, BC = 12. Из центра B радиусом BC описана окружность и к ней проведена касательная, параллельная гипотенузе AB (касательная и треугольник лежат по разные стороны от гипотенузы). Катет BC продолжен до пересечения с проведённой касательной. Определите, на сколько продолжен катет.",
        "Подсказка: Рассмотрите подобные треугольники.",
        "Решение: Пусть M – точка касания, K – точка пересечения касательной с продолжением катета CB. AB² = CB² + CA² = 144 + 256 = 400.     Треугольники BMK и ACB подобны, поэтому BK : BM = AB : AC. Следовательно, BK = 20·16 : 12 = 15.",
        "Ответ: 15."
    ],
    "52929": [
        "Две касательные, проведенные из одной точки",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Площадь ромба ABCD равна 2. В треугольник ABD вписана  окружность, которая касается стороны AB в точке K. Через точку K проведена прямая KL, параллельная диагонали AC ромба (точка L лежит на стороне BC). Найдите угол BAD, если известно, что площадь треугольника KLB равна a.",
        "Решение: Треугольник KBL подобен треугольнику ABC. Коэффициент  подобия равен       Поэтому, если Q – точка пересечения диагоналей ромба, то       Следовательно, ∠BAC = arcsin, ∠BAD = 2 arcsin.",
        "Ответ: 2 arcsin."
    ]
}