{
    "30818": [
        "Теория графов (прочее)",
        "Сложность: 4+",
        "Классы: 8,9",
        "Условие: Каждое из рёбер полного графа с 18 вершинами покрашено в один из двух цветов.   Докажите, что есть четыре вершины, все рёбра между которыми – одного цвета.",
        "Решение: Из произвольной вершины выходит по крайней мере 9 рёбер одного цвета (пусть красного). Рассмотрим полный граф на 9 вершинах, в которые ведут эти рёбра, и применим к нему результат задачи 30817."
    ],
    "58168": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 4+",
        "Классы: 8,9,10",
        "Условие: На рис. изображен шестиугольник, разбитый на чёрные и белые треугольники так, что каждые два треугольника имеют либо общую сторону (и тогда они окрашены вразные цвета), либо общую вершину, либо не имеют общих точек, а каждая сторона шестиугольника является стороной одного из черных треугольников.   Докажите, что десятиугольник разбить таким образом нельзя.",
        "Решение: Предположим, что мы разбили десятиугольник требуемым образом. Пусть n – число сторон чёрных треугольников, m – число сторон белых треугольников. Так как каждая сторона чёрного треугольника (кроме сторон многоугольника) является также и стороной белого треугольника, то  n – m = 10. С другой стороны, оба числа n и m делятся на 3. Противоречие."
    ],
    "97913": [
        "Шахматные доски и шахматные фигуры",
        "Сложность: 5",
        "Классы: 7,8,9",
        "Условие: Каждая клетка шахматной доски закрашена в один из цветов – синий или красный. Докажите, что клетки одного из цветов обладают тем свойством, что их может обойти шахматный ферзь (на клетках этого цвета ферзь может побывать не один раз, на клетки другого цвета он не ставится, но может через них перепрыгивать).",
        "Решение: Если на доске найдётся одноцветная строка или столбец, то утверждение  очевидно. Иначе будем действовать следующим образом: обойдём все красные клетки первой горизонтали, перейдём на вторую, там тоже обойдём все красные клетки и т.д. Пусть мы не смогли перейти с i-й горизонтали на (i+1)-ю. Тогда начнём обходить все синие клетки последовательно, начиная с первой вертикали. Пусть мы не смогли перейти с j-й вертикали на (j+1)-ю. Пусть (i, j) – красная клетка, тогда (i + 1, j) и (i + 1, j + 1) – синие. Но тогда можно перейти с синей клетки (i + 1, j) на j-й вертикали на синюю клетку   (i + 1, j + 1) на (j+1)-й вертикали. Противоречие.     Аналогично приходим к противоречию и в случае, когда клетка (i, j) – синяя."
    ],
    "34930": [
        "Индукция в геометрии",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Несколько прямых делят плоскость на части. Докажите, что эти части можно раскрасить в 2 цвета так, что граничащие части будут иметь разный цвет.",
        "Подсказка: Рассуждайте, используя индукцию по количеству прямых.",
        "Решение: Будем использовать индукцию по количеству прямых n. При n = 1 утверждение задачи очевидно: достаточно покрасить две полуплоскости, на которые одна прямая делит плоскость, в разные цвета. Пусть утверждение задачи верно для k прямых. Рассмотрим некоторые k + 1 прямых. Забывая пока про (k+1)-ю прямую, раскрасим области, на которые делят плоскость остальные k прямых, в два цвета так, что граничащие части будут иметь разный цвет (это можно сделать по предположению индукции). При такой раскраске области, граничащие по (k+1)-й прямой, будут иметь одинаковый цвет. Далее перекрасим все области, расположенные по одну из сторон относительно (k+1)-й прямой, в противоположный цвет. Полученная в результате раскраска удовлетворяет условию задачи."
    ],
    "88302": [
        "Комбинаторная геометрия (прочее)",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Плоскость раскрашена в два цвета. Докажите, что найдутся две точки одного цвета на расстоянии 2004 м.",
        "Решение: Берем точку определенного цвета, например, красного цвета. Начертим окружность радиуса 2004 с центром в выбранной точке. Если на окружности есть хотя бы одна красная точка, то вместе с центром она и даст нужную пару. Если на окружности нет красных точек, то все точки окружности одного цвета (например, синего). Берем любую точку окружности и, радиусом 2004 делая засечку на этой же окружности, получим вторую точку."
    ],
    "21979": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: а) Какое наибольшее число полей на доске 8×8 можно закрасить в чёрный цвет так, чтобы в каждом уголке из трёх полей было по крайней мере одно незакрашенное поле?",
        "Решение: а) Пример. 32 поля закрасить можно (например, в полоску).     Оценка. Разобъём доску на 16 квадратиков 2×2. В каждом из них можно закрасить не более двух полей (иначе получится чёрный уголок). Поэтому всего можно закрасить не более 32 полей.     б) Задача сводится к а) заменой чёрных полей на незакрашенные и наоборот.",
        "Ответ: а)-б) 32 поля."
    ],
    "30815": [
        "Теория графов (прочее)",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Каждое из рёбер полного графа с 6 вершинами покрашено в один из двух цветов.  Докажите, что есть три вершины, все рёбра между которыми – одного цвета.",
        "Решение: См. задачу 21995."
    ],
    "58080": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Узлы бесконечной клетчатой бумаги раскрашены вдва цвета. Докажите, что существуют две горизонтальные идве вертикальные прямые, на пересечении которых лежат точки одного цвета.",
        "Решение: Возьмем три вертикальные прямые идевять горизонтальных. Будем рассматривать только точки пересечения этих прямых. Так как имеется лишь 2"
    ],
    "35409": [
        "Индукция в геометрии",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Вершины выпуклого многоугольника раскрашены в три цвета так, что каждый цвет присутствует и никакие две соседние вершины не окрашены в один цвет. Докажите, что многоугольник можно разбить диагоналями на треугольники так, чтобы у каждого треугольника вершины были трёх разных цветов.",
        "Подсказка: Используйте индукцию по числу вершин многоугольника.",
        "Решение: Обозначим цвета цифрами 1, 2, 3. Доказательство проведём индукцией по числу n вершин многоугольника. База (n = 3) тривиальна.      Шаг индукции. Пусть n > 3. Выберем две вершины A и B одного цвета, пусть это цвет 1. Точки A и B делят контур многоугольника на две ломаные. На каждой из этих ломаных есть вершина цвета, отличного от 1. Заметим, что можно найти такие две точки C и D цветов 2 и 3, что C и D лежат на разных ломаных. Действительно, это легко сделать, если на каждой из двух ломаных присутствуют вершины как цвета 2, так и цвета 3. Если же на одной ломаной нет вершин, скажем, цвета 2, то на этой ломаной все вершины цвета 3, и значит, на другой ломаной найдётся вершина цвета 2. Разобьём наш n-угольник на два многоугольника M1, M2 диагональю CD. Каждый из этих многоугольников удовлетворяет условию задачи. По предположению индукции каждый из них разбить на треугольники, у которых вершины окрашены в разные цвета. Это и даст разбиение исходного многоугольника."
    ],
    "79335": [
        "Доказательство от противного",
        "Сложность: 3+",
        "Классы: 6,7,8,9",
        "Условие: Каждая точка числовой оси, координата которой – целое число, покрашена либо в красный, либо в синий цвет. Доказать, что найдётся цвет со следующим  свойством: для каждого натурального числа k имеется бесконечно много точек  этого цвета, координаты которых делятся на k.",
        "Решение: Пусть A и B – множества соответственно синих и красных точек. Предположим утверждение задачи неверно. Тогда найдется такое натуральное число a, что A содержит лишь конечное число точек с координатами, кратными a. Также найдётся такое натуральное число b, что B содержит лишь конечное число точек с координатами, кратными b. Но тогда A ∪ B содержит лишь конечное число точек, с координатами, кратными ab. Противоречие, так как число таких точек бесконечно."
    ],
    "78699": [
        "Раскраски",
        "Сложность: 3",
        "Классы: 10",
        "Условие: Остров",
        "Решение: Будем называть такое разбиение острова на треугольники триангуляцией. Докажем требуемое утверждение индукцией по числу треугольников триангуляции. Для одного треугольника требуемая раскраска существует. Предположим теперь, что можно раскрасить требуемым образом любую триангуляцию, состоящую менее чем из"
    ],
    "102844": [
        "Таблицы и турниры (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Клетки квадратной таблицы 15×15 раскрашены в красный, синий и зелёный цвета.   Докажите, что найдутся, по крайней мере, две строки, в которых клеток хотя бы одного цвета поровну.",
        "Решение: Допустим противное. Тогда в каждых двух строках разное количество клеток красного цвета, и всего их в таблице не менее   0 + 1 + 2 + ... + 13 + 14  = 105. То же верно для синих и зелёных клеток. Тогда всего в таблице должно быть не менее 3·105 = 315 клеток, в то время как всего их 15² = 225. Противоречие."
    ],
    "108403": [
        "Ориентированные графы",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Выбежав после уроков на двор, каждый школьник кинул снежком ровно в одного другого школьника.   Докажите, что всех учащихся можно разбить на три команды так, что члены одной команды друг в друга снежками не кидали.",
        "Решение: Рассмотрим соответствующий граф: школьников-вершины соединим стрелочкой, если один кидал во второго. Этот граф распадается на несколько циклов с рожками (путями, ведущими от точки в цикл). Каждую такую фигуру легко разбить на три группы: разрывая цикл, одного школьника относим в первую группу, а получившиеся деревья разбиваем на чётные и нечётные вершины."
    ],
    "58201": [
        "Вспомогательная раскраска (прочее)",
        "Сложность: 4+",
        "Классы: 7,8,9",
        "Условие: Несколько кругов одного радиуса положили на  стол так, что никакие два не перекрываются. Докажите, что  круги можно раскрасить вчетыре цвета так, что любые  два касающихся круга будут разного цвета.",
        "Решение: Доказательство проведем индукцией по числу кругов"
    ],
    "58092": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 6",
        "Классы: 8,9",
        "Условие: Узлы бесконечной клетчатой бумаги раскрашены втри цвета. Докажите, что существует равнобедренный прямоугольный треугольник свершинами одного цвета.",
        "Решение: Предположим, что нет равнобедренного прямоугольного  треугольника скатетами, параллельными сторонами клеток,  ивершинами одного цвета. Для удобства можно считать, что раскрашены  не узлы, аклетки. Разобьем лист на квадраты со стороной4;  тогда на диагонали каждого такого квадрата найдутся две клетки  одного цвета. Пусть число"
    ],
    "60874": [
        "Теория графов (прочее)",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Дано N точек, никакие три из которых не лежат на одной прямой. Каждые две из этих точек соединены отрезком, и каждый отрезок окрашен в один из k цветов. Докажите, что если N > [k!e], то среди данных точек можно выбрать такие три, что все стороны образованного ими треугольника будут окрашены в один цвет.",
        "Решение: Индукция по k. База  (k = 1)  очевидна.     Шаг индукции. Как видно из задачи 60873 б),    Рассмотрим произвольную из N данных точек. Из неё выходит не менее    отрезков, окрашенных в один и тот же цвет. Если концы каких-либо двух из этих отрезков соединены отрезком того же цвета, то нужный треугольник найден. В противном случае, концы соединяются отрезками, окрашенными в  k – 1 цвет. Согласно предположению индукции можно найти треугольник одного цвета с вершинами в этих точках."
    ],
    "79426": [
        "Раскраски",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Белая плоскость произвольным образом забрызгана чёрной тушью. Доказать, что для любого положительного",
        "Решение: Рассмотрим произвольный правильный треугольник со стороной"
    ],
    "32099": [
        "Раскраски",
        "Сложность: 3+",
        "Классы: 7,8,9,10",
        "Условие: На плоскости нарисовано некоторое количество равносторонних треугольников. Они не пересекаются, но могут иметь общие участки сторон. Мы хотим покрасить каждый треугольник в какой-нибудь цвет так, чтобы те из них, которые соприкасаются, были покрашены в разные цвета (треугольники, имеющие одну общую точку, могут быть покрашены в один цвет). Хватит ли для такой раскраски двух цветов?",
        "Решение: Будем называть два треугольника параллельными, если какая-то сторона одного из них параллельна какой-то стороне другого. Ясно, что тогда и каждая сторона одного из них параллельна некоторой стороне другого. Поэтому параллельность на множестве равносторонних треугольников на плоскости является отношением эквивалентности.",
        "Ответ: Хватит."
    ],
    "32860": [
        "Раскраски",
        "Сложность: 3+",
        "Классы: 7",
        "Условие: а) Каждые две из шести ЭВМ соединены своим проводом. Укажите, как раскрасить каждый из этих проводов в один из пяти цветов так, чтобы из каждой ЭВМ выходило  пять проводов разного цвета.  б) Каждые две из девяти ЭВМ соединены своим проводом. Можно ли раскрасить каждый из этих проводов в один из восьми цветов так, чтобы из каждой ЭВМ выходило восемь  проводов разного цвета?",
        "Решение: а) См. задачу 79450.",
        "Ответ: б) Нельзя."
    ],
    "97980": [
        "Раскраски",
        "Сложность: 2+",
        "Классы: 7,8,9,10",
        "Условие: Каждую грань кубика разбили на четыре равных квадрата и раскрасили эти  квадраты в три цвета так, чтобы квадраты, имеющие общую сторону, были покрашены  в разные цвета. Докажите, что в каждый цвет покрашено по 8 квадратиков.",
        "Решение: Три квадрата, сходящиеся в вершине куба, окрашены разными красками.  Следовательно, каждый цвет использован 8 раз."
    ],
    "64598": [
        "Раскраски",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Клетки доски 10·10 раскрашены в красный, синий и белый цвета. Каждые две клетки с общей стороной раскрашены в разные цвета. Известно, что красных клеток 20.",
        "Решение: а) Разрежем доску на 50 прямоугольников 1×2. Ровно 20 из них содержат красные клетки, а остальные 30 – бело-синие."
    ],
    "79456": [
        "Раскраски",
        "Сложность: 3+",
        "Классы: 10",
        "Условие: Каждые две из 13 ЭВМ соединены своим проводом.   Можно ли раскрасить каждый из этих проводов в один из 12 цветов так, чтобы из каждой ЭВМ выходило 12 проводов разного цвета?",
        "Решение: См. задачу 65000 б).",
        "Ответ: Нельзя."
    ],
    "105195": [
        "Раскраски",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Плоскость раскрашена в два цвета, причем каждый цвет использован.",
        "Решение: а) Рассмотрим три точки в вершинах любого правильного треугольника со стороной 2006 м. По принципу Дирихле, какие-то две из них обязательно раскрашены в один цвет."
    ],
    "107791": [
        "Раскраски",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Можно ли рёбра n-угольной призмы раскрасить в три цвета так, чтобы на каждой грани были все три цвета и в каждой вершине сходились рёбра разных цветов, если  а) n = 1995;  б) n = 1996.",
        "Решение: См. задачу 98265.",
        "Ответ: а) Можно; б) нельзя."
    ],
    "34953": [
        "Раскраски",
        "Сложность: 3+",
        "Классы: 7,8,9,10",
        "Условие: Каждая точка пространства окрашена в один из пяти цветов, причем  каждым из этих пяти цветов окрашена хотя бы одна точка.  Докажите, что найдется плоскость, все точки которой окрашены не  менее, чем в 4 цвета.",
        "Подсказка: Если некоторая прямая окрашена в 3 цвета, то задача решается  просто.",
        "Решение: Если некоторая прямая окрашена в 3 или более цветов,  то проведем плоскость  через эту прямую и точку одного из недостающих цветов.  Эта плоскость будет окрашена  не менее, чем в 4 цвета.  Далее, предположим, что каждая прямая окрашена не более, чем в 2  цвета.  Фиксируем по одной точке каждого из пяти цветов.  Пусть никакие четыре из этих пяти точек не лежат в одной плоскости  (в противном случае решение очевидно).  Рассмотрим прямые, попарно соединяющие эти точки.  Они пересекают некоторую плоскость П, им не параллельную, в 10  различных точках. Покажем, что эти 10 точек окрашены не менее, чем  в 4 цвета. В противном случае некоторые 2 цвета (a и b) отсутствуют.  Но одним из этих цветов должна быть окрашена точка пересечения   прямой, соединяющей точки  цветов a и b, с плоскостью П   (вся эта прямая окрашена два цвета a и b)."
    ],
    "65619": [
        "Раскраски",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Какое наименьшее количество цветов необходимо, чтобы покрасить все вершины, стороны и диагонали выпуклого n-угольника, если должны выполняться два условия:    1) каждые два отрезка, выходящие из одной вершины должны быть разного цвета;     2) цвет любой вершины должен отличаться от цвета любого отрезка, выходящего из неё?",
        "Решение: Так как из каждой вершины выходит n – 1 отрезок и они все должны быть покрашены различными цветами, отличными от цвета этой вершины, то количество цветов должно быть не меньше чем n.     Докажем, что n цветов достаточно. Обозначим вершины через V0, V1, ..., Vn–1, цвета – числами 0, 1, ..., n – 1. Произведём раскраску следующим образом: отрезок ViVj    окрашивается цветом с номером i + j (mod n), а вершина Vi – цветом с номером 2i (mod n).     Несложно проверить, что такая окраска удовлетворяет условиям задачи.",
        "Ответ: n цветов."
    ],
    "65956": [
        "Раскраски",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Некоторые клетки белого прямоугольника размером 3×7 произвольным образом покрасили в чёрный цвет. Докажите, что обязательно найдутся четыре клетки одного цвета, центры которых являются вершинами некоторого прямоугольника со сторонами, параллельными сторонам исходного прямоугольника.",
        "Решение: Рассмотрим первые две строки. Если в образованном ими прямоугольнике два столбца белые (чёрные), то нужный прямоугольник найден.     В противном случае по крайней мере в пяти столбцах расположены клетки разного цвета. Тогда, не менее чем в трёх столбцах чёрная и белая клетки будут располагаться в одинаковом порядке, например, сверху – чёрная, снизу – белая.     Рассмотрим три эти столбца и третью строку. В третьей строке в рассмотренных столбцах есть хотя бы две клетки одного цвета. Если они чёрные, то искомый прямоугольник образуют их центры и центры чёрных клеток первой строки, а если они белые, то искомый прямоугольник образуют их центры вместе с центрами белых клеток второй строки."
    ],
    "66084": [
        "Раскраски",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Все натуральные числа, бóльшие единицы, раскрасили в два цвета – синий и красный – так, что сумма каждых двух синих (в том числе одинаковых) – синяя, а произведение каждых двух красных (в том числе одинаковых) – красное. Известно, что при раскрашивании были использованы оба цвета и что число 1024 покрасили в синий цвет. Какого цвета при этом могло оказаться число 2017?",
        "Решение: Заметим, что если число bn синего цвета, то число b тоже синее. Так как 1024 = 210, то число 2 синее. Отсюда следует, что все чётные числа синие, а также то, что если число a > 4 – красное, то a – 2 – тоже красное.     Рассмотрим произвольное красное число k. Тогда и любая степень k тоже красная. Так как k > 2, то существует степень k, которая превосходит 2017. Вычитая нужное количество двоек получим, что 2017 – красное число.",
        "Ответ: Красного."
    ],
    "64191": [
        "Раскраски",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Наострове все страны треугольной формы (границы прямые). Если две страны граничат, топоцелой стороне. Докажите, что страны можно раскрасить в3цвета так, что соседние постороне страны будут покрашены вразные цвета.",
        "Решение: Предположим, что некоторые острова, удовлетворяющие условию задачи, невозможно  покрасить втри цвета так, чтобы каждая страна была покрашена всвой  цвет, асоседние страны были покрашены вразные цвета. Выберем  изних остров, накотором число стран самое маленькое. Рассмотрим  какую–нибудь прибрежную страну (тоесть какую–нибудь страну,  одной изсторон выходящую наберег).  Всилу выбора, весь  остальной остров можно покрасить втри цвета.  Норассматриваемая  страна граничит только сдвумя странами, азначит, для неё запрещены  только два цвета. Поэтому её тоже можно покрасить. Получили противоречие.  Следовательно, карту любого острова, удовлетворяющего условию задачи, можно  раскрасить втри цвета так, чтобы выполнялись требования задачи."
    ],
    "58198": [
        "Раскраски",
        "Сложность: 4+",
        "Классы: 8,9",
        "Условие: Точки сторон правильного треугольника раскрашены в два цвета. Докажите, что найдётся прямоугольный треугольник с вершинами одного цвета.",
        "Решение: Предположим, что нет прямоугольного треугольника с вершинами одного  цвета. Разделим каждую сторону правильного треугольника двумя точками на три равные части. Эти точки образуют правильный шестиугольник. Если две его  противоположные вершины одного цвета, то все остальные вершины будут второго  цвета, а значит, есть прямоугольный треугольник с вершинами второго цвета. Следовательно, противоположные вершины шестиугольника разноцветные. Поэтому найдутся две соседние разноцветные вершины; противоположные им вершины тоже разноцветные. Одна из этих пар разноцветных вершин лежит на стороне исходного треугольника. Вершина A этой стороны не может быть ни первого, ни второго цвета. Противоречие."
    ],
    "35039": [
        "Раскраски",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Деревянный куб покрасили снаружи белой краской, каждое его ребро  разделили на 5 равных частей, после чего куб распилили так, что  получились  маленькие кубики, у которых ребро в 5 раз меньше, чем у исходного  куба.  Сколько получилось маленьких кубиков, у которых окрашена  хотя бы одна грань?",
        "Подсказка: Легче подсчитать число кубиков, у которых не окрашено ни одной   грани.",
        "Решение: Количество маленьких кубиков, полученных после распиливания   большого куба, равно 5",
        "Ответ: 98.00"
    ],
    "88217": [
        "Разложение в произведение транспозиций и циклов",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: В городе Васюки у всех семей были отдельные дома. В один прекрасный день каждая семья переехала в дом, который раньше занимала другая семья. В связи с этим было решено покрасить все дома в красный, синий или зелёный цвет, причём так, чтобы для каждой семьи цвет нового и старого домов не совпадал. Можно ли это сделать?",
        "Решение: Все семьи города можно разбить на замкнутые цепочки, в которых после каждой семьи будет стоять та, в дом которой семья переехала (может быть, будет всего одна  цепочка). В цепочках из чётного числа семей, будем красить дома попеременно в синий и зелёный цвета – тогда каждая семья переедет из синего дома в зелёный или наоборот. А в тех цепочках, где число семей нечётно, покрасим один дом в красный цвет, а оставшееся чётное число домов – попеременно в синий и зелёный. Тогда все дома будут окрашены с выполнением требований задачи.",
        "Ответ: Можно."
    ],
    "30946": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Доска 9×9 раскрашена в девять цветов, причём раскраска симметрична относительно главной диагонали.   Доказать, что на этой диагонали все клетки раскрашены в разные цвета."
    ],
    "32068": [
        "Принцип Дирихле (площадь и объем)",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Квадратная площадь размером 100×100 выложена квадратными плитами 1×1 четырёх цветов: белого, красного, чёрного и серого – так, что никакие две плиты одинакового цвета не соприкасаются друг с другом (то есть не имеют общей стороны или вершины). Сколько может быть красных плит?",
        "Решение: Разобьём площадь на 2500 квадратиков 2×2, каждый из которых состоит из четырёх плит с общей вершиной. Значит, каждый из этих квадратиков может содержать не более одной красной плиты, и, тем самым, количество красных плит не может превышать 2500. То же верно и для плит других цветов, значит, плит каждого цвета ровно по 2500.",
        "Ответ: 2500 плит."
    ],
    "64667": [
        "Таблицы и турниры (прочее)",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Дана таблица размером 8×8, изображающая шахматную доску. За каждый шаг разрешается поменять местами любые два столбца или любые две строки. Можно ли за несколько шагов сделать так, чтобы верхняя половина таблицы стала белой, а нижняя половина – чёрной?",
        "Решение: Обе разрешённые операции не изменяют количество чёрных и белых клеток в любой строке, следовательно, требуемую раскраску таблицы получить не удастся.",
        "Ответ: Нельзя."
    ],
    "35151": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 9,10,11",
        "Условие: Каждая точка плоскости, имеющая целочисленные координаты,   раскрашена в один из n цветов.   Докажите, что найдется прямоугольник с вершинами в точках   одного цвета.",
        "Подсказка: Рассмотрим целые точки, расположенные в бесконечной   горизонтальной полосе. В этой полосе найдутся два одинаково    окрашенных вертикальных ряда точек.",
        "Решение: Рассмотрим полосу из n+1 подряд идущих горизонтальных рядов точек.    Рассмотрим вертикальные ряды этой полосы, состоящие из n+1 точек.     Существует лишь конечное число способов    раскрасить в n цветов n+1 точек (первую точку можно раскрасить    n способами, независимо от этого вторую точку также можно     окрасить n способами, и т.д., всего имеется    n"
    ],
    "76432": [
        "Комбинаторика орбит",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: а) Выбраны 6 различных цветов; требуется раскрасить 6 граней куба, каждую в особый цвет из числа избранных. Сколькими геометрически различными способами можно это сделать? Геометрически различными называются две такие расцветки, которые нельзя совместить одну с другой при помощи вращений куба вокруг его центра.    б) Решить ту же задачу для случая раскраски граней додекаэдра в 12 различных цветов.",
        "Решение: а) Первый способ. Предположим, что процедура окраски куба происходит следующим образом: непокрашенный куб устанавливают в станок в некоторое фиксированное положение, а затем последовательно красятся его грани в определённом порядке. Таких способов столько же, сколько перестановок 6 цветов, то есть 6!. Но установить куб в фиксированное положение можно 24 различными способами: куб можно поставить на любую из 6 граней и затем повернуть вокруг вертикальной оси любым из четырёх способов. Поэтому геометрически различных раскрасок в 24 раза меньше, то есть 6! : 24 = 30.    Второй способ. Куб всегда можно повернуть гранью нужного (скажем, белого) цвета вниз, поэтому можно считать, что всегда в белый цвет красится именно нижняя грань. После этого у нас есть 5 способов выбрать цвет для противоположной грани. Из оставшихся четырёх цветов зафиксируем один и окрасим в него переднюю грань (другие варианты раскраски можно не рассматривать, поскольку всегда можно повернуть куб вокруг вертикальной оси в такое положение). Остаётся 3! вариантов для окраски трёх оставшихся граней. Всего получаем 5·3! = 30 способов.",
        "Ответ: а) 30; б) 12!:60 = 11!:5 раскрасок."
    ],
    "35238": [
        "Раскраски",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Плоскость раскрашена в два цвета. Докажите, что найдутся две точки одного цвета, расстояние между которыми равно 1.",
        "Подсказка: Рассмотрите равносторонний треугольник со стороной   1.",
        "Решение: Рассмотрим равносторонний треугольник со стороной 1.   Некоторые две из этих трех его вершин имеют одинаковый цвет    (согласно принципу Дирихле)."
    ],
    "79554": [
        "Признаки перпендикулярности",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: В пространстве имеются четыре различные прямые, окрашенные в два цвета: две красные и две синие, причём любая красная прямая перпендикулярна любой синей прямой. Докажите, что либо красные, либо синие прямые параллельны.",
        "Решение: Фиксируем в пространстве точку"
    ],
    "97990": [
        "Связность и разложение на связные компоненты",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Тетрадный лист раскрасили в 23 цвета по клеткам. Пара цветов называется  хорошей, если существует две соседние клетки, закрашенные этими цветами. Каково минимальное число хороших пар?",
        "Решение: Оценка. Нарисуем граф с 23 вершинами (цветами) и соединим рёбрами вершины, соответствующие хорошим парам.    Рассмотрим две произвольные вершины A и B. Возьмём некоторую клетку K, окрашенную в цвет A, и некоторую клетку L, окрашенную в цвет B. Построим цепочку клеток, соединяющих K с L. Каждым двум разноцветным соседним клеткам этой цепочки соответствует хорошая пара цветов, то есть ребро нашего графа. Тем самым мы построили путь от A к B.     Это значит, что наш граф связен, следовательно, в нём не менее 22 рёбер.     Пример раскраски в 23 цвета с 22 хорошими парами цветов: покрасим 22 несоседние клетки в 22 цвета, а оставшийся лист – в 23-й цвет.",
        "Ответ: 22 пары."
    ],
    "109454": [
        "Инварианты",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: В выпуклом пятиугольнике проведены все диагонали. Каждая вершина и каждая точка пересечения диагоналей окрашены в синий цвет. Вася хочет перекрасить эти синие точки в красный цвет. За одну операцию ему разрешается поменять цвет всех окрашенных точек, принадлежащих либо одной из сторон либо одной из диагоналей на противоположный (синие точки становятся красными, а красные – синими).   Сможет ли он добиться желаемого, выполнив какое-то количество описанных операций?",
        "Решение: Рассмотрим внутренний пятиугольник, образованный точками пересечений диагоналей исходного пятиугольника (cм. рис.).",
        "Ответ: Не сможет."
    ],
    "58307": [
        "Индукция в геометрии",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что если плоскость разбита на части прямыми иокружностями, то получившуюся карту можно раскрасить вдва цвета так, что части, граничащие по дуге или отрезку, будут разного цвета.",
        "Решение: Доказательство проведем индукцией по общему числу прямых иокружностей. Для одной прямой или окружности утверждение очевидно. Предположим теперь, что можно раскрасить требуемым образом любую карту, заданную"
    ],
    "78256": [
        "Индукция в геометрии",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Стороны произвольного выпуклого многоугольника покрашены снаружи. Проводится несколько диагоналей многоугольника, так, что никакие три не пересекаются в одной точке. Каждая из этих диагоналей тоже покрашена с одной стороны, т.е. с одной стороны отрезка проведена узкая цветная полоска. Доказать, что хотя бы один из многоугольников, на которые разбит диагоналями исходный многоугольник, весь покрашен снаружи.",
        "Решение: Нам дан многоугольник, в котором проведены какие-то диагонали. Сотрём их и  будем проводить снова, но уже по одной, по очереди.    Первая диагональ разделила многоугольник на два; каждый из них покрашен  снаружи всюду, кроме диагонали. Но так как диагональ покрашена с одной  стороны, ясно, что один из двух многоугольников целиком покрашен снаружи.    Проведём вторую диагональ. Если она проходит так, что не пересекает  выбранного нами многоугольника, то ничего не меняется— выбранный  многоугольник остается окрашенным снаружи, если же диагональ пересекает  многоугольник, то она снова разбивает его на две части, одна из которых, как  и раньше, окрашена снаружи.    И каждый раз, проводя новую диагональ, мы либо просто сохраняем уже имеющийся  многоугольник (окрашенный снаружи), либо получаем новый— и так пока не  проведём все диагонали."
    ],
    "105194": [
        "Раскраски",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Прямая раскрашена в два цвета. Докажите, что найдётся отрезок, оба конца и середина которого покрашены в один и тот же цвет.",
        "Ответ: Для удобства введем на прямой координаты. Пусть точки -1 и 1 покрашены в один цвет. Тогда 3 и -3  другого цвета (иначе искомый отрезок - соответственно, [-3; 1] или [-1; 3]). Тогда, в зависимости от цвета 0, либо отрезок [-1,1], либо [-3,3] удовлетворяет условию."
    ],
    "64953": [
        "Замощения костями домино и плитками",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Из шахматной доски размером 8×8 вырезали квадрат размером 2×2 так, что оставшуюся доску удалось разрезать на прямоугольники размером 1×3. Определите, какой квадрат могли вырезать.",
        "Решение: Раскрасим шахматную доску в три цвета по диагоналям, начиная с левого нижнего угла доски (рис. а). Тогда при разрезании части доски на прямоугольники 1×3 в каждом прямоугольнике окажутся клетки всех трёх цветов. Следовательно, после вырезания квадрата клеток каждого из цветов на доске должно остаться поровну. До вырезания на доске 21 клетка цвета 1, 22 клетки цвета 2 и 21 клетка цвета 3. Значит, вырезали квадрат, в котором две клетки цвета 2 и по клетке цвета 1 и 3.",
        "Ответ: Любой из девяти квадратов, закрашенных на рисунке."
    ],
    "65993": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: В правильном 21-угольнике шесть вершин покрашены в красный цвет, а семь вершин – в синий.   Обязательно ли найдутся два равных треугольника, один из которых с красными вершинами, а другой – с синими?",
        "Решение: Рассмотрим повороты вокруг центра данного многоугольника на все углы вида 2πk/21, где k = 1, 2, ..., 20, по часовой стрелке. Тогда каждая синяя точка попадёт по одному разу в каждую из остальных вершин 21-угольника. Следовательно, каждая синяя точка по одному разу совпадёт с каждой красной точкой, то есть всего таких совпадений будет 6·7 = 42. Так как все такие совпадения приходятся на 20 ненулевых поворотов (в исходном положении совпадений нет), то по принципу Дирихле найдётся поворот, при котором будет не менее трёх совпадений. Значит, при этом повороте образом какого-то треугольника с синими вершинами является треугольник с красными вершинами. Следовательно, эти треугольники равны.",
        "Ответ: Обязательно."
    ],
    "79528": [
        "Связность и разложение на связные компоненты",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: 20 телефонов соединены проводами так, что каждый провод соединяет два телефона,  каждая пара телефонов соединена не более чем одним проводом и от каждого телефона отходит не более двух проводов. Нужно закрасить провода (каждый провод целиком одной краской) так, чтобы от каждого телефона отходили провода разных цветов. Какого наименьшего числа красок достаточно для такой закраски?",
        "Решение: Будем изображать телефоны точками, а соединяющие их провода – отрезками, соединяющими эти точки. Так как из каждой точки выходит не более двух отрезков, то полученный граф распадается на незамкнутые пути и простые циклы Заметим, что незамкнутый путь можно покрасить в два цвета, а простой цикл – в три. Для этого достаточно в незамкнутом пути покрасить отрезки через один, а в цикле покрасить один отрезок в цвет 3, а оставшиеся покрасить через один в цвета 1 и 2. Кроме того, заметим, что если в получившемся графе есть треугольник, то двух цветов не хватит. Итак, искомое число красок равно 3.",
        "Ответ: Три краски."
    ],
    "32096": [
        "Раскраски",
        "Сложность: 3",
        "Классы: 6,7,8,9",
        "Условие: Прямая раскрашена в два цвета.   Докажите, что на ней найдутся такие три точки A, B и C, окрашенные в один цвет, что точка B является серединой отрезка AC.",
        "Решение: Рассмотрим на прямой две произвольные точки X и Y одного цвета, а также точку X1, симметричную X относительно Y, точку Y1, симметричную Y относительно X и середину O отрезка XY (см. рис.). Если хотя бы одна из этих точек окрашена в тот же цвет, что и точки X и Y, то она вместе с ними образует искомую тройку. Если все эти три точки окрашены в другой цвет, то тогда они будут искомой тройкой."
    ],
    "30816": [
        "Теория графов (прочее)",
        "Сложность: 4",
        "Классы: 7,8",
        "Условие: Каждое из рёбер полного графа с 17 вершинами покрашено в один из трёх цветов.  Докажите, что есть три вершины, все рёбра между которыми – одного цвета.",
        "Решение: Из произвольной вершины выходит по крайней мере 6 рёбер одного цвета (пусть красного). Рассмотрим полный граф на 6 вершинах, в которые ведут эти рёбра. Если хотя бы одно из рёбер этого графа – красное, то есть красный треугольник. В противном случае этот граф – двухцветный, и согласно задаче 30815 в нём есть одноцветный треугольник."
    ],
    "30817": [
        "Теория графов (прочее)",
        "Сложность: 4",
        "Классы: 7,8",
        "Условие: Каждое из рёбер полного графа с 9 вершинами покрашено в синий или красный цвет.   Докажите, что либо есть четыре вершины, все рёбра между которыми – синие, либо есть три вершины, все рёбра между которыми – красные.",
        "Решение: Пусть есть вершина, из которой выходит шесть синих рёбер. Тогда всё следует из задачи 30815.     В противном случае есть вершина, из которой выходит не более четырёх синих рёбер (из всех девяти вершин не может выходить по пять синих ребер). Тогда из неё выходит по крайней мере четыре красных ребра. Если хотя бы одно из рёбер, соединяющих их концы, – красное, то есть красный треугольник. Если же все они синие, то образовался полный синий граф на четырёх вершинах."
    ]
}