{
    "30320": [
        "Правило произведения",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Монету бросают трижды. Сколько разных последовательностей орлов и решек можно при этом получить?",
        "Ответ: 23 = 8 последовательностей."
    ],
    "30735": [
        "Сочетания и размещения",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: а) Спортивный клуб насчитывает 30 членов, из которых надо выделить четыре человека для участия в забеге на 1000 метров. Сколькими способами это можно сделать?   б) Сколькими способами можно составить команду из четырёх человек для участия в эстафете 100 м + 200 м + 300 м + 400 м?",
        "Ответ: а) ;  б) 30·29·28·27 = 657720 способами."
    ],
    "78627": [
        "Разложение в произведение транспозиций и циклов",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Испанский король решил перевесить по-своему портреты своих предшественников в  круглой башне замка. Однако он хочет, чтобы за один раз меняли местами только  два портрета, висящие рядом, причём это не должны быть портреты двух королей,  один из которых царствовал сразу после другого. Кроме того, ему важно лишь  взаимное расположение портретов, и два расположения, отличающиеся поворотом  круга, он считает одинаковыми. Доказать, что как бы сначала ни висели портреты,  король может по этим правилам добиться любого нового их расположения.",
        "Решение: Занумеруем портреты королей по порядку их царствования: 1, 2,..., n. Покажем, как королю из любого исходного расположения портретов получить порядок 1, 2,..., n по часовой стрелке (назовём такой порядок стандартным). Подгоним сначала первый портрет ко второму (двигая первый по часовой стрелке). Мы сможем это сделать, так как первый портрет можно менять с любым, кроме второго. После этого будем двигать портреты 1 и 2 вместе, пока не подгоним их к третьему, и т. д. В результате получим стандартный порядок.    Заметим, что мы заодно научились получать из стандартного порядка любой другой порядок. Действительно, для этого достаточно проделать перевешивания, приводящие конечный порядок к стандартному, но в обратном порядке. Теперь уже несложно получить из любого порядка любой другой: надо сначала из исходного порядка получить стандартный, а потом из него получить конечный порядок."
    ],
    "35024": [
        "Перестановки и подстановки",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: На книжной полке стоят 30 томов энциклопедии в некотором порядке. За одну операцию разрешается менять местами любые два соседних тома. За какое наименьшее число операций можно гарантированно выстроить все тома  в правильном порядке (с первого по тридцатый слева направо) независимо от начального положения?",
        "Подсказка: Назовём беспорядком пару томов, в которой том с большим номером стоит левее тома с меньшим номером. За одну операцию число беспорядков меняется не более чем на 1.",
        "Решение: Пусть имеется некоторое расположение томов на полке. Рассмотрим всевозможные пары томов (всего таких пар 30·29 : 2 = 435). Назовем беспорядком пару томов, в которой том с большим номером стоит левее тома с меньшим номером. В конечной ситуации не должно быть ни одного беспорядка. Заметим, что за одну операцию число беспорядков меняется не более, чем на 1. В самом деле, только в паре переставляемых томов может появиться или исчезнуть один беспорядок.  Следовательно, при начальном расположении, в котором тома идут в обратном порядке (каждая пара томов образует беспорядок), потребуется сделать не менее 435 операций.    Покажем, что 435 операций всегда достаточно. Если в некотором расположении томов есть беспорядки, то найдётся пара соседних томов, образующая беспорядок. Поменяв местами эту пару томов, мы уменьшаем число беспорядков на 1. Таким образом, каждой операцией мы можем уменьшать число беспорядков на 1 и не более, чем через 435 операций прийти к расположению, в котором нет беспорядков, то есть к правильному порядку томов.",
        "Ответ: За 435 операций."
    ],
    "58317": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Докажите, что число неравных треугольников с вершинами в вершинах правильного",
        "Решение: Пусть всего имеется N неравных треугольников с вершинами в вершинах правильного n-угольника, причём из них N1 правильных, N2 неправильных равнобедренных и N3 разносторонних. Каждый правильный треугольник равен одному треугольнику с фиксированной вершиной A, неправильный равнобедренный – трём треугольникам с вершиной A, а разносторонний – шести. Так как всего имеется ½ (n – 1)(n – 2) треугольников с вершиной A, то ½ (n – 1)(n – 2) = N1 + 3N2 + 6N3.    Ясно, что число неравных правильных треугольников равно 0 или 1, а число неравных равнобедренных равно n–1/2 или n/2 – 1, то есть N1 = 1 – c, N1 + N2 = ½ (n – 2 + d), где c и d равны 0 или 1. Поэтому      12N = 12(N1 + N2 + N3) = 2(N1 + 3N2 + 6N3) + 6(N1 + N2) + 4N1 = (n – 1)(n – 2) + 3(n – 2 + d) + 4(1 – c) = n² + 3d – 4c.    Так как |3d – 4c| < 6, то N совпадает с ближайшим к n²/12 целым числом."
    ],
    "76447": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: На сколько частей могут разделить пространство n плоскостей?   (Каждые три плоскости пересекаются в одной точке, никакие четыре плоскости не имеют общей точки.)",
        "Решение: Обозначим это число Kn. Посмотрим, как изменится это число при проведении (n+1)-й плоскости. Эта плоскость пересекается остальными плоскостями по n прямым общего положения и делится ими на ½ (n² + n + 2) кусков (см. задачу 60323). Каждый из этих кусков разбивает одну из старых частей пространства на две. Значит,   Kn+1 = Kn + ½ (n² + n + 2). Удобнее записать эту формулу в виде Kn = Kn–1 + ½ (n² – n + 2).     Поскольку K0 = 1, имеем   2Kn = 2 + (1² – 1 + 2) + (2² – 2 + 2) + ... + (n² – n + 2) = (1² + 2² + ... + n²) – (1 + 2 + ... + n) + 2(n + 1) =       = &frac16; n(n + 1)(2n + 1) – ½ n(n + 1) + 2(n + 1) = &frac13; (n + 1)(n² – n + 6).  (Формулу для суммы квадратов см. в задаче 60282.)",
        "Ответ: На &frac16; (n³ + 5n + 6) частей."
    ],
    "78599": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На клетчатой доске 11×11 отмечено 22 клетки так, что на каждой вертикали и на каждой горизонтали отмечено ровно две клетки. Два расположения отмеченных клеток эквивалентны, если, меняя любое число раз вертикали между собой и горизонтали между собой, мы из одного расположения можем получить другое. Сколько существует неэквивалентных расположений отмеченных клеток?",
        "Решение: Рассмотрим двудольный граф, вершинами которого являются строки и столбцы данной доски, причём строка и столбец соединены ребром тогда и только тогда, когда клетка на их пересечении отмечена. Заметим, что перестановки строк и перестановки столбцов исходной таблицы соответствуют перенумерациям вершин в каждой из долей получившегося графа. Это значит, что эквивалентным расположениям соответствуют изоморфные графы, а неэквивалентным – неизоморфные. Таким образом, число неэквивалентных расположений отмеченных клеток равно числу неизоморфных графов, соответствующих каким-нибудь расположениям.     Посмотрим, какие графы соответствуют каким-нибудь расположениям отмеченных клеток. Во-первых, в каждой доле этого графа должно быть по 11 вершин (доля строк и доля столбцов). Во-вторых, степень каждой вершины равна 2, а значит, граф распадается на циклы. Так как граф двудольный, то длины этих циклов чётны.  Кроме того, так как в графе нет кратных рёбер, то длина каждого такого цикла не меньше четырёх. Изоморфизм двух таких графов равносилен совпадению у них набора длин циклов. Следовательно, искомое число равно количеству представлений числа 22 в виде суммы чётных слагаемых, каждое из которых не менее четырёх (суммы, отличающиеся лишь порядком слагаемых, считаются одинаковыми), то есть количеству представлений числа 11 в виде суммы слагаемых, каждое из которых не меньше 2. Выписав все эти представления, можно убедиться, что их ровно 14.",
        "Ответ: 14 расположений."
    ],
    "60335": [
        "Правило произведения",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: а) В Стране Чудес есть три города A, B и C. Из города A в город B ведет 6 дорог, а из города B в город C – 4 дороги.   Сколькими cпособами можно проехать от A до C?    б) В Стране Чудес построили еще один город D и несколько новых дорог – две из A в D и две из D в C.   Сколькими способами можно теперь добраться из города A в город C?",
        "Решение: б) К 6·4 = 24 старым способам добавились еще 2·2 = 4 новых.",
        "Ответ: а) 24;  б) 28 способами."
    ],
    "108739": [
        "Задачи с ограничениями",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: На окружной железной дороге n станций. Иногда дежурные по станциям связываются друг с другом по радио. В каждый момент времени сеанс связи ведут только два человека. За сутки между каждыми двумя станциями произошёл ровно один радиосеанс. Для каждой станции (если учесть только её сеансы) оказалось, что она общалась с другими станциями по очереди в порядке их расположения на железной дороге (по или против часовой стрелки, у разных станций эти направления могут быть разными), начиная с одной из соседних и заканчивая другой. Чему может равняться n?",
        "Решение: Порядок, в котором могут связываться по радио четыре станции: AB, CD, BD, AC, AD, BC.    Докажем, что пять станций не могут общаться указанным в задаче  способом. Пусть станции находятся в вершинах пятиугольника ABCDE. Заметим, что первыми могут поговорить только две соседние станции. Более того, каждая станция, когда впервые выходит на связь, говорит с одной из соседних с ней. Пусть первый сеанс связи был между станциями A и B. Для следующего разговора есть всего два варианта: D с E и C с D (остальные разговоры невозможны согласно вышеизложенному). А третий разговор уже невозможен.     Допустим, n > 5. Посмотрим на какие-нибудь пять станций из этих n. Эти станции говорили между собой способом, удовлетворяющим условию, что невозможно.",
        "Ответ: n"
    ],
    "77913": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 4+",
        "Классы: 8,9",
        "Условие: На окружности расположены 20 точек. Эти 20 точек попарно соединяются 10   хордами, не имеющими общих концов и непересекающихся.   Сколькими способами это можно сделать?",
        "Решение: Пусть an – количество способов соединить 2n точек на окружности n непересекающимися хордами. Ясно, что a1 = 1 и a2 = 2. Покажем, что  an = an–1 + an–2a1 + an–3a2 + ... + a1an–2 + an–1.     Фиксируем одну из данных 2n точек. Хорда, выходящая из неё, делит окружность на две дуги, причём на каждой дуге расположено чётное число данных точек. Если на одной дуге расположено 2k точек, то на другой – 2(n – k – 1) точек; эти точки можно соединить непересекающимися хордами (не пересекающими первую хорду) an–k–1ak способами. Осталось просуммировать по k от 0 до 2n – 2.    Таким образом,    ..., a10 = 16796.",
        "Ответ: 16796 способами."
    ],
    "60336": [
        "Правило произведения",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Cколько существует различных семизначных телефонных номеров (cчитается, что номер начинаться с нуля не может)?",
        "Решение: Первую цифру можно выбрать 9 способами, а каждую из шести остальных – 10 способами. Итого, 9·106 способов.",
        "Ответ: 9·106 номеров."
    ],
    "35215": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 5",
        "Классы: 9,10,11",
        "Условие: Множество M есть объединение k попарно непересекающихся отрезков, лежащих на одной прямой. Известно, что любой отрезок длины, не большей 1, можно   расположить на прямой так, чтобы его концы принадлежали множеству M. Докажите, что сумма длин отрезков, составляющих M, не меньше 1/k.",
        "Подсказка: Пусть даны два непересекающихся отрезка длин s1 и s2. Числа, выражающие длины всевозможных отрезков, один конец которых принадлежит первому отрезку, а другой конец – второму, заполняют отрезок длины s1 + s2.",
        "Решение: Обозначим данные отрезки I1, I2, ... , Ik, а их длины – s1, s2, ... , sk. Рассмотрим семейство Tij всевозможных отрезков, один конец которых принадлежит    Ii, а другой конец – Ij.   Минимальная длина такого отрезка равна растоянию l между ближайшими вершинами отрезков, а максимальная – l + si + sj. Таким образом, числа, выражающие длины отрезков семейства Tij, принадлежат отрезку длины si + sj. Длины отрезков семейства Ti, оба конца которых принадлежат Ii, заполняют отрезок длины si. Отсюда получаем, что числа, выражающие длины всех отрезков с концами в множестве  M, заполняют несколько отрезков суммарной длины"
    ],
    "60337": [
        "Правило произведения",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Номер автомашины состоит из трёх букв русского алфавита (используется 30 букв) и трёх цифр: сначала идет буква, затем три цифры, а затем еще две буквы. Сколько существует различных номеров автомашин?",
        "Ответ: 10³·30³ = 27000000 номеров."
    ],
    "79405": [
        "Разложение в произведение транспозиций и циклов",
        "Сложность: 5",
        "Классы: 9,10,11",
        "Условие: За круглым столом сидят n человек. Разрешается любых двух людей, сидящих  рядом, поменять местами. Какое наименьшее число таких перестановок необходимо  сделать, чтобы в результате каждые два соседа остались бы соседями, но сидели  бы в обратном порядке?",
        "Решение: Пусть tn — наименьшее число пересаживаний. Докажем, что    при n ≥ 4.   (1)",
        "Ответ: ¼ (n² – 2n) при чётном n;  ¼ (n – 1)² при нечётном n."
    ],
    "78166": [
        "Сочетания и размещения",
        "Сложность: 5+",
        "Классы: 10,11",
        "Условие: В школе изучают 2n предметов. Все ученики учатся на 4 и 5. Никакие два  ученика не учатся одинаково, ни про каких двух нельзя сказать, что один из них  учится лучше другого. Доказать, что число учеников в школе не больше  .  (Мы считаем, что ученик p учится лучше ученика q, если у p оценки по всем предметам не ниже, чем у q, а по некоторым предметам – выше.)",
        "Решение: Немного изменим условие: пусть в школе учатся 22n учеников со всевозможными наборами пятёрок и четвёрок. Выберем из них максимальную группу A попарно несравнимых учеников (в смысле условия задачи). Мы докажем, что эта группа состоит в точности из всех учеников, которые имеют ровно n пятёрок (их ровно ). Отсюда, очевидно, следует утверждение исходной задачи.    Выделим в A подгруппу B, состоящую из учеников с наименьшим числом k пятёрок. Пусть k < n. Рассмотрим группу C всех учеников, каждый из которых имеет пятёрки ровно по k + 1 предмету, причём он (учится) лучше одного из учеников группы B. Очевидно ни один из них не входит в A, и мы можем заменить группу B на группу C. Докажем, что число c учеников группы C больше, чем число b учеников группы B.    Пусть каждый ученик группы B пожмёт руку всем ученикам из C, которые лучше него (таких учеников ровно 2n – k). Всего будет сделано  (2n – k)b > (k + 1)b рукопожатий. Действительно, 2k + 1 ≤ 2(n – 1) + 1 < 2n. С другой стороны, каждый ученик из C пожал руки не более, чем k + 1 ученику, следовательно, (k + 1)c > (k + 1)b, то есть c > b.    Итак, заменив группу B на группу C, мы увеличим группу A, что противоречит ее максимальности. Противоречие доказывает, что k ≥ n.    Симметричным образом, доказывается, что в A нет учеников с числом пятёрок, большим n. Следовательно, A состоит только из учеников с n пятёрками, и (снова в силу максимальности) туда должны попасть все такие ученики."
    ],
    "105220": [
        "Раскладки и разбиения",
        "Сложность: 5+",
        "Классы: 9,10,11",
        "Условие: Все имеющиеся на складе конфеты разных сортов разложены по n коробкам, на которые установлены цены в 1, 2, ..., n у. е. соответственно. Требуется купить такие k из этих коробок наименьшей суммарной стоимости, которые содержат заведомо не менее k/n массы всех конфет. Известно, что масса конфет в каждой коробке не превосходит массы конфет в любой более дорогой коробке.     а) Какие коробки следует купить при n = 10 и k = 3?      б) Тот же вопрос для произвольных натуральных n ≥ k.",
        "Решение: Пусть a1 ≤ a2 ≤ ... ≤ an – массы конфет в коробках стоимостью в 1, 2, ..., n у. е. соответственно, а n1 < n2 < ... < nk – номера тех коробок, которые нужно купить.     1. Обозначим mj = jn/k (j = 1, ..., k) и докажем, что для искомого набора номеров должны быть выполнены неравенства nj ≥ mj.   (*)     Действительно, предположим, что nj < mj для некоторого j.     Тогда, например, вслучае  a1 = ... = anj  = nj < anj + 1 = ... = an = n + nj    получаем      a1 + ... + an = nj2 + (n – nj)(n + nj) = n2,       an1 + ... + ank = (k – j)(n + nj) + jnj < (k – j)n + nj = kn,   то есть нарушено требование задачи.     2. Пусть теперь все неравенства (*) верны. Докажем, что тогда требование задачи выполнено.    а) При n = 10, k = 3 имеем n1 ≥ 10/3, n2 ≥ 20/3, n1 ≥ 10, т.е. достаточно взять 4-ю, 7-ю и 10-ю коробки. И действительно:          (добавив к группе чисел число, меньшее их всех, мы уменьшим среднее арифметическое).",
        "Ответ: Коробки стоимостью  а) 4, 7 и 10 у. е.;  б)  у. е."
    ],
    "104045": [
        "Правило произведения",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: а) Сколькими способами Дима сможет покрасить пять ёлок в серебристый, зеленый и синий цвета, если количество краски у него неограничено, а каждую ёлку он красит только в один цвет?     б) У Димы есть пять шариков: красный, зеленый, желтый, синий и золотой. Сколькими способами он сможет украсить ими пять ёлок, если на каждую требуется надеть ровно один шарик?     в) А если можно надевать несколько шариков на одну ёлку (и все шарики должны быть использованы)?",
        "Решение: а) Каждую из пяти ёлок можно покрасить в один из трёх цветов, поэтому всего различных способов существует 3·3·3·3·3 = 35.",
        "Ответ: а) 243; б) 120; в) 3125."
    ],
    "60349": [
        "Правило произведения",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Назовём натуральное число симпатичным, если в его записи встречаются только нечётные цифры.   Сколько существует четырёхзначных симпатичных  чисел?",
        "Подсказка: Нечётных цифр – пять. См. задачу 104045.",
        "Ответ: 54 = 625 чисел."
    ],
    "30314": [
        "Перебор случаев",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: а) В магазине Все для чая есть 5 разных чашек и 3 разных блюдца. Сколькими способами можно купить чашку с блюдцем?",
        "Решение: а) Выберем чашку. В комплект к ней можно выбрать любое из трёх блюдец. Поэтому есть 3 разных комплекта, содержащих выбранную чашку.  Поскольку чашек всего 5, то число различных комплектов равно 5·3 = 15.",
        "Ответ: а) 15; б) 60; в) 47 способами."
    ],
    "30325": [
        "Правило произведения",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: Сколькими способами можно сделать трёхцветный флаг с горизонтальными полосами одинаковой ширины, если имеется материя шести различных цветов?",
        "Решение: Цвет для верхней полоски флага можно выбрать шестью разными способами. После этого для средней полоски флага остается пять возможных цветов, а затем для нижней полоски флага – четыре различных цвета. Таким образом, флаг можно сделать 6·5·4 = 120 способами.",
        "Ответ: 120 способами."
    ],
    "30328": [
        "Перестановки и подстановки (прочее)",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Сколько существует трёхзначных чисел, в записи которых цифры 1, 2, 3 встречаются ровно по одному разу?",
        "Решение: На первое место можно поставить любую из трёх цифр, на второе – любую из двух оставшихся, а на третье – последнюю оставшуюся цифру.  Таким образом, всего получается 6 чисел.",
        "Ответ: 3! = 6 чисел."
    ],
    "30340": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: У двух начинающих коллекционеров по 20 марок и по 10\tзначков. Честным обменом называется обмен одной марки на одну марку или одного значка на один значок. Сколькими способами коллекционеры могут осуществить честный обмен?",
        "Ответ: 20·20 + 10·10 = 500 способами."
    ],
    "30355": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: Кубик бросают трижды. Среди всех возможных последовательностей результатов есть такие, в которых хотя бы один раз встречается шестёрка. Сколько их?",
        "Подсказка: См. задачу 60342.",
        "Ответ: 6³ – 5³."
    ],
    "30694": [
        "Сочетания и размещения",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: Рота состоит из трёх офицеров, шести сержантов и 60 рядовых.  Сколькими способами можно выделить из них отряд, состоящий из офицера, двух сержантов и 20 рядовых?",
        "Подсказка: Двух сержантов из шести можно выбрать  способами, а 20 рядовых из 60 –  способами.",
        "Ответ: способами."
    ],
    "30740": [
        "Правило произведения",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: Труппа театра состоит из 20 артистов. Сколькими способами можно выбрать из неё в течение двух вечеров по шесть\tчеловек для участия в спектаклях так, чтобы ни один артист не участвовал в двух спектаклях?",
        "Ответ: способами."
    ],
    "30746": [
        "Правило произведения",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: Ладья стоит на левом поле клетчатой полоски 1×30 и за ход может сдвинуться на любое количество клеток вправо.     а) Сколькими способами она может добраться до крайнего правого поля?    б) Сколькими способами она может добраться до крайнего правого поля ровно за семь ходов?",
        "Подсказка: а) Она может побывать или не побывать на каждом из 28 некрайних полей.",
        "Ответ: а) ;  б)  способами."
    ],
    "60348": [
        "Правило произведения",
        "Сложность: 2",
        "Классы: 7,8,9",
        "Условие: Сколькими способами можно разложить семь монет различного достоинства по трём карманам?",
        "Подсказка: Каждая из монет может оказаться в любом из трёх карманов.",
        "Ответ: 37 способами."
    ],
    "60379": [
        "Сочетания и размещения",
        "Сложность: 2",
        "Классы: 7,8,9",
        "Условие: Из класса, в котором учатся 28 человек, назначаются на дежурcтво в столовую 4 человека.    а) Сколькими способами это можно сделать?    б) Сколько существует способов набрать команду дежурных, в которую попадёт ученик этого класса Коля Васин?",
        "Подсказка: б) Если Коля уже выбран, то осталось выбрать 3 человек из 27.",
        "Ответ: а)  способами;  б)  способов."
    ],
    "60370": [
        "Перестановки и подстановки (прочее)",
        "Сложность: 2",
        "Классы: 7,8,9",
        "Условие: В пассажирском поезде 17 вагонов.   Сколькими способами можно распределить по вагонам 17 проводников, если за каждым вагоном закрепляется один проводник?",
        "Ответ: 17! способами."
    ],
    "60409": [
        "Треугольник Паскаля и бином Ньютона",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Сколькими способами, двигаясь по следующей таблице от буквы к букве,",
        "Подсказка: См. задачу 35547.",
        "Ответ: 26 способами."
    ],
    "78175": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 7,8,9,10",
        "Условие: Заметим, что если перевернуть лист, на котором написаны цифры, то цифры 0,  1, 8 не изменятся, 6 и 9 поменяются местами, остальные потеряют смысл.  Сколько существует девятизначных чисел, которые при переворачивании листа не  изменяются?",
        "Решение: Все такие числа должны состоять из цифр, имеющих смысл при переворачивании  листа, причём число определяется первыми пятью своими цифрами. Заметим, что  пятая цифра не может быть 6 или 9, а также первая цифра не может быть 0.  Итак, для первой цифры имеем 4 варианта, для второй, третьей и четвёртой – по 5, а для пятой – 3 варианта. Таким образом, всего таких чисел 4·5³·3 = 1500.",
        "Ответ: 1500 чисел."
    ],
    "102877": [
        "Шахматные доски и шахматные фигуры",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Сколькими способами можно расставить чёрную и белую ладьи на шахматной доске так, чтобы они не били друг друга?",
        "Решение: Белую ладью можно поставить на любое из 64 полей доски, причём с каждого из них она бьёт 15 полей (включая поле, на котором стоит). Остаётся 49 полей, на которые можно поставить чёрную ладью. Итак, белую и чёрную ладью можно расставить 64·49 = 3136 способами.",
        "Ответ: 3136 способами."
    ],
    "102999": [
        "Арифметика. Устный счет и т.п.",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: – У меня зазвонил телефон.    – Кто говорит?     – Слон.     А потом позвонил Крокодил, а потом позвонили Зайчатки, а потом позвонили Мартышки, а потом позвонил Медведь, а потом позвонили Цапли... Итак, у Слона, Крокодила, Зайчаток, Мартышек, Медведя, Цапель и у меня установлены телефоны. Каждые два телефонных аппарата соединены проводом. Cколько для этого понадобилось проводов?",
        "Подсказка: Заметьте, каждый провод соединяет два аппарата.",
        "Решение: Всего телефонных аппаратов 7, каждый соединен с шестью. Значит, соединений всего 42. А провод — это 2 соединения. Поэтому всего понадобился 21 провод.",
        "Ответ: 21 провод."
    ],
    "104046": [
        "Сочетания и размещения",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: У людоеда в подвале томятся 25 пленников.     а) Сколькими способами он может выбрать трёх из них себе на завтрак, обед и ужин? Порядок важен.     б) А сколько есть способов выбрать троих, чтобы отпустить на свободу?",
        "Решение: а) На завтрак людоед может предпочесть любого из 25 человек, на обед – любого из 24 оставшихся, а на ужин – кого-то из 23 оставшихся счастливчиков. Всего получаем 25·24·23 = 13800 способов.",
        "Ответ: а) 13800 способами;  б) 2300 способов."
    ],
    "30286": [
        "Четность и нечетность",
        "Сложность: 2+",
        "Классы: 6,7",
        "Условие: На хоккейном поле лежат три шайбы",
        "Подсказка: Когда шайбы",
        "Решение: Будем называть расположение шайб",
        "Ответ: Не могут."
    ],
    "30348": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Сколькими способами можно поставить на шахматную доску так, чтобы они не били друг друга     а) две ладьи;  б) двух королей; в) двух слонов;  г) двух коней;  д) двух ферзей?   Все фигуры одного цвета.",
        "Подсказка: В п. а) ответ в два раза меньше, чем в задаче 102877, а в п. б) – чем в задаче 30327, поскольку в тех подсчетах каждая позиция учитывалась дважды. В остальных пунктах вычисления аналогичны.",
        "Ответ: a)     б)  способами;  в)   способами;"
    ],
    "30349": [
        "Сочетания и размещения",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: У мамы два яблока, три груши и четыре апельсина. Каждый день в течение девяти дней подряд она дает сыну один из оставшихся фруктов.  Сколькими способами это может быть сделано?",
        "Подсказка: См. задачу 30330.",
        "Ответ: способами."
    ],
    "30352": [
        "Сочетания и размещения",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Сколько слов можно составить из пяти букв А и не более чем из трёх букв Б?",
        "Подсказка: См. задачу 30330.",
        "Ответ: слова."
    ],
    "60371": [
        "Перестановки и подстановки (прочее)",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Количество перестановок множества из n элементов обозначается Pn. Докажите равенство Pn = n!.",
        "Подсказка: Воспользуйтесь правилом произведения. См. задачу 30328."
    ],
    "30358": [
        "Количество и сумма делителей числа",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Пусть p и q – различные простые числа. Сколько делителей у числа     а) pq;    б) p²q;     в) p²q²;     г) pmqn?",
        "Решение: г) Каждый делитель также имеет вид pkql, причём показатель k можно выбрать m + 1 способом (от 0 до m), а показатель l – n + 1 способом.",
        "Ответ: а) 4 делителя; б) 6;  в) 9;  г) (m + 1)(n + 1) делителей."
    ],
    "30690": [
        "Сочетания и размещения",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: У одного школьника есть 6 книг по математике, а у другого – 8.  Сколькими способами они могут обменять три книги одного на три книги другого?",
        "Решение: Первый школьник может выбрать 3 книги для обмена  способами, второй –  способами.  Таким образом, число возможных обменов равно .",
        "Ответ: 1120 способами."
    ],
    "30696": [
        "Задачи с ограничениями",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Сколькими способами можно выбрать из 15 различных слов набор, состоящий не более чем из пяти слов?",
        "Ответ: способами."
    ],
    "30697": [
        "Сочетания и размещения",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Сколькими способами можно составить комиссию из трёх\tчеловек, выбирая её членов из четырёх супружеских пар, но так, чтобы члены одной семьи не входили в комиссию одновременно?",
        "Подсказка: Выберите сначала семью, представитель которой не войдёт в комиссию, а потом в каждой из оставшихся семей – конкретного представителя.",
        "Ответ: 4·23 = 32 способами."
    ],
    "30698": [
        "Задачи с ограничениями",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: В классе, в котором учатся Петя и Ваня – 31 человек. Сколькими способами можно выбрать из класса футбольную команду (11 человек) так, чтобы Петя и Ваня не входили в команду одновременно?",
        "Подсказка: Первый способ. Разберите три случая: в команду входит только Петя; в команду входит только Ваня; оба они в команду не входят.",
        "Ответ: способами."
    ],
    "30699": [
        "Сочетания и размещения",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Сколькими способами можно переставить буквы слова ЭПИГРАФ так, чтобы и гласные, и согласные шли в алфавитном порядке?",
        "Подсказка: Все определяется местами, на которых стоят гласные буквы.",
        "Ответ: способами."
    ],
    "30703": [
        "Сочетания и размещения",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Сколькими способами можно выбрать из полной колоды (52 карты) 10 карт так, чтобы    \tа) среди них был ровно один туз?     б) среди них был хотя бы один туз?",
        "Подсказка: б) Перейдите к дополнению.",
        "Ответ: а) ;  б)  способами."
    ],
    "30706": [
        "Сочетания и размещения",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Человек имеет шесть друзей и в течение пяти дней приглашает\tк себе в гости каких-то троих из них так, чтобы компания ни разу не повторялась.   Сколькими способами он может это сделать?",
        "Подсказка: Выбрать трёх друзей из шести можно  способами.",
        "Ответ: 20·19·18·17·16 способами."
    ],
    "30707": [
        "Сочетания и размещения",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Как известно, для участия в лотерее Спортлото нужно указать шесть номеров из имеющихся на карточке 45 номеров.     а) Сколькими способами можно заполнить карточку Спортлото?     б) После тиража организаторы лотереи решили подсчитать, каково число возможных вариантов заполнения карточки, при которых могло быть угадано ровно три номера. Помогите им в этом подсчёте.",
        "Ответ: а)  способами;  б)  вариантов."
    ],
    "30745": [
        "Сочетания и размещения",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Сколькими способами можно разделить колоду из 36 карт пополам так, чтобы в каждой половине было по два туза?",
        "Ответ: способами."
    ],
    "35269": [
        "Комбинаторика орбит",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Гайка имеет форму правильной шестиугольной призмы. Каждая боковая грань гайки покрашена в один из трёх цветов: белый, красный или синий, причём соседние грани выкрашены в разные цвета. Сколько существует различных по раскраске гаек? (Для раскраски гайки не обязательно использовать все три краски.)",
        "Решение: Грани одного цвета не могут быть рядом, поэтому их не более трёх. Разберем три случая.  1) Использованы только два цвета – каждый по три раза. Тогда цвета должны чередоваться, и единственная схема раскраск – 121212. Подставляя вместо 1 и 2 любую пару цветов, мы получим 3 типа гаек. Замена цветов в паре ничего не меняет.     2) Один цвет использован три раза, второй – два, третий – один. Очевидно, схема раскраски (с точностью до поворота) тоже одна – 121213. В качестве цвета 1 можно взять любой из трёх данных цветов, в качестве цвета 2 – любой из двух оставшихся. Итого – 6 типов гаек.          3) Каждый цвет использован по два раза. Здесь есть два подслучая.    а) Каждая грань окрашена так же, как противоположная: схема раскраски – 123123. Такой тип гайки только один (напомним, что гайку можно переворачивать).    б) Какие-то противоположные грани окрашены в разные цвета (1 и 2). Тогда вторая грань цвета 1 находится рядом с первой гранью цвета 2, и наоборот, а грани цвета 3 – напротив друг друга (схема 123213). Здесь важно, какой цвет мы выберем в качестве цвета 3, поэтому получается 3 типа гаек.      И всего 3 + 6 + 1 + 3 = 13 типов."
    ],
    "60339": [
        "Правило произведения",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: В языке одного древнего племени было 6 гласных и 8 согласных, причём при составлении слов гласные и согласные непременно чередовались. Сколько слов из девяти букв могло быть в этом языке?",
        "Ответ: 14·484 слов."
    ],
    "60340": [
        "Правило произведения",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Алфавит племени Мумбо-Юмбо состоит из трёх букв. Словом является любая последовательность, состоящая не более чем из четырёх букв.   Сколько слов в языке племени Мумбо-Юмбо?",
        "Ответ: 3 + 3² + 3³ + 34 = 120 слов."
    ],
    "60385": [
        "Сочетания и размещения",
        "Сложность: 2+",
        "Классы: 8",
        "Условие: У Нины 7 разных шоколадных конфет, у Коли 9 разных карамелек. Сколькими способами они могут обменяться друг с другом пятью конфетами?",
        "Подсказка: См. решение задачи 30690.",
        "Ответ: способами."
    ],
    "60421": [
        "Задачи с ограничениями",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Сколько четырёхзначных чисел можно составить, используя цифры 1, 2, 3, 4 и 5, если:     а) никакая цифра не повторяется более одного раза;    б) повторения цифр допустимы;     в) числа должны быть нечётными и повторений цифр быть не должно?",
        "Решение: а) первую цифру можно выбрать 5 способами, вторую – 4-мя, и т. д.    б) Каждую цифру можно выбрать 5 способами;     в) Начнём с конца: цифру единиц можно выбрать 3 способами, цифру десятков - 4-мя, цифру сотен – 3-мя, ...",
        "Ответ: а) 5·4·3·2 = 120;  б) 54 = 625 чисел;  в) 3·4·3·2 = 72 числа."
    ],
    "65953": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Сколько существует восьмизначных чисел, в записи которых цифры идут в порядке убывания?",
        "Решение: См. задачу 60402.",
        "Ответ: 45 чисел."
    ],
    "88198": [
        "Взвешивания",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Какие восемь монет нужно взять, чтобы с их помощью можно было бы без сдачи заплатить любую сумму от 1 коп. до 1 руб.?   (В хождении были монеты в 1, 3, 5, 10, 20 и 50 коп.)",
        "Подсказка: Попробуйте разбить эту задачу на две: сначала найдите монеты, при помощи которых можно заплатить любую сумму от 1 до 10 коп., затем – монеты, при помощи которых можно заплатить 10, 20, ..., 90 коп.",
        "Решение: Возьмём монеты достоинством 1, 1, 3, 5, 10, 10, 20, 50 коп. Нетрудно проверить, что первые четыре монеты позволяют выплатить любую сумму от 1 до 9 коп., а последние четыре – любую кратную 10 сумму от 10 до 100 коп. Следовательно, располагая указанным набором монет, можно заплатить любую сумму от 1 коп. до 100 коп.",
        "Ответ: 1, 1, 3, 5, 10, 10, 20, 50 коп."
    ],
    "104048": [
        "Сочетания и размещения",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Сколькими способами можно разложить девять орехов по трём карманам? (Карманы разные, а орехи одинаковые.)",
        "Решение: В первый карман мы можем положить любое число орехов от 0 до 9. В каждом из этих 10 случаев подсчитаем, сколько орехов можно положить во второй карман; например, если в первый карман положен один орех, то во второй можно положить любое число орехов от 0 до 8 – всего 9 способов. Если мы определили, сколько орехов кладем в первые два кармана, то число орехов в третьем определяется однозначно. Поэтому общее число способов равно   10 + 9 + 8 + ... + 1 + 0 = 55.",
        "Ответ: способами."
    ],
    "104073": [
        "Текстовые задачи (прочее)",
        "Сложность: 2+",
        "Классы: 5,6,7,8",
        "Условие: В забеге от Воробьёвых гор до Красной площади приняли участие три спортсмена. Сначала стартовал Гриша, затем – Саша, и последней – Лена. После финиша выяснилось, что во время забега Гриша обгонял других 10 раз, Лена – 6 раз, Саша – 4 раза, причём все трое ни разу не оказывались в одной точке одновременно. В каком порядке финишировали спортсмены, если известно, что они пришли к финишу в разное время?",
        "Решение: Гриша стартовал первым. Чтобы он смог совершить 10 обгонов, необходимо чтобы Саша и Лена обогнали его хотя бы 10 раз. Так как общее количество обгонов Саши и Лены равно 6 + 4 = 10, то они обгоняли только Гришу и не обгоняли друг друга. После того, как Гриша совершил все 10 обгонов, он опять оказался первым. Значит, спортсмены финишировали в том же порядке, в котором и стартовали.",
        "Ответ: Первым финишировал Гриша, затем – Саша, и последней – Лена."
    ],
    "30701": [
        "Сочетания и размещения",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Сколькими способами можно расставить 12 белых и 12 чёрных шашек на чёрных полях шахматной доски?",
        "Подсказка: Сначала надо выбрать 12 полей для белых шашек, а потом из оставшихся  20 полей – 12 полей для чёрных шашек.",
        "Ответ: &nbsp способами."
    ],
    "61419": [
        "Раскладки и разбиения",
        "Сложность: 2",
        "Классы: 8,9,10",
        "Условие: Найдите число всех диаграмм Юнга с весом s, если   а) s = 4; б) s = 5; в) s = 6; г) s = 7.    Определение диаграмм Юнга смотри в справочнике.",
        "Решение: Достаточно перечислить все способы разбить указанные веса в сумму натуральных слагаемых, расположенных в неубывающем порядке.",
        "Ответ: а) 5; б) 7;  в) 11; г) 15 диаграмм."
    ],
    "60346": [
        "Правило произведения",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Сколько существует пятизначных чисел, которые одинаково читаются слева направо и справа налево (например, таких как 54345, 17071)?",
        "Подсказка: Достаточно задать три первые цифры такого числа – остальные восстановятся однозначно.",
        "Ответ: 9·10² = 900 чисел."
    ],
    "60352": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: В мешке 70 шаров, отличающихся только цветом: 20 красных, 20 синих, 20 жёлтых, остальные – чёрные и белые.   Какое наименьшее число шаров надо вынуть из мешка, не видя их, чтобы среди них было не менее 10 шаров одного цвета?",
        "Решение: Вынув 37 шаров, мы рискуем получить по 9 красных, синих и жёлтых, и десяти шаров одного цвета не будет. Если же мы вытащим 38 шаров, то общее число красных, синих и жёлтых среди них не меньше 28, и шаров одного из этих цветов – не меньше десяти (поскольку 28 > 3·9).",
        "Ответ: 38 шаров."
    ],
    "60373": [
        "Перестановки и подстановки (прочее)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Семнадцать девушек водят хоровод. Сколькими различными способами они могут встать в круг?",
        "Решение: Первый способ. Зафиксируем одно из мест в круге. Всегда можно повернуть круг так, чтобы на этом месте оказалась первая девушка. Остальные 16 девушек могут расположиться по оставшимся 16 местам 16! способами.",
        "Ответ: 16! способами."
    ],
    "60535": [
        "Количество и сумма делителей числа",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Сколько различных делителей имеют числа",
        "Подсказка: См. задачу",
        "Ответ: а) 32 делителя; б) 3·4·6·8·12 = 6912 делителей."
    ],
    "86513": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Назовём натуральное число замечательным, если оно – самое маленькое среди всех натуральных чисел с такой же, как у него, суммой цифр.   Сколько существует трёхзначных замечательных чисел?",
        "Решение: Замечательные числа с суммой цифр от 1 до 18 – однозначные или двузначные. Поэтому замечательные трёхзначные числа имеют сумму цифр от 19 до 27. Каждой такой сумме соответствует одно замечательное число. Следовательно, трёхзначных замечательных чисел – девять.",
        "Ответ: 9 чисел."
    ],
    "109151": [
        "Треугольник Паскаля и бином Ньютона",
        "Сложность: 2+",
        "Классы: 8,9,10",
        "Условие: Доказать, что",
        "Решение: Левая часть равна (1 – 3)4k = 24k, а правая – (1 – 5)2k = 42k = 24k."
    ],
    "60374": [
        "Перестановки и подстановки (прочее)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Сколько существует ожерелий, составленных из 17 различных бусинок?",
        "Решение: 17 предметов можно расставить по кругу 16! способами (см. задачу 60373). Но ожерелье можно еще и перевернуть, что сокращает число способов вдвое.",
        "Ответ: 8·15!."
    ],
    "60377": [
        "Правило произведения",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Сколько существует различных пятицветных флагов с пятью вертикальными полосами одинаковой ширины, если можно использовать материю одиннадцати цветов? (Флаг здесь считается просто полотнищем, не прикреплённым ни к древку, ни к чему другому.)",
        "Подсказка: См. задачи 30325 и 60374.",
        "Ответ: 11·10·9·8·7 : 2 = 27720 флагов."
    ],
    "78204": [
        "Перебор случаев",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Указать все денежные суммы, выраженные целым числом рублей, которые могут быть  представлены как чётным, так и нечётным числом денежных билетов. (В обращении имелись билеты достоинством в 1, 3, 5, 10, 25, 50 и 100 рублей.)",
        "Решение: Предположим сначала, что мы имеем денежную сумму в 10 рублей или больше. Покажем, что любая такая сумма может быть представлена как чётным, так и нечётным количеством денежных билетов. Именно, любая чётная денежная сумма (в 10 рублей или более) представляется, с одной стороны, чётным числом билетов достоинством в 1 рубль, а с другой – одним билетом в 10 рублей и ещё чётным числом билетов по одному рублю. Точно так же, любая нечётная денежная сумма (в 10 рублей или более) представляется, с одной стороны, нечётным числом билетов по одному рублю, а с другой – одним билетом в 10 рублей и ещё нечётным числом билетов по одному рублю.    Рассмотрим теперь денежные суммы, меньшие 10 рублей. Для представления этих сумм в нашем распоряжении имеются лишь билеты достоинством в 1, 3, 5 рублей – все нечётные. Понятно, что нечётное число нечётных билетов могут составить лишь нечётную сумму; следовательно, никакую чётную сумму, меньшую 10 рублей, нельзя представить нечётным числом билетов. Аналогично чётное число нечётных билетов могут составить лишь чётную сумму; следовательно, никакую нечётную сумму, меньшую 10 рублей, нельзя представить чётным числом билетов.",
        "Ответ: Все суммы, не меньшие 10 рублей."
    ],
    "30343": [
        "Правило произведения",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Сколькими способами из полной колоды (52 карты) можно выбрать    а) 4 карты разных мастей и достоинств?     б) 6 карт так, чтобы среди них были представители всех четырех мастей?",
        "Подсказка: а) Карту пиковой масти можно выбрать 13 способами, после этого карту бубновой масти можно выбрать 12 способами...",
        "Ответ: а) 13·12·11·10 = 17160 способами;  б)  способами."
    ],
    "88193": [
        "Сочетания и размещения",
        "Сложность: 2",
        "Классы: 5,6,7,8",
        "Условие: В обыкновенном наборе домино 28 косточек. Сколько косточек содержал бы  набор домино, если бы значения, указанные на косточках, изменялись  не от 0 до 6, а от 0 до 12?",
        "Подсказка: Попробуйте понять, почему встандартном наборе домино именно 28 косточек.",
        "Решение: В таком наборе было бы 13 дублей. Число остальных косточек равно числу пар из 13 чисел, то есть 13·12 : 2 = 78.",
        "Ответ: 91 косточка."
    ],
    "30356": [
        "Правило произведения",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Сколькими способами можно разбить 14 человек на пары?",
        "Подсказка: См. задачи 60342, 35628.",
        "Ответ: 13·11·9·7·5·3 = 13!! способами."
    ],
    "30604": [
        "Деление с остатком",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Сколько существует натуральных чисел",
        "Решение: Остатки от деления 2",
        "Ответ: 2858 чисел."
    ],
    "30691": [
        "Задачи с ограничениями",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: В шахматном кружке занимаются 2 девочки и 7 мальчиков. Для участия в соревновании необходимо составить команду из четырёх человек, в которую обязательно должна входить хотя бы одна девочка. Сколькими способами это можно сделать?",
        "Решение: В команду входит либо одна девочка, либо две. Разберём оба случая.  Если в команде две девочки, то двух мальчиков к ним можно добавить  способами. Если же в команду входит только одна девочка (её можно выбрать двумя способами), то команду можно дополнить тремя мальчиками  различными способами. Таким образом, общее число возможных команд равно .",
        "Ответ: 91 способом."
    ],
    "30692": [
        "Сочетания и размещения",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Сколькими способами можно разбить 10 человек на две баскетбольные команды по 5 человек в каждой?",
        "Решение: Первую команду можно выбрать  способами. Этот выбор полностью определяет вторую команду. Однако при таком подсчете каждая пара команд А и В учитывается дважды: один раз, когда в качестве первой команды выбирается команда А, и второй, – когда в качестве первой команды выбирается команда В. Значит, полученный результат надо разделить пополам.",
        "Ответ: 126 способами."
    ],
    "30700": [
        "Задачи с ограничениями",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Из 12 девушек и 10 юношей выбирают команду, состоящую из пяти человек.   Сколькими способами можно выбрать эту команду так, чтобы в нее вошло не более трёх юношей?",
        "Подсказка: См. задачу 30691.",
        "Ответ: способами."
    ],
    "30721": [
        "Раскладки и разбиения",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Переплетчик должен переплести 12 одинаковых книг в красный, зелёный или синий переплеты. Сколькими способами он может это сделать?",
        "Подсказка: Задача эвивалентна задаче о разложении 12 шаров по трём ящикам. См. задачу 30717 б).",
        "Ответ: способом."
    ],
    "30724": [
        "Раскладки и разбиения",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В почтовом отделении продаются открытки 10 видов. Сколькими способами можно купить в нём     а) 12 открыток;     б) 8 открыток;     в) 8 различных открыток?",
        "Подсказка: а), б) Задача эквивалентна задаче о разложении 12 (8) шаров по 10 ящикам. См. 30717 б).",
        "Ответ: а) ;  б) ;  в)  способами."
    ],
    "60343": [
        "Правило произведения",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Сколько существует десятизначных чисел, в записи которых имеется хотя бы две одинаковые цифры?",
        "Решение: Найдём количество десятизначных чисел, в которых все цифры разные. На первом месте в таком числе может стоять любая из девяти отличных от нуля цифр, на втором – любая из девяти цифр, отличных от первой, для третьей цифры остается уже 8 вариантов и т. д. Всего получаем 9·9! чисел. Осталось вычесть это количество из количества 9·109 всех десятизначных чисел (см. решение задачи  60336).",
        "Ответ: 9·109 – 9·9! чисел."
    ],
    "60397": [
        "Сочетания и размещения",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Параллелограмм пересекается двумя рядами прямых, параллельных его сторонам; каждый ряд состоит из m прямых.  Сколько параллелограммов можно выделить в образовавшейся сетке?",
        "Подсказка: Чтобы задать параллелограмм, надо выбрать по две прямые из каждого ряда параллельных. Учтите, что в ряду m + 2 прямые: добавляются стороны исходного параллелограмма.",
        "Ответ: ."
    ],
    "60400": [
        "Треугольник Паскаля и бином Ньютона",
        "Сложность: 3",
        "Классы: 9,10,11",
        "Условие: Докажите, что в равенстве  (x1 + ... + xm)n =   коэффициенты C(k1,..., km) могут быть найдены по формуле",
        "Решение: Чтобы получить одночлен  из произведения скобок  (x1 + ... + xm)...(x1 + ... + xm)  надо выбрать k1 скобок, из которых будет взят множитель x1; k2 скобок, из которых будет взят множитель x2; ..., km скобок, из которых будет взят множитель xm. Первую выборку можно сделать  способами, после этого вторую –  способами и т. д.    Следовательно, коэффициент C(k1, ..., km) равен произведению"
    ],
    "30321": [
        "Правило произведения",
        "Сложность: 2",
        "Классы: 5,6,7,8",
        "Условие: Каждую клетку квадратной таблицы 2×2 можно покрасить в чёрный или белый цвет. Сколько существует различных раскрасок этой таблицы?",
        "Ответ: 16 = 24 раскрасок."
    ],
    "60401": [
        "Раскладки и разбиения",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: При игре в преферанс каждому из трёх игроков раздают по 10 карт, а две карты кладут в прикуп. Сколько различных раскладов возможно в этой игре? (Считаются возможные раздачи без учета того, что каждые 10 карт достаются конкретному игроку.)",
        "Подсказка: См. задачи 30692, 30702.",
        "Ответ: раскладов."
    ],
    "60407": [
        "Раскладки и разбиения",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: Сколькими  способами можно составить букет из 17 цветков, если в продаже имеются гвоздики, розы, гладиолусы, ирисы, тюльпаны и васильки?",
        "Подсказка: См. задачу 30721.",
        "Ответ: способами."
    ],
    "78180": [
        "Правило произведения",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Рассмотрим лист клетчатой бумаги со стороной клетки, равной 1. Пусть Pk – число всех непересекающихся ломаных длины k, начинающихся в точке O – некотором фиксированном узле сетки. Доказать, что Pk·3–k < 2 для любого k.",
        "Решение: Первое звено ломаной можно провести четырьмя способами (в каждом из четырёх направлений). Каждое следующее звено можно провести не более чем тремя способами (одно направление уже занято). Поэтому Pk ≤ 4·3k–1 < 2·3k."
    ],
    "98651": [
        "Индукция (прочее)",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Любую ли сумму из целого числа рублей больше семи, можно уплатить без сдачи денежными купюрами по 3 и 5 рублей?",
        "Решение: Если эта сумма кратна 3 (наименьшее возможное число 9), используем только 3-рублевые купюры. Если при делении на 3 она даёт остаток 1 (наименьшее возможное число 10), то берём две 5-рублевые купюры, остальное доплачиваем 3-рублевыми. Если же при делении на 3 сумма даёт остаток 2 (наименьшее возможное число 8), то берём одну 5-рублевую купюру, остальное доплачиваем 3-рублевыми.",
        "Ответ: Любую."
    ],
    "30705": [
        "Раскладки и разбиения",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Сколько существует десятизначных чисел, сумма цифр которых равна  а) 2;  б) 3;  в) 4?",
        "Подсказка: Разберите все возможные представления чисел 2, 3, 4 в виде суммы нескольких натуральных слагаемых.",
        "Решение: б) 3 = 2 + 1 = 1 + 1 + 1. Есть одно число, состоящее из тройки и 9 нулей,  = 36 чисел из 3 единиц и 7 нулей и 18 чисел из двойки, единицы и 8 нулей.",
        "Ответ: а) 10;  б) 55;  в)  чисел."
    ],
    "30717": [
        "Раскладки и разбиения",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Шесть ящиков занумерованы числами от 1 до 6. Сколькими способами можно разложить по этим ящикам 20 одинаковых шаров     а) так, чтобы ни один ящик не оказался пустым?    б) если некоторые ящики могут оказаться пустыми)?",
        "Решение: а) Выложим шары в ряд. Для определения расклада наших шаров по шести ящикам разделим ряд пятью перегородками на шесть групп: первая группа для первого ящика, вторая – для второго и так далее. Таким образом, число вариантов раскладки шаров по ящикам равно числу способов расположения пяти перегородок. Перегородки могут стоять на любом из 19 мест (между 20 шарами – 19 промежутков). Поэтому число их возможных расположений равно .    б) Рассмотрим ряд из 25 предметов: 20 шаров и 5 перегородок, расположенных в произвольном порядке. Каждый такой ряд однозначно соответствует некоторому способу раскладки шаров по ящикам: в первый ящик попадают шары, расположенные левее первой перегородки, во второй – расположенные между первой и второй перегородками и т. д. (между какими-то перегородками шаров может и не быть). Поэтому число способов раскладки шаров по ящикам равно числу различных рядов из 20 шаров и 5 перегородок, то есть равно .",
        "Ответ: а) ;  б)  способами."
    ],
    "30719": [
        "Раскладки и разбиения",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Сколькими способами натуральное число n можно представить в виде суммы     а) k натуральных слагаемых?     б) k неотрицательных целых слагаемых?   (Представления, отличающиеся порядком слагаемых, считаются различными.)",
        "Подсказка: Представим n в виде суммы n единиц: n = 1 + 1 + ... + 1. Назовём теперь эти n единиц шарами, а k слагаемых из условия задачи – ящиками. Далее см. задачу 30717.",
        "Ответ: а) ;  б)  способами."
    ],
    "30730": [
        "Правило произведения",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Общество из n членов выбирает из своего состава одного представителя.   а) Сколькими способами может произойти открытое голосование, если каждый голосует за одного человека (быть может, и за себя)?     б) Решите ту же задачу, если голосование – тайное, то есть учитывается лишь число голосов, поданных за каждого кандидата, и не учитывается, кто за кого голосовал персонально.",
        "Подсказка: Если в задаче 30725 взять  m = n, то получим задачу эквивалентную данной.",
        "Ответ: а) ;  б)  способами."
    ],
    "30733": [
        "Сочетания и размещения",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На полке стоит 12 книг. Сколькими способами можно выбрать из них пять книг, никакие две из которых не стоят рядом?",
        "Решение: Поставив в соответствие оставшимся книгам белые шары, а вынутым – чёрные, мы получим частный случай задачи 60403.",
        "Ответ: = 56 способами."
    ],
    "30741": [
        "Правило произведения",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: а) Найдите сумму всех трёхзначных чисел, которые можно записать с помощью цифр 1, 2, 3, 4 (цифры могут повторяться).  б) Найдите сумму всех семизначных чисел, которые можно получить всевозможными перестановками цифр 1, ..., 7.",
        "Подсказка: а) На каждом месте каждая из цифр встречается 4² = 16 раз.",
        "Решение: б) Найдём сначала сумму цифр разряда единиц. Каждая цифра от 1 до 7 входит (в качестве цифры единиц) в 6! чисел, значит, эта сумма равна",
        "Ответ: а) 16·(1 + 2 + 3 + 4)·111 = 17760;  б) 28·6!·1111111."
    ],
    "30749": [
        "Сочетания и размещения",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Имеется куб размером 10×10×10, состоящий из маленьких единичных кубиков.  В центре O одного из угловых кубиков сидит кузнечик. Он может прыгать в центр кубика,\tимеющего общую грань с тем, в котором кузнечик находится в данный момент; причём так, чтобы расстояние до точки O увеличивалось.  Сколькими способами кузнечик может допрыгать до кубика, противоположного исходному?",
        "Подсказка: Кузнечик должен совершить всего 27 прыжков – по 9 в каждом направлении.  Обозначим направления буквами A, B и C. Каждый путь однозначно определяется последовательностью длины 27, в которой буквы A, B и C встречаются по 9 раз.",
        "Ответ: способами."
    ],
    "30778": [
        "Четность перестановки",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: В ряд выписаны числа 1, 2, 3, ..., n.  За один ход разрешается поменять местами любые два числа.   Может ли после 1989 таких операций порядок чисел оказаться исходным?",
        "Решение: Каждая пара (a, b) чисел может находиться в двух состояниях: правильном, когда меньшее число стоит левее, и неправильном, когда меньшее число стоит правее. Если между числами a и b стоит ровно k чисел, и мы поменяем a и b местами, то ровно 2k + 1 пара поменяет свое состояние: сама пара (a, b) и все пары, содержащие одно из чисел a, b и одно из k промежуточных чисел. Поэтому каждая операция меняет четность числа неправильных пар.     В начале все пары были правильными. Значит после 1989 операций число неправильных пар станет нечётным. Следовательно, полученный ряд чисел не совпадает с исходным.",
        "Ответ: Не может."
    ],
    "32040": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Автобусные билеты имеют номера от 000000 до 999999. Билет называется счастливым, если сумма первых трёх цифр его номера равна сумме последних трёх его цифр. Докажите, что:     а) число всех счастливых билетов чётно;     б) сумма номеров всех счастливых билетов делится на 999.",
        "Решение: а) Укажем два способа разбиения счастливых билетов на пары."
    ],
    "34851": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: В дискуссии приняли участие 15 депутатов. Каждый из них в своем выступлении   раскритиковал ровно k из оставшихся 14 депутатов.  При каком наименьшем k можно утверждать, что найдутся два депутата, которые раскритиковали друг друга?",
        "Подсказка: Рассмотрите ориентированный граф, вершины которого соответствуют депутатам, а ребро, ведущее из A в B, означает, что депутат A раскритиковал депутата B.",
        "Решение: Если каждый депутат раскритиковал 8 других, то число рёбер указанного в подсказке графа равно 15·8 = 120, что больше, чем число пар  его вершин. Это доказывает, что какие-то две вершины соединяются не менее чем двумя рёбрами, то есть найдутся два депутата, которые раскритиковали друг друга.    С другой стороны, пусть 15 депутатов сидят за круглым столом и каждый раскритиковал семь следующих за ним по часовой стрелке. Легко видеть, что при этом никакие два депутата не критиковали друг друга.",
        "Ответ: При k = 8."
    ],
    "35037": [
        "Уравнения в целых числах",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: В обращении есть монеты достоинством в  1, 2, 5, 10, 20, 50 копеек и 1 рубль. Известно, что k монетами можно набрать m копеек.   Докажите, что m монетами можно набрать k рублей.",
        "Подсказка: Для каждой монеты достоинством в n коп. есть монета достоинством в 100/n коп.",
        "Решение: Пусть среди k монет, дающих в сумме m копеек, есть   a1 монет по 1 коп., a2 – по 2 коп.,   a3 – по 5, a4 – по 10, a5 – по 20, a6 – по 50 коп. и a7 – по 1 рублю. Тогда      a1 + 2a2 + 5a3 + 10a4 + 20a5 + 50a6 + 100a7 = m;      a1 + a2 + a3 + a4 + a5 + a6 + a7 = k.    Умножим второе равенство на 100 и запишем его в виде:      100a1 + 50·2a2 + 20·5a3 + 10·10a4 + 5·20a5 + 2·50a6 + 100a7 = 100k.    Отсюда следует, что если взять 100a7 монет по 1 коп., 50a6 – по 2, 20a5 – по 5, 10a4 – по 10, 5a3 – по 20, 2a2 – по 50 коп. и a1 монет по 1 рублю, то в сумме они дадут 100k копеек, то есть k рублей. А согласно первому равенству монет будет m."
    ],
    "35071": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Сколько существует пар натуральных чисел, у которых наименьшее общее кратное (НОК) равно 2000?",
        "Подсказка: Либо одно из чисел равно 2000, либо в разложении одного из чисел на простые сомножители должен присутствовать множитель 24, а в разложении другого – множитель 53.",
        "Решение: Рассмотрим две возможности.    1) Одно из чисел равно 2000. Тогда другое число может быть  любым делителем числа 2000. Поскольку 2000 = 24·53, оно имеет 20 делителей (см. задачу 30358).    2) Ни одно из двух чисел a, b не равно 2000. Тогда в разложении одного из этих чисел a, b (для определенности, a) на простые сомножители должен присутствовать множитель 24, а в разложении другого – множитель 53. Таким образом, a = 24·5m,  b = 2n·53, где m может принимать 3 значения (0, 1, 2), и независимо от этого n может принимать 4 значения (0, 1, 2, 3). Таким образом, в этом случае имеется 3·4 = 12 возможностей.    Итак, имеется 20 + 12 = 32 пары натуральных чисел, имеющие НОК = 2000.",
        "Ответ: 32 пары."
    ],
    "30341": [
        "Правило произведения",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: Сколько существует шестизначных чисел, все цифры которых имеют одинаковую чётность?",
        "Подсказка: Учтите, что 0 не может стоять на первом месте.",
        "Ответ: 9·55 чисел."
    ],
    "60344": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: а) Каких чисел больше среди целых чисел первой тысячи (включая и 1000): в записи которых есть единица, или остальных?",
        "Решение: а) Имеется 83 = 512 трёхзначных чисел, не содержащих 1 и 0. Это уже больше половины чисел первой тысячи.    б) Подсчитаем количество чисел, в записи которых нет единицы. На первом месте может стоять любая из восьми цифр (не 0 и не 1), на каждом из остальных – любая из девяти цифр, отличных от 1. Всего получаем 8·96 чисел, что составляет меньше половины от количества 9·106 всех семизначных чисел (см. задачу 60336).",
        "Ответ: Больше чисел, в записи которых  а) нет единицы;  б) есть единица."
    ],
    "60406": [
        "Раскладки и разбиения",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: Сколько решений имеет уравнение x1 + x2 + x3 = 1000    а) в натуральных;  б) в целых неотрицательных числах?",
        "Подсказка: Задача эквивалентна задаче о раскладке 1000 шаров по трём ящикам. См. задачу 30717. См. также задачу 76433.",
        "Ответ: а)  ;    б)  решений."
    ],
    "60438": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Сколько существует целых чисел от 1 до 16500, которые     а) не делятся на 5;     б) не делятся ни на 5, ни на 3;     в) не делятся ни на 5, ни на 3, ни на 11?",
        "Решение: а) Разобьём все числа на 16500 : 5 = 3300 пятерок последовательно идущих чисел. В каждой пятерке одно число делится на 5, а 4 – не делятся. Поэтому всего 4·3300 = 13200 чисел не делятся на 5.",
        "Ответ: а) 13200;  б) 8800;  в) 8000 чисел."
    ],
    "61511": [
        "Раскладки и разбиения",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Докажите, что каждое натуральное число n может быть 2n–1 – 1 различными способами представлено в виде суммы меньших натуральных слагаемых, если два представления, отличающихся хотя бы порядком слагаемых, считать различными.",
        "Решение: Расположим в ряд n шаров. Если мы вставим в некоторые промежутки между шарами перегородки, то n разобьётся на некоторое число слагаемых. Поскольку мест для перегородок n – 1,  возможностей вставить перегородки 2n–1 (см. зад. 34931). Но этот результат учитывает также случай, когда перегородки вообще не вставляются. Этот случай по условию следует исключить."
    ],
    "64948": [
        "Турниры и турнирные таблицы",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: В круговом шахматном турнире участвовало шесть человек: два мальчика и четыре девочки. Могли ли мальчики по итогам турнира набрать в два раза больше очков, чем девочки? (В круговом шахматном турнире каждый игрок играет с каждым по одной  партии. За победу дается 1 очко, за ничью – 0,5, за поражение – 0).",
        "Решение: В круговом турнире из шести участников разыгрывается 6·5 : 2 = 15 очков, причём каждый участник может набрать не более пяти очков. Если бы мальчики набрали в два раза больше очков, чем девочки, то они набрали 10 очков на двоих, то есть по 5 очков каждый. Но тогда оба должны были выиграть все партии, что невозможно (в личной встрече кто-то из них должен потерять очки).",
        "Ответ: Не могли."
    ],
    "65313": [
        "Дискретное распределение",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: В городе, где живет Рассеянный Ученый, телефонные номера состоят из 7 цифр.  Ученый легко запоминает телефонный номер, если этот номер палиндром, то есть он одинаково читается слева направо и справа налево. Например, номер 4435344  Ученый запоминает легко, потому что этот номер палиндром. А номер 3723627 не палиндром, поэтому Ученый такой номер запоминает с трудом. Найдите вероятность того, что телефонный номер нового случайного знакомого Ученый запомнит легко.",
        "Решение: Как известно, первая цифра телефонного номера может быть не всякой. Пусть число разрешённых первых цифр равно m. Тогда общее число номеров равно m·106. Легкий номер (тот, который запоминается легко) однозначно определяется первыми четырьмя цифрами. Значит, семизначных палиндромов всего m·103.    Поэтому вероятность того, что случайно взятый номер окажется лёгким, равна",
        "Ответ: 0,001."
    ],
    "65767": [
        "Дискретное распределение",
        "Сложность: 3",
        "Классы: 6,7,8,9,10,11",
        "Условие: Василий Петров выполняет задание по английскому языку. В этом задании есть 10 английских выражений и их переводы на русский в случайном порядке. Нужно установить верные соответствия между выражениями и их переводами. За каждое правильно установленное соответствие даётся 1 балл. Таким образом, можно получить от 0 до 10 баллов. Вася ничего не знает, поэтому выбирает варианты наугад. Найдите вероятность того, что он получит ровно 9 баллов.",
        "Решение: Если угадано девять верных ответов, то десятый ответ тоже будет верным. Значит, искомая вероятность равна нулю.",
        "Ответ: 0."
    ],
    "65783": [
        "Дискретное распределение",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Дана таблица 3×3 (как для игры в крестики-нолики). В четыре случайно выбранные ячейки случайным образом поставили четыре фишки.   Найдите вероятность того, что среди этих четырёх фишек найдутся три, которые стоят в один ряд по вертикали, по горизонтали или по диагонали.",
        "Решение: Всего возможных расстановок . Расстановки, где занята вертикаль,   горизонталь или диагональ, легко пересчитать: их 8·6 = 48. В силу случайности и равновозможности расстановок искомая вероятность равна 48/126 = 8/21.",
        "Ответ: 8/21."
    ],
    "65891": [
        "Объединение, пересечение и разность множеств",
        "Сложность: 3",
        "Классы: 5,6",
        "Условие: У каждого из тридцати шестиклассников есть одна ручка, один карандаш и одна линейка. После их участия в олимпиаде оказалось, что 26 учеников потеряли ручку, 23 – линейку и 21 – карандаш. Найдите наименьшее возможное количество шестиклассников, потерявших все три предмета.",
        "Решение: Из условия следует, что у четырёх шестиклассников есть ручка, у семи – линейка и у девяти – карандаш. Таким образом, обладать хотя бы одним предметом могут не более чем 4 + 7 + 9 = 20 человек. А значит, не менее чем 30 – 20 = 10 человек потеряли все три предмета.     Все три предмета потеряют ровно 10 человек, если каждый из остальных двадцати потеряет ровно два предмета.",
        "Ответ: 10 шестиклассников."
    ],
    "30734": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: Сколько ожерелий можно составить из пяти одинаковых красных бусинок и двух одинаковых синих бусинок?",
        "Подсказка: Сколько красных бусинок может быть между двумя синими?",
        "Ответ: 3 ожерелья."
    ],
    "73608": [
        "Сочетания и размещения",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: На лотерейном билете требуется отметить 8 клеточек из 64. Какова вероятность того, что после розыгрыша, в котором также будет выбрано 8 каких-то клеток из 64 (все такие возможности равновероятны), окажется, что угаданы     а) ровно 4 клетки?  б) ровно 5 клеток?  в) все 8 клеток?",
        "Решение: 8 клеток из 64 могут быть выбраны  способами. Следовательно, вероятность того, что выпадет какой-то один определённый способ, равна  Число случаев, в которых оказались угаданными ровно k клеток равно числу способов, при которых выбираются k клеток из 8 отмеченных и 8 – k клеток из 56 неотмеченных, то есть    Таким образом, вероятность угадать ровно k клеток равна",
        "Ответ: а)"
    ],
    "76433": [
        "Раскладки и разбиения",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Сколькими различными способами можно разложить натуральное число n на сумму трёх натуральных слагаемых? Два разложения, отличающиеся порядком слагаемых, считаются различными.",
        "Решение: Первый способ. Пусть n = x + y + z. Число x может быть равно 1, 2, 3, ..., n – 2. При фиксированном x число y может принимать одно из  n – x – 1 значений. Всего получаем (n – 2) + (n – 3) + ... + 1 = ½ (n – 1)(n – 2) вариантов.",
        "Ответ: ½ (n – 1)(n – 2) способами."
    ],
    "76510": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Даны 6 цифр: 0, 1, 2, 3, 4, 5. Найти сумму всех четырёхзначных чётных чисел,  которые можно написать этими цифрами (одна и та же цифра в числе может  повторяться).",
        "Решение: Будем отдельно подсчитывать сумму тысяч, сотен, десятков и единиц для  рассматриваемых чисел. На первом месте может стоять любая из пяти цифр  1, 2, 3, 4, 5. Количество всех чисел с фиксированной первой цифрой равно  6·6·3 = 108, поскольку на втором и третьем месте может стоять любая из шести цифр, а на четвёртом месте – любая из трёх цифр 0, 2, 4. Поэтому сумма тысяч равна (1 + 2 + 3 + 4 + 5)·108·1000 = 1620000. Количество чисел с фиксированной второй цифрой равно 5·6·3 = 90 (на первом месте стоит любая из пяти цифр). Поэтому сумма сотен равна",
        "Ответ: 1769580."
    ],
    "77985": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3",
        "Классы: 9",
        "Условие: На окружности даны точки A1, A2,..., A16. Построим все возможные выпуклые многоугольники, вершины которых находятся среди точек A1, A2,..., A16. Разобьём эти многоугольники на две группы. В первую группу будут входить все многоугольники, у которых A1 является вершиной. Во вторую группу входят все многоугольники, у которых A1 в число вершин не входит. В какой группе больше многоугольников?",
        "Решение: Каждому многоугольнику, не имеющего вершины A1, сопоставим многоугольник с вершиной A1, просто добавив A1 к его вершинам. Обратная операция (отбрасывание вершины A1) невозможна для треугольников.",
        "Ответ: В первой."
    ],
    "78097": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: От",
        "Решение: Если число слева составлено из цифр a, b, c, то число слева составлено из цифр  a1 = 9 – a, b1 = 9 – b и c1 = 9 – c. Если a = b = c, то требуемое условие выполняется. Таких столбов ровно 10.    Пусть теперь среди цифр a, b, c есть ровно две различных. Среди цифр a1, b1, c1 будут в точности те же самые две цифры тогда и только тогда, когда эти две цифры в сумме дают 9. Таких пар цифр 5: (0, 9), (1, 8), (2, 7), (3, 6) и (4, 5). Трёхзначных чисел, записывающихся двумя данными цифрами ровно шесть: три из них записываются двумя цифрами a и одной цифрой b, а ещё три – одной цифрой a и двумя цифрами b. Так мы получаем ещё 5·6 = 30 столбов.",
        "Ответ: 40 столбов."
    ],
    "88137": [
        "Объединение, пересечение и разность множеств",
        "Сложность: 3",
        "Классы: 5,6,7",
        "Условие: В детский сад завезли карточки для обучения чтению: на некоторых написано МА, на остальных – НЯ. Каждый ребёнок взял три карточки и стал составлять из них слова. Оказалось, что слово МАМА могут сложить из своих карточек 20 детей, слово НЯНЯ – 30 детей, а слово МАНЯ – 40 детей. У скольких ребят все три карточки одинаковы?",
        "Подсказка: Заметьте, что карточек у каждого ребёнка три 3, а различных надписей на них — две.",
        "Решение: Поскольку у каждого ребёнка по три карточки, а надписей всего две, то обязательно две надписи должны совпадать, то есть каждый может сложить либо слово МАМА (таких детей 20), либо слово НЯНЯ (таких детей 30). Значит, всего детей 50. Если у ребёнка все три карточки одинаковы, то он не сможет сложить слово МАНЯ (а таких было 40). Значит, три одинаковые карточки у 50 – 40 = 10 детей.",
        "Ответ: У 10 детей."
    ],
    "89950": [
        "Периодичность и непериодичность",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: В старой усадьбе дом обсажен по кругу высокими деревьями – елями, соснами и березами. Всего деревьев 96. Эти деревья обладают странным свойством: из двух деревьев, растущих через одно от любого хвойного – одно хвойное, а другое лиственное, и из двух деревьев, растущих через три от любого хвойного – тоже одно хвойное, а другое лиственное. Сколько берёз посажено вокруг дома?",
        "Подсказка: Заметьте, что услови наложено на деревья одной чётности.",
        "Решение: Уберём мысленно половину деревьев – посаженных через одно. Тогда останется 48 деревьев, а условие станет таким: из двух деревьев, растущих рядом с хвойным, – одно хвойное, а другое берёза, и из двух деревьев, растущих через одно от хвойного, – тоже одно хвойное, а другое берёза.    Рассмотрим одно из посаженных хвойных деревьев. Назовём его деревом 1 и занумеруем все деревья по порядку. Если дерево 1 хвойное, то из деревьев 48 и 2 – одно хвойное, другое – берёза. Будем для определенности считать, что дерево 2 – берёза, а 48 – хвойное. Рассмотрим дерево 48. Рядом с ним – дерево 1 (хвойное) и 47 (значит, 47 – берёза). Через одно дерево от 1 – 47 (берёза) и 3 (значит, 3 – хвойное). У дерева 3 два соседа – 2 (берёза) и 4 (хвойное). Теперь ясно, что все время повторяется группа из трёх деревьев – БХХ – берёза и два хвойных. Всего деревьев 48, значит, эта группа повторится 16 раз.    Аналогично вычисляется число берёз в оставшейся половине деревьев – их тоже 16. Итак, вокруг замка посажено 32 берёзы.",
        "Ответ: 32 берёзы."
    ],
    "108978": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Найти такое трёхзначное число, удвоив которое, мы получим число, выражающее количество цифр, необходимое для написания всех последовательных целых чисел от единицы до этого искомого трёхзначного числа (включительно).",
        "Решение: Пусть x – искомое число. Однозначных чисел всего 9, двузначных – 90, трёхзначных чисел до x включительно – x – 99. Количество цифр, необходимое для написания всех последовательных чисел от 1 до x, равно 9 + 2·90 + 3·(x – 99) = 3x – 108. Получим уравнение 2x = 3x – 108, откуда x = 108.",
        "Ответ: 108."
    ],
    "109436": [
        "Количество и сумма делителей числа",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Найдите все нечётные натуральные числа, большие 500, но меньшие 1000, у каждого из которых сумма последних цифр всех делителей (включая 1 и само число) равна 33.",
        "Решение: У нечётного числа все делители – нечётные. Так как сумма их последних цифр нечётна, то делителей должно быть нечётное количество. Если число имеет нечетное количество делителей, то оно является квадратом натурального числа (см. задачу 30365). Рассмотрим все квадраты нечётных чисел, лежащие в указанном промежутке: 23², 25² = 625, 27² = 729, 29², 31². Заметим, что у искомого числа должно быть не менее пяти делителей, иначе сумма их последних цифр не больше 27. Это означает, что из дальнейшего перебора можно исключить квадраты простых чисел 23, 29 и 31, которые имеют ровно три делителя. Тогда остается проверить два числа. Делители числа 625: 1, 5, 25, 125, 625; сумма их последних цифр равна 21. Делители числа 729: 1, 3, 9, 27, 81, 243, 729; сумма их последних цифр равна 33.",
        "Ответ: 729."
    ],
    "30708": [
        "Правило произведения",
        "Сложность: 2+",
        "Классы: 6,7",
        "Условие: Человек имеет 10 друзей и в течение нескольких дней\tприглашает некоторых из них в гости так, что компания ни разу не повторяется (в какой-то из дней он может не приглашать никого). Сколько дней он может так делать?",
        "Решение: Первый способ. Для каждого из 10 друзей есть две возможности: его можно пригласить или не пригласить. Значит, всего вариантов выбрать группу друзей 210.",
        "Ответ: 1024 дня."
    ],
    "115450": [
        "Арифметика. Устный счет и т.п.",
        "Сложность: 3",
        "Классы: 7,8,9,10",
        "Условие: Из ряда натуральных чисел вычеркнули все числа, которые являются квадратами или кубами целых чисел.",
        "Решение: Рассмотрим первую сотню натуральных чисел. Среди этих чисел десять квадратов (от 1 до 10² = 100) и четыре куба (от 1 до 4³ = 64). Учтем, что два из этих чисел, а именно, 1 и 64 являются одновременно квадратами и кубами. Таким образом, из первой сотни вычеркнули 12 чисел. Среди следующих двенадцати чисел нет ни квадратов, ни кубов (11² = 121, 5³ = 125), следовательно, среди оставшихся чисел на сотом месте стоит число 112.",
        "Ответ: 112."
    ],
    "61385": [
        "Классические неравенства (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Докажите, что если  a1 ≥ a2 ≥ ... ≥ an, b1 ≥ b2 ≥ ... ≥ bn,  то наибольшая из сумм вида  a1bk1 + a2bk2 + ... + anbkn    (k1, k2, ..., kn – перестановка чисел   1, 2, ..., n), это сумма  a1b1 + a2b2 + ... + anbn,  а наименьшая – сумма  a1bn + a2bn–1 + ... + anb1.",
        "Решение: Заметим, что если x ≥ y, z ≥ w, то  xz + yw ≥ xw + yz.  Действительно,  (xz + yw) – (xw + yz) = (x – y)(z – w) ≥ 0.    Рассмотрим в сумме  a1bk1 + a2bk2 + ... + anbkn  член ajb1, содержащий множитель b1. Если j > 1, то, заменив  aj–1bkj–1 + ajb1    на  aj–1b1 + ajbkj–1, мы не уменьшим сумму. Так можно продолжать, пока множитель b1 не перейдёт в первое слагаемое. Затем поступим так же с множителем b2 и т. д. В конце концов мы превратим нашу сумму в  a1b1 + a2b2 + ... + anbn,  не  уменьшив её.    Аналогично доказывается, что сумма  a1bn + a2bn–1 + ... + anb1  – наименьшая."
    ],
    "60315": [
        "Индукция (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: а) Головоломка Ханойская башня представляет собой восемь дисков, нанизанных в порядке уменьшения размеров на один из трёх колышков. Требуется переместить всю башню на другой колышек, перенося каждый раз только один диск и не помещая больший диск на меньший. Докажите, что головоломка имеет решение. Какой способ будет оптимальным (по числу перекладываний дисков)?",
        "Решение: а) Пусть минимальное число шагов для перемещения башни из n дисков равно Kn. Выразим Kn+1 через Kn.    Рассмотрим башню из n + 1 диска. Разобьём всю процедуру на три этапа.    Этап 1 – от начала до первого перемещения нижнего диска. В конце этого этапа стоящая на нижнем диске башня из n дисков должна переместиться на один из свободных колышков (колышек, на который следующим шагом должен переместиться нижний диск, должен быть свободен). Нижний диск в этих перемещениях не участвует, следовательно, для этого необходимо (и достаточно) Kn шагов.    Этап 2 – от первого до последнего перемещения нижнего диска. Одного шага достаточно: после первого перемещения нижний диск можно больше не трогать.    Этап 3 – после последнего перемещения нижнего диска. В начале этого этапа колышек, с которого перед этим был снят нижний диск, свободен. Значит, на третьем колышке стоит башня из n дисков, и ее надо переместить на нижний диск. Для такого перемещения также нужно Kn шагов.    Итак, Kn+1 = Kn + 1 + Kn = 2Kn + 1 (выше показано, что меньшим числом шагов обойтись нельзя, а такого количества достаточно).    Поскольку K1 = 1, мы можем последовательно вычислить K2, K3, ..., K8.    Нетрудно вывести и общую формулу: записав полученное соотношение в виде Kn+1 + 1 = 2(Kn + 1), имеем Kn + 1 = 2n–1(K1 + 1) = 2n.",
        "Ответ: а) Самый короткий способ содержит 28 – 1 = 255 перекладываний."
    ],
    "60413": [
        "Треугольник Паскаля и бином Ньютона",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Докажите тождества:",
        "Решение: а) Пусть нам из r человек надо выбрать комиссию в составе m человек, а внутри неё – штаб из k человек. Если сначала выбрать членов комиссии, а из них выбирать штаб, то подсчёт числа способов это сделать приведёт по правилу произведения к левой части равенства. Но можно поступить по-другому: сначала выбрать штаб, а потом из оставшихся r – k человек выбрать m – k простых членов комиссии. Тогда подсчёт приведёт к правой части равенства."
    ],
    "60414": [
        "Треугольник Паскаля и бином Ньютона",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите равенство",
        "Решение: ="
    ],
    "60418": [
        "Теория графов (прочее)",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: В компании из 10 человек произошло 14 попарных ссор. Докажите, что все равно можно составить компанию из трёх друзей.",
        "Решение: Общее число способов выбрать компанию из трёх человек равно   Каждая ссора разрушает не более восьми таких компаний, поэтому число разрушенных компаний не больше 8·14 = 112. Значит осталось по крайней мере 8 дружных компаний."
    ],
    "60441": [
        "Формула включения-исключения",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: В классе 30 учеников. Сколькими способами они могут пересесть так, чтобы ни один не сел на своё место?",
        "Решение: Всего есть 30! перестановок учеников. Обозначим через Ak множество перестановок, в которых k-й ученик сидит на своём месте. Очевидно, что Ak состоит из 29! перестановок. Пересечение любых m из 30 множеств Ak состоит из (30 – m)! перестановок, а всего таких пересечений . По формуле включения-исключения количество перестановок, в которых хотя бы один ученик сидит на своём месте, (то есть мощность множества  A1 ∪ ... ∪ A30)  равно",
        "Ответ: способами."
    ],
    "30722": [
        "Сочетания и размещения",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Сколькими способами можно разрезать ожерелье, состоящее из 30  различных бусин на 8 частей (резать можно только между бусинами)?",
        "Решение: Нужно указать 8 мест из 30, в которых будут произведены разрезы.",
        "Ответ: способами."
    ],
    "64517": [
        "Четность и нечетность",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: В ряд выписаны несколько нулей и единиц. Рассмотрим пары цифр в этом ряду (не только соседних), где левая цифра равна 1, а правая 0. Пусть среди этих пар ровно M таких, что между единицей и нулем этой пары стоит чётное число цифр, и ровно N таких, что между единицей и нулем этой пары стоит нечётное число цифр. Докажите, что M ≥ N.",
        "Решение: Если в ряду есть две единицы подряд, вычеркнем их. При этом разность M – N не изменится: число чётных пар с одной единицей равно числу нечётных пар с другой; а на чётности пар, куда эти единицы не входят, это не повлияет. Также можно стереть и два нуля, стоящих подряд. Продолжая эти стирания, мы придём к ряду (возможно, пустому), где нули и единицы чередуются. Но у такого ряда N = 0."
    ],
    "64556": [
        "Системы точек и отрезков (прочее)",
        "Сложность: 3+",
        "Классы: ",
        "Условие: На окружности отмечено 20 точек. Сколько существует таких троек хорд с концами в этих точках, что каждая хорда пересекает две остальные (возможно, в концах)?",
        "Решение: Концами хорд в тройке могут являться 3, 4, 5 или 6 точек. Разберём эти случаи.    1) Концами хорд являются 3 точки (см. рис.). Их можно выбрать  способами. Соединить каждую тройку точек хордами попарно можно единственным способом.",
        "Ответ: 156180."
    ],
    "64595": [
        "Системы точек и отрезков. Примеры и контрпримеры",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На плоскости нарисовали 10 равных отрезков и отметили все их точки пересечения. Оказалось, что каждая точка пересечения делит любой проходящий через неё отрезок в отношении 3 : 4. Каково наибольшее возможное число отмеченных точек?",
        "Решение: На каждом отрезке расположено не более двух точек. С другой стороны, каждая точка пересечения принадлежит не менее чем двум отрезкам. Поэтому точек не более чем 10·2 : 10 = 10.  Пример с 10 точками см. на рисунке.",
        "Ответ: 10 точек."
    ],
    "65185": [
        "Правило произведения",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Прямоугольный параллелепипед размером m×n×k   разбит на единичные кубики. Сколько всего образовалось параллелепипедов (включая исходный)?",
        "Решение: На трёх ребрах данного параллелепипеда, исходящих из одной вершины, образовалось m + 1, n + 1 и k + 1 точка разбиения соответственно (включая концы). Далее можно рассуждать по-разному.",
        "Ответ: &frac18; mnk(m + 1)(n + 1)(k + 1)."
    ],
    "65289": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Монету бросают 10 раз. Найдите вероятность того, что ни разу не выпадут два орла подряд.",
        "Решение: Общее число исходов при десяти бросаниях монеты равно 210. Найдём число комбинаций, где нет двух орлов подряд.",
        "Ответ: 9/64."
    ],
    "65482": [
        "Системы точек и отрезков (прочее)",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: На плоскости проведены n прямых так, что каждые две пересекаются, но никакие четыре через одну точку не проходят. Всего имеются 16 точек пересечения, причём через 6 из них проходят по три прямые. Найдите n.",
        "Решение: Пошевелим данную конструкцию таким образом, чтобы по-прежнему каждые две прямые пересекались, но никакие три не проходили через одну точку. Тогда, если какие-то три прямые пересекались в некоторой точке О, то теперь вместо одной точки О появятся три точки попарного пересечения этих прямых. Значит, в результате шевеления исходное количество прямых не изменится, а количество точек пересечения увеличится на 2·6 = 12. В итоге, все прямые будут пересекаться попарно, а точек пересечения станет 16 + 12 = 28. Таким образом, ½ n(n – 1) = 28, откуда n = 8.",
        "Ответ: n"
    ],
    "65494": [
        "Текстовые задачи (прочее)",
        "Сложность: 3+",
        "Классы: 5,6,7",
        "Условие: Из 101 далматинца у 29 пятно только на левом ухе, у 17 – только на правом ухе, а у 22 далматинцев нет пятен на ушах.   Сколько далматинцев имеют пятно на правом ухе?",
        "Решение: Достаточно из 101 вычесть количество далматинцев, у которых пятно только на левом ухе, и количество тех, у кого пятен нет совсем:   101 – 22 – 29 = 50.",
        "Ответ: 50 далматинцев."
    ],
    "30738": [
        "Правило произведения",
        "Сложность: 2+",
        "Классы: 6,7",
        "Условие: Сколько различных четырёхзначных чисел, делящихся на 4, можно составить из цифр 1, 2, 3 и 4,     а) если каждая цифра может встречаться только один раз?    б) если каждая цифра может встречаться несколько раз?",
        "Подсказка: Переберите возможные варианты двух последних цифр.",
        "Ответ: а) 2·3 = 6 чисел;  б) 42·4 = 64 числа."
    ],
    "76531": [
        "Комбинаторная геометрия (прочее)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Автобусная сеть города устроена следующим образом:     1) с каждой остановки на любую другую остановку можно попасть без пересадки;     2) для каждой пары маршрутов найдётся, и притом единственная, остановка, на которой можно пересесть с одного из этих маршрутов на другой;     3) на каждом маршруте ровно три остановки.   Сколько автобусных маршрутов в городе? (Известно, что их больше одного.)",
        "Решение: Пусть a – один из маршрутов, B – остановка, через которую маршрут a не проходит. Каждый маршрут, проходящий через B, пересекает маршрут a. При этом два разных маршрута, проходящих через B, пересекают a по разным остановкам (иначе они имели бы две общие остановки, что противоречит условию 2). Поэтому через B проходит ровно три маршрута.     На каждом из них есть по две остановки, отличных от B. Значит, всего в городе 7 остановок. Через каждую пару остановок (а их 21) проходит единственный маршрут, при этом на каждом маршруте – три пары остановок. Следовательно, всего маршрутов 21 : 3 = 7.",
        "Ответ: 7 маршрутов."
    ],
    "30744": [
        "Правило произведения",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Сколько существует целых чисел от 0 до 999999, в десятичной записи которых нет двух стоящих рядом одинаковых цифр?",
        "Подсказка: Количество n-значных чисел с таким свойством равно 9n: на первом месте может стоять любая из 9 цифр (все, кроме 0), на втором – тоже (все, кроме первой) и т. д.",
        "Ответ: число."
    ],
    "116856": [
        "Турниры и турнирные таблицы",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Десять футбольных команд сыграли каждая с каждой по одному разу. В результате у каждой команды оказалось ровно по х очков.   Каково наибольшее возможное значение х? (Победа – 3 очка, ничья – 1 очко, поражение – 0.)",
        "Решение: Оценка. В каждом матче разыграно либо 3, либо 2 очка. Всего было сыграно 10·9 : 2 = 45 матчей, значит, разыграно не более, чем 135 очков. Таким образом, 10х ≤ 135, то есть х ≤ 13,5. Так как х – целое число, то х ≤ 13.     Пример. Расположим команды по кругу и разобьём их последовательно на 5 пар. Пусть команды каждой пары сыграли между собой вничью, каждая из них выиграла у четырёх команд, следующих за данной парой по часовой стрелке, а остальным командам проиграла. Тогда каждая команда набрала ровно 13 очков.",
        "Ответ: 13."
    ],
    "78294": [
        "Делимость чисел. Общие свойства",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: В окружность вписан неправильный n-угольник, который при повороте окружности около центра на некоторый угол α ≠ 2π  совмещается сам с собой. Доказать, что n – число составное.",
        "Решение: Предположим, что n – простое число. Рассмотрим орбиту каждой вершины, т. е. множество точек, в которые переходит вершина при поворотах,  переводящих n-угольник в себя. Все орбиты состоят из одного количества вершин – их столько, сколько геометрически различных углов поворота, совмещающих n-угольник с собой. Из этого следует, что орбита одна, поскольку n – простое. Но тогда каждые две вершины можно совместить поворотом, а значит, все стороны и все углы многоугольника равны, то есть n-угольник – правильный. Противоречие."
    ],
    "64544": [
        "Инварианты",
        "Сложность: 4",
        "Классы: ",
        "Условие: Двадцать пять монет раскладывают по кучкам следующим образом. Сначала их произвольно разбивают на две группы. Затем любую из имеющихся групп снова разбивают на две группы, и так далее до тех пор, пока каждая группа не будет состоять из одной монеты. При каждом разбиении какой-либо группы на две записывается произведение количеств монет в двух получившихся группах. Чему может быть равна сумма всех записанных чисел?",
        "Решение: Первый способ. Изобразим монеты точками и соединим каждую пару точек отрезком. Получим 25(25 – 1) : 2 = 300 отрезков. При каждом разбиении одной группы монет на две будем стирать все отрезки, соединяющие точки, соответствующие монетам, оказавшимся в разных группах. Пусть на некотором шаге мы разбили монеты одной из уже имевшихся групп на две группы по x и y монет. Тогда мы стираем xy отрезков. Это же число мы записываем. Таким образом, сумма записанных чисел – это количество всех стёртых отрезков. Так как изначально было 300 отрезков, а в итоге все отрезки стёрты, то общее количество стёртых отрезков равно 300.",
        "Ответ: 300."
    ],
    "65769": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 7,8,9,10,11",
        "Условие: В выпуклом шестиугольнике независимо друг от друга выбраны две случайные диагонали.   Найдите вероятность того, что эти диагонали пересекаются внутри шестиугольника (внутри – то есть не в вершине).",
        "Решение: Всего у шестиугольника девять диагоналей и, значит, 9·8 : 2 = 36 пар диагоналей. Осталось понять, сколько пар диагоналей пересекается внутри шестиугольника. Диагонали у шестиугольника бывают двух видов: главные (соединяют противоположные вершины) и неглавные. Например, диагональ AC – неглавная (см. рис.). Всего неглавных диагоналей 6, и каждая пересекает 3 другие диагонали. Главных диагоналей (таких, как AD) всего три штуки, и каждая пересекает четыре другие диагонали. Всего получается (см. рис.) (6·3 + 3·4) : 2 = 15 пар пересекающихся диагоналей.",
        "Ответ: 5/12."
    ],
    "65770": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 7,8,9,10,11",
        "Условие: Стрелок стреляет по трём мишеням до тех пор, пока не собьёт все. Вероятность попадания при одном выстреле равна p.     a) Найдите вероятность того, что потребуется ровно 5 выстрелов.     б) Найдите математическое ожидание числа выстрелов.",
        "Решение: а) Искомое событие наступает, только если четыре первых выстрела дали две сбитые мишени, а последний выстрел был удачным. Вероятность этого равна",
        "Ответ: а)  6p³(1 – p)²;  б) 3/p."
    ],
    "30748": [
        "Сочетания и размещения",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Найдите число прямоугольников, составленных из клеток доски с m горизонталями и n вертикалями, которые содержат клетку с координатами (p, q).",
        "Подсказка: Каждый прямоугольник однозначно определяется своим левым нижним и правым верхним углами.",
        "Ответ: pq(n – p + 1)(m – q + 1)."
    ],
    "65779": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Каждую пятницу десять джентльменов приходят в клуб, и каждый отдает швейцару свою шляпу. Каждая шляпа точно впору своему хозяину, но двух одинаковых по размеру шляп нет. Уходят джентльмены по одному в случайном порядке.     Провожая очередного джентльмена, швейцар клуба пробует надеть ему на голову первую попавшуюся шляпу. Если налезает, джентльмен уходит в этой шляпе. Если мала, то швейцар пробует следующую случайную шляпу из оставшихся. Если все оставшиеся шляпы оказались малы, швейцар говорит бедняге: Сэр, сегодня шляпа вам не к лицу, и джентльмен отправляется домой с непокрытой головой. Найдите вероятность того, что в следующую пятницу у швейцара не останется ни одной шляпы.",
        "Решение: Пусть джентльменов n. Занумеруем их в порядке возрастания размеров их шляп номерами от 1 до n. Шляп не останется, только если каждый забрал свою же шляпу. Обозначим вероятность этого pn. Если первым уходит k-й джентльмен (вероятность этого 1/n), то вероятность получить свою шляпу у него равна 1/n–k+ 1 (поскольку своя шляпа – единственная среди n – k + 1 подходящих этому джентльмену). Если это случилось, то вероятность того, что все оставшиеся заберут свои же шляпы, равна pn–1. По формуле полной вероятности получаем    где  Hn = 1 + ½ + ... + 1/n – n-е гармоническое число. Учитывая, что p1 = 1 (если джентльмен только один, то он обязательно возьмёт свою шляпу), получаем       Подставляя n = 10, получаем  p10 = 1/10!·(1 + ½)(1 + ½ + &frac13;)...(1 + ½ + ... + 1/10) ≈ 0,000516. Вычисление можно легко провести с помощью калькулятора или компьютера.",
        "Ответ: ≈ 0,000516."
    ],
    "76535": [
        "Комбинаторная геометрия (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: В городе 57 автобусных маршрутов. Известно, что:     1) с каждой остановки на любую другую остановку можно попасть без пересадки;     2) для каждой пары маршрутов найдётся, и притом только одна, остановка, на  которой можно пересесть с одного из этих маршрутов на другой;     3) на каждом маршруте не менее трёх остановок.   Сколько остановок имеет каждый из 57 маршрутов?",
        "Решение: Пусть на каком-то маршруте a ровно n остановок. Возьмём остановку B, через которую a не проходит. Из B есть маршрут в каждую из n остановок маршрута a, причём такой маршрут ровно один, поскольку два разных маршрута не могут иметь двух общих остановок. Каждый маршрут, проходящий через B, пересекает маршрут a. Поэтому через B проходит ровно n маршрутов.     Теперь ясно, что любой маршрут b, не проходящий через остановку B, имеет ровно n остановок. Действительно, как и выше, число остановок на нём равно числу маршрутов, проходящих через B.    Рассмотрим произвольную точку A маршрута a, возьмём на маршруте AB остановку C, отличную от A и B, и проведём через неё маршрут c, отличный от AB. Маршрут c не проходит через B, следовательно, на нём n остановок. Остановка A не лежит на c, поэтому, как показано выше, через A проходит n маршрутов (включая a). То же верно для каждой точки маршрута a.    &nbsp Значит, через точки маршрута a проходит всего n(n – 1) маршрутов, отличных от a, и ещё сам маршрут a. А это – все маршруты города.     Решая уравнение n(n – 1) + 1 = 57, находим, что n = 8.",
        "Ответ: 8 остановок."
    ],
    "78500": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: В правильном десятиугольнике провели все диагонали. Сколько попарно неподобных треугольников имеется на этом рисунке?",
        "Решение: Зафиксируем одну из сторон. Нетрудно понять, что все диагонали и стороны десятиугольника образуют с ней углы, кратные 18°. Поэтому углы всех образованных треугольников кратны 18°. Следовательно, искомое количество треугольников не больше количества способов представить число 10 в виде суммы трех натуральных чисел с точностью до порядка слагаемых. Всего таких способов 8: 1 + 1 + 8, 1 + 2 + 7, 1 + 3 + 6, 1 + 4 + 5, 2 + 2 + 6, 2 + 3 + 5,   2 + 4 + 4, 3 + 3 + 4.     Каждый такой способ легко реализовать, разбив стороны десятиугольника на три соответствующие группы и соединив разделяющие эти группы вершины.",
        "Ответ: 8 треугольников."
    ],
    "78604": [
        "Уравнения в целых числах",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Остап Бендер организовал в городе Фуксе раздачу слонов населению. На раздачу  явились 28 членов профсоюза и 37 не членов, причём Остап раздавал слонов  поровну всем членам профсоюза и поровну – не членам. Оказалось, что  существует лишь один способ такой раздачи (так, чтобы раздать всех слонов). Какое наибольшее число слонов могло быть у О. Бендера? (Предполагается, что каждому из пришедших достался хотя бы один слон.)",
        "Решение: Пусть Бендер как-то распределил слонов между двумя указанными группами. Чтобы осуществить другой способ раздачи, ему придётся отнять у каждого члена одной группы по равному числу слонов и раздать их поровну членам другой группы. Поэтому общее число слонов, переданных из одной группы в другую, кратно как 37, так и 28. Эти числа взаимно просты, поэтому указанное число слонов кратно 28·37 = 1036.    Если общее число слонов больше 2·1036 = 2072, то хотя бы у одной группы слонов больше 1036, и можно, отобрав их, раздать членам другой группы. Если же общее число слонов равно 2072, то, раздав каждой группе по 1036 слонов (при этом члены профсоюза получат по 37, а не члены – по 28 слонов), мы осуществим единственную возможную раздачу: ни у одной из групп нельзя отнять всех слонов.",
        "Ответ: 2072 слона."
    ],
    "34862": [
        "Сочетания и размещения",
        "Сложность: 2+",
        "Классы: 8,9,10",
        "Условие: В парламенте 30 депутатов. Каждые два из них либо дружат, либо враждуют, причём каждый дружит ровно с шестью другими. Каждые три депутата образуют комиссию. Найдите общее число комиссий, в которых все три члена попарно дружат или все трое попарно враждуют.",
        "Подсказка: В скольких комиссиях состоит депутат? В скольких комиссиях оставшиеся два члена – друг и враг депутата?",
        "Решение: Обозначим депутатов точками. Соединим точки красным отрезком, если cоответствующие депутаты дружат, и синим – если враждуют.  Нам нужно найти число одноцветных треугольников с вершинами в данных точках. Число всех треугольников равно     Подсчитаем сначала число неодноцветных треугольников. В каждом таком треугольнике ровно два угла, в которых сходятся красный и синий отрезки (назовем такие углы разноцветными). В одноцветных треугольниках разноцветных углов нет. В каждой вершине по условию сходятся   6 красных и 23 синих отрезка, то есть имеется 6·23 = 138 разноцветных углов с фиксированной вершиной. Общее количество неодноцветных треугольников, таким образом, равно 138·30:2 = 2070. А число одноцветных треугольников равно 4060 – 2070 = 1990.",
        "Ответ: 1990 комиссий."
    ],
    "30804": [
        "Планарные графы. Формула Эйлера",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Каждое ребро полного графа с 11 вершинами покрашено в один из двух цветов: красный или синий.   Докажите, что либо красный, либо синий граф не является плоским.",
        "Решение: Пусть оба эти графа – плоские. Тогда у них вместе не более, чем (3·11 – 6) + (3·11 – 6) = 54 ребра (см. задачу 30799). Однако в полном графе с 11 вершинами 55 ребер. Противоречие."
    ],
    "35166": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: На собеседовании десяти человекам был предложен тест, состоящий из нескольких  вопросов. Известно, что любые пять человек ответили вместе на все вопросы (то есть на каждый вопрос хоть один из пяти дал правильный ответ), а любые четыре – нет. При каком минимальном количестве вопросов это могло быть?",
        "Подсказка: Для каждого вопроса количество людей, не ответивших на него, не больше четырёх.",
        "Решение: По условию для каждой четвёрки людей найдется вопрос, на который они не ответили. С другой стороны, количество людей, не ответивших на этот вопрос, не больше четырёх. Поэтому число вопросов  не меньше числа четвёрок, которые можно выбрать из 10 человек, то есть     Наоборот, если в тесте было 210 вопросов (столько, сколько имеется четвёрок людей), причем на каждый вопрос не ответила своя четвёрка, то условие задачи выполняется.",
        "Ответ: При 210 вопросах."
    ],
    "35804": [
        "Плоскость, разрезанная прямыми",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Архитектор хочет расположить семь высотных зданий так, чтобы, гуляя по городу, можно было увидеть их шпили в любом (циклическом) порядке.   Удастся ли это ему?",
        "Подсказка: Чтобы сменить порядок следования шпилей, пешеход должен пересечь прямую линию, соединяющую некоторые два шпиля. Число возможных циклических порядков следования шпилей равно 6!.",
        "Решение: Число циклических порядков следования шпилей равно 6! (см. задачу 60373). Пусть турист в некоторый момент видит здания в каком-то циклическом порядке. Порядок следования шпилей не изменится, пока турист не пересечет прямую, проходящую через некоторые два шпиля. Проведем прямые через каждую пару шпилей (таких прямых всего 7·6:2 = 21). Эти прямые разобьют плоскость не более, чем на 21·22:2 + 1 = 232 области (см. задачу 60323). Поскольку   232 < 720, не все порядки могут быть увидены.",
        "Ответ: Не удастся."
    ],
    "58106": [
        "Формула включения-исключения",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На плоскости дано n фигур. Пусть Si1...ik – площадь пересечения фигур с номерами   i1, ..., ik, a S – площадь части плоскости, покрытой данными фигурами; Mk – сумма всех чисел Si1...ik. Докажите, что:    а) S = M1 – M2 + M3 – ... + (–1)n + 1Mn;     б) S ≥ M1 - M2 + M3 – ... + (–1)m + 1Mm  при m чётном и       S ≤ M1 – M2 + M3 – ... + (–1)m + 1Mm  при m нечётном.",
        "Решение: а) Обозначим через Wm площадь части плоскости, покрытой ровно m фигурами. Эта часть состоит из кусков, каждый из которых покрыт какими-то определенными m фигурами. Площадь каждого такого куска при вычислении Mk учитывается   раз. Поэтому"
    ],
    "61528": [
        "Раскладки и разбиения",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Докажите, что     Числа Pkl(n) определены в задаче  61525.",
        "Решение: Сумма в условии равна количеству наборов вида {a1, a2, ..., ak}, где 0 ≤ a1 ≤ a2 ≤ ... ≤ ak ≤ l. Поставим в соответствие такому набору подмножество   {a1 + 1, a2 + 2, ..., ak + k} множества {1, 2, ..., l + k}. Нетрудно проверить, что так получаются все подмножества из k элементов указанного множества, причём по одному разу. Следовательно, наших наборов ровно"
    ],
    "76445": [
        "Разные задачи на разрезания",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: На сколько частей разделяют",
        "Решение: Будем поочерёдно проводить диагонали. Когда мы проводим новую диагональ, число  частей, на которые проведённые ранее диагонали делят многоугольник,  увеличивается на",
        "Ответ: На  1/24 n(n – 1)(n – 2)(n – 3) + ½ n(n – 3) + 1  частей."
    ],
    "30322": [
        "Правило произведения",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: Сколькими способами можно заполнить одну карточку в лотерее Спортпрогноз? (В этой лотерее нужно предсказать итог тринадцати спортивных матчей. Итог каждого матча – победа одной из команд либо ничья; счёт роли не играет).",
        "Ответ: 313 способами."
    ],
    "34864": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 2+",
        "Классы: ",
        "Условие: Дан шестизначный номер телефона. Из скольких семизначных номеров его можно получить вычеркиванием одной цифры?",
        "Подсказка: Сколько способов вставить еще одну цифру в номер телефона?",
        "Решение: Пусть ABCDEF – шестизначный номер телефона. Подсчитаем, сколько семизначных номеров можно получить из него добавлением одной цифры. Перед номером можно приписать любую из 10 цифр, однако номер, получающийся приписыванием цифры A, можно также получить, вставив цифру A между A и B.  Этот случай мы учтём позже. Итак, пока мы получили 9 номеров. Аналогично можно получить 9 номеров, вставляя цифру между A и B (число, получаемое вставлением туда цифры B, получим на следующем шаге) между B и C и т. д. Наконец, 10 номеров можно получить, приписывая цифру в конце исходного номера. Таким образом, получаем 6·9 + 10 = 64 номера.",
        "Ответ: Из 64 номеров."
    ],
    "78058": [
        "Системы точек и отрезков. Примеры и контрпримеры",
        "Сложность: 4",
        "Классы: 11",
        "Условие: Имеется 1955 точек. Какое максимальное число троек можно из них выбрать так,  чтобы каждые две тройки имели ровно одну общую точку?",
        "Решение: Выделим одну из троек {A, B, C}. Каждая из остальных троек содержит ровно одну из точек A, B, C. Рассмотрим два случая.    1) Все остальные тройки содержат точку A. Тогда их не больше, чем непересекающихся пар, составленных из 1954 точек, то есть не больше 977. Такое число троек достигается, если разбить 1954 точки на 977 пар и к каждой из них присоединить точку A.    2) Есть тройка {A, D, E}, содержащая A, и тройка, содержащая B. Последняя тройка должна пересекаться с предыдущей – можно считать, что она имеет вид {B, D, F}. Рассмотрим любую тройку, отличную от трёх указанных. Если она содержит A, то она содержит и F (поскольку пересекается с {B, D, F}), поэтому есть не более одной такой тройки. Аналогично есть не более одной дополнительной тройки, содержащей B, (она должна содержать E) и не более одной, содержащей C. Итак, в этом случае троек не больше шести.",
        "Ответ: 977 троек."
    ],
    "35547": [
        "Правило произведения",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Сколькими способами можно прочитать слово строка, двигаясь вправо или вниз?:    С Т Р О К А  Т Р О К А   Р О К А  О К А  К А  А",
        "Подсказка: Если двигаться с первой буквы С, то каждый раз предоставляется две возможности – идти вправо или вниз.",
        "Решение: Ясно, что начать движение можно только с первой буквы C. Каждым ходом мы опускаемся на одну диагональ ниже, и перед перед нами имеется выбор – идти вправо или вниз. При каждой из этих двух возможностей мы вновь опускаемся на диагональ ниже и тем самым продолжаем чтение слова СТРОКА. Таким образом, возможностей прочитать слово СТРОКА столько же, сколько возможностей последовательного пятикратного выбора из двух вариантов, то есть  25 = 32.",
        "Ответ: 32 способами."
    ],
    "35667": [
        "Правило произведения",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Ключом шифра, называемого поворотная решетка, является трафарет, изготовленный из квадратного листа клетчатой бумаги размера n×n (n чётно). Некоторые из клеток вырезаются. Одна из сторон трафарета помечена. При наложении этого трафарета на чистый лист бумаги четырьмя возможными способами (помеченной стороной вверх, вправо, вниз, влево) его вырезы полностью покрывают всю площадь квадрата, причём каждая клетка оказывается под вырезом ровно один раз. Буквы сообщения, имеющего длину n², последовательно вписываются в вырезы трафарета, сначала наложенного на чистый лист бумаги помеченной стороной вверх. После заполнения всех вырезов трафарета буквами сообщения трафарет располагается в следующем положении и т. д. После снятия трафарета на листе бумаги оказывается зашифрованное сообщение.     Найдите число различных ключей для произвольного чётного числа n.",
        "Подсказка: Все клетки квадрата размера n×n разобьём на непересекающиеся группы по четыре клетки, которые совмещаются поворотами вокруг центра квадрата. В ключе-трафарете должна быть вырезана ровно одна клетка из каждой группы.",
        "Решение: Все клетки квадрата размера разобьём на непересекающиеся группы по четыре клетки в каждой. Отнесём клетки к одной и той же группе, если при каждом повороте квадрата до его самосовмещения они перемещаются на места клеток этой же группы. Всего таких групп будет",
        "Ответ: 4n²/4."
    ],
    "60341": [
        "Правило произведения",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Сколько существует шестизначных чисел, делящихся на 5?",
        "Решение: Пятизначных чисел – 90000 (см. решение задачи 60336). К каждому из них, чтобы получить шестизначное число, кратное 5, можно в конце приписать либо 0, либо 5.",
        "Ответ: 180000 чисел."
    ],
    "60378": [
        "Сочетания и размещения",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Сколькими способами можно выбрать четырёх человек на четыре различные должности, если имеется девять кандидатов на эти должности?",
        "Ответ: способами."
    ],
    "60402": [
        "Сочетания и размещения",
        "Сложность: 2+",
        "Классы: 8,9,10",
        "Условие: Сколько существует шестизначных чисел, у которых каждая последующая цифра меньше предыдущей?",
        "Решение: Первый способ. Каждому такому числу однозначно соответствует выбор шести цифр из числа 9876543210.",
        "Ответ: чисел."
    ],
    "60897": [
        "Правило произведения",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Имеются четыре гири и двухчашечные весы без стрелки. Сколько всего различных по весу грузов можно точно взвесить этими гирями, если    а) гири можно класть только на одну чашку весов;    б) гири можно класть на обе чашки весов?",
        "Решение: б) Гири можно разложить на 3 кучки 34 = 81 способом (см. задачу 60348). Первую кучку отложим в сторону, а две остальные положим на чаши весов (случай, когда обе эти кучки пусты, следуен отбросить). Поскольку неважно, на какие чаши попадут эти кучки, 80 следует разделить пополам.",
        "Ответ: а) 2"
    ],
    "65344": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 2+",
        "Классы: 8,9,10,11",
        "Условие: В кабинете министров Анчурии 100 министров. Среди них есть жулики и честные министры. Известно, что из любых десяти министров по крайней мере один министр – жулик. Какое наименьшее число министров-жуликов может быть в кабинете?",
        "Решение: Честных министров не больше чем девять: десятка честных министров противоречит условию.     С другой стороны, наличие ровно девяти честных министров не противоречит условию.",
        "Ответ: 91."
    ],
    "65346": [
        "Сочетания и размещения",
        "Сложность: 2+",
        "Классы: 8,9,10,11",
        "Условие: Квадрат разбит на треугольники (см. рисунок). Сколько существует способов закрасить ровно треть квадрата? Маленькие треугольники нельзя красить частично.",
        "Решение: Закрасить ровно треть квадрата – значит закрасить ровно 6 маленьких треугольников из 18. Это можно сделать  способами.",
        "Ответ: 18564 способов."
    ],
    "30324": [
        "Правило произведения",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: В футбольной команде (11 человек) нужно выбрать капитана и его заместителя.  Сколькими способами это можно сделать?",
        "Решение: Капитаном может стать любой из 11 футболистов. После выбора капитана на роль его заместителя могут претендовать 10 оставшихся человек. Таким образом, всего есть 11·10 = 110 разных вариантов.",
        "Ответ: 110 способами."
    ],
    "88217": [
        "Разложение в произведение транспозиций и циклов",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: В городе Васюки у всех семей были отдельные дома. В один прекрасный день каждая семья переехала в дом, который раньше занимала другая семья. В связи с этим было решено покрасить все дома в красный, синий или зелёный цвет, причём так, чтобы для каждой семьи цвет нового и старого домов не совпадал. Можно ли это сделать?",
        "Решение: Все семьи города можно разбить на замкнутые цепочки, в которых после каждой семьи будет стоять та, в дом которой семья переехала (может быть, будет всего одна  цепочка). В цепочках из чётного числа семей, будем красить дома попеременно в синий и зелёный цвета – тогда каждая семья переедет из синего дома в зелёный или наоборот. А в тех цепочках, где число семей нечётно, покрасим один дом в красный цвет, а оставшееся чётное число домов – попеременно в синий и зелёный. Тогда все дома будут окрашены с выполнением требований задачи.",
        "Ответ: Можно."
    ],
    "102839": [
        "Правило произведения",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: В США дату принято записывать так: номер месяца, потом номер дня и год. В Европе же сначала идёт число, потом  месяц и год. Сколько в году дней, дату которых нельзя прочитать однозначно, не зная, каким способом она написана?",
        "Решение: Очевидно это те дни, у которых число может быть номером месяца, то есть принимает значение от 1 до 12. Таких дней 12·12 = 144. Но те дни, у которых число совпадает с номером месяца, понимаются однозначно. Поэтому искомых дней 144 − 12 = 132."
    ],
    "103809": [
        "Правило произведения",
        "Сложность: 2+",
        "Классы: 7",
        "Условие: Сколькими способами можно прочитать в таблице слово    а) КРОНА,     б) КОРЕНЬ,   начиная с буквы K и двигаясь вправо или вниз?",
        "Подсказка: Запишите каждый путь последовательностью нулей и единиц.",
        "Решение: а) См. задачу 35547.",
        "Ответ: а) 16; б) 32 способами."
    ],
    "30737": [
        "Перестановки и подстановки (прочее)",
        "Сложность: 2+",
        "Классы: 6,7",
        "Условие: Сколькими способами можно построить замкнутую ломаную, вершинами которой являются вершины правильного шестиугольника (ломаная может быть самопересекающейся)?",
        "Подсказка: Задача эквивалентна подсчету количества расстановок шести предметов по кругу. См. задачу 60373.",
        "Ответ: способами."
    ],
    "30723": [
        "Сочетания и размещения",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: 30 человек голосуют по пяти предложениям. Сколькими способами могут распределиться голоса, если каждый голосует только за одно предложение и учитывается лишь количество голосов, поданных за каждое предложение?",
        "Подсказка: Задача эквивалентна задаче о разложении 30 шаров по пяти ящикам. См. 30717 б).",
        "Ответ: = 46376 способами."
    ],
    "32052": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9,10",
        "Условие: Было семь ящиков. В некоторые из них положили еще по семь ящиков (не вложенных друг в друга) и т. д. В итоге стало 10 непустых ящиков.   Сколько всего стало ящиков?",
        "Решение: При каждой операции заполняется один пустой ящик. Поскольку стало 10 непустых ящиков, то было проведено 10 операций. При каждой операции добавлялось по семь ящиков. Поэтому в результате стало 7 + 10·7 = 77 ящиков."
    ],
    "34943": [
        "Сочетания и размещения",
        "Сложность: 3",
        "Классы: ",
        "Условие: План города имеет схему, представляющую собой прямоугольник 5×10 клеток. На улицах введено одностороннее движение: разрешается ехать только вправо и вверх. Сколько есть различных маршрутов, ведущих из левого нижнего угла в правый верхний?",
        "Подсказка: Каждому маршруту сопоставьте  строку из 15 букв П и В (П означает движение на клетку вправо, В – на клетку вверх).",
        "Решение: Каждому маршруту можно сопоставить строку из 15 букв П и В (см. подсказку), причём букв П должно быть ровно 5, а букв В – ровно 10. Наоборот, по каждой такой строке букв можно однозначно восстановить маршрут. Поэтому число маршрутов равно числу таких строк, которое, в свою очередь, равно",
        "Ответ: 3003 маршрута."
    ],
    "60380": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Из двух математиков  и десяти экономистов надо составить комиссию из восьми человек.   Сколькими способами можно составить комиссию, если в неё должен входить хотя бы один математик?",
        "Подсказка: См. задачу",
        "Ответ: способами."
    ],
    "30346": [
        "Перестановки и подстановки (прочее)",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: На танцплощадке собрались N юношей и N девушек. Сколькими способами они могут разбиться на пары для участия в очередном танце?",
        "Подсказка: Зафиксируем девушек. Тогда разбиение на пары определяется перестановкой юношей.",
        "Ответ: N! способами."
    ],
    "60383": [
        "Сочетания и размещения",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На двух параллельных прямых a и b выбраны точки A1, A2, ..., Am и B1, B2, ..., Bn  соответственно и проведены все отрезки вида AiBj   (1 ≤ i ≤ m, 1 ≤ j ≤ n). Сколько будет точек пересечения, если известно, что никакие три из этих отрезков в одной точке не пересекаются?",
        "Подсказка: Каждые два пересекающихся отрезка являются диагоналями четырёхугольника, у которого две вершины лежат на a, а две другие – на b. См. также задачу 30695.",
        "Ответ: точек."
    ],
    "61421": [
        "Раскладки и разбиения",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Нарисуйте все лестницы из четырёх кирпичей в порядке убывания, начиная с самой крутой (4, 0, 0, 0) и заканчивая самой пологой (1, 1, 1, 1).",
        "Подсказка: См. решение задачи 61419 а)."
    ],
    "61422": [
        "Раскладки и разбиения",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: а) Диаграммы Юнга (4, 1, 1) и (3, 3, 0) не сравнимы,– ни одна из них не мажорирует другую. Есть ли еще такие несравнимые наборы с суммой 6?",
        "Ответ: а) Других нет. б) (5, 1, 1) и (4, 3, 0); (4, 1, 1, 1) и (3, 3, 1, 0);  (3, 1, 1, 1, 1) и (2, 2, 2, 1, 0)."
    ],
    "61473": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 3",
        "Классы: 9,10,11",
        "Условие: Лягушка прыгает по вершинам треугольника ABC, перемещаясь каждый раз в одну из соседних вершин.   Сколькими способами она может попасть из A в A за n прыжков?",
        "Решение: Пусть an – число способов вернуться за n прыжков в исходную вершину, а bn – попасть за n прыжков в соседнюю вершину. Легко видеть, что an+1 = 2bn, bn+1 = an + bn. Отсюда нетрудно вывести, что bn+2 = bn+1 + 2bn, an+2 = an+1 + 2an.    Из начальных условий a0 = 1, a1 = 0, получаем  (это нетрудно доказать по индукции).",
        "Ответ: способами."
    ],
    "102883": [
        "Правило произведения",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: На шахматной доске 8×8 расставлено наибольшее возможное число слонов так, что никакие два слона не угрожают друг другу.   Доказать, что число всех таких расстановок есть точный квадрат.",
        "Решение: Пусть на белых клетках максимально можно расположить k слонов и сделать это n способами. Это никак не мешает расположению слонов на чёрных клетках. Поскольку множество чёрных клеток получается из множества белых поворотом на 90°, там можно расположить столько же слонов и тем же числом способов. Следовательно, всего максимальных расстановок n²."
    ],
    "32044": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Какое наименьшее число карточек спортлото (6 из 49) надо купить, чтобы наверняка хоть в одной из них был угадан хоть один номер?",
        "Решение: Заполним восемь карточек следующим образом: в первой зачеркнем числа от 1 до 6, во второй – от 7 до 12 и т. д., в последней – от 43 до 48. Не зачеркнутым ни в одной карточке останется только число 49. Поэтому среди \tвыигрышных номеров по крайней мере пять окажутся зачеркнутыми.     Докажем, что семи карточек может не хватить. Действительно, всего будет вычеркнуто не более 42 различных чисел. Поэтому не менее семи чисел окажутся не вычеркнутыми ни в одной из карточек. Может так случиться, что выигрышными окажутся как раз шесть чисел из этих семи.",
        "Ответ: 8 карточек."
    ],
    "34931": [
        "Правило произведения",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: В столовой предложено на выбор шесть блюд. Каждый день Вася берёт некоторый набор блюд (возможно, не берет ни одного блюда), причём этот набор блюд должен быть отличен от всех наборов, которые он брал в предыдущие дни. Какое наибольшее количество дней Вася сможет питаться по таким правилам и какое количество блюд он в среднем при этом будет съедать за день?",
        "Подсказка: Каждому набору блюд можно сопоставить противоположный набор, состоящий в точности из тех блюд, которых нет в исходном наборе.",
        "Решение: Количество дней равно, очевидно, количеству различных наборов из шести блюд. Для каждого блюда есть две возможности – быть выбранным или невыбранным. Поэтому количество дней равно 26.     Каждому набору блюд можно сопоставить противоположный набор, состоящий в точности из тех блюд, которых нет в исходном наборе. Вместе в исходном и в противоположном наборе – шесть блюд, значит, в среднем приходится по три блюда на набор. Поскольку все 64 набора разбиваются на пары противоположных, то в среднем за эти 64 дня Вася съедал три блюда.",
        "Ответ: 64 дня, в среднем 3 блюда в день."
    ],
    "35768": [
        "Сочетания и размещения",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Нарисуйте на плоскости шесть точек так, чтобы они служили вершинами ровно для 17 треугольников.",
        "Подсказка: Если никакие три точки не будут лежать на одной прямой, то каждые три точки будут образовывать треугольник, и всего треугольников будет . Если усадить три точки на одну прямую, то на один треугольник станет меньше. Значит, нужно создать три тройки точек, лежащих на одной прямой.",
        "Ответ: Например, можно взять вершины и середины сторон произвольного треугольника."
    ],
    "58313": [
        "Правило произведения",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На окружности отмечено десять точек. Сколько существует незамкнутых несамопересекающихся девятизвенных ломаных с вершинами в этих точках?",
        "Решение: Первую точку можно выбрать десятью способами. Каждую из следующих восьми точек можно выбрать двумя способами: она должна быть соседней с одной из ранее выбранных точек (иначе получится самопересекающаяся ломаная). Поскольку начало и конец при таком подсчёте различаются, а в ломаной – нет, результат нужно разделить на 2. Следовательно, всего имеется 10·28 : 2 = 1280 ломаных.",
        "Ответ: 1280 ломаных."
    ],
    "30347": [
        "Сочетания и размещения",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: Чемпионат России по шахматам проводится в один круг.\tСколько играется партий, если участвуют 18 шахматистов?",
        "Решение: Первый способ. Каждый участник должен сыграть 17 партий, в каждой партии играют двое. Поэтому всего партий 18·17 : 2 = 153.",
        "Ответ: 153 партии."
    ],
    "60347": [
        "Правило произведения",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Сколько существует девятизначных чисел, сумма цифр которых чётна?",
        "Решение: Разобьём девятизначные числа на пары последовательных: (100000000, 100000001), (100000000, 100000001), ... В каждой паре сумма цифр второго числа на 1 больше суммы цифр первого, значит, ровно одна из них чётна. Следовательно, числа с чётной суммой цифр составляют ровно половину от количества всех девятизначных чисел, а их 9·108 (см. решение задачи 60336).",
        "Ответ: 45·107 чисел."
    ],
    "61526": [
        "Раскладки и разбиения",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Пусть fk,l(x) – производящая функция последовательности Pk,l(n) из задачи 61525:  fk,l(x) = Pk,l(0) + xPk,l(1) + ... + xklPk,l(kl).",
        "Подсказка: а) Оба равенства немедленно следуют из определения и формул а) и б) задачи 61525."
    ],
    "66005": [
        "Сочетания и размещения",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Жили-были двадцать шпионов. Каждый из них написал донос на десять своих коллег.   Докажите, что не менее, чем десять пар шпионов донесли друг на друга.",
        "Решение: См. решение задачи 98031  и замечание к нему."
    ],
    "66036": [
        "Задачи с ограничениями",
        "Сложность: 3",
        "Классы: 6,7,8,9",
        "Условие: Имеется резинка и стеклянные шарики-бусины: четыре одинаковых красных, две одинаковых синих и две одинаковых зелёных. Нужно все восемь бусин нанизать на резинку последовательно, чтобы получился браслет. Сколько различных браслетов можно составить так, чтобы бусины одного цвета не оказались рядом? (Считайте, что застёжки нет, а узелок на резинке незаметен.)",
        "Ответ: 2 браслета."
    ],
    "79438": [
        "Сочетания и размещения",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Двадцать городов соединены 172 авиалиниями.   Доказать, что, используя эти авиалинии, можно из любого города перелететь в любой другой (быть может, делая пересадки).",
        "Решение: Предположим, что из города"
    ],
    "79545": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 3",
        "Классы: 8",
        "Условие: В тёмной комнате на полке в беспорядке лежат четыре пары носков двух разных  размеров и двух разных цветов. Какое наименьшее число носков необходимо, не  выходя из комнаты, переложить с полки в чемодан, чтобы в нем оказались две  пары различного размера и цвета?",
        "Решение: Сначала заметим, что семи носков достаточно. Действительно, не взят только один носок, то есть взяты все пары носков, кроме одной. Следовательно, в чемодане оказались две пары различного цвета и размера, а именно пара, отличающаяся от невзятой только цветом, и пара, отличающаяся от невзятой только размером.    Если оставить на полке по одному носку из двух пар одного цвета, то в чемодане не окажется двух пар разного цвета. Следовательно, шести носков может не хватить.",
        "Ответ: 7 носков."
    ],
    "111241": [
        "Задачи с ограничениями",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Новогодняя гирлянда, висящая вдоль школьного коридора, состоит из красных и синих лампочек. Рядом с каждой красной лампочкой обязательно есть синяя. Какое наибольшее количество красных лампочек может быть в этой гирлянде, если всего лампочек 50?",
        "Решение: Подсчитаем, какое  наименьшее количество синих лампочек может быть в гирлянде.   Можно считать, что первая лампочка – красная. Поскольку рядом с каждой красной лампочкой обязательно есть синяя, то три красных лампочки не могут идти подряд. Следовательно, среди каждых трёх последовательно идущих лампочек хотя бы одна лампочка должна быть синей. Тогда среди первых 48 лампочек синих будет не меньше чем   48 : 3 = 16. Обе лампочки с номерами 49 и 50 оказаться красными не могут. Итак, синих лампочек в гирлянде должно быть не менее 17. Такой случай возможен: если лампочки с номерами 2, 5, 8, 11, ..., 50 – синие, а остальные – красные, то в гирлянде – 33 красные лампочки.",
        "Ответ: 33 лампочки."
    ],
    "60345": [
        "Правило произведения",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Пассажир оставил вещи в автоматической камере хранения, а когда пришёл получать вещи, выяснилось, что он забыл номер. Он только помнит, что в номере были числа 23 и 37. Чтобы открыть камеру, нужно правильно набрать пятизначный номер. Каково наименьшее количество номеров нужно перебрать, чтобы наверняка открыть камеру?",
        "Решение: Разберём несколько случаев.    1) Номер содержит комбинацию 237. Её можно расположить в номере тремя способами: **237, *237*, 237**. В каждом из них каждую из оставшихся цифр можно выбрать 10 способами. Всего получаем 3·10² = 300 номеров.    2) Номер содержит комбинации 23 и 37, причём 23 расположена левее. Оставшуюся цифру можно выбрать 10 способами и вставить её на одно из трёх мест. Всего 30 номеров.    3) Номер содержит комбинации 23 и 37, причём 23 расположена правее. Еще 30 номеров.    Осталось заметить, что номера 23723, 23237, 23737 и 37237 мы сосчитали дважды.",
        "Ответ: 356 номеров."
    ],
    "31377": [
        "Правило произведения",
        "Сложность: 3+",
        "Классы: 6,7,8,9",
        "Условие: Имеются две одинаковых шестеренки по 14 зубьев на общей оси. Их совместили и выбили четыре пары зубьев.   Доказать, что шестеренки можно повернуть так, что они образуют полноценную шестеренку (без дырок).",
        "Решение: Пусть выбиты зубья A1, A2, A3, A4. Будем поворочивать верхнюю шестеренку относительно нижней. Помимо исходного положения есть еще 13 положений верхней шестеренки, когда из зубья совмещаются. Из них плохими являются не более 12 (когда зубец Ai верхней шестеренки совмещается с зубцом Aj нижней, i ≠ j). Значит, имеется и хорошее положение."
    ],
    "30687": [
        "Сочетания и размещения",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: а) Из класса, в котором учатся 30 человек, нужно выбрать двоих школьников для участия в математической олимпиаде. Сколькими способами это можно сделать?  б) Сколькими способами можно выбрать команду из трех школьников в том же классе?",
        "Решение: а) Первого ученика можно выбрать 30 способами, второго, независимо от выбора первого ученика, – 29 способами. При этом каждая пара учитывается дважды. Поэтому всего способов 30&middot29 : 2.",
        "Ответ: а)  способами;  б)  способами."
    ],
    "35296": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: В сериале Тайна Санта-Барбары участвует 20 героев. Каждую серию происходит одно из событий: некоторый герой узнаёт Тайну, некоторый герой узнаёт, что кто-то знает Тайну, некоторый герой узнаёт, что кто-то не знает Тайну. Какое наибольшее число серий может продолжаться сериал?",
        "Подсказка: Подсчитайте, какое наибольшее число раз может случаться событие каждого из трёх указанных в условии типов.",
        "Решение: Каждый герой может что-то узнать не более чем в 39 сериях (в одной – узнать Тайну, в 19 – узнать про каждого из остальных, что тот не знает Тайну, и еще в 19 – узнать про каждого из остальных, что тот знает Тайну. Поэтому серий не больше чем 20·39 = 780.    Построим пример сериала из 780 серий. Пусть вначале никто не знает Тайну. В первых 380 сериях для каждой упорядоченной пары героев пусть первый из них узнаёт, что второй не знает Тайну. В следующих 20 сериях пусть все герои последовательно узнают Тайну. В последних 380 сериях для каждой упорядоченной пары героев пусть первый из них узнаёт, что второй знает Тайну.",
        "Ответ: 780 серий."
    ],
    "61420": [
        "Раскладки и разбиения",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Докажите, что    тогда и только тогда, когда β можно получить из α проделав несколько (может быть один раз или ни одного) операции вида",
        "Подсказка: Каждая из указанных трёх операций приводит к диаграмме Юнга, мажорируемой диаграммой α. Проверьте, при каких условиях полученная диаграмма мажорирут β, и убедитесь в том, что одно из этих условий выполнено, если α ≠ β."
    ],
    "61509": [
        "Раскладки и разбиения",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Пусть p(n) – количество разбиений числа n  (определение разбиений смотри здесь). Докажите равенства:",
        "Решение: Представим n в виде суммы k1 единиц, k2 двоек, k3 троек, … . Поставим в соответствие такому разбиению одночлен xn = xk1x2k2x3k3...,   где множитель xk1 берется из первой скобки, x2k2 – из второй, x3k3 – из третьей, ... . Ясно, что количество таких одночленов (коэффициент   при xn после раскрытия скобок и приведения подобных) равно p(n), что и доказывает левое равенство."
    ],
    "61512": [
        "Раскладки и разбиения",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Обозначим через d(n) количество разбиений числа n на различные слагаемые, а через l(n) – на нечётные. Докажите равенства:",
        "Решение: а) В соответствии, описанном в решении задачи 61509, чтобы получить одночлен, соответствующий разбиению на различные слагаемые, нужно из каждой скобки брать либо единицу, либо член наименьшей степени. Это и значит, что от каждой скобки останутся только два первых члена. В результате мы и получим правую часть равенства а)."
    ],
    "61525": [
        "Раскладки и разбиения",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Обозначим через Pk,l(n) количество разбиений числа n на не более чем k слагаемых, каждое из которых не превосходит l.   Докажите равенства:      а) Pk,l(n) – Pk,l–1(n) = Pk–1,l(n – l);       б) Pk,l(n) – Pk–1,l(n) = Pk,l–1(n – k);       в) Pk,l(n) = Pl,k(n);       г) Pk,l(n) = Pk,l(kl – n).",
        "Подсказка: в) Рассмотрите симметричную   диаграмму Юнга.",
        "Решение: а) Из каждого разбиения n – l = a1 + a2 + ... + am числа  n – l на слагаемые, не превосходящие l, можно получить разбиение n = a1 + a2 + ... + am + 1 числа n. Но так получаются не все интересующие нас разбиения (которых Pk,l(n)), а только те, которые содержат слагаемое, равное l. Количество разбиений, не содержащих таких слагаемых, равно Pk,l–1(n)."
    ],
    "64833": [
        "Перестановки и подстановки (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: В строку выписаны 40 знаков: 20 крестиков и 20 ноликов. За один ход можно поменять местами любые два соседних знака. За какое наименьшее количество ходов можно гарантированно добиться того, чтобы какие-то 20 стоящих подряд знаков оказались крестиками?",
        "Решение: Для того чтобы 20 крестиков стояли подряд, необходимо и достаточно, чтобы все нолики стояли с краев (возможно, все с одного края).     Оценка. Пусть есть строка с произвольной расстановкой крестиков и ноликов. Будем делать разрешённые ходы, перемещая нолики к правому или к левому краю так, чтобы правее или левее них уже не было крестиков.    Для этого сначала выберем самый правый и самый левый нолики. Для того чтобы один из них оказался с краю, требуется не более 10 ходов, так как либо слева от самого левого, либо справа от самого правого нолика стоит не более, чем 10 крестиков.     Далее, возьмём самый правый и самый левый нолик из оставшихся 19. Рассуждая аналогично, получим, что для указанного перемещения опять потребуется не более 10 ходов, и так далее. Таким образом, для получения требуемой расстановки потребуется не более 20·10 = 200 ходов.     Приведём пример изначальной расстановки для случая, когда меньшего количества ходов не хватит. Пусть в ряд стоят 10 крестиков, затем 20 ноликов, а затем еще 10 крестиков. В этом случае для перемещения каждого нолика к краю потребуется ровно 10 ходов.",
        "Ответ: За 200 ходов."
    ],
    "65299": [
        "Сочетания и размещения",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: В финал конкурса спектаклей к 8 Марта вышли два спектакля. В первом  играли n учеников 5 класса А, а во втором – n учеников 5 класса Б. На спектакле присутствовали 2n мам всех 2n учеников. Лучший спектакль выбирается голосованием мам. Известно, что ровно половина мам честно голосует за лучший спектакль, а другая половина в любом случае голосует за спектакль, в котором участвует её ребенок.    а) Найдите вероятность того, что лучший спектакль победит с  перевесом голосов.",
        "Решение: а) Назовём маму честной, если она в любом случае голосует за лучший спектакль. Известно, что n честных мам будет голосовать за лучший спектакль, поэтому он заведомо не проиграет (половина голосов точно за него). Единственный случай, когда лучший спектакль не победит – ничья, когда худший спектакль также наберет половину голосов. Это возможно только если  все дети нечестных мам играют в худшем спектакле. Найдем вероятность  этого события.    Всего существует  случаев распределения n нечестных мам среди общего числа 2n мам. И только в одном из этих случаев все нечестные мамы голосуют за худший спектакль. Таким образом, вероятность ничьей равна .   Следовательно, вероятность события лучший спектакль наберёт больше голосов равна  =",
        "Ответ: а)   б) 1."
    ],
    "30689": [
        "Сочетания и размещения",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: Сколькими способами можно выбрать 4 краски из имеющихся 7 различных?",
        "Решение: Рассуждая аналогично задаче   30687 получим, что число этих способов () равно .",
        "Ответ: 35 способами."
    ],
    "73627": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Петя собирается все 90 дней каникул провести в деревне и при этом каждый второй день (то есть через день) ходить купаться на озеро, каждый третий – ездить в магазин за продуктами, а каждый пятый день – решать задачи по математике. (В первый день Петя сделал и первое, и второе, и третье и очень устал.) Сколько будет у Пети приятных дней, когда нужно будет купаться, но не нужно ни ездить в магазин, ни решать задачи? Сколько скучных, когда совсем не будет никаких дел?",
        "Решение: Занумеруем дни числами от 0 до 89. Петя купается в дни с чётными номерами, ездит в магазин в дни с номерами, кратными 3, и решает задачи в дни, с номерами, кратными 5.     Таким образом, нам следует ответить на два вопроса:      1) сколько существует чётных чисел от 0 до 89, которые не делятся ни на 3, ни на 5;       2) сколько существует нечётных чисел от 0 до 89, которые не делятся ни на 3, ни на 5?     Ответы на эти вопросы одинаковы. Действительно, разобьём наши числа на пары с разностью 45: {0, 45}, {1, 46}, ..., {44, 89}. В каждой паре – два числа разной четности, при этом если одно из чисел пары не делится ни на 3, ни на 5, то и второе тоже.     Поэтому достаточно ответить на вопрос 1).     Заметим, что чётных чисел от 0 до 89 ровно половина, то есть 45. Из них каждое третье кратно 3 (всего 15 чисел), каждое пятое кратно 5 (9 чисел) и каждое пятнадцатое кратно 15 (3 числа). Таким образом, чётных чисел, кратных либо 3, либо 5, ровно 15 + 9 – 3 = 21 (мы вычитаем 3, так как в сумме 15 + 9 числа, кратные 15, сосчитаны дважды). Значит, интересующих нас чисел 45 – 21 = 24.",
        "Ответ: Поэтому достаточно ответить на вопрос 1)."
    ],
    "78178": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Имеется 1959 положительных чисел",
        "Решение: 1 = (a1 + ... + a1959)1000. Раскрыв скобки, получим сумму всех возможных произведений ai длины 1000. Каждое рассматриваемое в задаче произведение входит в эту сумму, но произведения, отличающиеся порядком сомножителей, входят в эту сумму несколько раз. Кроме того, в сумму входят и другие слагаемые, например,  Все слагаемые положительны, значит, искомая сумма меньше 1."
    ],
    "79614": [
        "Задачи с ограничениями",
        "Сложность: 3+",
        "Классы: 9",
        "Условие: В квадратной таблице из 9×9 клеток отмечены 9 клеток, лежащие на  пересечении второй, пятой и восьмой строк со вторым, пятым и восьмым  столбцами. Сколькими путями можно из левой нижней клетки попасть в правую  верхнюю, двигаясь только по неотмеченным клеткам вверх или вправо?",
        "Решение: Пусть",
        "Ответ: 678 путями."
    ],
    "32033": [
        "Раскладки и разбиения",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: На центральном телеграфе стоят разменные автоматы, которые меняют 20 коп. на 15, 2, 2 и 1; 15 коп. на 10, 2, 2 и 1; 10 коп. на 3, 3, 2 и 2. Петя разменял 1 руб. 25 коп. серебром на медь. Вася, посмотрев на результат, сказал: Я точно  знаю, какие у тебя были монеты и назвал их. Назовите и вы.",
        "Решение: Так как две 15-копеечные монеты размениваются на ту же комбинацию, что и набор из одной 10-копеечной и одной 20-копеечной монеты, то в исходном наборе у Пети не могло быть ни более одной 15-копеечной монеты, ни одновременно 10-копеечной и 20-копеечной.     Из монет 10 и 20 коп. невозможно получить 125 коп., значит, у Пети была 15-копеечная монета. Остальные монеты в сумме 110 коп. должны были быть одинаковыми, следовательно, 10-копеечными.     При таком наборе монет по результатам размена действительно можно однозначно определить исходные монеты: у Пети оказалась всего одна копейка; из  этого можно заключить, что вначале у не было 20-копеечных монет, и была только одна 15-копеечная.",
        "Ответ: Одна 15-копеечная монета и 11 гривенников."
    ],
    "35399": [
        "Сочетания и размещения",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Имеется 20 человек – 10 юношей и 10 девушек. Сколько существует способов составить компанию, в которой было бы одинаковое число юношей и девушек?",
        "Подсказка: Каждой такой компании сопоставьте множество из 10 человек, в которое входят все девушки, вошедшие в компанию, и все юноши, не вошедшие в неё.",
        "Решение: Пусть имеется некоторая компания из k юношей и k девушек. Поставим ей в соответствие множество из 10 человек, в которое включим k девушек, вошедших в компанию, и 10 – k юношей, не вошедших в неё. Установленное соответствие, очевидно, является взаимно-однозначным. Таким образом, искомое число равно числу способов выбрать 10 человек из 20-ти.",
        "Ответ: способов."
    ],
    "60384": [
        "Сочетания и размещения",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Международная комиссия состоит из девяти человек. Материалы комиссии хранятся в сейфе. Сколько замков должен иметь сейф, сколько ключей для них нужно изготовить и как их разделить между членами комиссии, чтобы доступ к сейфу был возможен тогда и только тогда, когда соберутся не менее шести членов комиссии?",
        "Решение: По условию, любые пять человек сейф открыть не могут. Значит, у них нет ключа от некоторого замка. При этом любой другой член комиссии должен этот ключ иметь. Поэтому нужно поставить  замков. Четыре ключа от каждого замка отдаются некоторой четвёрке членов комиссии, причём разные ключи раздаются разным четвёркам.",
        "Ответ: 126 замков, по 4 ключа к каждому замку."
    ],
    "73582": [
        "Сочетания и размещения",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Из цифр 1 и 2 составили пять n-значных чисел так, что у каждых двух чисел совпали цифры ровно в m разрядах, но ни в одном разряде не совпали все пять чисел. Докажите, что отношение m/n не меньше &frac25; и не больше &frac35;.",
        "Решение: Выпишем числа одно под другим. В каждом разряде (столбце) пять цифр. Из них можно составить 10 (неупорядоченных) пар. По всем столбцам таких пар будет 10n. Выясним, сколько среди них таких, которые состоят из одинаковых цифр, то есть пар (1, 1) и (2, 2). В каждом столбце таких пар либо 4, либо 6. Поэтому общее количество таких пар не меньше 4n и не больше 6n. С другой стороны, количество таких пар равно 10m, поскольку всевозможных пар из пяти чисел – 10.     Итак, 4n ≤ 10m ≤ 6n, что и требовалось доказать."
    ],
    "30693": [
        "Сочетания и размещения",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: На плоскости отмечено 10 точек так, что никакие три из них не лежат на одной прямой. Сколько существует треугольников с вершинами в этих точках?",
        "Ответ: треугольников."
    ],
    "61513": [
        "Раскладки и разбиения",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Придумайте какое-либо взаимно-однозначное соответствие между разбиениями натурального числа на различные и на нечётные слагаемые.",
        "Решение: Пусть есть разбиение числа n на различные слагаемые. Каждое чётное слагаемое вида 2km, где m нечётно, разобьём дополнительно на 2k слагаемых, равных m. Получим разбиение n на нечётные слагаемые. Исходное разбиение однозначно восстанавливается по полученному. Действительно, пусть в нём оказалось l слагаемых, равных m. Представим l в виде суммы l = 2k1 + ... + 2ks различных степеней двойки (как известно, это можно сделать единственным способом) и восстановим слагаемые 2k1m, ..., 2ksm исходного разбиения."
    ],
    "61510": [
        "Раскладки и разбиения",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: На доске написано n натуральных чисел. Пусть ak – количество тех из них, которые больше k. Исходные числа стерли и вместо них написали все положительные ak. Докажите, что если с новыми числами сделать то же самое, то на доске окажется исходный набор чисел.   Например, для чисел 5, 3, 3, 2, получается следующая цепочка  (5, 3, 3, 2) → (4, 4, 3, 1, 1) → (5, 3, 3, 2).",
        "Подсказка: Проследите за изменением диаграммы Юнга.",
        "Решение: См. задачу 98424."
    ],
    "78493": [
        "Раскладки и разбиения",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: a",
        "Решение: Расположим числа в порядке убывания и рассмотрим соответствующую диаграмму Юнга. Нетрудно заметить, что bj – число квадратов в j-м столбце этой диаграммы. Поэтому обе суммы из условия равны числу квадратов в полученной диаграмме."
    ]
}