{
    "30415": [
        "Связность и разложение на связные компоненты",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: Между девятью планетами Солнечной системы введено космическое сообщение.  Ракеты летают по следующим маршрутам: Земля – Меркурий, Плутон – Венера, Земля – Плутон, Плутон – Меркурий, Меркурий – Венера, Уран – Нептун, Нептун – Сатурн, Сатурн – Юпитер, Юпитер – Марс и Марс – Уран. Можно ли добраться с Земли до Марса?",
        "Решение: Нарисуем схему: планетами будут соответствовать точки, а соединяющим их маршрутам – не пересекающиеся между собой линии.",
        "Ответ: Нельзя."
    ],
    "31083": [
        "Теория графов (прочее)",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: В классе больше 32, но меньше 40 человек. Каждый мальчик дружит с тремя девочками, а каждая девочка – с пятью мальчиками.   Сколько человек в классе?",
        "Решение: Количество рёбер в соответствующем графе в три раза больше числа мальчиков и в 5 раз больше числа девочек. Следовательно, число девочек относится к числу мальчиков как 3 : 5, а общее число учеников делится на 8. Но между 32 и 40 таких чисел нет.",
        "Ответ: Такого класса не существует."
    ],
    "30791": [
        "Деревья",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Волейбольная сетка имеет вид прямоугольника размером 50×600 клеток.  Какое наибольшее число верёвочек можно перерезать так, чтобы сетка не распалась на куски?",
        "Решение: Будем рассматривать волейбольную сетку как граф, вершинами которого являются узлы сетки, а рёбрами – верёвочки. В этом графе нужно удалить как можно больше рёбер так, чтобы он остался связным. Будем убирать рёбра по очереди до тех пор, пока это возможно. Заметим, что если в графе есть цикл, то возможно удаление любого ребра этого цикла. Связный граф, не имеющий циклов, является деревом. Поэтому, только получив дерево, мы не сможем убрать ни одного ребра. Подсчитаем число рёбер в нашем графе в этот момент. Количество вершин осталось тем же – 51·601 = 30651. Число рёбер в дереве на единицу меньше (см. задачу 31098 б), то есть их 30650. Сначала же их было 601·50 + 600·51 = 60650. Таким образом, можно удалить 30000 рёбер (но не более!).",
        "Ответ: 30000 верёвочек."
    ],
    "30798": [
        "Планарные графы. Формула Эйлера",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Докажите, что для плоского связного графа справедливо неравенство E ≤ 3V – 6.",
        "Решение: Из задачи 30797 известно, что 2E ≥ 3F. Подставив это в формулу Эйлера (задача 30759), получим V – E + 2E/3 ≥ 2, откуда E ≤ 3V – 6."
    ],
    "30799": [
        "Планарные графы. Формула Эйлера",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Докажите, что для любого плоского графа (в том числе и несвязного) справедливо неравенство E ≤ 3V – 6.",
        "Решение: Требуемое утверждение получается сложением аналогичных неравенств для компонент связности, доказанных в задаче 30798."
    ],
    "30800": [
        "Планарные графы. Формула Эйлера",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Докажите, что граф, имеющий пять вершин, каждая из которых соединена ребром со всеми остальными, не является плоским.",
        "Решение: У этого графа 10 рёбер, поэтому не выполнено неравенство E ≤ 3V – 6. Согласно задаче 30798 он не может быть плоским."
    ],
    "30801": [
        "Планарные графы. Формула Эйлера",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Можно ли построить три дома, вырыть три колодца и соединить тропинками каждый дом с каждым колодцем так, чтобы тропинки не пересекались?",
        "Решение: Пусть это удалось. Полученный плоский граф двудолен, поэтому согласно задаче 31110 E ≥ 2F, то есть F ≤ 4. Подставив в формулу Эйлера (задача 30759), получим 2 = 6 – 9 + F ≤ 1. Противоречие.",
        "Ответ: Нельзя."
    ],
    "30802": [
        "Планарные графы. Формула Эйлера",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Докажите, что граф, имеющий 10 вершин, степень каждой из которых равна 5, – не плоский.",
        "Решение: Не выполняется неравенство 3V – 6 ≥ E, которое согласно задаче 30799 выполнено для любого плоского графа."
    ],
    "30807": [
        "Обход графов",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Можно ли составить решётку, изображённую на рисунке     а) из пяти ломаных длины 8?     б) из восьми ломаных длины 5?   (Длина стороны клетки равна 1.)",
        "Решение: а) В каждой нечётной вершине должен быть конец одной из ломаных. Но нечётных вершин 12, а концов только 10.",
        "Ответ: а) Нельзя; б) можно."
    ],
    "30811": [
        "Степень вершины",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Каждый из 102 учеников одной школы знаком не менее чем с 68 другими.   Докажите, что среди них найдутся четверо, имеющие одинаковое число знакомых.",
        "Решение: Предположим противное. Тогда для каждого числа от 68 до 101 есть ровно три человека, имеющие такое число знакомых. Но тогда количество людей, имеющих нечётное число знакомых, нечётно. Противоречие."
    ],
    "30812": [
        "Деревья",
        "Сложность: 4",
        "Классы: 8",
        "Условие: Расстоянием между двумя произвольными вершинами дерева будем называть длину простого пути, соединяющего их. Удалённостью вершины дерева назовём сумму расстояний от неё до всех остальных вершин. Докажите, что в дереве, у которого есть две вершины с удалённостями, отличающимися на 1, нечётное число вершин.",
        "Решение: Соединим эти две вершины A и B путем. Пусть a – его длина. Расстояние от любой вершины до A и B отличаются на величину, имеющую ту же чётность, что и a. Поэтому если число вершин чётно, то (независимо от чётности a) удаленности A и B отличаются на чётное число, что противоречит условию."
    ],
    "32996": [
        "Теория графов (прочее)",
        "Сложность: 2",
        "Классы: 8",
        "Условие: Несколько Совершенно Секретных Объектов соединены подземной железной дорогой таким образом, что каждый Объект напрямую соединён не более чем с тремя другими и от каждого Объекта можно добраться под землей до любого другого, сделав не более одной пересадки. Каково максимальное число Совершенно Секретных Объектов?",
        "Решение: Оценка. Из данного Объекта можно добраться за один ход до трёх Объектов, а с пересадкой – еще до 2·3 = 6 Объектов. Следовательно, Объектов не больше 10.     Пример с 10 Объектами изображен на рисунке.",
        "Ответ: 10."
    ],
    "30825": [
        "Ориентированные графы",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В некоторой стране каждый город соединён с каждым дорогой с односторонним движением.   Докажите, что найдётся город, из которого можно добраться в любой другой.",
        "Решение: Индукция по числу городов. База очевидна.     Шаг индукции. Удалим один из городов. В силу предположения индукции есть город А с требуемым свойством.  Вспомним теперь про удалённый город. Если в него ведёт хотя бы одна дорога, то город А – искомый. В противном случае сам удалённый город удовлетворяет требуемому свойству."
    ],
    "30828": [
        "Ориентированные графы",
        "Сложность: 4",
        "Классы: 6,7",
        "Условие: 20 команд сыграли круговой турнир по волейболу.   Докажите, что команды можно занумеровать числами от 1 до 20 так, что 1-я команда выиграла у 2-й, 2-я – у 3-й, ..., 19-я – у 20-й.",
        "Решение: См. задачу 78303."
    ],
    "31099": [
        "Деревья",
        "Сложность: 4",
        "Классы: 6,7,8",
        "Условие: Есть  волейбольная  сетка 5×10. Какое максимальное число веревок, её составляющих, можно разрезать так, чтобы она  не распалась?",
        "Решение: См. задачу 30791.",
        "Ответ: 50 верёвочек."
    ],
    "31373": [
        "Ориентированные графы",
        "Сложность: 4",
        "Классы: 6,7,8,9",
        "Условие: 12 шахматистов сыграли турнир в один круг. Потом каждый из них написал 12 списков. В первом только он, в (k+1)-м – те, кто были в k-м и те, у кого они выиграли. Оказалось, что у каждого шахматиста 12-й список отличается от 11-го.  Сколько было ничьих?",
        "Решение: Рассмотрим ориентированный граф, вершины которого – шахматисты, а стрелки ведут от выигравшего к проигравшему. Условие означает, что для каждого шахматиста есть другой, до которого можно добраться только по 11 стрелкам (это, в частности означает, что от каждого шахматиста можно добраться до любого другого). Рассмотрим такой путь: A1 выиграл у A2, A2 – у A3, ..., A11 – у A12. Заметим, что Ai (1 < i < 12) не мог выиграть у A1 (иначе от A2 можно было бы добраться до каждого не более чем по 10 стрелкам). Но кто-то у A1 выиграл (иначе до A1 вообще нельзя было бы добраться), значит, это – A12. Как и выше, показываем, что в полученном цикле каждый мог выиграть только у следующего.",
        "Ответ: 54 ничьих."
    ],
    "64490": [
        "Степень вершины",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Среди n рыцарей каждые двое – либо друзья, либо враги. У каждого из рыцарей ровно три врага, причём враги его друзей являются его врагами.   При каких n такое возможно?",
        "Решение: Из условия следует, что рыцарей – не менее четырёх. Заметим, что у рыцаря не может быть более двух друзей, иначе найдутся четыре рыцаря, у которых есть общий враг, но тогда у этого врага будет не менее четырёх врагов, что противоречит условию. Значит, у каждого рыцаря не более двух друзей и ровно три врага, следовательно, всего рыцарей – не более шести.     Так как у каждого рыцаря по три врага, то число рыцарей чётно (см. задачу 87972 б).     Примеры. Четыре рыцаря, каждый враждует с остальными тремя.     Шесть рыцарей разбиваем на две тройки: каждый рыцарь дружит с рыцарями из своей тройки и враждует с рыцарями из другой.",
        "Ответ: n = 4 или n = 6."
    ],
    "79259": [
        "Степень вершины",
        "Сложность: 4",
        "Классы: 10",
        "Условие: На бесконечной шахматной доске проведена замкнутая несамопересекающаяся  ломаная, проходящая по сторонам клеток. Внутри ломаной оказалось k чёрных  клеток. Какую наибольшую площадь может иметь фигура, ограниченная этой ломаной?",
        "Решение: Будем постепенно перекрашивать нашу фигуру. На первом шаге перекрасим одну из чёрных клеток в синий цвет, а всех её белых соседей, принадлежащих фигуре, – в жёлтый. На следующем шаге перекрасим чёрную клетку, соседнюю с желтой, в синий цвет, а всех её белых соседей – в жёлтый. И так далее.    Поскольку фигура связная, а чёрных клеток ровно k, то ровно через k шагов вся фигура будет перекрашена. При этом на первом шаге перекрашиваются не более пяти клеток, а на каждом из остальных – не более четырёх (одна чёрная и три белых). Следовательно, всего в фигуре не более 4k + 1 клеток.     На рисунке приведён пример фигуры ровно из 4k + 1  клетки.",
        "Ответ: 4k + 1."
    ],
    "107849": [
        "Теория графов (прочее)",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: За круглым столом сидят несколько гостей. Некоторые из них знакомы между   собой; знакомство взаимно. Все знакомые каждого гостя (считая его самого)  сидят вокруг стола через равные промежутки. (Для  другого человека эти промежутки могут быть другими.) Известно, что каждые двое имеют хотя бы одного общего знакомого. Докажите, что все гости знакомы друг с другом.",
        "Решение: Заметим,  что если у человека есть знакомые, сидящие рядом друг с другом (в частности, если он знаком со своим соседом), то этот человек знаком со всеми. Докажем, что такой гость найдётся.     Пусть A и B – двое соседей. Если они не знакомы между собой, то их общий знакомый C знаком со всеми, так как его  знакомые  сидят без промежутков. В противном случае  со всеми знаком человек A (по той же причине).     Итак, пусть X – гость, знакомый со всеми. Тогда его соседи тоже знакомы со всеми, так как они  знакомы с X (являющимся  для  них соседом). Соседи этих соседей также знакомы со всеми, и так далее по кругу."
    ],
    "111260": [
        "Связность и разложение на связные компоненты",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Клетчатая прямоугольная сетка m×n связана из верёвочек единичной длины. Двое делают ходы по очереди. За один ход можно разрезать (посередине) не разрезанную ранее единичную верёвочку. Если не останется ни одного  замкнутого верёвочного контура, то игрок, сделавший последний ход, считается  проигравшим. Кто из игроков победит при правильной игре и как он должен для этого играть?",
        "Решение: В начале игры верёвочек единичной длины было m(n + 1) + n(m + 1) = 2mn + m + n. Это число имеет ту же чётность, что и число m + n. Последний ход в игре разрушает последний замкнутый контур.     Но граница замкнутого контура содержит чётное количество верёвочек единичной длины (см. решение задачи 30310). Выигрышная стратегия для любого игрока состоит в том, чтобы не разрушать последний замкнутый контур,   пока есть такая возможность.",
        "Ответ: Если m + n чётно, то выигрывает второй игрок, если m + n нечётно, то первый."
    ],
    "30418": [
        "Степень вершины",
        "Сложность: 2+",
        "Классы: 6,7",
        "Условие: В городе Маленьком 15 телефонов. Можно ли их соединить проводами так, чтобы каждый телефон был соединён ровно с пятью другими?",
        "Решение: Предположим, что это возможно. Рассмотрим тогда граф, вершины которого соответствуют телефонам, а рёбра – соединяющим их проводам. В этом графе 15 вершин, степень каждой из которых равна 5. Подсчитаем количество рёбер в этом графе. Для этого сначала просуммируем степени всех его вершин. Ясно, что при таком подсчёте каждое ребро учтено дважды (оно ведь соединяет две вершины!). Поэтому число рёбер графа должно быть равно 15·5 : 2. Но это число нецелое! Следовательно, такого графа не существует, а значит, и соединить телефоны требуемым образом невозможно."
    ],
    "30793": [
        "Деревья",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Докажите, что в любом связном графе можно удалить вершину вместе со всеми выходящими из нее рёбрами так, чтобы он остался связным.",
        "Подсказка: Выделите максимальное дерево и удалите его висячую вершину."
    ],
    "30794": [
        "Деревья",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: В стране 100 городов, некоторые из которых соединены авиалиниями. Известно, что от каждого города можно долететь до любого другого (возможно, с пересадками).   Докажите, что можно побывать во всех городах, совершив не более а) 198 перёлетов; б) 196 перелётов.",
        "Решение: б) Рассмотрим соответствующий граф и выделим из него максимальное дерево (см. задачу"
    ],
    "30803": [
        "Планарные графы. Формула Эйлера",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Докажите, что в плоском графе есть вершина, степень которой не превосходит 5.",
        "Решение: Предположим противное. Тогда 2E ≥ 6V, то есть E ≥ 3V, что противоречит неравенству из задачи 30799."
    ],
    "30804": [
        "Планарные графы. Формула Эйлера",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Каждое ребро полного графа с 11 вершинами покрашено в один из двух цветов: красный или синий.   Докажите, что либо красный, либо синий граф не является плоским.",
        "Решение: Пусть оба эти графа – плоские. Тогда у них вместе не более, чем (3·11 – 6) + (3·11 – 6) = 54 ребра (см. задачу 30799). Однако в полном графе с 11 вершинами 55 ребер. Противоречие."
    ],
    "30814": [
        "Связность и разложение на связные компоненты",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В некоторой стране каждые два города соединены либо авиалинией, либо железной дорогой.  Докажите, что     а) можно выбрать вид транспорта так, чтобы от каждого города можно было добраться до любого другого, пользуясь только этим видом транспорта;    \tб) из некоторого города, выбрав один из видов транспорта, можно добраться до любого другого города не более чем с одной пересадкой (пользоваться можно только выбранным видом транспорта);     в) каждый город обладает свойством из пункта б);     г) можно выбрать вид транспорта так, чтобы пользуясь только им, можно было добраться из каждого города до любого другого не более чем с двумя пересадками.",
        "Решение: а) Первый способ. Пусть из некоторого города A нельзя попасть в некоторый город B по железной дороге. Рассмотрим множество M всех городов, в которые можно попасть из города A по железной дороге. Множество городов, не входящих в M, обозначим N. Множество N непусто, поскольку в нём содержится город B. Ясно, что из городов множества M нельзя попасть в города множества N по железной дороге.     Докажем, что из каждого города в любой другой можно попасть  авиарейсами.     Если один из городов принадлежит M, а другой – множеству N, то между ними есть прямая авиалиния.     Пусть два города принадлежат M. Тогда из первого города можно попасть авиарейсом в некоторый город множества N, а оттуда (также самолётом) – во второй город.     Аналогично рассматривается случай, когда оба города принадлежат N.     Второй способ. См. г)."
    ],
    "30816": [
        "Теория графов (прочее)",
        "Сложность: 4",
        "Классы: 7,8",
        "Условие: Каждое из рёбер полного графа с 17 вершинами покрашено в один из трёх цветов.  Докажите, что есть три вершины, все рёбра между которыми – одного цвета.",
        "Решение: Из произвольной вершины выходит по крайней мере 6 рёбер одного цвета (пусть красного). Рассмотрим полный граф на 6 вершинах, в которые ведут эти рёбра. Если хотя бы одно из рёбер этого графа – красное, то есть красный треугольник. В противном случае этот граф – двухцветный, и согласно задаче 30815 в нём есть одноцветный треугольник."
    ],
    "30827": [
        "Ориентированные графы",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В одном государстве 100 городов и каждый соединён с каждым дорогой с односторонним движением. Докажите, что можно поменять направление движения не более чем на одной дороге так, чтобы от каждого города можно было доехать до любого другого.",
        "Решение: Докажем по индукции, что утверждение верно для любого числа n городов, большего 2.     База – для трёх городов – очевидна.     Шаг индукции. Удалим город A, имеющий и входящие и выходящие дороги (такой найдётся, так как городов, из которых дороги только выходят, не больше одного; аналогично для городов, в которые дороги только входят). По предположению индукции в оставшемся графе можно добиться требуемого, поменяв направление не более чем одной дороги. Присоединение города A и соответствующих дорог сохраняет это свойство."
    ],
    "30830": [
        "Ориентированные графы",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В некотором государстве 101 город.",
        "Решение: Рассмотрим города А и В. Пусть соединяющая их дорога ведёт из B в A."
    ],
    "31086": [
        "Ориентированные графы",
        "Сложность: 4",
        "Классы: 6,7,8",
        "Условие: В ориентированном графе 101 вершина. У каждой вершины число входящих и число выходящих рёбер равно 40.",
        "Решение: См. задачу 30830 б)."
    ],
    "30422": [
        "Степень вершины",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: У короля 19 баронов-вассалов.  Может ли оказаться так, что у каждого вассального баронства одно, пять или девять соседних баронств?",
        "Подсказка: В графе соседства баронств было бы 19 нечётных вершин.",
        "Ответ: Не может."
    ],
    "35108": [
        "Теория графов (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: На плоскости отмечено 100 точек, никакие три из которых не лежат на одной прямой. Некоторые пары точек соединены отрезками. Известно, что никакая тройка отрезков не образует треугольника. Какое наибольшее число отрезков могло быть проведено?",
        "Решение: См. решение задачи 31104 а).",
        "Ответ: 2500 отрезков."
    ],
    "35163": [
        "Теория графов (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: В парламенте 200 депутатов. В процессе заседания произошло 200 потасовок, в каждой из которой участвовали некоторые два депутата.   Докажите, что можно объединить в комиссию 67 депутатов, из которых никакие два не выясняли между собой отношения в потасовке.",
        "Подсказка: Вначале включим в комиссию всех депутатов, а затем исключаем из комиссии тех депутатов, которые участвовали по крайней мере в двух потасовках с членами комиссии.",
        "Решение: Сначала включим в комиссию всех депутатов. Назовём депутата вредным для комиссии, если он участвовал по крайней мере в двух потасовках с членами этой комиссии. Если в комиссии нашелся вредный депутат, удалим его из комиссии (при этом некоторые депутаты могут перестать быть вредными). Будем удалять из комиссии вредных депутатов, пока это возможно. Пусть после завершения этого процесса депутатов в комиссии осталось k депутатов, между которыми произошли m потасовок. С одной стороны, k ≥ 2m (иначе есть вредный депутат); с другой стороны 200 – m ≥ 2(200 – k) (так как каждый раз при удалении из комиссии вредного депутата количество потасовок между членами комиссии уменьшалось по крайней мере на 2). Отсюда  k + (200 – m) ≥ 2m + 2(200 – k), следовательно, k – m ≥ 67. Наконец, удалим из комиссии по одному участнику каждой из m потасовок, после чего получим комиссию, между членами которой уже не было потасовок, состоящую из k – m членов."
    ],
    "35222": [
        "Степень вершины",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На плоскости нарисовано несколько точек, некоторые пары точек соединены отрезками. Известно, что из каждой точки выходит не более k отрезков. Докажите, что точки можно покрасить в k + 1 цвет таким образом, чтобы каждые две точки, соединенные отрезком, были покрашены в разные цвета.",
        "Подсказка: Используйте индукцию по числу точек.",
        "Решение: Индукция по числу точек. База: для одной точки утверждение очевидно.     Шаг индукции. Пусть на плоскости нарисовано n + 1 точек, некоторые пары из которых соединены отрезками. Рассмотрим одну из точек - A. На время забудем про неё и про выходящие из неё отрезки. По предположению индукции оставшиеся n точек можно покрасить в k + 1 цвет таким образом, чтобы каждые две точки, соединённые отрезком, были покрашены в разные цвета. Покрасим эти n точек нужным образом. Вспомним про точку A. Она соединена отрезками  не более, чем с k точками. Поскольку цветов k + 1, покрасим  точку A в цвет, отличный от цветов точек, с которыми она соединена. Тем самым, получена требуемая раскраска точек."
    ],
    "60874": [
        "Теория графов (прочее)",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Дано N точек, никакие три из которых не лежат на одной прямой. Каждые две из этих точек соединены отрезком, и каждый отрезок окрашен в один из k цветов. Докажите, что если N > [k!e], то среди данных точек можно выбрать такие три, что все стороны образованного ими треугольника будут окрашены в один цвет.",
        "Решение: Индукция по k. База  (k = 1)  очевидна.     Шаг индукции. Как видно из задачи 60873 б),    Рассмотрим произвольную из N данных точек. Из неё выходит не менее    отрезков, окрашенных в один и тот же цвет. Если концы каких-либо двух из этих отрезков соединены отрезком того же цвета, то нужный треугольник найден. В противном случае, концы соединяются отрезками, окрашенными в  k – 1 цвет. Согласно предположению индукции можно найти треугольник одного цвета с вершинами в этих точках."
    ],
    "65731": [
        "Теория графов (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: а) Есть 2n + 1 батарейка (n > 2). Известно, что хороших среди них на одну больше, чем плохих, но какие именно батарейки хорошие, а какие плохие, неизвестно. В фонарик вставляются две батарейки, при этом он светит, только если обе – хорошие. За какое наименьшее число таких попыток можно гарантированно добиться, чтобы фонарик светил?",
        "Решение: а) Оценка. Пусть была n + 1  попытка. В каких-то двух попытках использовалась одна и та же батарейка, сделаем её плохой. В остальных n – 1 попытках выберем по батарейке и сделаем их плохими. Всего не более n плохих батареек, а фонарик точно светить не будет.    Пример. Разобьём батарейки на n кучек: в одной – три батарейки, в остальных – по две. В какой-то кучке окажется хотя бы две хороших батарейки. В каждой кучке проверим все возможные пары – всего n + 2, и фонарик загорится.",
        "Ответ: а) За n + 2 попытки; б) за n + 3 попытки."
    ],
    "30423": [
        "Степень вершины",
        "Сложность: 2+",
        "Классы: 6,7",
        "Условие: Может ли в государстве, в котором из каждого города выходит три дороги, быть ровно 100 дорог?",
        "Решение: Если в государстве k городов, то дорог – 3k/2 (см. задачу 87972 а). Но такое число не может быть равно 100.",
        "Ответ: Не может."
    ],
    "78825": [
        "Обход графов",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: В стране Мара расположено несколько замков. Из каждого замка ведут три дороги.  Из какого-то замка выехал рыцарь. Странствуя по дорогам, он из каждого замка,  стоящего на его пути, поворачивает либо направо, либо налево по отношению к  дороге, по которой приехал. Рыцарь никогда не сворачивает в ту сторону, в  которую он свернул перед этим. Доказать, что когда-нибудь он вернётся в исходный замок.",
        "Решение: Все замки страны Мара связаны каким-то конечным числом дорог. Если рыцарь странствует по стране достаточно долго, то он проедет достаточно много дорог, поэтому хотя бы по одной дороге AB (A и B – замки) он проедет не менее пяти раз. При этом не менее трёх раз он проедет по этой дороге в одном и том же направлении (скажем, от A к B); поэтому, если из замка B, кроме BA, ведут еще две дороги BC и BD то рыцарь минимум дважды, – скажем, после i-го и после j-го посещения замка B, где j > i, – сворачивал, выезжая из B (куда он оба раза приезжал из A)  в одну и ту же сторону, скажем, в сторону замка C. Но из условия тогда следует, что не только в i-е и в j-е посещение B рыцарь приехал в B из одного замка – из A, – но и в A он оба раза приезжал из одного и того же замка P (ведь если рыцарь после B свернул на дорогу BC, например, налево, то в A он должен был свернуть направо после посещения P). Аналогично этому устанавливается, что полностью совпадают пути рыцаря, предшествующие двум рассматриваемым посещениям замка B: в замок P он оба раза попал из одного и того же замка, и т. д. Но тогда, если рыцарь до i-го посещения B миновал, начиная с выезда из своего замка X, какое-то  число k замков, то и за k замков до j-го посещения B он снова был в X, что и доказывает утверждение задачи."
    ],
    "104033": [
        "Теория графов (прочее)",
        "Сложность: 4",
        "Классы: 7,8,9,10",
        "Условие: На столе лежат несколько тонких спичек одинаковой длины. Всегда ли можно раскрасить их концы а) в 2,  б) в 3 цвета так, чтобы два конца каждой спички были разных цветов, а каждые два касающихся конца (разных спичек) – одного и того же цвета?",
        "Решение: а) Достаточно взять три спички и сложить из них правильный треугольник. Предположим, что нам удастся раскрасить его вершины в два цвета. Какие-то две вершины окажутся одного цвета, а значит, у спички, которая соединяет эти вершины, оба конца будут одного цвета. Противоречие.",
        "Ответ: а-б) Не всегда."
    ],
    "30424": [
        "Степень вершины",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Джон, приехав из Диснейленда, рассказывал, что там на заколдованном озере имеются семь островов, с каждого из которых ведет один, три или пять мостов. Верно ли, что хотя бы один из этих мостов обязательно выходит на берег озера?",
        "Решение: Если бы ни один мост не выходил на берег, то в соответствующем графе было бы семь нечётных вершин, что противоречит задаче 87972 б).",
        "Ответ: Верно."
    ],
    "30805": [
        "Планарные графы. Формула Эйлера",
        "Сложность: 4+",
        "Классы: 9,10",
        "Условие: Семиугольник разбит на выпуклые пяти- и шестиугольники, причём так, что каждая его вершина является вершиной по крайней мере двух многоугольников разбиения.  Докажите, что число пятиугольников разбиения не меньше 13.",
        "Решение: Рассмотрим полученную картинку как плоский граф. Так как из каждой вершины выходит не менее трёх рёбер, то E ≥ 3V/2. Подставив в формулу Эйлера, получим 2 = V – E + F ≤ 2E/3 – E + F = F – E/3, то есть E ≤ 3F – 6.     Обозначим количество пятиугольников через a, количество шестиугольников через b. Заметим, что 5a + 6b + 7 = 2E ≤ 6F – 12 = 6(a + b + 1) – 12. Отсюда a ≥ 13."
    ],
    "78163": [
        "Теория графов (прочее)",
        "Сложность: 4+",
        "Классы: 10,11",
        "Условие: Между зажимами A и B включено несколько сопротивлений. Каждое сопротивление имеет входной и выходной зажимы. Какое наименьшее число сопротивлений необходимо иметь и какова может быть схема их соединения, чтобы при порче любых девяти сопротивлений цепь оставалась соединяющей зажимы A и B, но не было короткого замыкания? (Порча  сопротивления: короткое замыкание или обрыв.)",
        "Решение: Оценка. Рассмотрим граф, вершинами которого являются зажимы, а рёбрами – сопротивления. Заметим, что между вершинами A и B не может быть пути, состоящего менее чем из девяти рёбер (иначе при коротком замыкании всех рёбер этого пути у нас получалось бы короткое замыкание цепи). Кроме того, для любых девяти рёбер существует путь из A в B, не проходящий через эти рёбра. Следовательно, по теореме Менгера, существует не менее 10 попарно не пересекающихся (по рёбрам) путей из A в B. Так как в каждом из этих путей не менее 10 рёбер, то всего рёбер не менее 100.     Пример цепи со 100 сопротивлениями – это 10 попарно непересекающихся путей длины 10 из вершины A в вершину B.",
        "Ответ: 100 сопротивлений."
    ],
    "79610": [
        "Обход графов",
        "Сложность: 4+",
        "Классы: 8",
        "Условие: Можно ли четыре раза рассадить девять человек за круглым столом так, чтобы никакие двое не сидели рядом более одного раза?",
        "Решение: См. задачу 64639 б).",
        "Ответ: Можно."
    ],
    "79616": [
        "Обход графов",
        "Сложность: 4+",
        "Классы: 9",
        "Условие: Можно ли n раз рассадить 2n + 1 человека за круглым столом так, чтобы никакие двое не сидели рядом более одного раза, если а) n = 5; б) n = 10?",
        "Решение: а) См. задачу 64639 а).",
        "Ответ: Можно."
    ],
    "30425": [
        "Степень вершины",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Докажите, что число людей, когда-либо живших на Земле и сделавших нечётное число рукопожатий, чётно.",
        "Решение: См. задачу 87972 б)."
    ],
    "30426": [
        "Степень вершины",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Можно ли нарисовать на плоскости 9 отрезков так, чтобы каждый пересекался ровно с тремя другими?",
        "Решение: Рассмотрим граф, вершины которого – данные отрезки, а ребро соединяет две вершины тогда, когда два соответствующих отрезка пересекаются. У него 9 нечётных вершин, что противоречит задаче 87972 б).",
        "Ответ: Нельзя."
    ],
    "30784": [
        "Деревья",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Докажите, что граф, в котором каждые две вершины соединены ровно одним простым путем, является деревом.",
        "Решение: Очевидно, что данный граф связен. Предположим теперь, что в нем есть цикл.  Тогда любые две вершины этого цикла соединены по крайней мере двумя простыми путями. Противоречие."
    ],
    "88117": [
        "Турниры и турнирные таблицы",
        "Сложность: 2",
        "Классы: 5,6,7,8",
        "Условие: В турнире участвовали шесть шахматистов. Каждые два участника турнира сыграли между собой поодной партии. Сколько всего было сыграно партий? Сколько партий сыграл каждый участник? Сколько очков набрали шахматисты все вместе?",
        "Решение: См. задачу 30347.",
        "Ответ: 15 партий; 5 партий; 15 очков."
    ],
    "30821": [
        "Ориентированные графы",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: В некотором государстве каждый город соединён с каждым дорогой.  Сумасшедший король хочет ввести на дорогах одностороннее движение так, чтобы выехав из любого города, в него нельзя было вернуться. Можно ли так сделать?",
        "Решение: Занумеруем города и направим движение от городов с меньшими номерами к городам с большими номерами.",
        "Ответ: Можно."
    ],
    "32859": [
        "Ориентированные графы",
        "Сложность: 2+",
        "Классы: 7",
        "Условие: В поселке 20 жительниц. 1 марта одна из них узнала интересную новость и сообщила её всем своим подругам. 2 марта те сообщили новость всем своим подругам, и так далее. Может ли так случиться, что:     а) 15 марта ещё не все жительницы будут знать новость, а 18 марта уже  все?    б) 25 марта ещё не все жительницы будут знать новость, а 28 марта уже  все?",
        "Решение: а) Пример. Пусть 1-я дружит только со 2-й, 2-я – еще и с 3-й, 3-я – с 4-й, ..., 16-я – с 17-й, а 17-я – еще и с остальными тремя.",
        "Ответ: а) Может; б) не может."
    ],
    "32993": [
        "Обход графов",
        "Сложность: 2+",
        "Классы: 8",
        "Условие: Гуляя по Кенигсбергу, Леонард Эйлер захотел обойти город, пройдя по каждому   мосту ровно один раз (см. рис.). Как ему это сделать?",
        "Решение: В соответствующем графе (см. рис.) три нечётные вершины. Поэтому обойти его невозможно (см. задачу 31095 а).",
        "Ответ: Это невозможно."
    ],
    "34862": [
        "Сочетания и размещения",
        "Сложность: 2+",
        "Классы: 8,9,10",
        "Условие: В парламенте 30 депутатов. Каждые два из них либо дружат, либо враждуют, причём каждый дружит ровно с шестью другими. Каждые три депутата образуют комиссию. Найдите общее число комиссий, в которых все три члена попарно дружат или все трое попарно враждуют.",
        "Подсказка: В скольких комиссиях состоит депутат? В скольких комиссиях оставшиеся два члена – друг и враг депутата?",
        "Решение: Обозначим депутатов точками. Соединим точки красным отрезком, если cоответствующие депутаты дружат, и синим – если враждуют.  Нам нужно найти число одноцветных треугольников с вершинами в данных точках. Число всех треугольников равно     Подсчитаем сначала число неодноцветных треугольников. В каждом таком треугольнике ровно два угла, в которых сходятся красный и синий отрезки (назовем такие углы разноцветными). В одноцветных треугольниках разноцветных углов нет. В каждой вершине по условию сходятся   6 красных и 23 синих отрезка, то есть имеется 6·23 = 138 разноцветных углов с фиксированной вершиной. Общее количество неодноцветных треугольников, таким образом, равно 138·30:2 = 2070. А число одноцветных треугольников равно 4060 – 2070 = 1990.",
        "Ответ: 1990 комиссий."
    ],
    "35473": [
        "Обход графов",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Художник-авангардист нарисовал картину Контур квадрата и его диагонали.   Мог ли он нарисовать свою картину, не отрывая карандаша от бумаги и не проводя одну линию дважды?",
        "Решение: См. задачу 31092 а).",
        "Ответ: Не мог."
    ],
    "35587": [
        "Подсчет двумя способами",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Несколько шестиклассников и семиклассников обменялись рукопожатиями. При этом оказалось, что каждый шестиклассник пожал руку семи семиклассникам, а каждый семиклассник пожал руку шести шестиклассникам. Кого было больше - шестиклассников или семиклассников?",
        "Подсказка: Как связано число рукопожатий между шестиклассниками и семиклассниками с числом семиклассников?",
        "Решение: Заметим, что общее число рукопожатий между учениками разных классов в шесть раз больше числа семиклассников и в семь раз больше числа шестиклассников.",
        "Ответ: Семиклассников."
    ],
    "88280": [
        "Подсчет двумя способами",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: В сказочной стране Перра-Терра среди прочих обитателей проживают Карабасы и Барабасы. Каждый Карабас знаком с шестью Карабасами и девятью Барабасами. Каждый Барабас знаком с десятью Карабасами исемью Барабасами. Кого вэтой стране больше – Карабасов или Барабасов?",
        "Подсказка: Вспомните задачу 88268.",
        "Решение: Мысленно натянем ниточки между каждым Карабасом и знакомым с ним Барабасом. Тогда от каждого Карабаса протянется 9 ниточек, а от каждого Барабаса – 10 ниточек. Значит, числю ниток одновременно будет в 9 раз больше числа Карабасов и в 10 раз больше числа Барабасов. Следовательно, Карабасов в 10/9 раза больше, чем Барабасов.",
        "Ответ: Карабасов."
    ],
    "32117": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: На некотором острове 15 государств. У каждого из них хотя бы одно  соседнее  государство  дружественное. Докажите, что найдётся государство, у которого чётное  число  дружественных соседей. (Два государства называются соседними, если у них имеется\tцелый кусок общей границы.)",
        "Решение: См. задачу 87972 б)."
    ],
    "60628": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Каждый из людей, когда-либо живших на земле, сделал определённое число рукопожатий.   Докажите, что число людей, сделавших нечётное число рукопожатий, чётно.",
        "Решение: См. задачу 87972 б)."
    ],
    "30417": [
        "Связность и разложение на связные компоненты",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: В стране Цифра есть 9 городов с названиями 1, 2, 3, 4, 5, 6, 7, 8, 9. Путешественник обнаружил, что два города соединены авиалинией в том и только в том случае, если двузначное число, составленное из цифр-названий этих городов, делится на 3. Можно ли добраться из города 1 в город 9?",
        "Решение: Ни из какого города-цифры, не кратной 3, нельзя долететь в город-цифру, кратную 3.",
        "Ответ: Нельзя."
    ],
    "30785": [
        "Деревья",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Докажите, что в дереве каждые две вершины соединены ровно одним простым путем.",
        "Решение: Предположим противное и рассмотрим те две вершины, которые соединены двумя разными простыми путями.     Выберем первую точку, в которой эти пути расходятся. Теперь за выбранной точкой на пути 1 возьмём первую точку, принадлежащую также и пути 2. Участки первого и второго пути между выбранными точками образуют простой цикл, чего в дереве быть не может."
    ],
    "87972": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Докажите, что в любом графе     а) сумма степеней всех вершин равна удвоенному числу рёбер (и следовательно, чётна);     б) число вершин нечётной степени чётно.",
        "Решение: а) При сложении степеней вершин каждое ребро учитывается дважды: по разу для каждой из вершин, которые оно соединяет."
    ],
    "98656": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: У марсиан бывает произвольное число рук. Однажды все марсиане взялись за руки так, что свободных рук не осталось.   Докажите, что число марсиан, у которых нечётное число рук, чётно.",
        "Решение: См. задачу 87972 б)."
    ],
    "21995": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Докажите, что среди любых шести человек есть либо трое попарно знакомых, либо трое попарно незнакомых.",
        "Решение: У данного человека среди остальных пяти есть либо не менее трёх знакомых, либо не менее трёх незнакомых ему. Разберём, например, первый случай. Среди этих трёх людей есть либо двое знакомых – тогда они вместе с выбранным нами исходно человеком образуют нужную тройку, либо они все трое попарно незнакомы."
    ],
    "31079": [
        "Степень вершины",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Есть 20 карточек, у каждой из которых на двух сторонах написано по числу. При этом все числа от 1 до 20 написаны по два раза.   Доказать, что карточки можно разложить так, чтобы все числа сверху были различны.",
        "Решение: Отложим карточки, на которых написано по два одинаковых числа. Возьмём одну из оставшихся карточек. Пусть на ней написаны числа a и b. Положим её числом a вверх. Далее найдём карточку, на которой написано второе число b и положим её числом b вверх. Так будем продолжать, пока не дойдём до карточки, на которой написано второе число a. На этом цикл заканчивается. Если карточки еще остались, начнём новый цикл и т.д."
    ],
    "31098": [
        "Связность и разложение на связные компоненты",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Доказать, что     а) из связного графа можно выкинуть несколько рёбер так,  чтобы осталось дерево;     б) в дереве с n вершинами ровно n – 1 ребро;      в) в дереве не меньше двух висячих вершин;     г) в связном графа из n вершин не меньше n – 1 ребра;     д) если в связном графе n вершин и n – 1 ребро, то он – дерево.",
        "Решение: а) Если граф – не дерево, то в нём есть простой цикл. Любое ребро из этого цикла можно выкинуть без нарушения связности. Этот процесс остановится, когда граф станет деревом."
    ],
    "31354": [
        "Связность и разложение на связные компоненты",
        "Сложность: 3",
        "Классы: 5,6,7,8",
        "Условие: Лифт в 100-этажном доме имеет 2 кнопки: +7 и –9 (первая поднимает лифт на  7 этажей, вторая опускает на 9).Можно ли проехать:     a) с 1-го на 2-й;     б) со 2-го на 1-й;     в) с любого на любой этаж?",
        "Решение: а) Например, можно четыре раза нажать первую кнопку, а затем трижды – вторую.",
        "Ответ: Можно."
    ],
    "32006": [
        "Подсчет двумя способами",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: а) Можно ли занумеровать рёбра куба натуральными числами от 1 до 12 так, чтобы для каждой вершины куба сумма номеров рёбер, которые в ней сходятся, была одинаковой?",
        "Решение: а) Предположим, что это возможно, и сумма номеров рёбер, сходящихся в каждой из восьми вершин, равна x. Сложив эти суммы для всех вершин, получим 8x. С другой стороны, эта сумма равна удвоенной сумме номеров всех рёбер, так как номер каждого ребра входит в неё дважды. Вычислим эту сумму: 2·(1 + 2 + ... + 12) = 156. Отсюда следует, что 8x = 156, то есть x – не целое. Противоречие.",
        "Ответ: а) Нельзя; б) можно."
    ],
    "60635": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Представим себе большой куб, склеенный из 27 меньших кубиков. Термит садится на центр грани одного из наружных кубиков и начинает прогрызать ход. Побывав в кубике, термит к нему уже не возвращается. Движется он при этом всегда параллельно  какому-нибудь ребру большого куба. Может ли термит прогрызть все 26 внешних кубиков и закончить свой ход в центральном кубике? Если возможно, покажите, каким должен быть путь термита.",
        "Решение: Раскрасим кубики в шахматном порядке так, чтобы угловые кубики были чёрными. При этом получится 14 чёрных и 13 белых кубиков. При движении термита цвета кубиков чередуются. Поскольку последний кубик по условию – белый, термит по дороге к нему смог посетить не более 13 чёрных кубиков, то есть хотя бы в одном чёрном кубике он не был.",
        "Ответ: Не может."
    ],
    "77930": [
        "Степень вершины",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На консультации было 20 школьников и разбиралось 20 задач. Оказалось, что   каждый из школьников решил две задачи и каждую задачу решили два школьника. Докажите, что можно так организовать разбор задач, чтобы каждый школьник рассказал одну из решённых им задач и все задачи были разобраны.",
        "Решение: Дадим каждому школьнику карточку, на которой он напишет номера решённых им задач. Теперь задача свелась к задаче 31079."
    ],
    "31069": [
        "Степень вершины",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Имеется 30 человек, некоторые из них знакомы. Доказать, что число человек, имеющих нечётное число знакомых, чётно.",
        "Решение: См. задачу 87972 б)."
    ],
    "88021": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 5,6,7,8",
        "Условие: Можно ли 77 телефонов соединить между собой проводами так, чтобы каждый  был соединён ровно с пятнадцатью?",
        "Решение: См. задачу 87972 б).",
        "Ответ: Нельзя."
    ],
    "88268": [
        "Подсчет двумя способами",
        "Сложность: 3",
        "Классы: 5,6,7",
        "Условие: На кошачьей выставке каждый посетитель погладил ровно трех кошек. При этом  оказалось, что каждую кошку погладили ровно три посетителя.",
        "Решение: Если мы мысленно натянем ниточки между каждой кошкой и погладившим её посетителем, тогда откаждой кошки будут протянуты 3 ниточки  и от каждого посетителя тоже3. Значит, число ниток одновременно в 3 раза больше числа посетителей и в 3 раза больше числа кошек. Отсюда следует, что число кошек равно числу посетителей."
    ],
    "103753": [
        "Целочисленные решетки (прочее)",
        "Сложность: 3",
        "Классы: 5,6,7",
        "Условие: Как, не отрывая карандаша от бумаги, провести шесть отрезков таким образом, чтобы оказались зачёркнутыми 16 точек, расположенных в вершинах квадратной сетки 4&times4?",
        "Ответ: См. рисунок."
    ],
    "103986": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: На третье занятие кружка по математике пришло 17 человек. Может ли случиться так, что каждая девочка знакома ровно с тремя из присутствующих на занятии кружковцев, а каждый мальчик ровно с пятью?",
        "Решение: См. задачу 87972 б).",
        "Ответ: Не может."
    ],
    "31075": [
        "Степень вершины",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: На клетчатом листе закрасили 25 клеток. Может ли каждая из них иметь нечётное число закрашенных соседей?",
        "Решение: См. задачу 87972 б)."
    ],
    "30759": [
        "Планарные графы. Формула Эйлера",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Пусть связный плоский граф с V вершинами и E рёбрами разрезает плоскость на F кусков. Докажите формулу Эйлера: V – E + F = 2.",
        "Решение: Будем удалять рёбра по одному, пока граф не превратится в дерево (как в задаче 31098 а). На каждом шаге число как число рёбер, так и число кусков уменьшается на 1 (при удалении ребра два примыкающих к нему куска сливаются в один). Поэтому величина V – E + F не меняется. Но для полученного дерева она равна 2, поскольку E = V – 1 (см. задачу 31098 б), а F = 1."
    ],
    "30809": [
        "Обход графов",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите, что связный граф с 2n нечётными вершинами можно нарисовать, оторвав карандаш от бумаги ровно n –1 раз и не проводя никакое ребро дважды.",
        "Решение: Разобьём нечётные вершины на пары и каждую пару соединим новым ребром. Согласно задаче 30806 полученный граф можно обойти по циклу. Удалив новые рёбра, мы разобьём цикл на n частей."
    ],
    "31092": [
        "Степень вершины",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: Можно ли начертить, не отрывая  карандаша  от  бумаги (одним росчерком)     а) квадрат с диагоналями?     б) шестиугольник со всеми диагоналями?",
        "Подсказка: См. задачу 31095 а).",
        "Решение: а) В этом графе 4 нечётные вершины.",
        "Ответ: Нельзя."
    ],
    "31093": [
        "Степень вершины",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: Существует ли ломаная, пересекающая все рёбра картинки по одному разу?",
        "Решение: Рассмотрим граф, вершины которого соответствуют шести областям, на которые картинка разбивает плоскость (пять прямоугольников и внешняя область), а рёбра – разделяющим эти обзасти отрезкам. Построив ломаную, мы провели бы в этом графе эйлеров путь. Но в графе три нечётных вершины (степени 5, 5 и 9), поэтому в нем нет эйлерова пути (см. задачу 31095 а).",
        "Ответ: Не существует."
    ],
    "31096": [
        "Степень вершины",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: Доказать, что связный граф можно обойти, проходя по каждому ребру дважды.",
        "Решение: Заменим каждое ребро на два, соединяющих те же вершины. Далее см. задачу 30806."
    ],
    "35362": [
        "Подсчет двумя способами",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: У Царя Гвидона было 5 сыновей. Среди его потомков 100 имели каждый ровно по 3 сына, а остальные умерли бездетными.   Сколько потомков было у царя Гвидона?",
        "Подсказка: При подсчете потомков не забудьте о сыновьях Гвидона.",
        "Решение: Всякий потомок Царя Гвидона – это либо сын одного из его потомков, либо сын самого Гвидона. Из условия следует, что у всех потомков Гвидона было в общей сложности 300 сыновей. А у самого Гвидона было 5 сыновей, следовательно, всего потомков было 305.",
        "Ответ: 305."
    ],
    "31076": [
        "Степень вершины",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Могут ли степени вершин в графе быть равны:     а) 8, 6, 5, 4, 4, 3, 2, 2?     б) 7, 7, 6, 5, 4, 2, 2, 1?     в) 6, 6, 6, 5, 5, 3, 2, 2?",
        "Решение: а) В графе из восьми вершин степень 8 встретиться не может.",
        "Ответ: а)-в) Не может."
    ],
    "88269": [
        "Подсчет двумя способами",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: На кошачьей выставке в ряд сидят 10 котов и 19 кошек, причём рядом с каждой кошкой сидит более толстый кот.   Докажите, что рядом с каждым котом сидит кошка, которая тоньше него.",
        "Решение: Проведём ккаждой кошке стрелочку от сидящего рядом с ней более толстого, чем она, кота. Число стрелочек – 19: столько, сколько кошек. Но, с другой стороны, откаждого кота не может идти больше двух стрелок, так как стрелки направлены на соседних кошек, да ещё не на всех, а только на более худых. Следовательно, стрелки ведут от всех котов, что и требовалось."
    ],
    "31089": [
        "Ориентированные графы",
        "Сложность: 4",
        "Классы: 6,7,8",
        "Условие: В стране каждые два города соединены дорогой с односторонним движением. Доказать, что можно проехать по всем городам, побывав в каждом по одному разу (то есть что в полном ориентированном  графе есть гамильтонов путь).",
        "Решение: Это – переформулировка задачи 30828."
    ],
    "31077": [
        "Степень вершины",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: В графе каждая вершина – синяя или зелёная. При этом каждая синяя вершина связана с пятью синими и десятью зелёными, а каждая зелёная – с девятью синими и шестью зелёными. Каких вершин больше – синих или зелёных?",
        "Подсказка: Одноцветные рёбра можно не учитывать.",
        "Решение: См. задачу 88280.",
        "Ответ: Зелёных."
    ],
    "65307": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: В Долине Пяти Озёр есть пять одинаковых озёр, некоторые из которых соединены ручьями (на рис. пунктиром обозначены возможные маршруты ручьёв). Маленькие караси появляются на свет только в озере S. Пока карась взрослеет, он ровно четыре раз переходит из одного озера в другое по какому-нибудь ручью (карась выбирает ручей наудачу), а затем остается жить в том озере, в котором оказался. Из каждой тысячи карасей в среднем 375 остается жить в озере S, а остальные остаются жить в озере B, в других озерах не остается жить никто. Определите, сколько ручьёв в Долине Пяти Озёр.",
        "Решение: Переход из озера в озеро будем называть маршрутом длины n, если он проходит через n ручьев. Докажем несколько утверждений."
    ],
    "65323": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: На шкуре у Носорога складки – вертикальные и горизонтальные.  Если у Носорога на левом боку a вертикальных, b горизонтальных складок, а на правом – c вертикальных и d горизонтальных, будем говорить, что это Носорог в состоянии (abcd)  или просто Носорог (abcd).    Если Носорог чешется каким-то боком о баобаб вверх-вниз, и у Носорога на этом боку есть две горизонтальные складки, то эти две горизонтальные складки  разглаживаются. Если двух таких складок нет, то ничего не происходит.     Аналогично если Носорог чешется боком вперед-назад, и на этом боку есть две вертикальные складки, то они разглаживаются, если же таких двух складок не найдётся, то ничего не происходит.    Если на каком-то боку две какие-то складки разглаживаются, то на другом боку немедленно появляется две новые складки: одна вертикальная и одна горизонтальная.    Носороги чешутся часто, случайным боком о случайные баобабы в случайных направлениях.",
        "Решение: Построим граф, вершинами которого будем считать состояния Носорога, а рёбрами со стрелками укажем возможные переходы между состояниями и их вероятности.    Оказывается, всего состояний 8. При этом никакое состояние не является конечным – из любого Носорог может перейти в любое другое. Но вот перейдёт ли? Рассмотрим бесконечную последовательность переходов. Поскольку всего состояний конечное число, в силу принципа Дирихле среди них найдётся такое состояние a, которое встретится бесконечное число раз."
    ],
    "78171": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Можно ли расположить все трёхзначные числа, не оканчивающиеся нулями, в последовательности так, чтобы последняя цифра каждого числа была равна первой цифре следующего за ним?",
        "Решение: Рассмотрим полный граф с девятью вершинами, занумерованных цифрами от 1 до 9. Каждому трёхзначному числу вида abc (где a ≠ c), не оканчивающемуся на ноль, сопоставим ребро, соединяющее вершины с номерами a и c. Согласно задаче 30806 в графе существует эйлеров цикл. Пройдя этот цикл десять раз (для b = 0, 1, ..., 9) в одном направлении и десять раз – в другом, получим искомую последовательность без чисел вида aba. Но вставить эти числа в последовательность уже нетрудно.",
        "Ответ: Можно."
    ],
    "78514": [
        "Целочисленные решетки (прочее)",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: На листе бумаги проведено 11 горизонтальных и 11 вертикальных прямых, точки  пересечения которых называются узлами, звеном мы будем называть отрезок прямой, соединяющий два соседних узла одной прямой. Какое наименьшее число звеньев надо стереть, чтобы после этого в каждом узле сходилось не более трёх звеньев?",
        "Решение: Оценка. Назовём узел внутренним, если изначально он принадлежит четырём звеньям. Внутренние звенья образуют квадрат 9×9, поэтому их количество равно 81. Для каждого внутреннего узла мы должны стереть хотя бы одно содержащее его звено, при этом каждое из таких звеньев мы посчитаем  не более двух раз. Следовательно, количество стёртых звеньев не менее 41.    Пример: сотрём все звенья на горизонтальных прямых с 2-й по 10-ю, расположенные между вертикальными прямыми с номерами 2 и 3, 4 и 5, 6 и 7, 8 и 9, а также все звенья на 10-й вертикальной прямой, расположенные между горизонтальными прямыми с номерами 2 и 3, 4 и 5, 6 и 7, 8 и 9, 9 и 10. Итого, стёрто 41 звено.",
        "Ответ: 41 звено."
    ],
    "31081": [
        "Степень вершины",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: В графе из каждой вершины выходит по три ребра. Может ли в нём быть 1990 рёбер?",
        "Решение: См. задачу 30423.",
        "Ответ: Не может."
    ],
    "104056": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 4",
        "Классы: 7,8,9,10",
        "Условие: Хозяйка сделала расстегай и хочет заранее разрезать его на такие (не обязательно равные) части, чтобы пирог можно было разделить поровну и на пятерых, и на семерых. Каким минимальным числом кусков она сможет обойтись?",
        "Решение: Эта задача – частный случай задачи 98057.",
        "Ответ: 11 кусками."
    ],
    "115467": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 4",
        "Классы: 7,8,9,10",
        "Условие: На дне рождения у Васи было 10 ребят (включая Васю). Оказалось, что у каждых двух из этих ребят есть общий дедушка.   Докажите, что у семи из них есть общий дедушка.",
        "Решение: Рассмотрим граф, где вершины соответствуют дедам, а рёбра – общим внукам. Если вершин не более двух, то у каждого деда десять внуков.     Предположим, что вершин ровно три. Они соединены 10 рёбрами. По принципу Дирихле какие-то две вершины соединены не более чем тремя рёбрами. Тогда из третьей вершины выходит не менее семи рёбер. Следовательно, у деда, соответствующего этой вершине, семь внуков.     Предположим, что на вершин более трёх. По условию из каждой вершины выходит хотя бы одно ребро и каждые два ребра имеют общую вершину. Рассмотрим вершину A, из которой выходит хотя бы два ребра AB и AC, и произвольную из оставшихся вершин D. Тогда каждое рёбро из D должно вести в A (иначе найдутся два ребра без общей вершины). Значит, рёбер, соединяющих B с C, нет, и все рёбра выходят из A.     Дед, соответствующий вершине A, будет общим для всех 10 ребят."
    ],
    "30792": [
        "Деревья",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В некоторой стране 30 городов, причём каждый соединён с каждым дорогой.   Какое наибольшее число дорог можно закрыть на ремонт так, чтобы из каждого города можно было проехать в любой другой?",
        "Подсказка: См. задачи 87972 а) и 30791.",
        "Ответ: 30·29 : 2 – 29 = 406."
    ],
    "30806": [
        "Обход графов",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Докажите, что связный граф, имеющий не более двух нечётных вершин, можно нарисовать, не отрывая карандаша от бумаги и проводя каждое ребро ровно один раз.",
        "Решение: Разберём случай, когда граф не имеет нечётных вершин. Индукцией по числу рёбер графа докажем, что его можно обойти по циклу. База (граф без рёбер) очевидна.     Шаг индукции. Рассмотрим произвольный связный граф, степени всех вершин которого чётны. Поскольку в этом графе нет висячих вершин, то он не является деревом, и, следовательно, в нём есть простой цикл. Временно удалим из графа рёбра этого цикла. При этом граф распадётся на несколько компонент связности, имеющих общие вершины с выкинутым циклом. В каждой компоненте все вершины чётны, и по предположению индукции каждую из этих компонент связности можно обойти по циклу. Теперь ясно как обойти требуемым образом исходный граф: обходим цикл и попадая в вершину, относящуюся к какой-то компоненте, обходим её, в конце возвращаясь в ту же вершину, после чего продолжаем движение по циклу.     Доказательство для случая графа с двумя нечётными вершинами аналогично (нужно временно удалить путь, соединяющий две нечётные вершины)."
    ],
    "30824": [
        "Ориентированные графы",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: На ребрах связного графа расставлены стрелки так, что для каждой вершины числа входящих и выходящих рёбер равны.   Докажите, что двигаясь по стрелкам, можно добраться от каждой вершины до любой другой.",
        "Подсказка: Доказательство проводится по индукции аналогично решению задачи 30806."
    ],
    "31091": [
        "Степень вершины",
        "Сложность: 4",
        "Классы: 6,7,8",
        "Условие: В графе 20 вершин, степень каждой не меньше 10. Доказать, что в нём есть гамильтонов путь.",
        "Решение: Выберем самый длинный путь L, в котором вершины не повторяются. Предположим, что он содержит n < 20 вершин. Тогда вне пути лежат 20 – n вершин. Рассмотрим конечную точку K этого пути. Если хотя бы одно ребро ведёт из K в наружную (не принадлежащую L) вершину, то путь L можно удлинить, что противоречит его выбору.     Пусть все пути из K ведут в вершины пути L. Тогда этих вершин не меньше 10 (значит, n > 10). Для каждой такой вершины A рассмотрим вершину A', следующую за ней на пути L. Если хотя бы одно ребро ведёт из A' в (фиксированную) наружную вершину B, то пройдём по пути L от начала до точки A, затем по ребру AK, вернёмся по пути L в точку A' и, наконец, пройдём по ребру A'B. В результате получится путь, содержащий все вершины L и точку B. Снова противоречие.     Значит, с B соединены не более n – 10 вершин пути L. Но тогда степень B не больше (n – 10) + (19 – n) = 9. Противоречие."
    ],
    "32095": [
        "Обход графов",
        "Сложность: 2+",
        "Классы: 5,6,7,8",
        "Условие: Можно ли нарисовать эту картинку (см. рис.), не отрывая карандаша от бумаги и проходя по каждой линии по одному разу?",
        "Решение: Пронумеруем три квадрата, из которых состоит фигура. Начнём рисовать первый квадрат с любой его точки до тех пор, пока не дойдём до точки пересечения со вторым квадратом. Затем прерываем обход первого квадрата и рисуем второй до тех пор, пока не дойдём до его точки пересечения с третьим. Затем рисуем полностью третий квадрат, окончив дорисовываем второй, затем – первый. Каждый раз мы будем оканчивать рисовать квадрат в той же точке, в которой начинали, то есть в точке пересечения с предыдущим квадратом.",
        "Ответ: Можно."
    ],
    "31104": [
        "Теория графов (прочее)",
        "Сложность: 4",
        "Классы: 6,7,8",
        "Условие: а) Какое наибольшее число рёбер может быть в 30-вершинном графе, в котором нет треугольников?   б) Какое наибольшее число рёбер может быть в 30-вершинном графе, в котором нет полного подграфа из четырёх вершин?",
        "Подсказка: Выберите вершину наибольшей степени.",
        "Решение: а) Оценка. Выберем вершину A наибольшей степени n и рассмотрим подграф G, образованный вершинами, куда ведут рёбра из A. Ясно, что в этом подграфе рёбер нет. Каждая вершина, не входящая в G имеет степень не больше n, а выходящие из них рёбра – это все рёбра исходного графа. Таким образом, общее число рёбер исходного графа не превосходит n(30 – n) ≤ 15².     Пример. Разобьём 30 вершин на две группы по 15 и проведём все рёбра, соединяющие вершины из разных групп. Получился граф без треугольников с 225 рёбрами.",
        "Ответ: а) 225; б) 300 рёбер."
    ],
    "78242": [
        "Шахматные доски и шахматные фигуры",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: На шахматной доске выбраны две клетки одинакового цвета.   Доказать, что ладья, начиная с первой, может обойти все клетки по разу, а на второй выбранной клетке побывать два раза.",
        "Решение: Ясно, что если искомый путь ладьи существует при каком-то выборе отмеченных клеток, то он существует и при любом другом выборе, который получается из исходного перестановкой вертикалей или перестановкой горизонталей шахматной доски. Поэтому утверждение задачи достаточно доказать всего в двух случаях:   если первая отмеченная клетка угловая, а вторая 1) соседняя с ней по стороне, 2) соседняя с ней по диагонали. Условие, что две клетки имеют одинаковый цвет – лишнее и никак не используется. В каждом из случаев 1) и 2) легко строится искомый путь ладьи."
    ],
    "78599": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На клетчатой доске 11×11 отмечено 22 клетки так, что на каждой вертикали и на каждой горизонтали отмечено ровно две клетки. Два расположения отмеченных клеток эквивалентны, если, меняя любое число раз вертикали между собой и горизонтали между собой, мы из одного расположения можем получить другое. Сколько существует неэквивалентных расположений отмеченных клеток?",
        "Решение: Рассмотрим двудольный граф, вершинами которого являются строки и столбцы данной доски, причём строка и столбец соединены ребром тогда и только тогда, когда клетка на их пересечении отмечена. Заметим, что перестановки строк и перестановки столбцов исходной таблицы соответствуют перенумерациям вершин в каждой из долей получившегося графа. Это значит, что эквивалентным расположениям соответствуют изоморфные графы, а неэквивалентным – неизоморфные. Таким образом, число неэквивалентных расположений отмеченных клеток равно числу неизоморфных графов, соответствующих каким-нибудь расположениям.     Посмотрим, какие графы соответствуют каким-нибудь расположениям отмеченных клеток. Во-первых, в каждой доле этого графа должно быть по 11 вершин (доля строк и доля столбцов). Во-вторых, степень каждой вершины равна 2, а значит, граф распадается на циклы. Так как граф двудольный, то длины этих циклов чётны.  Кроме того, так как в графе нет кратных рёбер, то длина каждого такого цикла не меньше четырёх. Изоморфизм двух таких графов равносилен совпадению у них набора длин циклов. Следовательно, искомое число равно количеству представлений числа 22 в виде суммы чётных слагаемых, каждое из которых не менее четырёх (суммы, отличающиеся лишь порядком слагаемых, считаются одинаковыми), то есть количеству представлений числа 11 в виде суммы слагаемых, каждое из которых не меньше 2. Выписав все эти представления, можно убедиться, что их ровно 14.",
        "Ответ: 14 расположений."
    ],
    "78828": [
        "Обход графов",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: В городе Никитовка двустороннее движение. В течение двух лет в городе  проходил ремонт всех дорог. Вследствие этого в первый год на некоторых дорогах  было введено одностороннее движение. На следующий год на этих дорогах было  восстановлено двустороннее движение, а на остальных дорогах введено  одностороннее движение. Известно, что в каждый момент ремонта можно было проехать  из любой точки города в любую другую. Доказать, что в Никитовке можно ввести одностороннее движение так, что из каждой точки города удастся проехать в  любую другую точку.",
        "Решение: Индукция по числу городских перекрёстков (из которых исходят более двух дорог).     База. Если в Никитовке имеются всего два перекрёстка A и B, то утверждение очевидно: по условию из A в B ведут не менее двух дорог; поэтому достаточно установить по одной из этих дорог движение от A к B, а по второй – от B к A, мы сможем проехать от каждого перекрёстка до любого, отличного от него.     Шаг индукции. Рассмотрим город Никитовку, имеющий n + 1 перекрёсток и  два соседних из этих перекрёстков – перекрёстки A и B, соединённые улицей AB. Поскольку  после введения на улице AB (при её ремонте) одностороннего движения – скажем, от A к B – проехать от B к A было возможно, то из B в A ведёт некоторая не включающая улицы AB цепочка улиц (эту цепочку можно считать не имеющей самопересечений). Таким образом, мы приходим к существованию в Никитовке кольца s – замкнутой сети улиц, ведущей из A в B, а затем (через ряд промежуточных перекрёстков) – снова в A.     Рассмотрим теперь новый город, план которого получается из плана Никитовки склеиванием всех перекрёстков нашего кольца s в один перекрёсток S, из которого исходят все улицы, реально упирающиеся в кольцо s. Число перекрёстков такого условного города меньше n + 1; поэтому по предположению индукции в нём можно ввести по всем улицам одностороннее движение с соблюдением требований задачи. Если мы затем оставим движение по всем не входящим в кольцо s улицам таким же, каким оно было в этом новом городе, а по кольцу s пустим движение в одном (безразлично каком!) направлении, то на всех улицах Никитовки будет установлено одностороннее движение – и притом с каждого перекрёстка можно будет проехать в любой другой."
    ],
    "32861": [
        "Степень вершины",
        "Сложность: 2+",
        "Классы: 7",
        "Условие: Страна называется пятёрочной, если в ней каждый город соединён авиалиниями ровно с пятью другими городами (международных рейсов нет).      а) Нарисуйте схему авиалиний для пятёрочной страны из 10 городов.    б) Сколько авиалиний в пятёрочной стране из 50 городов?     в) Может ли существовать пятёрочная страна, в которой ровно 46 авиалиний?",
        "Решение: а) В правильном десятиугольнике проведём все стороны, все малые диагонали (соединяющие вершины через одну) и все большие диагонали (соединяющие противоположные вершины).",
        "Ответ: б) 125 авиалиний; в) не может."
    ],
    "109427": [
        "Математическая логика (прочее)",
        "Сложность: 4+",
        "Классы: 6,7,8,9",
        "Условие: Кощей Бессмертный похитил у царя трёх дочерей. Отправился Иван-царевич их выручать. Приходит он к Кощею, а тот ему и говорит: Завтра поутру увидишь пять заколдованных девушек. Три из них – царёвы дочери, а ещё две – мои. Для тебя они будут неотличимы, а сами друг дружку различать смогут. Я подойду к одной из них и стану у неё спрашивать про каждую из пятерых: Это царевна?. Она может отвечать и правду, и неправду, но ей дозволено назвать царевнами ровно двоих (себя тоже можно называть). Потом я так же опрошу каждую из остальных девушек, и они тоже должны будут назвать царевнами ровно двоих. Если после этого угадаешь, кто из них и вправду царевны, отпущу тебя восвояси невредимым. А если ещё и догадаешься, которая царевна старшая, которая средняя, а которая младшая, то и их забирай с собой. Иван может передать царевнам записку, чтобы научить их, кого назвать царевнами. Может ли он независимо от ответов Кощеевых дочерей     а) вернуться живым?      б) увезти царевен с собой?",
        "Решение: а) Пусть все царевны назовут царевнами Кощеевых дочек (рис. слева). Тогда Кощеевых дочек назовут не менее трёх раз, а царевен – не более чем дважды. Так Иван их и отличит.",
        "Ответ: Может."
    ],
    "73550": [
        "Числовые таблицы и их свойства",
        "Сложность: 5",
        "Классы: 8,9,10",
        "Условие: Квадратная таблица размером n×n заполнена неотрицательными числами так, что как сумма чисел каждой строки, так и сумма чисел каждого столбца равна 1. Докажите, что из таблицы можно выбрать n положительных чисел, никакие два из которых не стоят ни в одном столбце, ни в одной строке.",
        "Решение: Заметим сначала, что если мы будем переставлять между собой строки (или столбцы) нашей таблицы, то это не повлияет ни на условие задачи, ни на то,  что нам требуется доказать. Предположим, что перестановками строк и столбцов  мы собрали в правый верхний угол размером k×m одни нули (см. рис.)."
    ],
    "32991": [
        "Степень вершины",
        "Сложность: 2+",
        "Классы: 8",
        "Условие: Можно ли семь телефонов соединить проводами так, чтобы каждый телефон был соединён ровно с тремя?",
        "Решение: См. задачу 30418.",
        "Ответ: Нельзя."
    ],
    "32992": [
        "Планарные графы. Формула Эйлера",
        "Сложность: 2+",
        "Классы: 8",
        "Условие: Можно ли расположить на плоскости     а) 4 точки так, чтобы каждая из них была соединена отрезками с тремя другими (без пересечений)?     б) 6 точек и соединить их непересекающимися отрезками так, чтобы из каждой точки выходило ровно 4 отрезка?",
        "Решение: См. рис.",
        "Ответ: Можно."
    ],
    "31355": [
        "Обратный ход",
        "Сложность: 3",
        "Классы: 5,6,7,8",
        "Условие: В 15-этажном доме имеется лифт с двумя кнопками: +7 и –9   (см. задачу 31354). Можно ли проехать с 3-го этажа на 12-й?",
        "Решение: Первый способ. С 3-го этажа за один ход можно попасть только на 10-й, оттуда – только на 1-й, потом – на 8-й, на 15-й, на 6-й, на 13-й, на 4-й, на 11-й, на 2-й и наконец на 9-й. А с 9-го этажа никуда проехать нельзя.",
        "Ответ: Нельзя."
    ],
    "32022": [
        "Обход графов",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: В одной из вершин а) октаэдра; б) куба сидит муха. Может ли она проползти по всем его рёбрам ровно по одному разу и возвратиться в исходную вершину?",
        "Решение: а) Пусть, A, B, C, A1, B1, C1 – вершины октаэдра, причём (A, A1), (B, B1) и (B, B1) – пары противоположных вершин. Тогда любая пара вершин, кроме этих трёх, соединяется ребром. Путь мухи может быть следующим: ABA1C1BCAC1B1CA1B1A (см. рис.)",
        "Ответ: а) Может; б) не может."
    ],
    "32824": [
        "Турниры и турнирные таблицы",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Трое друзей играли в шашки. Один из них сыграл 25 игр, а другой – 17 игр. Мог ли третий участник сыграть  а) 34;  б) 35;  в) 56 игр?",
        "Решение: а) Например, первый с третьим сыграли 21 игру, второй с третьим – 13 игр, а первый со вторым – 4 игры.     б) Пусть это произошло. Тогда общее число игр было бы равно (25 + 17 + 35) : 2 = 38.5 игр – не целое число. Противоречие.     в) Третий игрок не может сыграть больше партий, чем первый и второй вместе взятые. Не играл же он сам с собой!",
        "Ответ: а) Мог; б)-в) не мог."
    ],
    "34851": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: В дискуссии приняли участие 15 депутатов. Каждый из них в своем выступлении   раскритиковал ровно k из оставшихся 14 депутатов.  При каком наименьшем k можно утверждать, что найдутся два депутата, которые раскритиковали друг друга?",
        "Подсказка: Рассмотрите ориентированный граф, вершины которого соответствуют депутатам, а ребро, ведущее из A в B, означает, что депутат A раскритиковал депутата B.",
        "Решение: Если каждый депутат раскритиковал 8 других, то число рёбер указанного в подсказке графа равно 15·8 = 120, что больше, чем число пар  его вершин. Это доказывает, что какие-то две вершины соединяются не менее чем двумя рёбрами, то есть найдутся два депутата, которые раскритиковали друг друга.    С другой стороны, пусть 15 депутатов сидят за круглым столом и каждый раскритиковал семь следующих за ним по часовой стрелке. Легко видеть, что при этом никакие два депутата не критиковали друг друга.",
        "Ответ: При k = 8."
    ],
    "35363": [
        "Обход графов",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Жук ползёт по рёбрам куба. Сможет ли он последовательно обойти все рёбра, проходя по каждому ребру ровно один раз?",
        "Решение: См. задачу 32022 б).",
        "Ответ: Не может."
    ],
    "30419": [
        "Степень вершины",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: В государстве 100 городов, и из каждого из них выходит 4 дороги. Сколько всего дорог в государстве?",
        "Ответ: 100·4 : 2 = 200."
    ],
    "32994": [
        "Теория графов (прочее)",
        "Сложность: 2+",
        "Классы: 8",
        "Условие: Выписать в ряд цифры от 1 до 9 (каждую по разу) так, чтобы каждые две подряд идущие цифры давали бы двузначное число, делящееся на 7 или на 13.",
        "Ответ: Например, 784913526."
    ],
    "65661": [
        "Математическая логика (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: На острове живут лжецы, которые всегда лгут, и рыцари, которые всегда говорят правду. Каждый из них сделал по два заявления: 1) Среди моих друзей – нечётное количество рыцарей; 2) Среди моих друзей – чётное количество лжецов. Чётно или нечётно количество жителей острова?",
        "Решение: Вне зависимости от того, кто произносит указанные две фразы, рыцарь или лжец, у этого жителя нечётное количество друзей. Действительно, обе фразы одновременно либо правдивы, либо ложны, поэтому и в том, и в другом случае, количество друзей – это сумма чётного и нечётного чисел.     Согласно задаче 87972 число вершин нечётной степени чётно. Следовательно, на острове – чётное количество жителей.",
        "Ответ: Чётно."
    ],
    "35501": [
        "Ориентированные графы",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: На сторонах некоторого многоугольника расставлены стрелки.   Докажите, что число вершин, в которые входят две стрелки, равно числу вершин, из которых выходят две стрелки.",
        "Подсказка: Число выходящих стрелок равно числу вершин многоугольника.",
        "Решение: Пусть n – число сторон данного многоугольника, а k – число вершин, в которые входит по две стрелки. Всего стрелок – n, из них 2k стрелок входят в данные k вершин, остальные n – 2k стрелок входят еще в n – 2k вершин (в каждую – по одной). Остаётся n – k – (n – 2k) = k вершин, в которые не входит ни одной стрелки, то есть из которых выходит по две стрелки."
    ],
    "35765": [
        "Степень вершины",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что не существует многогранника, у которого было бы ровно семь рёбер.",
        "Подсказка: Из каждой вершины многогранника выходит не меньше трёх рёбер.",
        "Решение: Если у многогранника четыре вершины, то это тетраэдр, имеющий шесть рёбер. Пусть число n вершин многогранника не меньше пяти. В каждой вершине многогранника сходится по крайней мере три грани, таким образом, из каждой вершины многогранника выходит не меньше трёх рёбер. Значит, всего ребёр не меньше чем  3n/2 > 7."
    ],
    "30432": [
        "Обход графов",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: а) Дан кусок проволоки длиной 120 см.  Можно ли, не ломая проволоки, изготовить каркас куба с ребром 10 см? \t  б) Какое наименьшее число раз придется ломать проволоку, чтобы всё же изготовить требуемый каркас?",
        "Решение: а) Если бы это удалось, то проволока шла бы по рёбрам куба без наложения, то есть мы как бы нарисовали каркас куба, не отрывая карандаша от бумаги. Но это невозможно, так как у куба восемь нечётных вершин.",
        "Ответ: а) Нельзя; б) три раза."
    ],
    "30786": [
        "Деревья",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Докажите, что в дереве есть вершина, из которой выходит ровно одно ребро (такая вершина называется висячей).",
        "Решение: Рассмотрим произвольную вершину дерева и пойдём по любому выходящему из неё ребру в другую вершину. Если из новой вершины больше рёбер не выходит, то мы остаёмся в ней, а в противном случае идём по любому другому ребру дальше. В этом путешествии мы никогда не сможем попасть в вершину, в которой уже побывали: это означало бы наличие цикла. Так как у графа конечное число вершин, то наше путешествие когда-нибудь закончится. Но закончиться оно может только в висячей\tвершине!"
    ],
    "30788": [
        "Деревья",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Докажите, что при удалении любого ребра из дерева оно превращается в несвязный граф.",
        "Решение: Предположим, что концы удалённого ребра в новом графе соединены простым путем.  Тогда этот путь вместе с удалённым ребром образует в исходном графе цикл."
    ],
    "31082": [
        "Степень вершины",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Доказать, что число штатов США с нечётным  числом  соседей чётно.",
        "Решение: См. задачу 87972 б)."
    ],
    "31097": [
        "Обход графов",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: а) Из какого минимального числа кусков проволоки можно спаять каркас куба?    б) Какой максимальной длины кусок проволоки можно вырезать из этого каркаса? (Длина ребра куба равна 1 см.)",
        "Решение: а) См. задачу 30432 б).",
        "Ответ: а) Из четырёх кусков; б) 9 см."
    ],
    "103745": [
        "Обход графов",
        "Сложность: 3",
        "Классы: 7",
        "Условие: Метро города Урюпинска состоит из трёх линий и имеет по крайней мере две конечные станции и по крайней мере два пересадочных узла, причём ни одна из конечных станций не является пересадочной. С каждой линии на любую из остальных можно перейти по крайней мере в двух местах. Нарисуйте пример такой схемы метро, если известно, что это можно сделать, не отрывая карандаша от бумаги и не проводя два раза один и тот же отрезок.",
        "Подсказка: Не забудьте, что бывают кольцевые линии.",
        "Ответ: См. рисунок."
    ],
    "30416": [
        "Обход графов",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: Доска имеет форму креста, который получается, если из квадратной доски 4×4 выкинуть угловые клетки.   Можно ли обойти её ходом шахматного коня и вернуться на исходное поле, побывав на всех полях ровно по разу?",
        "Решение: Занумеруем поля доски (рис. слева) и нарисуем граф (рис. в центре), где вершины соответствуют полям, а ребро проводится, если соответствующие поля отстоят на ход коня. На графе легко построить требуемый обход (жирная линия). На рис. справа поля занумерованы уже в порядке обхода.",
        "Ответ: Можно."
    ],
    "30420": [
        "Степень вершины",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: В классе 30 человек. Может ли быть так, что 9 из них имеют по 3 друга (в этом классе), 11 – по 4 друга, а 10 – по 5 друзей?",
        "Решение: В соответствующем графе было бы 30 вершин, 9 из которых имели бы степень 3, 11 – степень 4, 10 – степень 5. Однако у такого графа 19 нечётных   вершин, что противоречит задаче 87972 б).",
        "Ответ: Не может."
    ],
    "30428": [
        "Связность и разложение на связные компоненты",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Докажите, что граф с n вершинами, степень каждой из которых не менее n–1/2, связен.",
        "Решение: Рассмотрим две произвольных вершины и предположим, что они не соединены путем, то есть такой последовательностью ребер, в которой начало очередного ребра  совпадает с концом предыдущего. Каждая из этих двух вершин  по условию соединена не менее, чем с n–1/2 другими; при этом все упомянутые вершины различны – ведь если какие-то две из них совпадают, то есть путь, соединяющий исходные вершины.     Таким образом, в графе не менее n–1/2 + n–1/2 + 2 = n + 1 вершин.  Противоречие."
    ],
    "30429": [
        "Связность и разложение на связные компоненты",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: В Тридевятом царстве лишь один вид транспорта – ковер-самолет. Из столицы выходит 21 ковролиния, из города Дальний – одна, а из всех остальных городов – по 20. Докажите, что из столицы можно долететь в Дальний (возможно, с пересадками).",
        "Решение: Рассмотрим компоненту связности графа ковролиний, содержащую столицу. Предположим, что она не содержит город Дальний. Тогда в этой компоненте связности из одной вершины (столицы) выходит 21 ребро, а из всех остальных вершин – по 20 рёбер. Таким образом в этом подграфе ровно одна нечётная вершина.  Противоречие с задачей 87972 б)."
    ],
    "30782": [
        "Степень вершины",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Верно ли, что два графа изоморфны, если     а) у них по 10 вершин, степень каждой из которых равна 9?     б) у них по 8 вершин, степень каждой из которых равна 3?     в) они связны, без циклов и содержат по 6 рёбер?",
        "Решение: а) В таком графе каждая вершина соединена со всеми остальными.",
        "Ответ: а) Верно; б)-в) неверно."
    ],
    "30808": [
        "Обход графов",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На плоскости дано 100 окружностей, составляющих связную (то есть не распадающуюся на части) фигуру.   Докажите, что эту фигуру можно нарисовать, не отрывая карандаша от бумаги и не проводя дважды одну и ту же линию.",
        "Решение: Граф связен, степени всех его вершин чётны (см. задачу 30806)."
    ],
    "30815": [
        "Теория графов (прочее)",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Каждое из рёбер полного графа с 6 вершинами покрашено в один из двух цветов.  Докажите, что есть три вершины, все рёбра между которыми – одного цвета.",
        "Решение: См. задачу 21995."
    ],
    "30820": [
        "Ориентированные графы",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: В некоторой стране есть столица и еще 100 городов. Некоторые города (в том числе и столица) соединены дорогами с односторонним движением. Из каждого нестоличного города выходит 20 дорог, и в каждый такой город входит 21 дорога.  Докажите, что в столицу нельзя проехать ни из одного города.",
        "Решение: Пусть в столицу входит a дорог. Тогда общее число входящих дорог равно 21·100 + a, а общее количество выходящих дорог не больше   20·100 + (100 – a). Поэтому 21·100 + a ≤ 20·100 + (100 – a), то есть 2a ≤ 0. Таким образом, a = 0."
    ],
    "30822": [
        "Ориентированные графы",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Докажите, что на рёбрах связного графа можно так расставить стрелки, чтобы из некоторой вершины можно было добраться по стрелкам до любой другой.",
        "Решение: Зафиксируем вершину A. Рассмотрим сначала вершины, соединённые с A, затем – новые вершины, соединённые с ними, и т.д. При этом рёбра, соединяющие добавляемые вершины с уже рассмотренными, ориентируем в направлении к новым вершинам."
    ],
    "31072": [
        "Связность и разложение на связные компоненты",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: В некоторой стране из столицы  выходит  89  дорог,  из  города Дальний – одна дорога, из остальных 1988 городов – по  20  дорог.  Доказать, что из столицы можно проехать в Дальний.",
        "Решение: См. задачу 30429."
    ],
    "31078": [
        "Связность и разложение на связные компоненты",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: В графе 100 вершин, причём степень каждой из них не меньше 50. Доказать, что граф связен.",
        "Решение: См. задачу 30428."
    ],
    "31087": [
        "Планарные графы. Формула Эйлера",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Грани некоторого многогранника раскрашены в два цвета так, что соседние грани имеют разные цвета. Известно, что  все  грани, кроме одной, имеют число рёбер, кратное 3. Доказать, что и эта одна грань имеет кратное 3 число рёбер.",
        "Решение: Общее число рёбер многогранника равно общему числу рёбер белых граней и общему числу рёбер чёрных граней. Одна из этих сумм (а значит, и вторая) кратна 3. Во второй все слагаемые, кроме одного, кратны 3. Значит, и это слагаемое кратно 3."
    ],
    "30421": [
        "Степень вершины",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: В городе Маленьком 15 телефонов. Можно ли их соединить проводами так, чтобы было четыре телефона, каждый из которых соединен с тремя другими, восемь телефонов, каждый из которых соединен с шестью, и три телефона, каждый из которых соединен с пятью другими?",
        "Решение: В соответствующем графе было бы семь нечётных вершин, что противоречит задаче 87972 б).",
        "Ответ: Нельзя."
    ],
    "31363": [
        "Теория графов (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: а) В группе из четырёх человек, говорящих на разных языках, любые трое могут общаться (возможно, один переводит двум другим).   Доказать, что их можно разбить  на пары, в каждой из которых имеется общий язык.   б) То же для группы из 100 человек.   в) То же для группы из 102 человек.",
        "Решение: а) Рассмотрим граф с четырьмя вершинами A, B, C, D, соответствующими людям, и соединим ребрами людей, знающих общий язык. Условие означает, что каждая тройка вершин соединена хотя бы двумя рёбрами. А доказать нужно, что есть два ребра без общих вершин. Пусть это неверно.     Первый способ. Если в тройке (A, B, C) проведены рёбра AB и AC, то рёбер BD и CD нет. Но тогда в тройке (B, C, D) не больше одного ребра. Противоречие.     Второй способ. Всего есть 4 тройки. Каждое ребро входит в две тройки. Следовательно, рёбер не менее 4·2 : 2 = 4. С другой стороны, каждому ребру соответствует отсутствующее противоположное ребро. Следовательно, рёбер не более трёх. Противоречие."
    ],
    "32995": [
        "Деревья",
        "Сложность: 3",
        "Классы: 8",
        "Условие: В Заитильщине 57 деревень, между некоторыми из которых проложены дороги. Известно, что из каждой деревни можно попасть в любую другую, притом по единственному маршруту.     а) Докажите, что найдётся деревня, из которой выходит лишь одна дорога.     б) Сколько дорог в Заитильщине?",
        "Подсказка: См. задачу 31098 в) и б).",
        "Ответ: б) 56 дорог."
    ],
    "35438": [
        "Теория графов (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: В компании у каждых двух людей ровно пять общих знакомых. Докажите, что количество пар знакомых делится на 3.",
        "Подсказка: Выразите количество троек попарно знакомых людей через количество пар знакомых.",
        "Решение: Обозначим через Р количество пар знакомых людей (то есть число рёбер в соответствующем графе), а через Т – количество треугольников в этом графе. По условию каждое из рёбер входит ровно в 5 треугольников. С другой стороны, в каждый из Т треугольников содержит ровно 3 ребра. Следовательно, 5Р = 3Т. Поскольку 3 и 5 – взаимно простые числа, Р делится на 3."
    ],
    "35514": [
        "Обход графов",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В углах шахматной доски 3×3 стоят четыре коня: два белых (в соседних углах) и два чёрных.   Можно ли за несколько ходов поставить коней так, чтобы во всех соседних углах стояли кони различного цвета?",
        "Подсказка: Кони ходят только циклу из восьми полей.",
        "Решение: Отметим центры клеток доски и соединим отрезками пары отмеченных точек, если из одной в другую можно пройти ходом коня. Получится цикл из восьми точек. Перемещение коней по доске соответствует движению по рёбрам этого цикла. Но при движении по циклу нельзя изменить порядок следования коней.",
        "Ответ: Нельзя."
    ],
    "60367": [
        "Теория графов (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9,10",
        "Условие: На плоскости даны шесть точек так, что никакие три из них не лежат на одной прямой. Каждая пара точек соединена отрезком синего или красного цвета. Докажите, что среди данных точек можно выбрать такие три, что все стороны образованного ими треугольника будут окрашены в один цвет.",
        "Решение: См. задачу 21995."
    ],
    "78020": [
        "Деревья",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Дан отрезок OA. Из конца отрезка A выходит 5 отрезков AB1, AB2, AB3, AB4, AB5. Из каждой точки Bi могут выходить ещё пять новых отрезков или ни одного нового отрезка и т.д. Может ли число свободных концов построенных отрезков равняться 1001? Под свободным концом отрезка понимаем точку, принадлежащую только одному отрезку (кроме точки O).",
        "Решение: При проведении пяти отрезков из конца отрезка появляются 5 новых свободных концов и пропадает один старый. В результате число свободных концов увеличивается на 4. Поэтому если пятёрки отрезков проведены k раз, то число свободных концов равно 4k + 1. При k = 250 получаем нужное число свободных концов.",
        "Ответ: Может."
    ],
    "78266": [
        "Деревья",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: n точек соединены отрезками так, что каждая точка с чем-нибудь соединена и нет таких двух точек, которые соединялись бы двумя разными путями.  Доказать, что общее число отрезков равно n – 1.",
        "Решение: См. задачу 31098 б)."
    ],
    "78492": [
        "Связность и разложение на связные компоненты",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Система точек, соединённых отрезками, называется связной, если из каждой точки можно пройти в любую другую по этим отрезкам. Можно ли соединить пять точек в связную систему так, чтобы при стирании любого отрезка образовались ровно две связные системы точек, не связанные друг с другом? (Мы считаем, что в местах пересечения отрезков переход с одного из них на другой невозможен.)",
        "Решение: Такое возможно, например, если все точки соединены в цепь.",
        "Ответ: Можно."
    ],
    "78653": [
        "Связность и разложение на связные компоненты",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Как соединить 50 городов наименьшим числом авиалиний так, чтобы из каждого  города можно было попасть в любой, сделав не более двух пересадок?",
        "Решение: Выделим один город и соединим его авиалинией с каждым из остальных 49 городов. Для этого потребуется 49 авиалиний.     Меньшим числом авиалиний обойтись нельзя. Действительно, согласно задаче 31098 г) в связном графе с 50 вершинами не менее 49 рёбер."
    ],
    "30427": [
        "Связность и разложение на связные компоненты",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: В стране Семёрка 15 городов, каждый из которых соединён дорогами не менее, чем с семью другими.   Докажите, что из каждого города можно добраться до любого другого (возможно, проезжая через другие города).",
        "Решение: Рассмотрим два произвольных города и предположим, что они не соединены путем, то есть такой последовательностью дорог, в которой начало очередной дороги совпадает с концом предыдущей. Каждый из этих двух городов по условию соединен не менее, чем с семью другими; при этом все упомянутые города различны – ведь если какие-то два из них совпадают, то есть путь, соединяющий исходные города.     Таким образом, мы насчитали не менее 16 городов. Противоречие."
    ],
    "79570": [
        "Степень вершины",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В компании из семи мальчиков каждый имеет среди остальных не менее трёх братьев.  Докажите, что все семеро – братья.",
        "Решение: Возьмём любых двух мальчиков из этой компании. Предположим, что они не братья. Тогда каждый из них имеет среди оставшихся пяти мальчиков по три брата. Следовательно, у них есть общий брат, а значит, они братья. Итак, любые два мальчика из этой компании – братья."
    ],
    "88006": [
        "Степень вершины",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Во время шахматного турнира, несколько игроков сыграли нечётное количество партий. Докажите, что число таких игроков чётно.",
        "Решение: См. задачу 87972 б)."
    ],
    "88155": [
        "Степень вершины",
        "Сложность: 3",
        "Классы: 5,6,7",
        "Условие: Школьник сказал своему приятелю Вите Иванову:     – У нас в классе тридцать пять человек. И представь, каждый из них дружит ровно содиннадцатью одноклассниками...     – Не может этого быть, – сразу ответил Витя Иванов, победитель  математической олимпиады.      Почему он так решил?",
        "Решение: См. задачу 87972 б)."
    ],
    "104078": [
        "Степень вершины",
        "Сложность: 3",
        "Классы: 5,6,7,8",
        "Условие: В норке живёт семья из 24 мышей. Каждую ночь ровно четыре из них отправляются на склад за сыром.   Может ли так получиться, что в некоторый момент времени каждая мышка побывала на складе с каждой ровно по одному разу?",
        "Решение: Каждая мышка за одну ночь может побывать на складе с тремя другими мышками. Чтобы побывать на складе с каждой из 23 других мышек по одному разу, ей необходимо 23 : 3 ночей. Но число 23 не делится на 3. Поэтому такая ситуация невозможна.",
        "Ответ: Не может."
    ],
    "30430": [
        "Связность и разложение на связные компоненты",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: В стране из каждого города выходит 100 дорог и от каждого города можно добраться до любого другого. Одну дорогу закрыли на ремонт.  Докажите, что и теперь от каждого города можно добраться до любого другого.",
        "Решение: Если закрыта дорога AB, то нам достаточно доказать, что и после этого можно добраться из A в B. Если это не так, то в компоненте связности, содержащей A, все вершины, кроме A, – чётные. Но наличие ровно одной нечётной вершины противоречит задаче 87972 б)."
    ],
    "30781": [
        "Степень вершины",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Докажите, что существует граф с 2n вершинами, степени которых равны 1, 1, 2, 2, ..., n, n.",
        "Подсказка: Используйте индукцию по n.",
        "Решение: Будем строить граф по индукции. База. Для n = 1 такой граф существует: две вершины, соединённые ребром.     Шаг индукции. Пусть граф с 2n вершинами и указанными степенями уже построен. Добавим к нему две вершины A и B. Вершину A соединим с n старыми вершинами со степенями 1, ..., n, а также с вершиной B. В результате у половины старых вершин степени не изменятся, у оставшихся – увеличатся на 1, степень A будет равна n + 1, а степень B будет равна 1. Это и есть искомый граф с 2n + 2 вершинами."
    ],
    "30787": [
        "Деревья",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: В графе все вершины имеют степень 3. Докажите, что в нём есть цикл.",
        "Решение: Рассмотрим произвольную компоненту связности этого графа. Она не является деревом, так как в ней нет висячей вершины (см. задачу 30786). Значит, в ней есть цикл."
    ],
    "30789": [
        "Деревья",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: В стране Древляндия 101 город, и некоторые из них соединены дорогами. При этом каждые два города соединяет ровно один путь.   Сколько в этой стране дорог?",
        "Решение: См. задачи 30784 и 31098 б).",
        "Ответ: 100 дорог."
    ],
    "30795": [
        "Планарные графы. Формула Эйлера",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: В стране Озёрная семь озер, соединённых между собой десятью непересекающимися каналами, причём от каждого озера можно доплыть до любого другого. Сколько в этой стране островов?",
        "Решение: Рассмотрим плоский граф, вершины которого соответствуют озёрам, а рёбра – каналам. Пусть он разрезает плоскость на F кусков. По формуле Эйлера (задача 30759) 7 – 10 + F = 2, то есть F = 5. Один из этих кусков материк, а остальные – острова.",
        "Ответ: 4 острова."
    ],
    "30431": [
        "Обход графов",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: Имеется группа островов, соединённых мостами так, что от каждого острова можно добраться до любого другого. Турист обошёл все острова, пройдя по каждому мосту ровно один раз. На острове Троекратном он побывал трижды. Сколько мостов ведёт с Троекратного, если турист     а) не с него начал и не на нём закончил?     б) с него начал, но не на нём закончил?     в) с него начал и на нём закончил?",
        "Решение: а) На Троекратый турист 3 раза зашёл и 3 раза с него вышел, то есть использовал 6 мостов.",
        "Ответ: а) 6 мостов; б) 5 мостов; в) 4 моста."
    ],
    "30797": [
        "Планарные графы. Формула Эйлера",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите, что для плоского графа справедливо неравенство 2E ≥ 3F.",
        "Подсказка: Каждый кусок ограничивается не менее, чем тремя рёбрами.",
        "Решение: Поставим у каждого ребра две точки: по одной в каждом из прилегающих к нему кусков. В каждый кусок попадёт не меньше трёх точек, поэтому всего точек не меньше 3F. С другой стороны, точек ровно 2E."
    ],
    "30810": [
        "Степень вершины",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: На конференции присутствуют 50 учёных, каждый из которых знаком по крайней мере с 25 участниками конференции.   Докажите, что найдутся четверо из них, которых можно усадить за круглый стол так, чтобы каждый сидел рядом со знакомыми ему людьми.",
        "Подсказка: Рассмотрите двух незнакомых учёных и их знакомых.",
        "Решение: Рассмотрим двух незнакомых учёных (если таких нет, то всё в порядке). Каждый из них имеет по 25 знакомых среди оставшихся 48, значит, у них есть по крайней мере два общих знакомых. Этих четверых и усадим за стол."
    ],
    "30813": [
        "Деревья",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Дима нарисовал на доске семь графов, каждый из которых является деревом с шестью вершинами. Докажите, что среди них есть два изоморфных.",
        "Решение: Нетрудно проверить, что существует всего 6 различных деревьев с шестью вершинами (см. рис.)."
    ],
    "30826": [
        "Ориентированные графы",
        "Сложность: 3+",
        "Классы: 8",
        "Условие: Несколько команд сыграли между собой круговой турнир по волейболу.  Будем говорить, что команда",
        "Решение: б) Пусть турнир выиграла команда А. Если существует команда B, выигравшая и у А, и у всех команд, проигравших А, то у такой команды очков больше, чем у А, что невозможно. Противоречие."
    ],
    "30829": [
        "Ориентированные графы",
        "Сложность: 3+",
        "Классы: 8",
        "Условие: Какие-то две команды набрали в круговом волейбольном турнире одинаковое число очков.   Докажите, что найдутся такие команды А, В и С, что А выиграла у В, В выиграла у С, а С выиграла у А.",
        "Решение: Пусть А и В набрали одинаковое количество очков, причём A выиграла у B. Если для каждой команды С, у которой выиграла B, выиграла и A, то у A должно быть очков больше, чем у B. Следовательно, есть такая команда С, что B выиграла у С, а С выиграла у A."
    ],
    "30831": [
        "Ориентированные графы",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В стране Ориентация на всех дорогах введено одностороннее движение, причём из каждого города в любой другой можно добраться, проехав не более чем по двум дорогам. Одну дорогу закрыли на ремонт так, что из каждого города по-прежнему можно добраться до любого другого. Докажите, что для каждых двух городов это можно сделать, проехав не более чем по трём дорогам.",
        "Решение: Пусть удалена дорога, ведущая из А в В. Рассмотрим произвольные два города C и D, отличные от А и В.     1) До удаления дороги АВ из C в D можно было проехать по одной или двум дорогам. Очевидно, ни одна из них не совпадает с АВ. Поэтому удаление дороги АВ не повлияет на проезд из C в D.     2) После удаления дороги АВ по условию остался путь из A в B. Пусть E – последний город на этом пути перед B. Как показано выше, из C в E можно проехать не более чем по двум дорогам. Значит, из C в B можно проехать не более чем по трём дорогам.     Аналогично доказывается, что из А можно проехать в D не более чем по трём дорогам.      3) До удаления дороги АВ из A в E можно было не более чем по двум дорогам. Очевидно, ни одна из них не совпадает с АВ. Поэтому после удаления дороги АВ из А в В можно проехать не более чем по трём дорогам (по маршруту АEВ)."
    ],
    "31070": [
        "Степень вершины",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: В кружке у каждого члена имеется один друг и один враг. Доказать, что     а) число членов чётно.     б) кружок можно разделить на два нейтральных кружка.",
        "Решение: а) Весь кружок разбивается на пары друзей."
    ],
    "31074": [
        "Связность и разложение на связные компоненты",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: Из полного 100-вершинного графа выкинули 98 рёбер. Доказать, что он остался связным.",
        "Решение: Предположим, что полученный граф оказался несвязным, и в одной из компонент связности n вершин. Тогда было выкинуто по крайней мере  n(100 – n) рёбер, соединявших вершины этой компоненты с вершинами других компонент. Но n(100 – n) = 50² – (n – 50)² ≥ 50² – 49² = 1·99 > 98. Противоречие."
    ],
    "31088": [
        "Ориентированные графы",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: В стране каждые два города соединены дорогой с односторонним движением.   Доказать, что существует город, из которого можно проехать в любой другой не более чем по двум дорогам.",
        "Подсказка: Это город, из которого выходит наибольшее число дорог.",
        "Решение: Рассмотрим город A, из которого выходит наибольшее число дороги, и произвольный город B. Если дорога ведёт из A в B, то всё в порядке. Если же дорога ведёт из B в A, то, поскольку из B выходит не больше дорог, чем из A, найдётся город C, в который ведёт дорога из A, но не ведёт дорога из B. Тогда можно из A попасть в B по маршруту ACB."
    ],
    "31110": [
        "Планарные графы. Формула Эйлера",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: Доказать, что в двудольном плоском графе E ≥ 2F, если E ≥ 2 (E – число рёбер, F – число областей).",
        "Решение: В двудольном плоском графе каждая область ограничена по меньшей мере четырьмя рёбрами. Поэтому рассуждения, аналогичные решению задачи 30797, приводят к неравенству E ≥ 2F."
    ],
    "30780": [
        "Степень вершины",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: Докажите, что не существует графа с пятью вершинами, степени которых равны 4, 4, 4, 4, 2.",
        "Решение: Пусть степень каждой из четырёх вершин равна 4. Это значит, что каждая из них соединена со всеми остальными вершинами (в том числе и с пятой). Значит, степень пятой вершины также равна 4."
    ],
    "31364": [
        "Ориентированные графы",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: 12 команд сыграли турнир по волейболу в один круг. Две команды одержали ровно по 7 побед.   Доказать, что найдутся такие команды А, В, С, что А выиграла у В, В выиграла у С, а С – у А.",
        "Решение: См. задачу 30829."
    ],
    "35089": [
        "Связность и разложение на связные компоненты",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: В стране n городов. Между каждыми двумя городами установлено воздушное сообщение одной из двух авиакомпаний. Докажите, из этих двух авиакомпаний хотя бы одна такова, что что из любого города можно попасть в любой другой рейсами только этой авиакомпании.",
        "Решение: См. задачу 30814 а)."
    ],
    "35146": [
        "Ориентированные графы",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: В секретной службе работают n агентов – 001, 002, ..., 007, ..., n. Первый агент следит за тем, кто следит за вторым, второй – за тем, кто следит за третьим, и т.д., n-й – за тем, кто следит за первым. Докажите, что n – нечётное число.",
        "Подсказка: Предполагая, что первый агент следит за k-м агентом, восстановите всю схему слежки.",
        "Решение: Обозначим агентов точками и проведём стрелку от агента A к агенту B в том случае, когда A следит за B. Поскольку каждый агент следит ровно за одним другим, мы получим некоторый цикл (или несколько циклов) из стрелок. Согласно условию, если начать движение по стрелкам, начиная с первого агента и проходя за один раз по двум стрелкам, мы встретим подряд всех агентов с номерами 2, 3, ..., n, и в конце снова придём к первому агенту (это, в частности, означает, что цикл только один). Но в случае чётного числа агентов таким образом мы обойдём только половину цикла."
    ],
    "35199": [
        "Деревья",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: В стране несколько городов (больше одного); некоторые пары городов соединены  дорогами. Известно, что из каждого города можно попасть в любой другой, проезжая по нескольким дорогам. Кроме того, дороги не образуют циклов, то есть если выйти из некоторого города по какой-то дороге и далее двигаться так, чтобы не проходить по одной дороге дважды, то невозможно возвратиться в начальный город. Докажите, что в этой стране найдутся хотя бы два города, каждый из которых соединен дорогой ровно с одним городом.",
        "Подсказка: Можно рассмотреть самую длинную цепь из дорог, концы этой цепи будут искомыми городами.",
        "Решение: Первый способ. Рассмотрим самую длинную цепь из дорог, то есть возьмём самую длинную последовательность попарно различных городов  A1, A2, ..., Ak, в которой каждые два соседних города в этой последовательности соединены дорогой. Докажем, что из городов A1 и Ak выходит ровно одна дорога (соответственно в A2 и Ak–1). Пусть, например, из A1 идет дорога в некоторый город B, отличный от A2. Если B – один из городов A3, ..., Ak, то возникает цикл из дорог, что противоречит условию. Таким образом, город B отличен от городов A1, A2, ..., Ak. Следовательно, в последовательности городов B, A1, A2, ..., Ak города попарно различны и соседние города соединены дорогой. Но эта последовательность содержит больше k городов вопреки выбору последовательности A1, A2, ..., Ak."
    ],
    "35598": [
        "Степень вершины",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В системе связи, состоящей из 2001 абонентов, каждый абонент связан ровно с n другими. Определите все возможные значения n.",
        "Подсказка: Посчитайте количество пар связанных абонентов и покажите, что n чётно.",
        "Решение: Так как каждый из 2001 абонентов связан ровно с n другими, то общее число направлений связи равно 2001n. Отсюда общее число связанных пар абонентов равно 2001n : 2, так как каждая связанная пара имеет ровно два направления связи. Поскольку это число должно быть целым, то число n должно быть чётным.     Докажем, что для каждого n = 2t (t = 0, 1, ..., 1000) существует система связи из 2001 абонентов, в которой каждый связан ровно с n другими. В самом деле, расположив всех абонентов на окружности и связав каждого из них с t ближайшими к нему по часовой стрелке и с t ближайшими к нему против часовой стрелки, получим пример такой сети связи."
    ],
    "35734": [
        "Степень вершины",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: В классе 20 учеников, причём каждый дружит не менее, чем с 14 другими.  Можно ли утверждать, что найдутся четыре ученика, которые все дружат между собой?",
        "Подсказка: У одного из учеников 14 друзей. Достаточно выбрать из них трёх попарно знакомых.",
        "Решение: Соберём весь класс в одной комнате. Рассмотрим некоторого человека А. Пусть теперь из комнаты выйдут все ученики, которые не дружат с А. По условию таких не более пяти. Поэтому в комнате осталось по крайней мере 15 учеников. Выберем из оставшихся в комнате ученика B, отличного от А. Пусть из комнаты выйдут все ученики, которые не дружат с B. После этого в комнате осталось не меньше 10 учеников. Наконец, выберем из оставшихся в комнате ученика C, отличного от А и от B. Пусть из комнаты выйдут все ученики, которые не дружат с C. После этого в комнате осталось не меньше пяти учеников. Эти пять учеников – это А, B, C и еще два ученика D и E, которые дружат с А, B, C. Искомая четвёрка учеников – это, например, А, B, C, D.",
        "Ответ: Можно."
    ],
    "60418": [
        "Теория графов (прочее)",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: В компании из 10 человек произошло 14 попарных ссор. Докажите, что все равно можно составить компанию из трёх друзей.",
        "Решение: Общее число способов выбрать компанию из трёх человек равно   Каждая ссора разрушает не более восьми таких компаний, поэтому число разрушенных компаний не больше 8·14 = 112. Значит осталось по крайней мере 8 дружных компаний."
    ],
    "30819": [
        "Ориентированные графы",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Дима, приехав из Врунляндии, рассказал, что там есть несколько озер, соединённых между собой реками.  Из каждого озера вытекают три реки, и в каждое озеро впадают четыре реки. Докажите, что он ошибается.",
        "Решение: Общее количество втекающих рек должно быть равно общему количеству вытекающих рек."
    ],
    "77917": [
        "Теория графов (прочее)",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Можно ли провести в городе 10 автобусных маршрутов и установить на них   остановки так, что какие бы 8 маршрутов ни были взяты, найдётся остановка, не лежащая ни на одном из них, а любые 9 маршрутов проходят через все остановки.",
        "Решение: Проведём 10 попарно пересекающихся (в различных точках) прямых. Пусть маршруты проходят по этим прямым, а остановками служат точки пересечения прямых. Любые  девять маршрутов проходят через все остановки, поскольку через каждую остановку,  лежащую на оставшейся прямой, проходит одна из девяти прямых, соответствующих этим  маршрутам. Любые восемь маршрутов не проходят через остановку, которая является  точкой пересечения двух остальных маршрутов.",
        "Ответ: Можно."
    ],
    "79305": [
        "Связность и разложение на связные компоненты",
        "Сложность: 3+",
        "Классы: 9",
        "Условие: Имеются две страны: Обычная и Зазеркалье. У каждого города в  Обычной стране есть двойник в Зазеркалье, и наоборот. Однако если в Обычной стране какие-то два города соединены железной дорогой, то в Зазеркалье эти города не соединены, а каждые два несоединённых в Обычной стране города обязательно соединены железной дорогой в Зазеркалье. В Обычной стране девочка Алиса не может проехать из города A в город B, сделав менее двух пересадок. Доказать, что Алиса в Зазеркалье сможет проехать из любого города в любой другой, сделав не более двух пересадок.",
        "Решение: Из условия следует, что города A и B в Обычной стране  не соединены дорогой и что любой другой город в Обычной стране не соединён либо с A, либо с B. Значит, двойники A' и B' городов A и B в Зазеркалье соединены дорогой, а каждый другой город Зазеркалья соединён либо с A', либо с B'. Следовательно, в Зазеркалье из каждого города можно доехать до одного из городов A' и B', затем при необходимости доехать до второго из них, а после доехать до любого другого города Зазеркалья. При этом требуется не более двух пересадок."
    ],
    "97990": [
        "Связность и разложение на связные компоненты",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Тетрадный лист раскрасили в 23 цвета по клеткам. Пара цветов называется  хорошей, если существует две соседние клетки, закрашенные этими цветами. Каково минимальное число хороших пар?",
        "Решение: Оценка. Нарисуем граф с 23 вершинами (цветами) и соединим рёбрами вершины, соответствующие хорошим парам.    Рассмотрим две произвольные вершины A и B. Возьмём некоторую клетку K, окрашенную в цвет A, и некоторую клетку L, окрашенную в цвет B. Построим цепочку клеток, соединяющих K с L. Каждым двум разноцветным соседним клеткам этой цепочки соответствует хорошая пара цветов, то есть ребро нашего графа. Тем самым мы построили путь от A к B.     Это значит, что наш граф связен, следовательно, в нём не менее 22 рёбер.     Пример раскраски в 23 цвета с 22 хорошими парами цветов: покрасим 22 несоседние клетки в 22 цвета, а оставшийся лист – в 23-й цвет.",
        "Ответ: 22 пары."
    ],
    "30783": [
        "Связность и разложение на связные компоненты",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: В связном графе степени четырёх вершин равны 3, а степени остальных вершин равны 4.   Докажите, что нельзя удалить ребро так, чтобы граф распался на две изоморфные компоненты связности.",
        "Решение: Пусть это удалось. Если удалённое ребро соединяло вершины с одинаковыми степенями, то в каждой полученной компоненте будет нечётное число нечётных вершин (по одной или по три), что невозможно.     Если же удалённое ребро соединяло вершины со степенями 3 и 4, то только в одной компоненте будет вершина степени 2, то есть компоненты не будут изоморфны."
    ],
    "30790": [
        "Деревья",
        "Сложность: 4",
        "Классы: 8",
        "Условие: Докажите, что связный граф, у которого число рёбер на единицу меньше числа вершин, является деревом.",
        "Решение: См. задачу 31098 д)."
    ]
}