{
    "87949": [
        "Разрезания (прочее)",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Удвух человек было два квадратных торта. Каждый сделал насвоём торте по2прямолинейных разреза открая докрая. При этом уодного получилось три куска, аудругого— четыре. Как это могло быть?",
        "Подсказка: Обратите внимание: разрезы могут пересекаться.",
        "Решение: Это могло получиться, если впервом случае разрезы непересекались между собой, авовтором— пересеклись. Например, если впервом случае разрезы были параллельны друг другу, авовтором— перпендикулярны.",
        "Ответ: Впервом случае разрезы были параллельны друг другу, вовтором— перпендикулярны."
    ],
    "87953": [
        "Разные задачи на разрезания",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Можноли испечь такой торт, который может быть разделён одним прямолинейным разрезом на4 части?",
        "Подсказка: Заметьте, торт необязательно должен быть выпуклой фигурой.",
        "Решение: Еслибы торт был выпуклой фигурой, этого сделать былобы нельзя, новедь нигде несказано, что он должен быть таким. Можно, например, испечь торт ввиде буквыШ иразрезать так, как показано нарисунке.",
        "Ответ: См.рисунок."
    ],
    "35522": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В клетчатом квадрате 64*64 вырезали одну из клеток. Докажите, что    оставшуюся часть квадрата можно разрезать на уголки из трех клеток.",
        "Подсказка: Доказывайте общее утверждение для квадрата    2",
        "Решение: Будем доказывать общее утверждение для квадрата    2"
    ],
    "35581": [
        "Замощения костями домино и плитками",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Можно ли покрыть плоскость паркетом из прямоугольников так, чтобы все эти прямоугольники можно было разрезать одним прямолинейным разрезом?",
        "Подсказка: Сначала разрежьте квадрат на много прямоугольников так, чтобы некоторая прямая, параллельная диагонали квадрата, пересекала каждый прямоугольник.",
        "Решение: Один из вариантов замощения показан на картинке (прямая отсекает верхние левые углы синих квадратиков и правые нижние углы зеленых квадратиков)."
    ],
    "35777": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Докажите, что никакой выпуклый многоугольник нельзя разрезать на 100 различных правильных треугольников.",
        "Подсказка: Предположите противное и рассмотрите наименьший треугольник, примыкающий к границе многоугольника.",
        "Решение: Предположим, что выпуклый многоугольник разбит на 100 различных правильных треугольников. Рассмотрим наименьший из всех треугольников, примыкающих к границе многоугольника. Пусть это треугольник ABC, у которого сторона AB примыкает к границе многоугольника. Поскольку многоугольник выпуклый, то он весь лежит по одну сторону с точкой C от прямой AB. К одной из сторон AC, BC треугольника ABC должен примыкать еще хотя бы один треугольник (иначе многоугольник совпадал бы с треугольником ABC).   Пусть, например, к стороне AC примыкает ещё один треугольник T. Тогда сторона треугольника T больше стороны треугольниика ABC, и поэтому его сторона, примыкающая к AC, продолжается за точку C. Если бы существовал треугольник, примыкающий к стороне BC треугольника ABC, то мы таким же образом заключили бы, что его сторона, примыкающая к BC, продолжается за точку C. Тем самым этот треугольник пересекался бы с треугольником T. Противоречие. Значит, нет треугольника, примыкающего к стороне BC треугольника ABC. Но это означает, что точка C является вершиной угла многоугольника, большего 180°. Противоречие с выпуклостью многоугольника."
    ],
    "58222": [
        "Равносоставленные фигуры",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Разрежьте правильный треугольник шестью прямыми на части и сложите из них 7 одинаковых правильных треугольников.",
        "Решение: Сложим 7 одинаковых правильных треугольников, как показано на  рис. Тогда"
    ],
    "58228": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Разрежьте фигуру, изображенную на рис.  на4 равные части.",
        "Решение: Требуемые разрезы изображены на рис."
    ],
    "58276": [
        "Замощения костями домино и плитками",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Прямоугольник размером",
        "Решение: Положим первую плитку в углу данного прямоугольника. После этого  замощение квадрата"
    ],
    "60323": [
        "Плоскость, разрезанная прямыми",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: На сколько частей делят плоскость n прямых общего положения, то есть таких, что никакие две не параллельны и никакие три не проходят через одну точку?",
        "Решение: Докажем по индукции, что количество частей равно 1 + ½ n(n + 1). База (n = 1) очевидна.    Шаг индукции. Пусть n > 1. По предположению индукции перед проведением n-й прямой было 1 + ½ (n – 1)n частей. Новая прямая делится точками пересечения со старыми прямыми на n интервалов. Каждый из этих интервалов разбивает одну часть на две. Следовательно, добавится n частей. Поэтому всего частей станет 1 + ½ (n – 1)n + n = 1 + ½ n(n + 1).",
        "Ответ: 1 + ½ n(n + 1)."
    ],
    "88084": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Можноли разрезать квадрат начетыре части так, чтобы каждая часть соприкасалась (т.е. имела общие участки границы) стремя другими?",
        "Подсказка: Заметьте, вобоих случаях нам недано никаких ограничений наформу кусков, определено только их количество.",
        "Решение: Можно. См.рисунок справа.",
        "Ответ: Можно. См.рисунок."
    ],
    "64495": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 3",
        "Классы: 5,6",
        "Условие: Федя из трёх равных треугольников составил несколько различных фигур (одна из них изображена на рисунке слева). Затем из всех имеющихся фигур он сложил стрелку так, как показано на рисунке справа. Нарисуйте отдельно каждую из Фединых фигур и покажите, как из них можно сложить стрелку.",
        "Ответ: Все четыре различных фигуры изображены на рис. слева (с точностью до переворачивания), а один из возможных вариантов составления стрелки – на рис. справа."
    ],
    "64789": [
        "Разные задачи на разрезания",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Покажите, как разрезать фигуру, изображённую на рисунке, на восемь равных частей пятью прямолинейными разрезами.",
        "Ответ: См. рис."
    ],
    "64930": [
        "Замощения костями домино и плитками",
        "Сложность: 3",
        "Классы: 5,6",
        "Условие: Полина решила раскрасить свой клетчатый браслет размером 10×2 (рис. слева) волшебным узором из одинаковых фигурок (рис. справа), чередуя в них два цвета. Помогите ей это сделать.",
        "Ответ: Способ раскраски показан на развертке браслета."
    ],
    "65622": [
        "Замощения костями домино и плитками",
        "Сложность: 3",
        "Классы: 1,9,10,11",
        "Условие: Квадрат со стороной 9 клеток разрезали по линиям сетки на 14 прямоугольников таким образом, что длина каждой стороны любого прямоугольника не меньше, чем две клетки. Могло ли оказаться так, что среди этих прямоугольников не было ни одного квадрата?",
        "Решение: Площадь прямоугольника, отличного от квадрата, с указанными сторонами не меньше чем 2·3 = 6 клеток. Так как 6·14 > 9², то площадь 14 таких прямоугольников заведомо больше площади исходного квадрата. Следовательно, обойтись без квадратов невозможно.",
        "Ответ: Не могло."
    ],
    "65660": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Про треугольник, один из углов которого равен 120°, известно, что его можно разрезать на два равнобедренных треугольника.   Чему могут быть равны два других угла исходного треугольника?",
        "Решение: Пусть в треугольнике",
        "Ответ: 40° и 20° или 45° и 15°."
    ],
    "66429": [
        "Разные задачи на разрезания",
        "Сложность: 3",
        "Классы: 5,6",
        "Условие: Разрежьте фигуру, изображенную слева, по линиям сетки на две равные части и покажите, как из них сложить фигуру, изображенную справа. (Фигуры можно поворачивать и переворачивать. Равными называются фигуры, которые совмещаются при наложении).",
        "Ответ: См. рисунок."
    ],
    "66433": [
        "Разные задачи на разрезания",
        "Сложность: 3",
        "Классы: 5,6,7",
        "Условие: Разрежьте фигуру, изображенную слева, по линиям сетки на две равные части и покажите, как из них сложить фигуру, изображенную справа. (Фигуры можно поворачивать и переворачивать. Равными называются фигуры, которые совмещаются при наложении).",
        "Ответ: См. рисунок."
    ],
    "76504": [
        "Свойства частей, полученных при разрезаниях",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Доказать, что разносторонний треугольник нельзя разрезать на два равных треугольника.",
        "Решение: Предположим, что отрезок"
    ],
    "77991": [
        "Разные задачи на разрезания",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Разрезать куб на три равные пирамиды.",
        "Решение: В качестве вершины пирамид можно взять одну из вершин куба, а в качестве их оснований — три грани куба, не содержащие эту вершину."
    ],
    "78606": [
        "Свойства частей, полученных при разрезаниях",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Можно ли разрезать квадратный пирог на 9 равновеликих частей таким способом: выбрать внутри квадрата две точки и соединить каждую из них прямолинейными разрезами со всеми четырьмя вершинами квадрата? Если можно, то какие две точки нужно выбрать?",
        "Решение: Предположим, что можно выбрать две точки требуемым образом.  Отрезки, соединяющие одну из этих точек с вершинами квадрата, разбивают  квадрат на 4 треугольника. При этом сумма площадей треугольников, примыкающих  к каждой паре противоположных сторон квадрата, равна 1/2. Отрезки,  соединяющие вторую выбранную точку с вершинами квадрата, разбивают одну из  этих пар треугольников на 4 части, а другую — на 5 частей. С одной стороны,  сумма четырёх частей равна",
        "Ответ: Нельзя."
    ],
    "79251": [
        "Покрытия",
        "Сложность: 3",
        "Классы: 8",
        "Условие: Дан остроугольный треугольник",
        "Решение: Опустим из точки пересечения высот треугольника"
    ],
    "79350": [
        "Замощения костями домино и плитками",
        "Сложность: 3",
        "Классы: 8",
        "Условие: Доказать, что в прямоугольник размером",
        "Решение: Разрежем прямоугольник со сторонами 2"
    ],
    "88100": [
        "Замощения костями домино и плитками",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Весь комплект косточек домино, кроме 0-0, уложили так, как изображено нарисунке. Разным буквам соответствуют разные цифры, одинаковым— одинаковые. Сумма очков вкаждой строке равна24. Попробуйте восстановить цифры.",
        "Подсказка: Какой буквой зашифрован нуль? Можетли букваа обозначать нечётное число (см.последнюю строку нарисунке кзадаче)? Можетлиа быть равно2 (см.первую строку нарисунке)?",
        "Решение: Рассмотрим рисунок.",
        "Ответ: См.рисунок."
    ],
    "104003": [
        "Разные задачи на разрезания",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Снежная Королева предпочитает идеальные фигуры, поэтому она так любит квадраты. Она дала Каю крест (см. рисунок справа), чтобы тот разделил его на равные части и собрал из них квадрат. Как это можно сделать?",
        "Решение: Пусть длина каждой стороны креста равна 1. Тогда необходимо так разрезать крест на части, чтобы из этих частей можно было собрать квадрат площади 5."
    ],
    "104004": [
        "Разные задачи на разрезания",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: У Кая имеется кусок шахматной доски 7×7 клеток из драгоценного хрусталя и алмазный нож. Кай хочет, не теряя материала и проводя разрезы только по краям клеток, распилить доску на 6 частей так, чтобы из них сделать три новых квадрата, все разных размеров. Как это сделать?",
        "Решение: Из квадрата 7×7 можно получить с помощью разрезаний только квадраты со сторонами 2, 3 и 6, так как число 49 раскладывается в сумму трех квадратов только одним способом: 49 = 36 + 9 + 4. Пример разрезания на шесть частей смотри на рисунке:"
    ],
    "109018": [
        "Покрытия",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Окружность покрыта несколькими дугами. Эти дуги могут налегать друг на друга, но ни одна из них не покрывает окружность целиком. Доказать, что всегда можно выбрать несколько из этих дуг так, чтобы они тоже покрывали всю окружность и составляли в сумме не более",
        "Решение: Если три дуги покрывают некоторую часть окружности так, что все они имеют общую часть, то из них всегда можно выбрать две такие, которые покроют ту же часть окружности. Поэтому можно выбросить лишние дуги так, что каждая часть окружности будет покрыта не более чем два раза, а сумма покрывающих дуг будет не более"
    ],
    "115274": [
        "Разные задачи на разрезания",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В равнобокой трапеции одно из оснований в три раза больше другого. Угол при большем основании равен",
        "Решение: Пусть основание"
    ],
    "88260": [
        "Разные задачи на разрезания",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Легко можно разрезать квадрат на два равных треугольника или два равных  четырёхугольника.   А как разрезать квадрат на два равных пятиугольника или два равных шестиугольника?",
        "Подсказка: Подумайте, будутли искомые многоугольники выпуклыми.",
        "Ответ: См. рисунок."
    ],
    "116790": [
        "Разные задачи на разрезания",
        "Сложность: 3",
        "Классы: 5,6",
        "Условие: Покажите, как разрезать фигуру (см. рисунок) на четыре равные части по линиям сетки.",
        "Ответ: Два способа см. на рисунке."
    ],
    "35449": [
        "Разные задачи на разрезания",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: От пирога, имеющего форму выпуклого многоугольника, разрешается    отрезать треугольный кусок ABC, где A - некоторая вершина, а B и C    - точки, лежащие строго внутри сторон, имеющих вершину A.    Вначале пирог имеет форму квадрата. В центре этого квадрата    расположена изюминка. Докажите, что ни на каком шаге от пирога    нельзя отрезать кусок, содержащий изюминку.",
        "Подсказка: Кусок пирога всегда имеет стороны, принадлежащие сторонам    исходного квадратного пирога.",
        "Решение: Операция отрезания устроена таким образом, что после отрезания    две стороны многоугольника укорачиваются, а также появляется новая    сторона. Таким образом, никакая сторона не отрезается полностью.    Значит, после любого числа отрезаний    кусок пирога всегда имеет четыре стороны, принадлежащие сторонам    исходного квадратного пирога.    Пусть некоторая прямая l на некотором шаге отрезала кусок,    содержащий изюминку - центр квадрата.    Тогда, как нетрудно видеть, в отрезанной части окажется целиком    одна из сторон исходного квадрата (см. картинку).    Мы получили противоречие, которое показывает, что отрезать кусок с    изюминкой невозможно."
    ],
    "35042": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Можно ли разбить какой-нибудь треугольник на 5  одинаковых   треугольников?",
        "Подсказка: В качестве примера можно взять прямоугольный треугольник,   в котором катеты относятся как 1:2.",
        "Решение: Примером является прямоугольный треугольник ABC с катетами AC=1 и  BC=2.  Укажем нужное разбиение этого треугольника.  Проведем высоту CH из вершины C прямого угла.  Треугольник ABC при этом разбивается на 2 подобных треугольника  ACH и BCH. Коэффициент подобия этих треугольников равен  AC/BC=1/2. Далее, треугольник BCH можно разбить средними линиями  на 4 равных треугольника, каждый из которых подобен треугольнику  BCH с коэффициентом подобия 1/2.  В итоге треугольник ABC оказался разбитым на 5 треугольников,  равных треугольнику ACH."
    ],
    "35388": [
        "Равносоставленные фигуры",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Правильный треугольник разрезать на четыре части так, чтобы из них можно было         сложить квадрат.",
        "Решение: Смотри картинку."
    ],
    "35389": [
        "Равносоставленные фигуры",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Три одинаковых треугольника  разрезать каждый на две части так,        чтобы из них можно было сложить один треугольник.",
        "Подсказка: Разрежьте эти треугольники по разным медианам.",
        "Решение: Пусть ABC - один из данных равных треугольников, α, β, γ -   его углы. Разрежем его по медиане AM и сложим  получившиеся части, совместив  отрезки BM  и CM. Получим треугольник со сторонами,  равными AB и AC и углом между ними, равным β + γ = 180° - α.  С двумя оставшимися треугольниками проведем ту же операцию, разрезая их по медианам,  проведенным из других вершин. Теперь заметим, что три полученных треугольника имеют  каждый по углу, сумма которых равна 360°, и стороны, прилежащие к этим углам,   попарно равны. Поэтому из таких треугольников можно сложить один."
    ],
    "35447": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: На какое минимальное число равновеликих треугольников можно    разрезать квадрат 8*8 с вырезанной угловой клеткой?",
        "Подсказка: Рассмотрите треугольники, примыкающие к вырезанной клетке и оцените    площадь одного из них.",
        "Решение: Пусть квадрат 8*8 с вырезанной угловой клеткой    (его площадь равна 63) разрезан    на n треугольников, каждый из которых имеет площадь    63/n.    Обозначим через A, B, C вершины вырезанной клетки.    Рассмотрим треугольники, содержащие точку B.    Нетрудно видеть, что таких треугольников    по крайней мере два - у одного из них одна из сторон     (назовем эту сторону a) соприкасается    с отрезком AB, а у другого -    из сторон     (назовем эту сторону с) соприкасается с отрезком BC.    Заметим, что одновременно не может сторона a выходить за пределы    отрезка AB и сторона с выходить за пределы    отрезка BС, так как в противном случае треугольники имели бы    пересечение.    Пусть, для определенности, сторона a не выходит за пределы    отрезка AB. Тогда в треугольнике со стороной a длина стороны а    не превосходит 1, а длина высоты, опущенной на сторону а, не    превосходит 7 (иначе треугольник вышел бы за пределы квадрата).    Таким образом, площадь этого треугольника не больше 7/2.    Итак, 63/n не превосходит 7/2, откуда n не меньше    18.     Пример разрезания на 18 равновеликих (и даже равных)    треугольников показан на картинке.",
        "Ответ: 18.00"
    ],
    "32075": [
        "Разные задачи на разрезания",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Из шахматной доски вырезали одну угловую клетку. На какое наименьшее число равновеликих треугольников можно разрезать эту фигуру?",
        "Решение: Оценка. Примем за единицу площадь одной клетки. Данная фигура  представляет собой невыпуклый шестиугольник ABCDEF площади 63 с углом 270° в вершине D (рис. справа). Если фигура разбита на треугольники, то, очевидно, точка D должна принадлежать по крайней мере двум треугольникам, причём у одного из них сторона лежит на прямой DE, а у другого – на DC. Более того, по крайней мере для одного из них она лежит на соответствующем отрезке. Для определенности предположим, что это треугольник DKL, где K лежит на отрезке DC. Тогда основание DK этого треугольника не больше  DC = 1, а высота – не больше BC = 7. Поэтому SDKL ≤ 7/2. Если все треугольники равновелики, то их не меньше 63 : 7/2 = 18.     Пример разрезания на 18 равновеликих треугольников см. на рис. слева.",
        "Ответ: На 18 треугольников."
    ],
    "34917": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: На какое наименьшее число тетраэдров можно разбить куб?",
        "Подсказка: Оценивайте объемы тетраэдров.",
        "Решение: Пример. Куб ABCDA'B'C'D' можно разбить на пять тетраэдров: AA'B'D', AB'BC, ACDD', B'C'D'C и ACB'D'.     Оценка. Пусть куб разбит на несколько тетраэдров. Основания хотя бы двух из них лежат на грани ABCD. Также имеются другие два тетраэдра с основаниями на грани A'B'C'D' (у одного тетраэдра нет двух параллельных граней). Если ребро куба равно 1, то суммарный объем первых (вторых) двух тетраэдров не больше &frac13;. Поскольку суммарный объем этих четырёх тетраэдров меньше 1, то в разбиении куба кроме них участвует ещё хотя бы один тетраэдр.",
        "Ответ: На 5 тетраэдров."
    ],
    "34975": [
        "Покрытия",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Круг радиуса 1 покрыт семью одинаковыми кругами. Докажите, что их радиусы не меньше ½.",
        "Подсказка: На покрытие границы круга уйдёт не меньше семи кругов с радиусом, меньшим ½.",
        "Решение: Рассмотрим круги радиуса меньше ½ (будем называть их маленькими), которые покрывают границу большого круга радиуса 1. Докажем, что таких кругов не меньше семи. Как известно, в окружности радиуса 1 дуга, стягиваемая хордой длины 1, имеет градусную меру 60°. Рассмотрим дуги окружности радиуса 1, высекаемые маленькими кругами. Поскольку хорды, стягивающие эти дуги, не превосходят 1, градусная мера каждой из этих дуг меньше 60°. Так как градусная мера всей окружности равна 360°, то шести маленьких кругов не хватит для покрытия границы большого круга. Кроме кругов, покрывающих границу, потребуется  ещё один маленький круг для покрытия центра большого круга: расстояние от точки на границе большого круга до его центра больше диаметра маленького круга. Таким образом, для покрытия большого круга требуется не менее восьми маленьких кругов."
    ],
    "35025": [
        "Разные задачи на разрезания",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На какое наибольшее число частей могут разбить плоскость n окружностей?",
        "Подсказка: Если k окружностей уже проведены, то (k+1)-я окружность разбивается ими не более чем на 2k дуг.",
        "Решение: Одна окружность делит плоскость на две части. Пусть уже проведены k окружностей. Рассмотрим (k+1)-ю окружность. Она пересекает предыдущие k окружностей не более чем в 2k точках (каждую окружность – не более чем в двух точках). Следовательно, (k+1)-я окружность разбивается первыми k окружностями не более чем на 2k дуг. Каждая дуга делит одну из частей, на которые плоскость была разделена k окружностями, еще на две части. Тем самым, каждая дуга прибавляет одну часть плоскости, и (k1)-я окружность прибавляет не более 2k частей плоскости. Более того, (k+1)-я окружность прибавляет ровно 2k частей плоскости тогда и только тогда, когда она пересекает каждую из предыдущих окружностей в двух точках и все эти точки различны. Таким образом, n окружностей делят плоскость не более чем на 2 + (2 + 4 + 6 + ... + 2(n – 1)) = n(n – 1) + 2 части, причём равенство достигается, если каждая пара окружностей пересекается в двух точках и все эти точки пересечения различны (то есть никакие три окружности не проходят через одну точку).     Можно указать пример такой системы n окружностей: возьмём одну окружность, а все остальные получим из неё сдвигами на вектора a, 2a, ..., (n – 1)a, где a – достаточно малый по длине вектор (настолько малый, что первая и последняя окружности пересекаются в двух точках).",
        "Ответ: На n(n – 1) + 2 части."
    ],
    "35051": [
        "Разрезания (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Из листа клетчатой бумаги размером 11×11 клеток вырезали 15 квадратиков размером 2×2.   Докажите, что можно вырезать ещё один такой квадратик.",
        "Подсказка: На данном листе можно закрасить 16 квадратов 2×2 так, чтобы каждый квадратик 2×2 пересекался только с одним из закрашенных квадратов.",
        "Решение: Покрасим в белый цвет все клетки листа 11×11 из третьего, шестого и девятого столбцов, а также все клетки из третьй, шестой и девятой строк. Оставшиеся клетки покрасим в чёрный цвет. Чёрные клетки образуют 16 чёрных квадратов 2×2. Легко видеть, что вырезая из листа квадратик 2×2, мы не можем задеть только один чёрный квадрат. Значит, после вырезания 15 квадратиков 2×2 хотя бы один из 16 чёрных квадратов останется нетронутым. Этот чёрный квадрат и можно вырезать."
    ],
    "35351": [
        "Замощения костями домино и плитками",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Как разбить бесконечный лист клетчатой бумаги на доминошки 2×1 так, чтобы каждая линия сетки разрезала лишь конечное число доминошек?",
        "Подсказка: Линиями раздела областей, разделённых на доминошки разного типа, являются диагональные прямые.",
        "Решение: Проведём две диагональные прямые y = x и y = – x, которые разбивают бесконечный лист на четыре части. Верхнюю и нижнюю разобьём на вертикальные доминошки, а левую и правую (вместе с остатками нижней и верхней частей) – на горизонтальные доминошки. Тогда вертикальная линия сетки может разрезать только горизонтальные доминошки, а их вдоль каждой вертикали лежит только конечное число. То же самое имеет место для горизонтальных линий сетки и вертикальных доминошек."
    ],
    "35380": [
        "Замощения костями домино и плитками",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Рассматриваются покрытия шахматной доски доминошками, содержащими две соседние клетки.   Каких покрытий больше – тех, которые содержат доминошку a1-a2, или тех, которые содержат доминошку b2-b3?",
        "Подсказка: Поставьте в соответствие каждому покрытию, содержащему доминошку b2-b3, некоторое покрытие, содержащее доминошку a1-a2.",
        "Решение: Исключим из рассмотрения все покрытия, в которых присутствует как доминошка a1-a2, так и доминошка b2-b3. Рассмотрим оставшиеся покрытия. Назовём покрытие покрытием типа A, если оно содержит доминошку a1-a2, и покрытием типа B, если оно содержит доминошку b2-b3. Покажем, что покрытий типа A больше.     Рассмотрим некоторое покрытие типа B. Так как в нём нет доминошки a1-a2, то клетка a1 покрыта доминошкой a1-b1. Следовательно, клетка a2 может быть покрыта только доминошкой a2-a3. Итак, в покрытии типа B левый нижний угол 2×3 покрыт доминошками b2-b3, a1-b1, a2-a3. Поставим в соответствии покрытию типа B покрытие типа A, в котором левый нижний угол 2×3 покрыт доминошками a1-a2, b1-b2, a3-b3, а остальная часть доски покрыта так же, как и в исходном покрытии типа B. Итак, каждому покрытию типа B поставлено в соответствие покрытие типа A, причём различным покрытиям типа B соответствуют различные покрытия типа A. Однако покрытие типа A, состоящее только из вертикальных доминошек, не соответствует при этом никакому покрытию типа B. Таким образом, покрытий типа A больше.",
        "Ответ: Больше тех, которые содержат доминошку a1-a2."
    ],
    "102965": [
        "Замощения костями домино и плитками",
        "Сложность: 2",
        "Классы: 5,6",
        "Условие: У Джузеппе есть лист фанеры, размером 22×15. Джузеппе хочет из него вырезать как можно больше прямоугольных заготовок размером 3×5. Как это сделать?",
        "Подсказка: Обратите внимание, больше чем 22 заготовки получить нельзя. Почему?",
        "Решение: Прежде всего, заметим, что Джузеппе не сможет получить заготовок больше, чем (22×15)/(3×5)=22 штуки. Теперь приступим к разрезанию."
    ],
    "35481": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что любой выпуклый многоугольник можно разрезать на остроугольные    треугольники.",
        "Подсказка: Научитесь разрезать на остроугольные треугольники прямоугольный    треугольник.",
        "Решение: Любой выпуклый многоугольник можно разрезать диагоналями на    треугольники. Каждый тупоугольный треугольник можно разрезать    высотой, проведенной к наибольшей стороне, на два прямоугольных    треугольника. Поэтому достаточно научиться разрезать на    остроугольные треугольники любой прямоугольный треугольник.    В прямоугольном треугольнике ABC (C - прямой угол)    на медиане CM достаточно близко к точке M выберем точку F.    Через F проведем прямые, почти параллельные прямым AC и BC так,    что они отрезают остроугольный треугольник FDE.    Теперь осталось разрезать на остроугольные треугольники каждую из    почти трапеций ACFD, BCFE (см. картинку)."
    ],
    "35536": [
        "Покрытия",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Известно, что множество M точек на прямой может быть покрыто тремя отрезками длины 1.   Каким наименьшим числом отрезков длины 1 можно заведомо покрыть множество середин отрезков с концами в точках множества M?",
        "Подсказка: Если точка A покрыта отрезком [a, a + 1], а точка B – отрезком [b, b + 1], то середина отрезка AB покрывается отрезком [a+b/2, a+b/2 + 1].",
        "Решение: Пусть две точки A и B покрыты одним единичным отрезком. Тогда середина отрезка AB также покрыта этим отрезком. Если точка A покрыта единичным отрезком [a, a + 1], а точка B – отрезком [b, b + 1], то середина отрезка AB покрывается единичным отрезком [a+b/2, a+b/2 + 1].     Пример. Обозначим через [a, a + 1], [b, b + 1], [c, c + 1] три отрезка, покрывающие данное множество M. Как показано выше, множество середин отрезков с концами в точках множества M покрывается шестью отрезками [a, a + 1], [b, b + 1], [c, c + 1],   [a+b/2, a+b/2 + 1], [a+c/2, a+c/2 + 1], [b+c/2, b+c/2 + 1].      Оценка. Пусть M = [0, 1] ∪ [2, 3] ∪ [6, 7]. Тогда множество середин отрезков с концами в точках множества M – это [0, 5] ∪ [6, 7]. Значит, меньше чем шестью отрезками длины 1 обойтись нельзя.",
        "Ответ: Шестью отрезками."
    ],
    "35651": [
        "Покрытия",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Дано бесконечное число углов. Докажите, что этими углами можно покрыть   плоскость.",
        "Подсказка: Заметьте, что любым углом можно покрыть любой круг.",
        "Решение: Рассмотрим бесконечное семейство концентрических кругов с радиусами 1, 2,   3, ... Объединение этих кругов покрывает всю плоскость. Покроем круг радиуса 1 первым углом, круг радиуса 2 – вторым углом, и т.д. до бесконечности. В результате вся плоскость будет покрыта данными углами."
    ],
    "35659": [
        "Замощения костями домино и плитками",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Можно ли доску 10×10 разрезать на фигурки из четырёх клеток в форме буквы Г?",
        "Подсказка: Раскрасьте в шахматном порядке вертикали доски.",
        "Решение: Раскрасим в шахматном порядке вертикали доски. При этом 50 клеток покрашено в белый цвет и 50 – в чёрный. Каждая буква Г занимает нечётное число (1 или 3) белых клеток. Поэтому если бы доску можно было разрезать на 25 фигурок в виде буквы Г, то белых клеток на доске было бы нечётное число (сумма 25 нечётных чисел). Противоречие.",
        "Ответ: Нельзя."
    ],
    "58238": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что если выпуклый четырёхугольник ABCD можно разрезать на два подобных четырёхугольника, то ABCD – трапеция или параллелограмм.",
        "Решение: Пусть отрезок MN, где точки M и N лежат на сторонах AB и CD, разрезает четырёхугольник ABCD на два подобных четырёхугольника. Тогда угол AMN четырёхугольника AMND равен одному из углов четырёхугольника NMBC. С другой стороны,   ∠NMB = 180° – ∠AMN. Поэтому если  ∠AMN = ∠NMB, то ∠NMB = 90°, а если угол AMN равен другому углу четырёхугольника NMBC, то в этом четырёхугольнике есть два угла, составляющих в сумме   180°. Проведя аналогичные рассуждения для угла MND, получаем, что либо AB ⊥ MN и CD ⊥ MN (и тогда  AB || CD), либо в четырёхугольнике NMBC есть два угла, составляющие в сумме 180°; без ограничения общности можно считать, что один из них – угол BMN. Рассмотрим три случая.     1) ∠BMN + ∠MNC = 180°. Тогда BM || CN, а значит, и AB || CD.     2) ∠BMN + ∠MBC = 180°.  Тогда MN || BC. Поэтому либо AD || MN, либо ND || MA.     3) ∠BMN + ∠BCN = 180°. Тогда четырёхугольники NMBC и AMND вписанные. Следовательно,   ∠BCN = 180° – ∠BMN и ∠ADN = 180° – ∠AMN = ∠BMN, то есть BC || AD."
    ],
    "60599": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: Для каждого натурального n приведите пример прямоугольника, который разрезался бы ровно на n квадратов, среди которых должно быть не более двух одинаковых.",
        "Подсказка: Смотрите задачу 60565   г).",
        "Ответ: Например, прямоугольник Fn×Fn+1."
    ],
    "102971": [
        "Разные задачи на разрезания",
        "Сложность: 2",
        "Классы: 4,5",
        "Условие: У двух человек было два квадратных торта. Каждый сделал на своем торте по 2 прямолинейных разреза от края до края. При этом у одного получилось три куска, а у другого — четыре. Как это могло быть?",
        "Подсказка: Обратите внимание, разрезы могут пересекаться.",
        "Решение: Это могло получиться, если в первом случае разрезы не пересекались, а во втором — пересеклись. Например, если в первом случае они были параллельны друг другу, а во втором — перпендикулярны."
    ],
    "64796": [
        "Замощения костями домино и плитками",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Из шахматной доски (размером 8×8) вырезали центральный квадрат размером 2×2.   Можно ли оставшуюся часть доски разрезать на равные фигурки в виде буквы Г, состоящие из четырёх клеток?",
        "Решение: Предположим, что искомое разрезание возможно. Покрасим горизонтали доски поочередно в два цвета (матрасиком, см. рис.). Тогда в каждой фигурке, независимо от её расположения, будут три клетки одного цвета и одна клетка другого цвета. Так как в оставшейся части доски – по 30 клеток каждого цвета, то фигурок при разрезании может получиться только чётное количество.    С другой стороны, фигурок будет (64 – 4) : 2 = 15, то есть нечётное количество. Противоречие.",
        "Ответ: Нельзя."
    ],
    "64943": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Из клетчатой бумаги вырезана прямоугольная рамка (см. рисунок). Её разрезали по границам клеток на девять частей и сложили из них квадрат 6×6. Могли ли все части, полученные при разрезании, оказаться различными? (При складывании квадрата части можно переворачивать.)",
        "Решение: На рисунке слева показано, каким образом может быть разрезана рамка в соответствии с условием задачи, а на рисунке справа – как из получившихся частей сложить квадрат.",
        "Ответ: Могли."
    ],
    "65595": [
        "Замощения костями домино и плитками",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Напомним, что игра в морской бой начинается с того, что на доске размером 10×10 клеток расставляют один корабль из четырёх клеток, два – из трёх клеток, три – из двух, и четыре одноклеточных (такие, как на рисунке).   По правилам корабли не должны касаться, даже углами. До какого наименьшего размера можно уменьшить квадратное поле для игры, сохранив это правило?",
        "Решение: Один из возможных примеров расстановки см. на рисунке.",
        "Ответ: До квадрата 7×7."
    ],
    "65967": [
        "Разные задачи на разрезания",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: На столе лежит прямоугольный лист бумаги. Саша разрезает его по прямой на две части и кладёт части на стол. Потом он берёт одну из частей, снова режет по прямой на две части и кладёт части обратно на стол. Потом снова берёт со стола и разрезает одну часть, и так далее. Какое наименьшее количество разрезов необходимо сделать Саше, чтобы на столе оказалось, по крайней мере, 252 одиннадцатиугольника?",
        "Решение: Заметим, что после одного разреза общее количество вершин увеличивается на две (если разрез проходит через две вершины), на три (если разрез проходит через вершину и точку внутри стороны) или на четыре (если разрез проходит через внутренние точки двух сторон). Пусть было сделано k разрезов, после чего получилось k + 1 частей, в которых суммарно не более чем 4k + 4 вершины.     Предположим, что среди полученных частей есть 252 одиннадцатиугольника. Каждый из оставшихся кусков будет иметь не менее трёх вершин, а всего вершин будет не меньше чем 11·252 + 3(k + 1 – 252) = 2772 + 3k – 753 = 3k + 2019 ≤ 4k + 4. Следовательно, k ≥ 2015.     Покажем, что 2015 разрезов достаточно. Например, сначала разрежем исходный прямоугольник на 252 прямоугольника (251 разрез). Теперь, чтобы получить 252 одиннадцатиугольника, достаточно от каждого прямоугольника семь раз отрезать по треугольнику, увеличивая каждый раз количество вершин на одну. Для этого потребуется еще 7·252 = 1764 разреза. Всего получим 251 + 1764 = 2015 разрезов.",
        "Ответ: 2015 разрезов."
    ],
    "66130": [
        "Разрезания на параллелограммы",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Внутри квадрата отмечена произвольная точка М. Можно ли этот квадрат разрезать не более чем на три прямоугольника, и сложить из них квадрат так, чтобы точка М стала его центром? (Разрезы не должны проходить через точку М.)",
        "Решение: Пусть точка М расположена внутри квадрата АВСD так, что её расстояния  до сторон АВ и AD равны x и y соответственно. Без ограничения общности можно считать, что сторона квадрата равна 2, а x, y ≤ 1.     Если знаки неравенства строгие, то проведём два разреза параллельно сторонам CD и BC: на расстоянии 1 – x от СD и на расстоянии 1 – y от ВС (см. рис.). Переместив два прямоугольника так, как показано на рисунке, получим квадрат EFGH. При этом расстояние от точки М до каждой из его сторон равно 1, то есть М – центр этого квадрата.",
        "Ответ: Можно."
    ],
    "76546": [
        "Разрезания на параллелограммы",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите, что выпуклый 13-угольник нельзя разрезать на параллелограммы.",
        "Решение: У выпуклого многоугольника с нечётным числом сторон есть сторона, не   параллельная ни одной из остальных его сторон, поскольку параллельные стороны  выпуклого многоугольника разбиваются на пары. А если многоугольник можно  разрезать на параллелограммы, то для каждой его стороны найдётся сторона, ей  параллельная (см. решения задач 34886 и 97796)."
    ],
    "77910": [
        "Свойства частей, полученных при разрезаниях",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: В выпуклом 13-угольнике проведены все диагонали. Они разбивают его на многоугольники. Возьмём среди них многоугольник с наибольшим числом сторон. Какое самое большее число сторон может он иметь?",
        "Решение: Из каждой вершины исходного 13-угольника выходит не более двух  диагоналей, которые являются сторонами рассматриваемого многоугольника.  Каждой диагонали соответствуют две вершины, поэтому число сторон  рассматриваемого многоугольника не превосходит 13. Пример правильного  13-угольника показывает, что число сторон полученного при разрезании  многоугольника может быть равно 13.",
        "Ответ: 13."
    ],
    "88042": [
        "Замощения костями домино и плитками",
        "Сложность: 3+",
        "Классы: 5,6,7,8",
        "Условие: Все поля шахматной доски 8×8 покрыли 32 косточками домино (каждая  косточка закрывает в точности два поля).   Докажите, что число вертикально лежащих косточек чётно.",
        "Решение: Окрасим чётные горизонтали в белый цвет, а нечётные – в чёрный. Каждая горизонтальная доминошка содержит чётное число белых клеток (0 или 2), а каждая вертикальная – ровно одну. Поскольку общее число белых клеток чётно, то и число вертикальных доминошек чётно."
    ],
    "87954": [
        "Разрезания (прочее)",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Накакое максимальное число кусков можно разделить круглый блинчик при помощи трех прямолинейных разрезов?",
        "Подсказка: Вспомните задачу11.",
        "Решение: Если изтрех прямых каждые две пересекаются внутри блинчика, получится 7кусков (см.рис.11.4). Еслиже изэтих прямых какиенибудь две параллельны или пересекаются запределами блинчика, токусков будет меньше.",
        "Ответ: 7кусков."
    ],
    "103017": [
        "Замощения костями домино и плитками",
        "Сложность: 3+",
        "Классы: 5,6,7",
        "Условие: Комплект косточек домино выложен в виде прямоугольника 8×7 клеток.   Попробуйте определить, как расположены косточки?",
        "Подсказка: Подумайте, где расположена косточка 6-6.",
        "Решение: См. рисунок."
    ],
    "107709": [
        "Разные задачи на разрезания",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Незнайка думает, что только равносторонний треугольник можно разрезать на три равных треугольника. Прав ли он?",
        "Решение: Возьмём прямоугольный треугольник",
        "Ответ: Незнайка неправ."
    ],
    "103827": [
        "Разные задачи на разрезания",
        "Сложность: 2",
        "Классы: 6",
        "Условие: Разрежьте фигуру, изображённую на рисунке, на две части, из которых можно сложить треугольник.",
        "Ответ: См. рисунок."
    ],
    "116787": [
        "Разные задачи на разрезания",
        "Сложность: 3+",
        "Классы: 5,6",
        "Условие: Требуется разрезать по клеточкам изображенную на рисунке фигуру на несколько равных частей. Сколько частей может получиться?",
        "Решение: Данная фигура содержит 24 клетки. Поскольку её требуется разрезать на равные части, то в каждой части должно быть одно и то же количество клеток. Значит, количество частей должно быть делителем числа 24, то есть одним из чисел 1, 2, 3, 4, 6, 8, 12, 24. На одну часть разрезать фигуру бессмысленно, а разрезания на 2, 3, 4, 6, 8, 12 и 24 части см. на рисунках.",
        "Ответ: 2, 3, 4, 6, 8, 12 или 24."
    ],
    "34886": [
        "Разрезания на параллелограммы",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Докажите, что если выпуклый многоугольник можно разбить   на несколько параллелограммов, то он имеет центр   симметрии.",
        "Подсказка: От некоторой стороны можно начать   цепочку параллелограммов.",
        "Решение: От каждой стороны многоугольника отходит цепочка   параллелограммов, т.е. эта сторона как бы   перемещается по ним  параллельно, причем   она может по ходу перемещения разбиваться на   несколько частей.   Так как у выпуклого многоугольника может быть еще   только одна сторона, параллельная данной, то   все разветвления цепочки упираются в одну и ту же сторону,   причем длина этой стороны не меньше  длины стороны,   из которой цепочка выходит.   Мы можем выпустить цепочку параллелограммов как   из первой стороны во вторую, так и из второй в первую,   поэтому все стороны многоугольника разобьются на пары   параллельных и равных сторон.   Отсюда нетрудно показать, что многоугольник имеет центр   симметрии."
    ],
    "35058": [
        "Покрытия",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: 10 журналов лежат на журнальном столе, полностью покрывая его.  Докажите,  что можно убрать пять из них так, что оставшиеся журналы будут  покрывать не менее половины площади стола.",
        "Подсказка: Сведите задачу к случаю, когда журналы не перекрываются.",
        "Решение: Занумеруем журналы числами от 1 до 10.  От второго журнала отрежем ту часть (если такая есть), которая  уже покрывается первым журналом.  От третьего журнала отрежем ту часть, которая  уже покрывается первым и вторым журналами.  Действуем так и дальше, в конце концов  от десятого журнала отрежем ту часть, которая  уже покрывается всеми журналами с первого по девятый.  После описанной процедуры 10 журналов  (у некоторых из них, возможно, отрезана какая-то часть, в частности,  может быть удален целый журнал)  будут покрывать стол в один слой. Следовательно,  5 журналов, наибольших по площади, покрывают не менее половины  площади стола. Ясно, что те же самые 5 журналов покрывали не менее  половины площади стола и до того, как мы резали журналы.  Следовательно, оставшиеся 5 журналов можно убрать со стола так, чтобы  условие задачи выполнялось."
    ],
    "35104": [
        "Плоскость, разрезанная прямыми",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На плоскости проведено несколько прямых (не менее трех),   никакие две из которых не   параллельны и никакие три не проходят через одну точку.   Докажите, что среди частей, на которые они разбивают плоскость,   найдется хотя бы один треугольник.",
        "Подсказка: Рассмотрите некоторую прямую и точку пересечения двух других  прямых, расположенную ближе всего к выбранной прямой.",
        "Решение: Рассмотрим некоторую прямую l и точку пересечения A двух других  прямых k и m, расположенную ближе всего к выбранной прямой  среди всех попарных точек пересечения данных прямых (отличных от l).  Пусть прямые k и m пересекают прямую l в точках B и C  соответственно. Докажем, что треугольник ABC является одной из  частей, на которые плоскость разбита прямыми. Предположим  противное. Тогда некоторая прямая из данного множества прямых  пересекает треугольник ABC. Следовательно,  эта прямая пересекает две  стороны треугольника ABC, т.е. пересекает хотя бы одну из сторон  AB, AC. Пусть K - точка пересечения этой прямой  с одной из сторон AB, AC. Тогда расстояние от точки K до прямой l  меньше расстояния от точки A до прямой l вопреки выбору точки A.  Итак, найден искомый треугольник ABC."
    ],
    "35112": [
        "Замощения костями домино и плитками",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Можно ли покрыть  шахматную доску 8×8 доминошками  2×1    так, чтобы никакие две доминошки не образовывали квадратик 2×2?",
        "Подсказка: Предположите, что это возможно, и исходя из этого предположения   постройте из доминошек лесенку, которая начинается с угла доски.",
        "Решение: Докажем, что всегда образуется хотя бы один квадратик 2×2.    Предположим противное – доска покрыта доминошками так, что ни одного    квадратика не образуется.",
        "Ответ: нельзя."
    ],
    "35773": [
        "Плоскость, разрезанная прямыми",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На какое наибольшее число частей могут разбить плоскость 5 отрезков?",
        "Подсказка: Каждый следующий отрезок пересекается с n уже проведенными  не более, чем в n точках.",
        "Решение: Пусть n отрезков уже проведено, и они делят плоскость на   K(n) частей. Проведем (n+1)-ый отрезок.  Он пересекается с n уже проведенными  не более, чем в n точках, которые высекают  на нем не более (n-1) отрезков.  Каждый из этих отрезков может поделить на две уже  имеющуюся часть плоскости. Таким образом, проведение  (n+1)-го отрезка добавляет не более (n-1) новых частей  плоскости, т.е. K(n+1) не превосходит K(n)+n-1 (при n>1).  Отсюда легко получить (поскольку K(2)=1), что  K(5) не превосходит 1+(1+2+3)=7.  Пример с семью частями плоскости строится так.  Проводятся 5 прямых общего положения и на этих прямых берутся   5 отрезков, содержащих все попарные точки пересечения этих прямых.",
        "Ответ: 7.00"
    ],
    "77896": [
        "Разные задачи на разрезания",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Сложить из одинаковых кирпичиков (см. рис.) выпуклый многогранник.",
        "Решение: Разрежем куб на 8 кубиков. Возьмём один из этих кубиков и приложим к нему три  соседних кубика. Куб можно составить из двух таких (невыпуклых) фигур, каждая  из которых составлена из четырёх кубиков (см. рис.). Возьмём одну из этих фигур и отрежем от неё три ребра исходного куба, проведя три плоскости, проходящие через  диагонали граней маленьких кубиков параллельно рёбрам исходного куба; на рис. слева эти диагонали изображены сплошными линиями. (Вместе с рёбрами мы отрезаем три треугольные призмы; эти призмы пересекаются.) В результате получим невыпуклую фигуру, которую легко можно разрезать на три кирпичика; разрезы нужно провести по пунктирным линиям на рис. слева. Из двух таких фигур составляется выпуклая фигура, которая получается при отрезании от исходного куба шести рёбер (точнее говоря, шести пересекающихся призм)."
    ],
    "78162": [
        "Покрытия",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Обозначим через",
        "Решение: Ответ:",
        "Ответ: a"
    ],
    "86093": [
        "Замощения костями домино и плитками",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: Незнайка разместил без наложений в квадрате 10*10 только 13 фигур (скобок), изображённых на рисунке. Попробуйте разместить больше.",
        "Ответ: Можно разместить 14, 15 или даже 16 скобок. Больше разместить нельзя, так как 17 скобок занимают уже 102 клетки."
    ],
    "102813": [
        "Замощения костями домино и плитками",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Режем прямоугольник.",
        "Решение: Для каждой прямой, идущей по линиям сетки, напишем число доминошек, которые она рассекает, и все  выписанные числа сложим. Очевидно, сумма будет делится на 4. Т.к. каждую доминошку рассекает ровно одна прямая, то полученная сумма равна общему числу доминошек. Итак, количество доминошек делится на 4, значит, площадь прямоугольника делится на 8. Поэтому длина одной из сторон делится на 4."
    ],
    "86097": [
        "Разные задачи на разрезания",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: Бумага расчерчена на клеточки со стороной 1. Ваня вырезал из неё по клеточкам прямоугольник и нашёл его площадь и периметр. Таня отобрала у него ножницы и со словами Смотри, фокус! вырезала с краю прямоугольника по клеточкам квадратик, квадратик выкинула и объявила: Теперь у оставшейся фигуры периметр такой же, какая была площадь прямоугольника, а площадь - как был периметр! Ваня убедился, что Таня права.",
        "Решение: а) Квадратик не мог иметь общий угол с прямоугольником (см. рис.), так как тогда периметр остался бы прежним или уменьшился (убедитесь сами!), а площадь бы уменьшилась. Значит, квадрат примыкает только к одной из сторон прямоугольника (см. рис.).",
        "Ответ: а) 2*2; б) см. рис. к пункту в) решения; в) 3*10 или 4*6."
    ],
    "35444": [
        "Покрытия",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Коридор покрыт несколькими ковровыми дорожками        (возможно, с наложениями).        Докажите, что можно убрать несколько дорожек таким образом, чтобы        оставшиеся дорожки покрывали коридор и сумма их длин не превышала        удвоенной длины коридора.",
        "Подсказка: Рассмотрите минимальную систему дорожек, покрывающих весь коридор.        Покажите, что в каждом наложении участвуют не более двух дорожек.",
        "Решение: Переформулируем задачу следующим образом.        Пусть отрезок длины 1 покрыт отрезками. Требуется доказать, что можно        исключить из покрытия некоторые отрезки так, чтобы оставшиеся        отрезки по-прежнему покрывали отрезок и их суммарная длина не        превышала 2.        Рассмотрим минимальное подмножество M отрезков, покрывающее данный        отрезок. Требование минимальности означает, что если из        подмножества M удалить любой отрезок, то полученная система отрезков уже        не будет покрывать исходный отрезок длины 1.        Докажем, что каждая точка отрезка длины 1 покрывается не более,        чем двумя отрезками множества М - этого будет достаточно для        решения задачи.        Предположим противное - некоторая точка X  покрыта тремя отрезками        [A"
    ],
    "78285": [
        "Разрезания на параллелограммы",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: На сторонах квадрата, как на основаниях, построены во внешнюю сторону равные равнобедренные треугольники с острым углом при вершине. Доказать, что получившуюся фигуру нельзя разбить на параллелограммы.",
        "Решение: Предположим, что данная фигура разбита на  параллелограммы. Легко доказать от противного, что сторона  любого  параллелограмма разбиения параллельна одной из сторон  фигуры. Тем же методом легко показать, что если  параллелограмм одной стороной примыкает к некоторой  стороне"
    ],
    "107632": [
        "Разные задачи на разрезания",
        "Сложность: 4",
        "Классы: 7,8,9,10",
        "Условие: Можно ли разрезать равносторонний треугольник на пять попарно различных равнобедренных треугольников.",
        "Решение: Два возможных решения приведены на рисунке:",
        "Ответ: Да, можно."
    ],
    "115710": [
        "Равносоставленные фигуры",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Покажите, как разрезать фигуру, изображенную на верхнем рисунке, на три равные части и сложить из этих частей правильный шестиугольник, изображенный на нижнем рисунке. Оставлять дырки и накладывать части друг на друга нельзя.",
        "Решение: Два решения приведены ниже."
    ],
    "35538": [
        "Покрытия",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Несколько отрезков покрывают отрезок [0, 1].   Докажите, что среди них можно выбрать несколько непересекающихся отрезков, сумма длин которых не меньше ½.",
        "Подсказка: Начните выбрасывать отрезки, которые покрываются другими отрезками.",
        "Решение: Используем индукцию по числу отрезков, покрывающих отрезок [0, 1].       База. Для покрытия одним отрезком утверждение очевидно.     Шаг индукции. Пусть отрезок [0, 1] покрыт n + 1 отрезком. Если среди них имеется отрезок, который покрыт остальными, то выкинем его из покрытия и воспользуемся предположением индукции.      Пусть таких отрезков нет. Обозначим отрезки Ii = [ai, bi] так, что a1 <  a2 < ... < an. Тогда bi < bi+1 для каждого i. С другой стороны, bi < ai+2, иначе отрезки Ii и Ii+2 покрывали бы отрезок Ii+1. Значит, отрезки с нечётными номерами попарно не  пересекаются, как и отрезки с чётными номерами. Поскольку все отрезки образуют покрытие отрезка [0, 1], либо сумма длин отрезков с чётными номерами, либо сумма длин отрезков с нечётными номерами не меньше ½. Тем самым найдена искомая система непересекающихся отрезков."
    ],
    "35784": [
        "Замощения костями домино и плитками",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: В квадрате 7×7 клеток размещено 16 плиток размером 1×3 клетки и одна плитка 1×1.   Докажите, что плитка 1×1 либо лежит в центре, либо примыкает к границам квадрата.",
        "Подсказка: В каждой клетке запишем номер её столбца. Тогда сумма чисел в любой плитке 1×3 будет делиться на 3.",
        "Решение: В каждой клетке запишем число, равное номеру её столбца. Тогда сумма чисел во всех клетках 7(1 + 2 + ... + 7) ≡ 1 (mod 3). С другой стороны,  сумма чисел в каждой плитке 1×3 будет кратна 3. Таким образом, в плитке 1×1 должно быть написано число, которое дает остаток 1 от деления на 3. Значит, плитка 1×1 может находиться только в первом, четвёртом или седьмом столбце. Точно также показывается, что она может находиться только в первой, четвёртой или седьмой строке. Отсюда сразу следует утверждение задачи."
    ],
    "58083": [
        "Плоскость, разрезанная прямыми",
        "Сложность: 4",
        "Классы: 7,8",
        "Условие: На шахматной доске 8×8 отмечены центры всех полей. Можно ли тринадцатью прямыми, не проходящими через эти центры, разбить доску на части так, чтобы внутри каждой из них лежало не более одной отмеченной точки?",
        "Решение: К краю шахматной доски 8×8 прилегает 28 полей. Проведем 28 отрезков, соединяющих центры соседних крайних полей, а также 13 прямых, не проходящих через эти центры. Каждая прямая может пересекать не более двух таких отрезков, поэтому 13 прямых могут пересекать не более 26 отрезков. Следовательно, найдутся  по крайней мере два отрезка, не пересекающихся ни с одной из 13 проведённых прямых. Оба конца такого отрезка лежат в одной части.",
        "Ответ: Нельзя."
    ],
    "64953": [
        "Замощения костями домино и плитками",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Из шахматной доски размером 8×8 вырезали квадрат размером 2×2 так, что оставшуюся доску удалось разрезать на прямоугольники размером 1×3. Определите, какой квадрат могли вырезать.",
        "Решение: Раскрасим шахматную доску в три цвета по диагоналям, начиная с левого нижнего угла доски (рис. а). Тогда при разрезании части доски на прямоугольники 1×3 в каждом прямоугольнике окажутся клетки всех трёх цветов. Следовательно, после вырезания квадрата клеток каждого из цветов на доске должно остаться поровну. До вырезания на доске 21 клетка цвета 1, 22 клетки цвета 2 и 21 клетка цвета 3. Значит, вырезали квадрат, в котором две клетки цвета 2 и по клетке цвета 1 и 3.",
        "Ответ: Любой из девяти квадратов, закрашенных на рисунке."
    ],
    "104001": [
        "Разные задачи на разрезания",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: У Кая есть ледяная пластинка в форме уголка (см. рисунок). Снежная Королева потребовала от Кая разрезать ее на четыре равные части. Как ему это сделать?",
        "Решение: Надо разрезать этот уголок на четыре маленьких уголка так, как показано на рисунке:"
    ],
    "78158": [
        "Покрытия",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Обозначим через",
        "Решение: Рассмотрим"
    ],
    "79613": [
        "Разные задачи на разрезания",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: В центре квадратного пирога находится изюминка. От пирога можно отрезать  треугольный кусок по линии, пересекающей в точках, отличных от вершин, две  соседние стороны; от оставшейся части пирога — следующий кусок (таким же  образом) и т.д. Можно ли отрезать изюминку?",
        "Решение: В решении задачи",
        "Ответ: нельзя."
    ],
    "98613": [
        "Разные задачи на разрезания",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Дан картонный прямоугольник со сторонами a см и b см, где b/2 < a < b.   Докажите, что его можно разрезать на три куска, из которых можно сложить квадрат.",
        "Решение: См. рис."
    ],
    "115474": [
        "Разные задачи на разрезания",
        "Сложность: 2",
        "Классы: 5,6,7,8",
        "Условие: Разрежьте данную фигуру (см. рисунок) на три равных фигуры.",
        "Решение: Исходная фигура состоит из восемнадцати клеток, следовательно, каждая из трех фигур, на которые нужно ее разбить, должна состоять из шести клеток. Перебором устанавливаем, что 5 клеток искомой фигуры должны лежать в одном ряду."
    ],
    "35212": [
        "Свойства частей, полученных при разрезаниях",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Пузатостью прямоугольника назовем отношение его меньшей    стороны к большей. Докажите, что если разрезать квадрат на    прямоугольники, то сумма их пузатостей будет не меньше 1.",
        "Подсказка: Если сторона квадрата не больше 1,    то пузатость каждого маленького прямоугольника   не меньше его площади.",
        "Решение: Примем сторону квадрата за 1 (это возможно, так как   при этом значения пузатостей прямоугольников сохранятся).   Обозначим для каждого маленького прямоугольника через   a"
    ],
    "78618": [
        "Покрытия",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: В четырёх заданных точках на плоскости расположены прожекторы, каждый из которых может освещать прямой угол. Стороны этих углов могут быть направлены на север, юг, запад или восток. Доказать, что эти прожекторы можно направить так, что они осветят всю плоскость.",
        "Решение: Среди данных точек выберем две наиболее северные (если есть несколько наиболее северных точек, то выбираем любые две из них). Одну из сторон каждого прямого угла в этих точках направим на юг, а другие стороны направим навстречу друг другу. В результате будет освещена вся полуплоскость южнее этих двух прожекторов. С помощью двух оставшихся прожекторов можно осветить полуплоскость севернее их."
    ],
    "79618": [
        "Разные задачи на разрезания",
        "Сложность: 4",
        "Классы: 7,8,9,10",
        "Условие: От пирога, имеющего форму выпуклого пятиугольника, можно отрезать треугольный кусок по линии, пересекающей в точках, отличных от вершин, две соседние стороны; от оставшейся части пирога — следующий кусок (таким же образом) и т.д. В какие точки пирога можно воткнуть свечку, чтобы её нельзя было отрезать?",
        "Решение: Ответ: свечку можно воткнуть в одну из точек многоугольника (включая  границу), закрашенного на рисунке. Будем решать задачу для произвольного многоугольника. Пусть",
        "Ответ: A"
    ],
    "35804": [
        "Плоскость, разрезанная прямыми",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Архитектор хочет расположить семь высотных зданий так, чтобы, гуляя по городу, можно было увидеть их шпили в любом (циклическом) порядке.   Удастся ли это ему?",
        "Подсказка: Чтобы сменить порядок следования шпилей, пешеход должен пересечь прямую линию, соединяющую некоторые два шпиля. Число возможных циклических порядков следования шпилей равно 6!.",
        "Решение: Число циклических порядков следования шпилей равно 6! (см. задачу 60373). Пусть турист в некоторый момент видит здания в каком-то циклическом порядке. Порядок следования шпилей не изменится, пока турист не пересечет прямую, проходящую через некоторые два шпиля. Проведем прямые через каждую пару шпилей (таких прямых всего 7·6:2 = 21). Эти прямые разобьют плоскость не более, чем на 21·22:2 + 1 = 232 области (см. задачу 60323). Поскольку   232 < 720, не все порядки могут быть увидены.",
        "Ответ: Не удастся."
    ],
    "58229": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 4",
        "Классы: 7,8",
        "Условие: Существует ли треугольник, который можно разрезать: а) на 3 равных треугольника, подобных исходному?; б)  на 5 треугольников, подобных исходному (не обязательно равных)?",
        "Решение: а) Существует. Из трех одинаковых прямоугольных треугольников с  углом"
    ],
    "58235": [
        "Свойства частей, полученных при разрезаниях",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: а) В выпуклом",
        "Решение: а) Прямая, на которой лежит сторона многоугольника разбиения, проходит через две вершины исходного многоугольника, а через каждую вершину исходного многоугольника может проходить не более двух таких прямых. Поэтому число сторон многоугольника разбиения не больше числа вершин исходного многоугольника."
    ],
    "58236": [
        "Свойства частей, полученных при разрезаниях",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Докажите, что если",
        "Решение: Если"
    ],
    "58245": [
        "Плоскость, разрезанная прямыми",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: 99 прямых разбивают плоскость на",
        "Решение: Индукцией по"
    ],
    "58246": [
        "Плоскость, разрезанная прямыми",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Докажите, что при",
        "Решение: Обозначим точки пересечения одной из данных прямых состальными через"
    ],
    "58247": [
        "Плоскость, разрезанная прямыми",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: а) Найдите число всех полученных фигур.",
        "Решение: а) Пусть"
    ],
    "58248": [
        "Плоскость, разрезанная прямыми",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: а) Докажите, что при",
        "Решение: а) Все точки пересечения данных прямых можно заключить  внекоторую окружность. Прямые разбивают эту окружность на  4"
    ],
    "64676": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Выпуклый многоугольник разрезан на выпуклые семиугольники (так, что каждая сторона многоугольника является стороной одного из семиугольников). Докажите, что найдутся четыре соседние вершины многоугольника, принадлежащие одному семиугольнику.",
        "Решение: Предположим, что N-угольник разрезан на несколько многоугольников (будем их называть малыми) так, что никакие четыре последовательные вершины не принадлежат одному многоугольнику. Тогда по меньшей мере каждый второй угол N-угольника разрезан одной из линий деления. Поэтому к каждым двум последовательным углам N-угольника прилегает не менее трёх углов малых многоугольников, и следовательно, среднее арифметическое этих прилегающих углов меньше 120°. Среднее арифметическое углов, прилегающих к каждой вершине внутри N-угольника, не больше 120° (равенство будет, только если в вершине сходится ровно три угла). Если же вершина одного малого многоугольника находится на стороне другого (малого или исходного) многоугольника, то среднее значение углов в этой вершине не превышает даже 90°. Отсюда следует, что и в целом среднее значение углов малых многоугольников меньше 120°. Но тогда они не могут все быть семиугольниками."
    ],
    "87967": [
        "Разрезания (прочее)",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: ВВолшебной Стране свои волшебные законы природы, один изкоторых гласит: Ковёр-самолёт будет летать только тогда, когда он имеет прямоугольную форму.  УИвана-царевича был ковёр-самолёт размером 9×12. Как-тораз Змей Горыныч подкрался иотрезал отэтого ковра маленький коврик размером 1×8. Иван-царевич очень расстроился ихотел было отрезать ещё кусочек 1×4, чтобы получился прямоугольник 8×12, ноВасилиса Премудрая предложила поступить по-другому. Она разрезала ковёр натри части, изкоторых волшебными нитками сшила квадратный ковёр-самолёт размером",
        "Подсказка: Подумайте, как стал выглядеть ковёрсамолёт после того, как Змей Горыныч отрезал отнего кусок.",
        "Решение: После того как Змей Горыныч испортил ковёрсамолёт, Иван-царевич мог отрезать отэтого ковра кусочек размером 1×4 ипревратить его вковёр размером 8×12. Это значит, что после ухода Змея Горыныча ковёр выглядел так, как показано нарис.1. Василиса Премудрая разрезала этот ковёр так, как показано нарис.2, исшила так, как показано нарис.3.",
        "Ответ: См.рисунок справа."
    ],
    "116843": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: Можно ли сложить какой-нибудь квадрат из трёхклеточных уголков (см. рис.)?",
        "Решение: Из двух уголков можно сложить прямоугольник 2×3, а из таких прямоугольников легко сложить любой квадрат со стороной, кратной 6.",
        "Ответ: Можно."
    ],
    "35672": [
        "Покрытия",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: На экваторе растет несколько 100-метровых сосен.  Однажды все сосны завалились на восток и покрыли весь экватор.  Докажите, что если бы они завалились на запад, то они также  покрыли бы весь экватор.",
        "Подсказка: Докажите, что промежуток между двумя соседними соснами  не превосходит 100 метров.",
        "Решение: Рассмотрим промежуток между двумя соседними соснами.  Так как он был завален соснами, когда сосны завалилсь на восток,  то длина этого промежутка не больше 100 м.  В самом деле, если бы этот промежуток был более 100 м,  то ни одна из завалившихся на восток сосен не смогла бы накрыть  восточный конец этого промежутка.  Рассуждая таким же образом для каждого промежутка между  соседними соснами, получаем, что ни один из этих промежутков не  превышает 100 м.  Отсюда следует, что если бы сосны завалились на запад, то  каждая сосна накрыла бы целиком промежуток до следующей  сосны, находящийся к западу от нее."
    ],
    "79660": [
        "Замощения костями домино и плитками",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: Составьте из прямоугольников 1х1, 1х2, 1х3,…,1х13 прямоугольник, каждая сторона которого больше 1.",
        "Решение: Площадь искомого прямоугольника должна быть равна 1+2+...+13=91. Так как 91 раскладывается только в произведение 7×13, то стороны прямоугольника должны быть равны 7 и 13. Замостить его исходными прямоугольниками можно, например, так:"
    ],
    "98705": [
        "Разные задачи на разрезания",
        "Сложность: 2",
        "Классы: 5,6",
        "Условие: В Волшебной Стране свои волшебные законы природы, один из которых гласит: «Ковер-самолет будет летать только тогда, когда он имеет прямоугольную форму». У Ивана-царевича был ковер-самолет размером 9×12. Как-то раз Змей Горыныч подкрался и отрезал от этого ковра маленький коврик размером 1×8. Иван-царевич очень расстроился и хотел было отрезать еще кусочек 1×4, чтобы получился прямоугольник 8×12, но Василиса Премудрая предложила поступить по-другому. Она разрезала ковер на три части, из которых волшебными нитками сшила квадратный ковер-самолет размером 10×10. Сможете ли Вы догадаться, как Василиса Премудрая переделала испорченный ковер?",
        "Подсказка: Подумайте, как стал выглядеть ковер-самолет после того, как Змей Горыныч отрезал от него кусок.",
        "Решение: После того как Змей Горыныч испортил ковер, Иван-царевич мог отрезать от этого ковра кусочек размером 1х4 и превратить его в ковер размером 8×12. Это значит, что после ухода Змея Горыныча ковер выглядел так, как показано на рис. 1. Василиса Премудрая разрезала этот ковер так, как показано на рис. 2, и сшила так, как показано на рис. 3."
    ],
    "31357": [
        "Разрезания, разбиения, покрытия  и замощения",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Как разрезать на единичные квадраты квадрат a)",
        "Решение: a) 4 разреза; b) 6 разрезов."
    ],
    "35072": [
        "Разрезания (прочее)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Можно ли поверхность единичного куба оклеить четырьмя треугольниками площади 1,5?",
        "Подсказка: Поверхность куба можно оклеить двумя равными прямоугольниками.",
        "Решение: Вначале оклеим поверхность куба двумя равными прямоугольниками размером 1&times3: каждый из этих прямоугольников покрывает три соседние грани куба. Каждый из них разрежем диагональю на два равных прямоугольных треугольника. Площадь каждого такого треугольника равна 1,5.",
        "Ответ: Можно."
    ],
    "88083": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Вкруге отметили точку. Можноли так разрезать этот круг натри части, чтобы изних можно былобы сложить новый круг, укоторого отмеченная точка стоялабы вцентре?",
        "Подсказка: Заметьте, вобоих случаях нам недано никаких ограничений наформу кусков, определено только их количество.",
        "Решение: Вырежем изкруга два одинаковых маленьких кружка, один сцентром вотмеченной точке, адругой— сцентром вцентре круга (нужно так подобрать их радиусы, чтобы вбольшом круге эти кружки непересекались), третий кусок— то,что осталось отбольшого круга. Поменяв местами маленькие кружки, получим такой круг, как требовалось вусловии.",
        "Ответ: Вырежем изкруга два одинаковых маленьких непересекающихся кружка, один сцентром вотмеченной точке, адругой— сцентром вцентре круга. Поменяв местами маленькие кружки, получим такой круг, как требовалось вусловии."
    ],
    "35528": [
        "Разные задачи на разрезания",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Как разрезать треугольник на несколько треугольников так, чтобы    никакие два из треугольников разбиения не имели целой общей    стороны?",
        "Подсказка: Существует искомое разрезание на четыре треугольника.",
        "Решение: Искомое разрезание может быть получено, например, так, как показано    на картинке."
    ],
    "35660": [
        "Разные задачи на разрезания",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Разрежьте фигуру, полученную из прямоугольника 4×5 вырезанием четырёх угловых клеток 1×1, на три части, не являющиеся квадратами, так, чтобы из этих частей можно было сложить квадрат.",
        "Подсказка: Две из частей – уголки из трёх клеток.",
        "Решение: См. рис."
    ],
    "35670": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Замостите плоскость одинаковыми пятиугольниками.",
        "Подсказка: Нужно подобрать достаточно простой паркет из равных        многоугольников, и разделить каждый из этих многоугольников        на равные пятиугольники.",
        "Решение: Возьмем паркет из одинаковых центрально-симметричных        шестиугольников (пчелиные соты), и разрежем каждый из        этих шестиугольников пополам (см. картинку)."
    ],
    "35795": [
        "Покрытия",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: В коридоре длиной 100 м постелено 20 дорожек общей длиной 1 км. Ширина каждой дорожки равна ширине коридора.   Какова максимально возможная суммарная длина незастеленных участков коридора?",
        "Подсказка: Какова минимальная длина самой длинной из дорожек?",
        "Решение: Оценка. Из 20 дорожек суммарной длиной 1000 = 20·50  м длина хотя бы одной не меньше 50 м. Таким образом, даже одна из дорожек покрывает не меньше 50 м.     Пример. Возьмём 20 дорожек по 50 м и положим их точно друг на друга.",
        "Ответ: 50 м."
    ],
    "58221": [
        "Равносоставленные фигуры",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Разрежьте произвольный треугольник на части, из которых можно составить треугольник, симметричный исходному относительно некоторой прямой (части переворачивать нельзя).",
        "Решение: Пусть A – наибольший угол треугольника. Разрежем треугольник  ABC на равнобедренные треугольники и переставим их, как показано на рисунке."
    ],
    "65214": [
        "Замощения костями домино и плитками",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Можно ли разрезать квадрат 5×5 на прямоугольники двух видов: 1×4 и 1×3 так, чтобы получилось 7  прямоугольников?",
        "Решение: Cм. рис.",
        "Ответ: Можно."
    ],
    "65958": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 2+",
        "Классы: 8,9,10",
        "Условие: Верно ли, что любой треугольник можно разбить на четыре равнобедренных треугольника?",
        "Решение: Проведём высоту к наибольшей стороне треугольника. Она разобьёт треугольник на два прямоугольных треугольника. В этих прямоугольных треугольниках проведём медианы к гипотенузам. Они разобьют каждый прямоугольный треугольник на два равнобедренных треугольника.",
        "Ответ: Верно."
    ],
    "78028": [
        "Разные задачи на разрезания",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Найти все прямоугольники, которые можно разрезать на 13 равных квадратов.",
        "Решение: Квадраты, на которые разрезан прямоугольник, по условию равны. Поэтому каждая  сторона прямоугольника разбита на равные части: одна сторона на m частей, а  другая на n. Общее число квадратов равно mn, поэтому mn = 13. Но число 13 простое, поэтому одно из чисел m и n равно 1, а другое равно 13.",
        "Ответ: Прямоугольники с отношением сторон 13 : 1."
    ],
    "88007": [
        "Замощения костями домино и плитками",
        "Сложность: 2+",
        "Классы: 5,6,7,8",
        "Условие: Из шахматной доски вырезали две клетки – a1 и h8. Можно ли оставшуюся часть доски покрыть 31 косточкой домино так, чтобы каждая косточка покрывала ровно две клетки доски?",
        "Решение: См. задачу 104026 б).",
        "Ответ: Нельзя."
    ],
    "88175": [
        "Разрезания (прочее)",
        "Сложность: 2+",
        "Классы: 5,6,7",
        "Условие: Настоле лежат три красные палочки разной длины, сумма длин которых равняется 30см, ипять синих палочек разной длины, сумма длин которых тоже равняется 30см. Можноли распилить теидругие палочки так, чтобы потом можно было расположить их парами, причём вкаждой паре палочки былибы одинаковой длины, норазного цвета?",
        "Подсказка: Попробуйте сложить синюю икрасную палки длиной по30 см исравните их между собой.",
        "Решение: Проверим, нетли среди наших палочек пар одной длины иразного цвета. Если есть— отложим эти пары всторону, если нет— выберем самую короткую палочку. Теперь возьмём любую палочку другого цвета иотпилим отнеё палочку такой же длины, как первая. Две одинаковые подлине, норазные поцвету палочки отложим всторону, аоставшийся после отпиливания кусочек приложим коставшимся палочкам. Теперь их будет уже меньше, нопри этом сумма длин красных палочек останется равной сумме длин синих. Повторив предыдущую операцию несколько раз, вконце концов распилим палочки напары, вкоторых длины совпадают, ацвета отличаются, что итребуется.  Можно поступить подругому. Сложим изсиних палочек синюю палку общей длиной 30см, аизкрасных— красную палку длиной 30см. Теперь насиней палке сделаем разрезы втех местах, вкоторых они есть накрасной, анакрасной палке— втех местах, вкоторых они есть насиней. Тогда красная исиняя палки будут разрезаны напалочки попарно равной длины.",
        "Ответ: Да. Сложим красную палку изкрасных палочек исинюю— изсиних. Приложим эти палки друг кдругу. Против стыков красных палочек сделаем разрезы насиних, апротив стыков синих— разрезы накрасных."
    ],
    "58220": [
        "Равносоставленные фигуры",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Разрежьте произвольный треугольник на 3 части и сложите из них прямоугольник.",
        "Решение: Пусть"
    ],
    "89934": [
        "Разрезания (прочее)",
        "Сложность: 2+",
        "Классы: 5,6,7",
        "Условие: В квадрате 4×4 нарисовано 15 точек Доказать, что из него можно вырезать квадратик 1×1, не содержащий внутри себя точек.",
        "Подсказка: Попробуйте разрезать исходный квадрат на квадраты 1×1.",
        "Решение: Разрежем наш квадрат на 16 квадратиков 1×1. Среди этих маленьких квадратиков обязательно найдется хотя бы один, в который не попала точка (не могут 15 точек попасть в 16 квадратов)."
    ],
    "102846": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 2+",
        "Классы: 6,7",
        "Условие: Квадрат на шестиугольники.",
        "Решение: Смотрите. Одна сторона шестиугольника параллельна стороне квадрата и центр квадрата является серединой этой стороны, меняя длину этой стороны, можно получить много разных шестиугольников."
    ],
    "103732": [
        "Замощения костями домино и плитками",
        "Сложность: 2+",
        "Классы: 7",
        "Условие: Замостите плоскость одинаковыми а)пятиугольниками;  б)семиугольниками.",
        "Подсказка: Попробуйте разбить квадрат на два одинаковых пятиугольника  или  семиугольника.",
        "Ответ: Замостим плоскость одинаковыми квадратиками (лист в ''клеточку''), а теперь разобьём каждый квадратик на два  одинаковых  пятиугольника (пункта)  или семиугольника (пунктб), как показано на рисунке."
    ],
    "115487": [
        "Разные задачи на разрезания",
        "Сложность: 2+",
        "Классы: 5,6,7",
        "Условие: Пете и Коле выдали две одинаковые фигуры, вырезанные из клетчатой бумаги. Известно, что в каждой фигуре меньше, чем",
        "Решение: Из условия задачи следует, что искомая фигура должна состоять из"
    ],
    "58275": [
        "Замощения костями домино и плитками",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Замостите обычную шахматную доску плитками, изображенными на рис.",
        "Решение: Требуемое замощение изображено на рис."
    ],
    "35565": [
        "Замощения костями домино и плитками",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Как замостить бесконечную клетчатую плоскость крестами,    состоящими из пяти клеток?",
        "Подсказка: Это несложно, хотя крест - не такая ровная фигура.    Какое множество клеток займут центральные клетки крестов?",
        "Решение: Расположим центральные клетки крестов в клетках    квадратной решетки, в которой ближайшие клетки отстоят друг    от друга на ход шахматного коня (см. картинку,    в центральных клетках крестов поставлены звездочки).    Каждая клетка, в которой не стоит звездочка, является    соседней ровно одной клетки, в которой стоит звездочка.    Это и показывает, что клетчатая плоскость покрыта    в один слой крестами,    имеющими в качестве центральных клеток клетки со звездочками."
    ],
    "35726": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 2+",
        "Классы: 8,9,10",
        "Условие: Можно ли из квадрата со стороной 10 см вырезать несколько кругов,  сумма диаметров которых больше 5 м?",
        "Подсказка: Круги должны быть маленькими, но их должно быть очень много.",
        "Решение: Разрежем квадрат на 100",
        "Ответ: можно."
    ],
    "104002": [
        "Разные задачи на разрезания",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Когда Кай справился с этим заданием, Королева дала ему другую ледяную пластинку (см. рисунок). Как разрезать ее на две равные части?",
        "Решение: Смотри рисунок:"
    ],
    "35390": [
        "Покрытия",
        "Сложность: 2+",
        "Классы: 9,10",
        "Условие: На стол положили несколько одинаковых листов бумаги прямоугольной        формы. Оказалось, что верхний лист покрывает больше половины площади        каждого из остальных листов. Можно ли в таком случае воткнуть булавку        так,  чтобы она проколола все прямоугольники?",
        "Подсказка: Найдите общую точку двух равных прямоугольников, покрывающих    более половины площади другого.",
        "Решение: Докажем, что булавка, воткнутая в центр верхнего листа  O, проколет все остальные листы. Действительно, если предположить, что  некоторый лист П не покрывается точкой O, то его можно симметрично отразить   относительно O, и его образ П' не будет пересекать исходный лист.  Так как O - центр симметрии  верхнего листа, то пересечения П и П' с верхним листом имеют равные площади, в сумме  меньшие площади одного листа. А значит, верхний лист покрывает меньше половины площади   листа П, что противоречит условию."
    ],
    "35610": [
        "Разные задачи на разрезания",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Можно ли квадратный лист бумаги размером 2*2 сложить так, чтобы    его можно было разрезать на 4 квадрата 1*1 одним взмахом    ножницами?",
        "Подсказка: Складывать квадрат разрешается не только по линиям сетки.",
        "Решение: Сложим квадрат пополам по диагонали, а затем полученный    равнобедренный прямоугольный треугольник - еще раз пополам    (см. картинку). Теперь все 4 отрезка длины 1, по которым    нужно разрезать квадрат 2*2 на 4 квадрата 1*1, совместились.    Тем самым, сделав единственный разрез ножницами,    получим 4 квадрата 1*1.        На самом деле, аналогичная задача может быть решена и для разрезания    квадрата  n*n на единичные квадратики.",
        "Ответ: можно."
    ],
    "58263": [
        "Разбиение фигур на отрезки",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что четырехугольник (с границей и внутренностью) можно разбить на отрезки, т.е. представить в виде объединения непересекающихся отрезков.",
        "Решение: Возьмем на сторонах"
    ],
    "89906": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 2+",
        "Классы: 6,7",
        "Условие: На прямоугольном торте лежит круглая шоколадка. Как разрезать торт на две равные части так, чтобы и шоколадка тоже разделилась ровно пополам?",
        "Подсказка: Помните ли Вы, что если фигура имеет центр симметрии, то любая прямая, проходящая через него, делит эту фигуру на две равные части?",
        "Решение: Если фигура имеет центр симметрии, то любая прямая, проходящая через него, делит эту фигуру на две равные части. Поэтому для того, чтобы одновременно разрезать и торт, и шоколадку на две равные части, надо провести прямую через центр торта и центр шоколадки."
    ],
    "102847": [
        "Замощения костями домино и плитками",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Вырезаем из прямоугольника.",
        "Решение: Смотрите:"
    ],
    "102848": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Режем буквой Т.",
        "Решение: Смотрите:"
    ],
    "102851": [
        "Свойства частей, полученных при разрезаниях",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Из треугольника прямоугольник.",
        "Решение: Провели среднюю линию треугольника, опустили на нее перпендикуляр из вершины, тем самым разбили треугольник на три части. Осталось верхние треугольники развернуть как показано на рисунке. (Докажите, что получился прямоугольник.)"
    ],
    "111230": [
        "Разные задачи на разрезания",
        "Сложность: 2+",
        "Классы: 5,6,7",
        "Условие: Разрежьте одну из фигур, приведенных на рисунке, на две части так,  чтобы из них можно было сложить каждую из оставшихся.  Нарисуйте, как вы разрезаете и как складываете.",
        "Решение: Например, разрежем первую фигуру так, как показано на рисунке 5.2.1.  Складываем вторую и третью фигуры так, как показано на рисунке 5.2.2."
    ],
    "102819": [
        "Разные задачи на разрезания",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Из двух квадратов один.",
        "Решение: На рисунке задача решена в общем случае. Пунктиром указан нужный квадрат. Докажите равенство треугольников, занумерованных одинаковыми цифрами."
    ],
    "35622": [
        "Разные задачи на разрезания",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Существует ли четырехугольник, который можно разрезать    двумя прямыми на 6 кусков?",
        "Подсказка: Четырехугольник с таким условием должен обязательно быть    невыпуклым.",
        "Решение: Пример ясен из картинки.",
        "Ответ: существует."
    ],
    "76039": [
        "Разные задачи на разрезания",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: Разрежьте квадрат на 3 части, из которых можно сложить треугольник с 3 острыми углами и тремя различными сторонами.",
        "Решение: Смотрите рисунок: квадрат разрезан на три части: белую, бирюзовую и зеленую."
    ],
    "111637": [
        "Разные задачи на разрезания",
        "Сложность: 3",
        "Классы: 6,7,8,9",
        "Условие: Петя разрезал фигуру на две равные части, как показано на рисунке. Придумайте, как разрезать эту фигуру на две равные части другим способом.",
        "Решение: Приведём ещё два возможных варианта разреза, кроме  приведённого в условии."
    ],
    "64932": [
        "Разрезания на параллелограммы",
        "Сложность: 3",
        "Классы: 5,6",
        "Условие: На клетчатом листе нарисован прямоугольник 6×7. Разрежьте его по линиям сетки на пять каких-нибудь квадратов.",
        "Ответ: См. рисунок."
    ],
    "86555": [
        "Замощения костями домино и плитками",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Игра с «доминошками».",
        "Решение: Второй делает ходы симметричные ходам первого относительно центра доски, и выигрывает."
    ],
    "108734": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 3",
        "Классы: 6,7,8,9",
        "Условие: Есть три треугольника: остроугольный, прямоугольный и тупоугольный. Саша взял  себе один треугольник, а Боря – два оставшихся. Оказалось, что Боря может приложить (без наложения) один из своих треугольников к другому, и получить треугольник, равный Сашиному. Какой из этих треугольников взял Саша?",
        "Решение: Саша может разрезать одной прямой свой треугольник на два, равных Бориным. При этом один из концов разреза расположен в вершине Сашиного треугольника, а другой – на противоположной стороне.     Посмотрим на сторону, которую пересёк разрез. Разрез не перпендикулярен этой стороне (иначе получится два прямоугольных треугольника, что противоречит условию). Значит, получится один тупоугольный треугольник и один остроугольный или прямоугольный.     В первом случае Сашин треугольник – прямоугольный. Пример приведён на рисунке.",
        "Ответ: Прямоугольный."
    ],
    "87951": [
        "Разрезания (прочее)",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Как разделить блинчик тремя прямолинейными разрезами на4, 5, 6, 7частей?",
        "Подсказка: Число частей зависит оттого, пересекаютсяли разрезы между собой внутри блинчика.",
        "Решение: Проведём вблинчике три прямые ирассмотрим точки их пересечения. Взависимости оттого, где будут расположены эти точки, получится тоили иное количество частей. Чтобы получить 4части, надо все три точки расположить вне блинчика (рис.1). Перенос одной изэтих точек иззаграницы блинчика внутрь добавляет одну часть. Так, чтобы получить 5частей, надо одну точку перенести внутрь блинчика (рис.2), 6— ещё одну точку перенести внутрь блинчика (рис.3), 7— все три точки пересечения расположить внутри блинчика (рис.4).",
        "Ответ: См.рисунок."
    ],
    "116473": [
        "Замощения костями домино и плитками",
        "Сложность: 3",
        "Классы: 5,6",
        "Условие: Квадрат 8×8 распилили на квадраты 2×2 и прямоугольники 1×4. При этом общая длина распилов оказалась равна 54.   Сколько фигурок каждого вида получилось?",
        "Решение: В квадрате 8×8 – 64 клетки, а в каждой из полученных фигурок – по четыре клетки. Поэтому всего получилось 16 фигурок.    Найдём сумму периметров всех получившихся фигурок. Так как граница каждого распила входит в периметр двух фигурок, то прибавим к периметру квадрата удвоенную длину распилов: 32 + 2·54 = 140.    Периметр квадрата 2×2 равен 8, а периметр прямоугольника – на 2 больше. Если бы все 16 фигурок были квадратами, то их суммарный периметр был бы равен 16·8 = 128, что на 12 меньше, чем на самом деле. Для увеличения общего периметра на 12 требуется 6 квадратов заменить на прямоугольники. Поэтому прямоугольников было 6, а квадратов – 10.",
        "Ответ: 10 квадратов и 6 прямоугольников."
    ],
    "32093": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 3",
        "Классы: 5,6,7,8",
        "Условие: В круге отметили точку. Разрежьте круг на а) три; б) две части так, чтобы из них можно было составить новый круг, у которого отмеченная точка будет в центре.",
        "Решение: a) Нужно вырезать из круга два маленьких равных кружка – один с центром в центре круга, а другой с центром в отмеченной точке, и затем поменять эти кружки местами."
    ],
    "34908": [
        "Покрытия",
        "Сложность: 3",
        "Классы: 9,10,11",
        "Условие: Можно ли на плоскости разместить конечное число парабол так, чтобы их внутренние области покрыли всю плоскость?",
        "Решение: Легко видеть, что парабола (с внутренней областью) пересекается с прямой, не параллельной её оси, по отрезку, точке или пустому множеству. Возьмём прямую, не параллельную ни одной из осей парабол. Параболы высекут на прямой конечное число отрезков, значит, не покроют даже эту прямую.",
        "Ответ: Нельзя."
    ],
    "34969": [
        "Замощения костями домино и плитками",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Можно ли из 18 доминошек 1&times2 выложить квадрат 6&times6 так, чтобы при этом не получалось ни одного прямого шва, соединяющего противоположные стороны квадрата и идущего по краям плиток?",
        "Подсказка: При выполнении условия каждый возможный шов должен пересекать хотя бы две доминошки.",
        "Решение: В квадрате 6×6, разбитом на единичные клетки, имеется пять горизонтальных и пять вертикальных швов. Эти швы являются потенциальными швами при разбиении квадрата на доминошки. Заметим, что если потенциальный шов пересекает ровно одну доминошку, то при удалении этой доминошки доска будет разделена этим швом на две части с нечётным числом клеток, каждая из которых разбита на доминошки, что невозможно. Таким образом, если потенциальный шов пересекает какую-нибудь доминошку, то он пересекает и вторую. Каждая плитка пересекаема ровно одним потенциальным швом, поэтому, чтобы заблокировать все 10 потенциальных швов, потребуется не менее 20 доминошек. Но доминошек только 18, один из потенциальных швов не будет заблокирован.",
        "Ответ: Нельзя."
    ],
    "35110": [
        "Плоскость, разрезанная прямыми",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: На плоскости нарисовано несколько прямых (не меньше двух),   никакие две из которых не параллельны и никакие три не проходят   через одну точку.   Докажите, что среди частей, на которые эти прямые делят плоскость,   найдется хотя бы один угол.",
        "Подсказка: Рассмотрите выпуклую оболочку   множества точек попарного пересечения прямых.",
        "Решение: Рассмотрим множество точек пересечения P пар прямых.   Возьмем выпуклую оболочку множества P -   наименьший выпуклый многоугольник M,   содержащий это множество. Вершинами многоугольника M являются   некоторые из точек множества P.   Рассмотрим одну из вершин A многоугольника M,   а также прямые k и m, которые   пересекаются в точке A.   Возьмем луч прямой k с началом в A, который не пересекает    многоугольник M (точнее, пересекает многоугольник M по точке A).   Также возьмем луч прямой m с началом в A, который не пересекает    многоугольник M.   Эти два луча образуют угол, лежащий вне многоугольника M.   Понятно, что этот угол и является одной из частей,   на которые плоскость разделена прямыми.   Из приведенного рассуждения следует, что если количество прямых   не меньше трех, то среди частей плоскости найдутся хотя бы    3 угла, поскольку выпуклая оболочка множества точек P   имеет хотя бы 3 вершины."
    ],
    "35321": [
        "Разные задачи на разрезания",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Внутри круга нарисована точка. Покажите, что можно разрезать круг на две       части так, чтобы из них можно было составить круг, в котором отмеченная       точка являлась бы центром.",
        "Подсказка: Границей разреза должна быть дуга окружности с центром в       нарисованной точке.",
        "Решение: Пусть O - центр данного круга S, а A - нарисованная точка.        Если A совпадает с O, то перекраивать нечего.        Иначе проведем окружность S' с центром в A и радиусом, равным        радиусу круга S. Эта окружность разобьет круг S на две части.        Первая из этих частей содержит точки A и O и симметрична        относительно серединного перпендикуляра m, проведенного к отрезку AO.        Эту часть оставим на месте. Вторую часть (имеющую форму месяца)        переложим так, чтобы она заняла положение, симметричное        своему начальному положению относительно m.        После этого первая и вторая часть заполняют внутренность        окружности S'.        Тем самым, требуемое перекраивание круга проделано."
    ],
    "35463": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Можно ли какой-нибудь выпуклый многоугольник разрезать на конечное    число невыпуклых четырехугольников?",
        "Подсказка: Оцените сумму углов, больших 180",
        "Решение: Предположим противное - некоторый выпуклый многоугольник разбит на     n невыпуклых четырехугольников. В каждом четырехугольнике есть     угол, больший 180",
        "Ответ: нельзя."
    ]
}