{
    "21984": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Пятеро молодых рабочих получили на всех зарплату -  1500 рублей.  Каждый из них хочет купить себе магнитофон ценой  320 рублей.  Докажите, что кому-то из них придется подождать с  покупкой до следующей зарплаты.",
        "Решение: Если бы каждый из рабочих мог купить магнитофон, то у них в сумме было бы не менее 5·320=1600 рублей."
    ],
    "88082": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Можно ли разложить 44 шарика на 9 кучек так, чтобы количество шариков в разных кучках было различным?",
        "Подсказка: Подумайте, сколько нужно шариков, чтобы выполнить условие задачи.",
        "Решение: Предположим, нам это удалось. Упорядочим кучки по возрастанию количества шариков. Тогда в первой кучке должно быть не меньше одного шарика, во второй – не меньше двух, в третьей – не меньше трёх и т. д. Всего шариков должно быть не меньше чем 1 + 2 + 3 + ... + 9 = 45. А у нас только 44. Противоречие.",
        "Ответ: Нельзя."
    ],
    "34970": [
        "Принцип Дирихле (углы и длины)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Несколько углов покрывают плоскость. Докажите, что сумма этих углов не меньше 360°.",
        "Подсказка: Если все углы отложены от одной точки O, то в предположении, что сумма углов меньше 360°, найдётся луч с началом в O, не покрытый углами.",
        "Решение: Предположим противное – сумма углов меньше 360°. Фиксируем некоторую точку O плоскости и совершим параллельный перенос каждого угла, так чтобы его вершина совместилась с точкой O. Поскольку сумма углов меньше развернутого угла, то найдётся луч m с началом в точке O, который не покрывается перенесенными углами. Нетрудно видеть, что при выполнении обратного параллельного переноса каждый угол станет пересекать луч m не более, чем по отрезку (то есть возможно пересечение по отрезку, по точке или пустое пересечение). Таким образом, данные углы высекают на луче m конечное число отрезков. Следовательно, даже луч m и тем более вся плоскость не покрываются углами. Противоречие."
    ],
    "35200": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Внутри выпуклого пятиугольника расположены две точки.   Докажите, что можно выбрать четырехугольник с   вершинами в вершинах пятиугольника так,   что в него попадут обе выбранные точки.",
        "Подсказка: Прямая, проходящая через две данные точки, пересекает две стороны   пятиугольника.",
        "Решение: Проведем прямую через две данные точки.   В одной из полуплоскостей от этой прямой лежит по крайней мере три   вершины A, B, C пятиугольника. Отрежем от пятиугольника треугольник с вершинами в этих   в точках A, B, C.   Получаем, что две данные точки лежат в оставшемся   четырехугольнике.   Это и требовалось в задаче."
    ],
    "35758": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Все точки окружности окрашены произвольным образом в два цвета.   Докажите, что найдётся равнобедренный треугольник с вершинами одного цвета, вписанный в эту окружность.",
        "Подсказка: В правильном пятиугольнике каждые три вершины образуют равнобедренный треугольник.",
        "Решение: Рассмотрим правильный пятиугольник, вписанный в данную окружность. Из его пяти вершин хотя бы три окрашены в один цвет. Они и являются вершинами   равнобедренного треугольника с вершинами одного цвета."
    ],
    "58097": [
        "Принцип Дирихле (углы и длины)",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Внутри квадрата со стороной 1 расположено несколько окружностей, сумма длин которых равна 10.   Докажите, что найдётся прямая, пересекающая по крайней  мере четыре из этих окружностей.",
        "Решение: Спроектируем все данные окружности на сторону AB квадрата ABCD. Проекцией окружности длины l является отрезок длины l/π. Поэтому сумма длин проекций всех данных окружностей  равна 10/π > 3. Значит, на отрезке AB есть точка, принадлежащая проекциям по крайней мере четырёх окружностей. Перпендикуляр к AB, проведённый через эту точку, пересекает по крайней мере четыре окружности."
    ],
    "60844": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что число рационально тогда и только тогда, когда оно представляется  конечной или периодической десятичной дробью."
    ],
    "64836": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Трое играют в настольный теннис на вылет, то есть игрок, проигравший партию, уступает место игроку, не участвовавшему в ней. В итоге Никанор сыграл 10 партий, Филимон – 15, а Агафон – 17. Кто из них проиграл во второй партии?",
        "Решение: Всего была сыграна (10 + 15 + 17) : 2 = 21 партия. Заметим, что никто не мог пропускать две партии подряд. Значит, Никанор играл все партии с чётным номером и только их. Так как он не играл в третьей партии, то вторую партию он проиграл.",
        "Ответ: Никанор."
    ],
    "64957": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Каждый день, с понедельника по пятницу, ходил старик к синему морю и закидывал в море невод. При этом каждый день в невод попадалось не больше рыбы, чем в предыдущий. Всего за пять дней старик поймал ровно 100 рыбок. Какое наименьшее суммарное количество рыбок он мог поймать за три  дня – понедельник, среду и пятницу?",
        "Решение: Оценка. Во вторник и в четверг старик поймал рыбок не больше, чем в понедельник и в среду, значит, за указанные три дня он поймал не меньше половины от 100, то есть не меньше 50 рыбок.     Пример. Если в каждый из первых четырёх дней старик ловил по 25 рыбок, а в пятницу не поймал ничего, то условия задачи выполнены, и за указанные три дня поймано ровно 50 рыбок.",
        "Ответ: 50 рыбок."
    ],
    "65054": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: По кругу выписаны числа 1, 2, 3, ..., 10 в некотором порядке. Петя вычислил 10 сумм всех троек соседних чисел и написал на доске наименьшее из вычисленных чисел. Какое наибольшее число могло быть написано на доске?",
        "Решение: Оценка. Выделим число 10, а оставшиеся 9 чисел разобьём на три тройки соседних чисел. Сумма чисел в этих трёх тройках равна   1 + 2 + 3 + ... + 9 = 45, поэтому хотя бы в одной из рассматриваемых троек сумма чисел не больше чем 45 : 3 = 15.    Пример расстановки чисел, при котором число, выписанное Петей, равно 15, таков: 1, 5, 9, 2, 7, 6, 8, 3, 4, 10.",
        "Ответ: 15."
    ],
    "88214": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Вклассе учатся 38человек. Докажите, что среди них найдутся четверо, родившихся водин месяц.",
        "Подсказка: Вспомните задачу145.",
        "Решение: Еслибы вкаждом месяце родилось неболее трех учеников этого класса, товклассе немоглобы учиться больше, чем",
        "Ответ: Еслибы вкаждом месяце родилось неболее 3х учеников этого класса, товклассе немоглобы учиться больше, чем"
    ],
    "65658": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: В некотором классе при любой раздаче 200 конфет найдутся хотя бы двое школьников, получившие одинаковое количество конфет (возможно, и ни одной). Каково наименьшее количество учеников в таком классе?",
        "Решение: Пусть в классе не более 20 человек, тогда ничего не дадим первому ученику, дадим одну конфету второму ученику, две конфеты – третьему, и так далее. В этом случае, будет роздано не больше чем 0 + 1 + 2 + ... + 19 = 190 конфет. Оставшиеся конфеты отдадим ученику, у которого больше всего конфет. Тем самым, указан способ раздать конфеты так, чтобы не нашлось двух учеников с одинаковым количеством конфет. Следовательно, в классе должно быть больше 20 учеников.     Если в классе 21 ученик, то наименьшее количество конфет, необходимое для того, чтобы все ученики получили разное количество, равно   0 + 1 + 2 + ... + 20 = 210. Так как всего раздаётся 200 конфет, то в этом случае условие выполняется.",
        "Ответ: 21 ученик."
    ],
    "66292": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В театральной труппе 60 актеров. Каждые два хотя бы раз играли в одном и том же спектакле. В каждом спектакле занято не более 30 актеров.   Какое наименьшее количество спектаклей мог поставить театр?",
        "Решение: Пример. Разобьём труппу на четыре группы по 15 человек и проведём 6 спектаклей, в каждом из которых задействованы какие-то две группы. Количество способов выбрать две группы из четырёх равно 4·3 : 2 = 6.     Оценка. В сумме актеры сыграли не более чем 30·5 = 150 ролей, значит, если спектаклей пять, то найдётся актер, сыгравший не более двух ролей. Тогда он сыграл в одном спектакле не более чем с 29·2 = 58 коллегами из остальных 59. Следовательно, для выполнения условия пяти спектаклей недостаточно.",
        "Ответ: 6 спектаклей."
    ],
    "78206": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В составлении 40 задач приняло участие 30 студентов со всех пяти курсов. Каждые два однокурсника придумали одинаковое число задач. Каждые два студента с  разных курсов придумали разное число задач. Сколько человек придумало ровно по одной задаче?",
        "Решение: Выберем пять студентов, по одному с каждого курса. Так как количество придуманных ими задач различно, то этими студентами придумано не менее чем 1 + 2 + 3 + 4 + 5 = 15 задач. Тогда остальные 25 студентов придумали не более чем 40 – 15 = 25 задач. То есть каждый из них придумал ровно по одной задаче, и среди выбранных студентов один придумал одну задачу, следовательно, всего по одной задаче придумали 26 человек.     Такое действительно возможно. Например, каждый студент придумал столько задач, каков номер его курса, причём с первого курса принимало участие 26 студентов, а с остальных – по одному студенту.",
        "Ответ: 26 студентов."
    ],
    "78592": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Какое максимальное число дамок можно поставить на чёрных полях шахматной доски  размером 8×8 так, чтобы каждую дамку била хотя бы одна из остальных?",
        "Решение: Рассмотрим некоторую расстановку дамок, удовлетворяющую условию. Дамку,  стоящую на краю доски, не может бить никакая другая дамка, а значит, все дамки  стоят во внутреннем квадрате 6×6. Заметим, что ни в одном из квадратов 3×3 не может быть больше четырёх дамок. Действительно, если в одном из них пять дамок,то центральная его клетка – черная, и дамки стоят на всех чёрных полях этого квадрата. Но тогда дамку, стоящую в центре квадрата, не бьёт ни одна дамка. Следовательно, в квадрате 6×6 может стоять не более 4·4 = 16 дамок.    Пример расстановки шестнадцати дамок приведён на рисунке.",
        "Ответ: 16 дамок."
    ],
    "86522": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите, что среди чисел вида 19991999...19990...0 найдётся  хотя бы одно, которое делится на 2001.",
        "Решение: См. задачу 79651 а)."
    ],
    "89951": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 2",
        "Классы: 5,6,7,8",
        "Условие: Запах от цветущего кустика ландышей распространяется в радиусе 20 м вокруг него. Сколько цветущих кустиков ландышей необходимо посадить вдоль прямолинейной 400-метровой аллеи, чтобы в каждой ее точке пахло ландышем?",
        "Подсказка: Заметьте, чтобы выполнялись условия задачи, расстояние между соседними ландышами должно быть не больше 40 м.",
        "Решение: Давайте мысленно перенесем крайние левые 20 м аллеи на правый край. Тогда у нас получатся отрезки аллеи по 40 м, а справа от каждого отрезка будет расти ландыш. Таким образом, ландышей должно быть столько же, сколько внутри аллеи поместится отрезков по 40 м. Поскольку таких отрезков разместится 10, то и ландышей надо посадить 10 кустов."
    ],
    "32783": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: За круглым столом сидят 33 представителя четырех племен: люди, гномы, эльфы и гоблины. Известно, что люди не сидят рядом с гоблинами, а эльфы не сидят рядом с гномами. Докажите, что какие-то два представителя одного и того же племени сидят рядом.",
        "Решение: 1) Посмотрим, кого за столом больше: людей с гоблинами или эльфов с гномами. Без ограничения общности можно считать, что людей с гоблинами больше; тогда их по крайней мере 17, так как всего за столом сидят 33 существа."
    ],
    "21985": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: В бригаде 7 человек и их суммарный возраст - 332  года.  Докажите, что из них можно выбрать трех человек, сумма  возрастов которых не меньше 142 лет.",
        "Решение: Рассмотрим всевозможные тройки рабочих бригады. Сумма их возрастов, как легко подсчитать, равна 15·332, а всего таких троек 35. Значит, есть тройка, суммарный возраст в которой не меньше, чем 15·332/35, что больше 142."
    ],
    "103960": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Доказать, что если 21 человек собрали 200 орехов, то есть два человека, собравшие поровну орехов.",
        "Решение: Если у всех разное число орехов, то всего было бы собрано не меньше 0+1+2+3+...+20=210 орехов, что противоречит условию задачи."
    ],
    "32124": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: В булке за 10 копеек оказался запечен изюм двух сортов.   Докажите, что внутри булки найдутся две такие точки, удаленные на   расстояние 1 см, что они либо не принадлежат никаким из изюмин,   либо принадлежат изюминам одного сорта.",
        "Решение: Рассмотрим правильный тетраэдр с ребром 1 см,  \t\t\t\tрасположенный целиком внутри булки. Для каждой из его вершин  \t\t\t\tсуществует одна из трех возможностей — либо находиться внутри  \t\t\t\tизюмины одного из двух сортов, либо не принадлежать никакой  \t\t\t\tизюмине. Поскольку всего вершин четыре, а возможностей — три, то  \t\t\t\tдля каких-то двух вершин выполнена одна и та же возможность. Эти две вершины и будут искомыми точками."
    ],
    "78508": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Доказать, что из одиннадцати произвольных бесконечных десятичных дробей можно выбрать две дроби, разность которых имеет в десятичной записи либо бесконечное число нулей, либо бесконечное число девяток.",
        "Решение: Попринципу Дирихле, для каждого знака после запятой найдётся пара дробей, укоторых наэтом месте стоят одинаковые цифры. Отметим такую пару последовательностей для каждого знака. Так как всего возможных пар конечное число, какая-нибудь пара встретится бесконечно много раз, т.е. найдётся пара дробей, десятичные записи которых совпадают вбесконечном числе знаков. Докажем, что эта пара дробей является искомой. Рассмотрим разность этих дробей. Если внекотором разряде десятичные записи дробей совпадают, тоуразности вэтом разряде находится либо нуль (если при вычитании `` встолбик'' изэтого разряда незанимали), либо девятка (если занимали). Следовательно, вдесятичной записи разности либо бесконечное число нулей, либо бесконечное число девяток."
    ],
    "78529": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Собрались 2",
        "Решение: Если все присутствующие знакомы друг с другом, то возможность рассадить таким  образом 4-х человек сомнения не вызывает. Пусть теперь"
    ],
    "78629": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Можно ли расставить на окружности числа",
        "Решение: Заметим, что числа"
    ],
    "78661": [
        "Принцип Дирихле (углы и длины)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: В коридоре длиной 100 метров постелено 20 ковровых дорожек общей длины 1000 метров. Каково может быть наибольшее число незастеленных кусков (ширина дорожки равна ширине коридора)?",
        "Решение: Сначала приведём пример: возьмём одиннадцать дорожек по90.5 метров  иостальные девять дорожек по0.5 метра. Расположение дорожек показано  нарисунке (все дорожки длины90.5 метров лежат наодном итомже месте).",
        "Ответ: 11 кусков."
    ],
    "79505": [
        "Принцип Дирихле",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: В марте 1987 года учитель решил провести 11 занятий математического кружка. Доказать, что если по субботам и воскресеньям кружок не проводить, то в марте найдутся три дня подряд, в течение которых не будет ни одного занятия кружка.",
        "Решение: Предположим, можно провести в марте ровно 11 занятий кружка так, чтобы по субботам и воскресеньям занятий кружка не проводилось и в любые три подряд идущих дня проводилось хотя бы одно занятие кружка.  Тогда перед субботой и воскресеньем и после субботы и воскресенья обязательно проводить кружок. Следовательно, 6-го, 9-го, 13-го, 16-го, 20-го, 23-го, 27-го и 30-го занятия кружка проводились. Кроме того, со вторника по четверг необходимо провести хотя бы одно занятие кружка. Следовательно, необходимо провести ещё не менее четырёх занятий кружка. Итого уже 12 занятий. Полученное противоречие доказывает, что найдутся три дня подряд, в течение которых не будет ни одного занятия кружка."
    ],
    "107702": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Поверхность кубика Рубика 3 x 3 x 3 состоит из 54 клеток. Какое наибольшее количество клеток можно отметить так, чтобы отмеченные клетки не имели общих вершин?",
        "Решение: На рис. 1 показано, как отметить 7 клеток на трёх смежных гранях куба. На трёх невидимых гранях нужно отметить семь клеток, симметричных этим.",
        "Ответ: 14 клеток."
    ],
    "34905": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Каждая из 9 прямых разбивает квадрат на два четырхугольника,   площади которых относятся как 2:3.   Докажите, что по крайней мере три из этих девяти прямых   проходят через одну точку.",
        "Подсказка: Имеются 4 фиксированные точки внутри квадрата, такие что   каждая прямая, делящая площадь квадрата в отношении 2:3, проходит   через одну из них.",
        "Решение: Каждая из 9 прямых разбивает квадрат на две трапеции,   основания которых лежат на сторонах квадрата и высоты равны   стороне квадрата.   Ясно, что прямая делит среднюю линию квадрата в отношении 2:3,   поскольку отношение площадей этих трапеций равно отношению   их средних линий. На каждой из двух средних линий имеется   2 точки,   делящие ее в отношении 2:3.   В результате мы получаем, что каждая из девяти данных   прямых проходит через одну из 4 указанных точек.   По   принципу Дирихле   через одну из этих   точек пройдет не менее трех прямых."
    ],
    "79322": [
        "Принцип Дирихле (площадь и объем)",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На сферическом Солнце обнаружено конечное число круглых пятен, каждое из которых занимает меньше половины поверхности Солнца. Эти пятна предполагаются замкнутыми (т.е. граница пятна принадлежит ему) и не пересекаются между собой. Доказать, что на Солнце найдутся две диаметрально противоположные точки, не покрытые пятнами.",
        "Решение: Рассмотрим пятно самого большого радиуса. Слегка увеличим радиус содержащего его круга так, чтобы он снова был меньше радиуса Солнца и этот круг не пересекался с остальными пятнами. Отразим границу круга относительно центра Солнца. Полученная окружность не может быть полностью покрыта одним пятном, потому что радиус окружности больше радиуса любого пятна. Но она не может быть полностью покрыта и несколькими пятнами, потому что пятна замкнутые и не пересекаются между собой. Любая непокрытая точка окружности и диаметрально противоположная ей точка не покрыты пятнами."
    ],
    "21974": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: В магазин привезли 25 ящиков с тремя разными сортами  яблок (в каждом ящике яблоки только одного сорта).  Докажите,  что среди них есть по крайней мере 9 ящиков с яблоками одного и  того же сорта.",
        "Решение: 25 ящиков - кроликов рассадим по 3 клеткам-сортам.  Так как 25=3·8+1, то применим обобщенный принцип Дирихле для"
    ],
    "32110": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Первоклассник Петя знает только цифру 1. Докажите, что он может написать число, делящееся на 1989.",
        "Решение: См. задачу 34968."
    ],
    "32828": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4",
        "Классы: 7,8,9,10",
        "Условие: Теннисист для тренировки играет каждый день хотя бы одну партию; при этом, чтобы не перетрудиться, он играет не более 12 партий в неделю.   Докажите, что можно найти несколько таких подряд идущих дней, в течение которых теннисист сыграл ровно двадцать партий.",
        "Решение: Рассмотрим десять подряд идущих недель. Пусть за первые k дней (из этих 70) теннисист сыграл bk партий. Рассмотрим числа  b0 = 0, b1, ..., b70,  b0 + 20,..., b70 + 20. Всего 142 числа, каждое из которых не превосходит 10·12 + 20 = 140. Поэтому среди них есть два равных.     Пусть bi + 20 = bj (среди чисел bk, очевидно, нет равных), то есть bj – bi = 20. Это значит, что за дни с (i+1)-го по j-й теннисист сыграл ровно 20 партий."
    ],
    "35190": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: В банде 50 бандитов.  Все вместе они ни в одной разборке ни   разу  не участвовали, а каждые двое  встречались на разборках   ровно по разу.  Докажите, что один из бандитов был   не менее, чем на восьми разборках.",
        "Подсказка: Покажите, что в одной из разборок Р участвовало не менее восьми   бандитов; с каждым из них бандит, не участвовавший в   разборке Р, должен встретиться на разных разборках.",
        "Решение: Допустим  противное. Выберем бандита А. Он участвовал не   более, чем в 7 разборках, причем    каждый из оставшихся бандитов присутствовал   ровно на одной из этих разборок.   Всего бандитов (без бандита А) 49, поэтому хотя  бы  в   одной из разборок (обозначим ее через Р) участвовало не меньше 7   бандитов, всего же на этой разборке (вместе с А) участвовало не   меньше 8 бандитов. Возьмем бандита Б, не участвовавшего в   разборке Р. Он искомый, так как он участвовал в разборках со всеми   бандитами разборки Р, причем все эти разборки различны.  Действительно,   пусть Х и У - бандиты, участвовавшие в разборке Р, а   С  - разборка, в которой участвовали Б, Х и У.    Тогда Х и У участвовали в двух разборках Р и С,    что противоречит условию задачи."
    ],
    "35615": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Первоклассник Петя знает только цифру 1. Докажите, что он может записать число, которое делится на 2001.",
        "Решение: См. задачу 34968."
    ],
    "60354": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Имеется 2k + 1 карточек, занумерованных числами от 1 до 2k + 1. Какое наибольшее число карточек можно выбрать так, чтобы ни один из извлечённых номеров не был равен сумме двух других извлечённых номеров?",
        "Решение: Если взять все карточки с нечётными номерами (их k + 1), то условие будет выполнено. Если взять k + 2 карточки, то, вычитая из наибольшего их номера N все остальные, мы получим k + 1 различное число. Все эти числа не превышают 2k, поэтому хотя бы два из них совпадут с номерами на   k + 2 выбранных карточках. По крайней мере один из этих двух номеров не равен N/2.",
        "Ответ: k + 1 карточку."
    ],
    "60366": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Докажите, что из 11 различных бесконечных десятичных дробей можно выбрать две такие, которые совпадают в бесконечном числе разрядов.",
        "Подсказка: Для каждого разряда найдутся две дроби, совпадающие в этом разряде.",
        "Решение: Выпишем 11 дробей друг под другом, чтобы цифры из одного разряда оказались в одном столбце. В каждом столбце 11 цифр, поэтому среди этих 11 цифр найдутся две равные. Пусть эти равные цифры находятся в k-й и m-й дробях. Поставим в соответствие этому столбцу пару чисел (k, m). Таким образом, каждому столбцу соответствует пара чисел от 1 до 11. Поскольку число пар таких чисел конечно, а число столбцов бесконечно, хотя бы одна из пар (k0, m0) была поставлена в соответствие бесконечному числу столбцов. Это означает, что дроби с номерами k0, m0 совпадают в бесконечном числе разрядов."
    ],
    "77894": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Если имеется 100 любых целых чисел, то среди них всегда можно взять несколько (или может быть одно) так, что в сумме они дадут число, делящееся на 100. Доказать.",
        "Решение: См. задачу 103964."
    ],
    "79285": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Сумма 100 натуральных чисел, каждое из которых не больше 100, равна 200.   Доказать, что из них можно выбрать несколько чисел, сумма которых равна 100.",
        "Решение: Заметим, что среди наших чисел по крайней мере два больше 1 (если 99 чисел равны 1, то последнее равно 101, что противоречит условию). Поэтому можно разбить числа на две группы по 50 чисел так, что сумма чисел в каждой группе больше 50.     Согласно задаче 103964 из каждой группы можно выбрать несколько чисел с суммой, кратной 50. Ни одна из этих сумм не может равняться 200 или 150. Поэтому одна из этих сумм равна 100 или обе равны 50, то есть нужный набор чисел найден."
    ],
    "79292": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Шарообразная планета окружена 37-ю точечными астероидами. Доказать, что в любой момент на поверхности планеты найдётся точка, из которой астроном не сможет наблюдать более 17 астероидов.",
        "Решение: Проведём через центр планеты и произвольную пару астероидов плоскость П  (будем считать её экваториальной). Проведём ось планеты, перпендикулярную  плоскости П. Она пересекает поверхность планеты в полюсах"
    ],
    "103988": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Найдётся ли среди чисел вида 1...1 число, которое делится на 57?",
        "Решение: См. задачу 34968.",
        "Ответ: Найдётся."
    ],
    "32784": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: Какое самое большое число ладей можно поставить на шахматную доску 8 на 8 так, чтобы они не били друг друга?",
        "Решение: Очевидно, 8 ладей поставить можно: например, по диагонали из a1 в h8. Докажем, что 9 ладей, не бьющих друг друга, поставить нельзя."
    ],
    "115467": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 4",
        "Классы: 7,8,9,10",
        "Условие: На дне рождения у Васи было 10 ребят (включая Васю). Оказалось, что у каждых двух из этих ребят есть общий дедушка.   Докажите, что у семи из них есть общий дедушка.",
        "Решение: Рассмотрим граф, где вершины соответствуют дедам, а рёбра – общим внукам. Если вершин не более двух, то у каждого деда десять внуков.     Предположим, что вершин ровно три. Они соединены 10 рёбрами. По принципу Дирихле какие-то две вершины соединены не более чем тремя рёбрами. Тогда из третьей вершины выходит не менее семи рёбер. Следовательно, у деда, соответствующего этой вершине, семь внуков.     Предположим, что на вершин более трёх. По условию из каждой вершины выходит хотя бы одно ребро и каждые два ребра имеют общую вершину. Рассмотрим вершину A, из которой выходит хотя бы два ребра AB и AC, и произвольную из оставшихся вершин D. Тогда каждое рёбро из D должно вести в A (иначе найдутся два ребра без общей вершины). Значит, рёбер, соединяющих B с C, нет, и все рёбра выходят из A.     Дед, соответствующий вершине A, будет общим для всех 10 ребят."
    ],
    "78768": [
        "Принцип Дирихле (углы и длины)",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Известно, что в кадр фотоаппарата, расположенного в точке",
        "Решение: Предположим, что на каждом снимке сфотографированы все остальные фотоаппараты  (за исключением того, которым сделан снимок). Тогда точки, в которых  расположены фотоаппараты, являются вершинами выпуклого 1000-угольника,  поскольку иначе найдётся фотоаппарат, из которого видны не все остальные.  Сумма всех углов 1000-угольника равна"
    ],
    "115454": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: В течение",
        "Решение: Рассмотрим"
    ],
    "22001": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: 11 пионеров занимаются в пяти кружках дома культуры.   Докажите, что найдутся два пионера А и В такие, что все кружки,   которые посещает А, посещает и В.",
        "Решение: Занумеруем кружки числами от 1 до 5 и вместо каждого пионера будем рассматривать тот набор кружков - подмножество множества {1, 2, 3, 4, 5} - который состоит из посещаемых им кружков. Осталось разбить 32 подмножества указанного множества на 10 наборов так, чтобы в каждом из наборов из любых двух множеств этого набора одно содержалось в другом. В качестве таких наборов рассмотрим следующие: [∅, {1}, {1,2}, {1,2,3}, {1,2,3,4}, {1,2,3,4,5}], [{2}, {2,5}, {1,2,5}, {1,2,3,5}], [{3}, {1,3}, {1,3,4}, {1,3,4,5}], [{4}, {1,4}, {1,2,4}, {1,2,4,5}], [{5}, {1,5}, {1,3,5}], [{2,4}, {2,4,5}, {2,3,4,5}], [{3,4}, {3,4,5}], [{3,5}, {2,3,5}], [{4,5}, {1,4,5}], [{2,3}, {2,3,4}]."
    ],
    "35181": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: За круглым столом совещались 2n депутатов. После перерыва эти же 2n депутатов расселись вокруг стола, но уже в другом порядке.  Доказать, что найдутся два депутата, между которыми как до, так и после перерыва сидело одинаковое число человек.",
        "Подсказка: Каждому депутату сопоставьте количество мест, на которые он сдвинулся по часовой стрелке после перерыва.  Если условие задачи не выполняется, то все эти числа должны быть различны.",
        "Решение: Занумеруем депутатов числами 1, 2, ..., 2n в том порядке (по часовой стрелке), в котором они сидели до перерыва; таким же образом пронумеруем места за столом. Обозначим через ai количество мест, на которое сдвинулся i-й депутат по часовой стрелке после перерыва. Таким образом, каждое из чисел a1, a2, ..., a2n принимает некоторое значение из множества {0, 1, ..., 2n – 1}.    Если некоторые два депутата сдвинулись после перерыва на одинаковое число мест, то между ними как до, так и после перерыва сидело одинаковое число человек, то есть утверждение задачи выполнено.     В противном случае числа a1, a2, ...,  a2n образуют перестановку чисел 0, 1, ..., 2n – 1. Число i + ai сравнимо по модулю 2n с номером места, на которое сел после перерыва i-й депутат. Поскольку после перерыва каждое из 2n мест снова занято одним из депутатов, сумма (1 + a1) + (2 + a2) + ... + (2n + a2n) сравнима по модулю 2n с суммой номеров всех мест 1 + 2 + ... + 2n. Отсюда следует, что сумма a1 + a2 + ... + a2n делится на 2n. Однако  a1 + a2 + ... + a2n = 0 + 1 + 2 + ... + (2n – 1) = n(2n – 1), что не делится на 2n. Противоречие."
    ],
    "35415": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: На доске написано 10 натуральных чисел. Докажите, что из этих чисел можно выбрать несколько чисел и расставить между ними знаки + и – так, чтобы полученная в результате алгебраическая сумма делилась на 1001.",
        "Подсказка: Рассмотрите вначале только суммы со знаками +. Затем покажите, что из одной из этих сумм можно вычесть другую так, чтобы результат делился на 1001.",
        "Решение: Рассмотрим всевозможные суммы нескольких из выписанных чисел. Количество таких сумм будет равно 210 = 1024 (мы учитываем пустую сумму). Согласно принципу Дирихле некоторые две из этих сумм S1 и S2 дают одинаковый остаток при делении на 1001. Разность этих сумм S1 – S2 делится на 1001 и представляет собой сумму нескольких данных чисел со знаками + или –."
    ],
    "35483": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Докажите, что существуют числа, не менее чем 100 способами представимые в виде  суммы 2001 слагаемого, каждое из которых является 2000-й степенью целого числа.",
        "Подсказка: Рассмотрите всевозможные суммы из 2001 2000-х степеней первых",
        "Решение: Рассмотрим числа 1, 2, 3, ...,"
    ],
    "58082": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Впрямоугольнике 3×4 расположено6 точек. Докажите, что среди них найдутся две точки, расстояние между которыми не превосходит",
        "Решение: Разрежем прямоугольник на пять фигур, как показано на рис. Водну из них попадут по крайней мере две точки, арасстояние между любыми двумя точками каждой из этих фигур не превосходит"
    ],
    "21972": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Дано 12 целых чисел. Докажите, что из них можно выбрать два, разность которых делится на 11.",
        "Подсказка: Найдутся хотя бы два числа с одинаковыми остатками."
    ],
    "58089": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 4",
        "Классы: 7,8,9,10",
        "Условие: Какое наименьшее число точек достаточно отметить внутри выпуклого",
        "Решение: Так как диагонали, выходящие из одной вершины, делят"
    ],
    "58101": [
        "Принцип Дирихле (площадь и объем)",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Вквадрате со стороной15 расположено20 попарно непересекающихся квадратиков со стороной1. Докажите, что вбольшом квадрате можно разместить круг радиуса1 так, чтобы он не пересекался ни содним из квадратиков.",
        "Решение: Рассмотрим фигуру, состоящую из всех точек, удаленных  от квадратика со стороной1 на расстояние не больше1 (рис.).  Ясно, что круг радиуса1, центр которого расположен вне этой  фигуры, не пересекается сквадратиком. Площадь такой фигуры  равна"
    ],
    "78234": [
        "Принцип Дирихле",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Число",
        "Решение: Заметим, что 2"
    ],
    "79358": [
        "Принцип Дирихле (площадь и объем)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: У белой сферы 12% её площади окрашено в красный цвет. Доказать, что в сферу можно вписать параллелепипед, у которого все вершины белые.",
        "Решение: Проведём через центр сферы три взаимно перпендикулярные плоскости и для каждой точки сферы рассмотрим её образы при симметриях относительно этих плоскостей и при композициях этих симметрий. Каждая точка, не лежащая на этих плоскостях, имеет ровно 8 образов. Следовательно, красные точки и их образы занимают не более"
    ],
    "109441": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Даны таблица 100×100 клеток и N фишек. Рассматриваются все такие расстановки фишек в клетки таблицы, что никакие две фишки не стоят в соседних клетках. При каком наибольшем N в каждой из этих расстановок можно найти хотя бы одну фишку, от перемещения которой в соседнюю клетку заданное условие не нарушится? (Соседними считаются клетки, имеющие общую сторону.)",
        "Решение: Назовём расстановку фишек жёсткой, если перемещение любой фишки в соседнюю клетку нарушает требуемое условие. Жёсткая расстановка из ста фишек существует: поставим все фишки на клетки большой диагонали.     То, что любая расстановка 99 (или менее) фишек нежёсткая, фактически доказано в задаче 35395.",
        "Ответ: При N = 99."
    ],
    "21977": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Докажите, что в любой компании из пяти человек есть двое, имеющие одинаковое число знакомых в этой компании.",
        "Решение: См. задачу 35512."
    ],
    "116301": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В квадрате со стороной, равной 1, произвольно берут 101 точку (не обязательно внутри квадрата, возможно, часть на сторонах), причём никакие три из них не лежат на одной прямой. Докажите, что существует треугольник с вершинами в этих точках, площадь которого не больше 0,01.",
        "Решение: Воспользуемся следующим утверждением. Если вершины треугольника  лежат внутри прямоугольника или на его сторонах, то площадь треугольника не превосходит половины площади прямоугольника."
    ],
    "116873": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Даны n + 1 попарно различных натуральных чисел, меньших 2n (n > 1).   Докажите, что среди них найдутся три таких числа, что сумма двух из них равна третьему.",
        "Решение: Воспользуемся методом математической индукции.    База. При n = 2 выбранными оказываются числа 1, 2, 3. При этом 1 + 2 = 3.    Шаг индукции. Пусть есть n + 2 натуральных числа, меньших 2n + 2. Возможны два случая.    1) Среди выбранных чисел нет числа 2n + 1. Тогда из чисел, меньших 2n, выбрали по крайней мере n + 1 число. По предположению индукции, найдутся три числа, сумма которых равна третьему.    2) Среди выбранных чисел есть число 2n + 1. Разобьём числа 1, 2, ..., 2n на n пар, в сумме дающих 2n + 1: {1, 2n}, {2, 2n – 1}, ..., {n, n + 1}. Поскольку в набор входит ещё n + 1 число, то какая-то из пар входит в набор целиком. Числа этой пары и число 2n + 1 образуют искомую тройку."
    ],
    "58094": [
        "Принцип Дирихле (углы и длины)",
        "Сложность: 4+",
        "Классы: 8,9,10",
        "Условие: Вокружности радиуса1 проведено несколько хорд. Докажите, что если каждый диаметр пересекает не более",
        "Решение: Предположим, что сумма длин хорд не меньше"
    ],
    "78043": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4+",
        "Классы: 8,9,10",
        "Условие: Трёхчлен ax² + bx + c при всех целых x является точной четвёртой степенью. Доказать, что тогда a = b = 0.",
        "Решение: Ясно, что a ≥ 0 и c ≥ 0. Рассмотрим значения x, равные 1, 2, ..., n. Если хотя бы одно из чисел a и b отлично от нуля, то трёхчлен ax² + bx + c при таких x принимает по крайней мере n/2 различных значений. Эти значения заключены между 0 и an² + |b|n + c. Но количество различных точных четвёртых степеней, заключённых в этих пределах, не превосходит  + 1. Поэтому  + 1 ≥ n/2, то есть an² + |b|n + c ≥ (n/2 – 1)4. При больших n такое неравенство выполняться не может, поскольку n4/16 будет гораздо больше чем an²."
    ],
    "79488": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4+",
        "Классы: 8,9,10",
        "Условие: Произведение некоторых 1986 натуральных чисел имеет ровно 1985 различных простых делителей.   Доказать, что либо одно из этих чисел, либо произведение нескольких из них является квадратом натурального числа.",
        "Решение: Рассмотрим наборы исходных чисел, взятых во всех возможных количествах: по  одному, по два, по три и т. д.  Таких наборов 21986 − 1. Числа в каждом таком наборе перемножим и полученное произведение представим в виде произведения наибольшего полного квадрата и нескольких простых сомножителей (например, 216·315·513·179 = (28·37·56174)²·3·5·17, а 216·1310 = (28·135)²). Сопоставим каждому набору исходных чисел тот набор простых чисел, который получается после выделения наибольшего точного квадрата из их произведения (в рассмотренных примерах первому числу сопоставляется набор 3, 5, 17, а второму – пустой набор). Число различных наборов из 1985 простых делителей (включая и пустой набор) равно 21985, что меньше количества 21986 − 1 наборов из исходных чисел. Поэтому каким-то двум наборам A и В из исходных чисел отвечает один и тот же набор p1, ..., pk простых делителей, то есть A = a²p1p2...pk, B = b²p1...pk. Следовательно, произведение AВ есть точный квадрат. С другой стороны, AВ равно произведению чисел в наборе A и чисел в наборе В. Выбросив из наборов A и В их общую часть (произведение выбрасываемых чисел есть точный квадрат), получим, что произведение остальных чисел является точным квадратом."
    ],
    "58085": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 4+",
        "Классы: 8,9,10",
        "Условие: Вквадрате со стороной1 находится51 точка. Докажите, что какие-то три из них можно накрыть кругом радиуса 1/7.",
        "Решение: Разрежем данный квадрат на25 одинаковых квадратиков со стороной 0, 2. Водин из них попадает не меньше трех точек. Радиус описанной окружности квадрата со стороной 0, 2 равен"
    ],
    "78270": [
        "Принцип Дирихле (площадь и объем)",
        "Сложность: 4+",
        "Классы: 8,9,10",
        "Условие: В прямоугольник со сторонами 20 и 25 бросают 120 квадратов со стороной  1. Доказать, что в прямоугольник можно поместить круг диаметра 1, не  пересекающийся ни с одним из квадратов.",
        "Решение: Окружим каждый квадрат со стороной 1 пограничной полосой ширины"
    ],
    "21986": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Докажите, что среди степеней двойки есть две, разность которых делится на 1987.",
        "Подсказка: Рассмотрите 1988 степеней и их остатки по модулю 1987."
    ],
    "79498": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4+",
        "Классы: 8,9,10",
        "Условие: Произведение некоторых 48 натуральных чисел имеет ровно 10 различных простых  делителей.  Докажите, что произведение некоторых четырёх из этих чисел является  квадратом натурального числа.",
        "Решение: Представим произведение произвольной пары чисел (a, b) из данного набора в виде произведения квадрата натурального числа на произведение простых делителей в первых степенях (например, если a = 213·34·19³,  b = 56·77·19, то ab = K²·2·7, где K = 26·3²·5³·7³·19²). Сопоставим паре (a, b)   получившийся набор простых делителей. Всевозможных различных пар (a, b) в наборе из 48 чисел    а количество наборов из 10 простых делителей (включая пустой набор) 210 = 1024. Так как 1128 > 1024, то найдутся две различные пары (a, b) и (c, d) из набора, которым отвечает один и тот же набор (p1, p2,..., pk) простых делителей (0 ≤ k ≤ 10). Следовательно, abcd – точный квадрат.       Если при этом пары (a, b) и (c, d) не имеют общего элемента, то числа a, b, c, d – искомые. Если же общий элемент есть, например b = d, то тогда ac – точный квадрат. Выкинем на время числа a и c из рассмотрения. Тогда мы приходим к набору из 46 чисел, произведение которых имеет не более 10 различных простых делителей. Проведя те же рассуждения, что и выше, и учитывая, что    приходим к выводу о существовании двух различных пар чисел (x, y) и (z, t) из набора, для которых xyzt – точный квадрат. Если общего элемента у этих пар нет, то x, y, z, t – искомые четыре числа; если же общий элемент есть, например x = t, то yz – точный квадрат. В этом случае искомой четвёркой чисел является (a, c, y, z)."
    ],
    "78233": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 5",
        "Классы: 8,9,10",
        "Условие: В квадрате со стороной 100 расположено",
        "Решение: Рассмотрим фигуру Ф, состоящую из множества точек, удалённых от отрезка  длины 10 не более чем на 1. Разобьём весь квадрат"
    ],
    "78570": [
        "Принцип Дирихле (углы и длины)",
        "Сложность: 5",
        "Классы: 8,9,10",
        "Условие: Два неравных картонных диска разделены на 1965 равных секторов. На каждом из дисков произвольно выбраны 200 секторов и раскрашены в красный цвет. Меньший диск наложен на больший, так что их центры совпадают, а секторы целиком лежат один против другого. Меньший диск поворачивают на всевозможные углы, кратные",
        "Решение: Возьмём1965 дисков, раскрашенных так же, как второй из наших дисков, и положим их на первый диск так, чтобы они занимали все возможные положения. Тогда над каждым окрашенным сектором первого диска расположено200 окрашенных секторов, т.е. всего имеется 200"
    ],
    "58087": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 5",
        "Классы: 8,9,10",
        "Условие: Каждая из девяти прямых разбивает квадрат на два четырехугольника, площади которых относятся как 2 : 3. Докажите, что по крайней мере три из этих девяти прямых проходят через одну точку.",
        "Решение: Данные прямые не могут пересекать соседние стороны квадрата"
    ],
    "58088": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 5",
        "Классы: 7,8,9",
        "Условие: Впарке растет10000 деревьев, посаженных квадратно-гнездовым способом (100рядов по100 деревьев). Какое наибольшее число деревьев можно срубить, чтобы выполнялось следующее условие: если встать на любой пень, то не будет видно ни одного другого пня? (Деревья можно считать достаточно тонкими.)",
        "Решение: Разобьем деревья на2500 четверок, как показано на рис.  Вкаждой такой четверке нельзя срубить более одного дерева.  Сдругой стороны, можно срубить все деревья, растущие влевых  верхних углах квадратов, образованных нашими четверками деревьев.  Поэтому наибольшее число деревьев, которые можно срубить,  равно2500."
    ],
    "58090": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 5",
        "Классы: 8,9,10",
        "Условие: Внутри выпуклого 2",
        "Решение: Возможны два случая:"
    ],
    "58096": [
        "Принцип Дирихле (углы и длины)",
        "Сложность: 5",
        "Классы: 8,9,10",
        "Условие: Внутри окружности радиуса",
        "Решение: Пусть"
    ],
    "58098": [
        "Принцип Дирихле (углы и длины)",
        "Сложность: 5",
        "Классы: 8,9,10",
        "Условие: На отрезке длиной1 закрашено несколько отрезков, причем расстояние между любыми двумя закрашенными точками не равно0, 1. Докажите, что сумма длин закрашенных отрезков не превосходит0, 5.",
        "Решение: Разрежем отрезок на десять отрезков длиной 0, 1, сложим их стопочкой испроецируем на такой же отрезок (рис.). Так как расстояние между любыми двумя окрашенными точками не равно 0, 1, то окрашенные точки соседних отрезков не могут проецироваться водну точку. Поэтому ни водну точку не могут проецироваться окрашенные точки более чем пяти отрезков. Следовательно, сумма длин проекций окрашенных отрезков (равная сумме их длин) не превосходит"
    ],
    "58102": [
        "Принцип Дирихле (площадь и объем)",
        "Сложность: 5",
        "Классы: 8,9,10",
        "Условие: Дана бесконечная клетчатая бумага ифигура,  площадь которой меньше площади клетки. Докажите, что  эту фигуру можно положить на бумагу, не накрыв ни одной  вершины клетки.",
        "Решение: Приклеим фигуру кклетчатой бумаге произвольным образом, разрежем бумагу по клеткам исложим их встопку, перенося их параллельно ине переворачивая. Спроецируем эту стопку на клетку. Проекции частей фигуры не могут покрыть всю клетку, так как их площадь меньше. Вспомним теперь, как была расположена фигура на клетчатой бумаге, исдвинем клетчатую бумагу параллельно, чтобы ее вершины попали вточки, проецирующиеся вкакую-либо непокрытую точку. Врезультате получим искомое расположение фигуры."
    ],
    "88178": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Обязательноли среди двадцати пяти медных монет (т.е. монет достоинством1, 2, 3, 5коп.) найдётся семь монет одинакового достоинства?",
        "Подсказка: Подумайте, сколько будет монет, если каждого изчетырех типов монет неболее шести?",
        "Решение: Да, обязательно. Еслибы монет каждого изчетырех типов было неболее 6, товсего монет былобы неболее",
        "Ответ: Да. Еслибы каждого изчетырех типов монет было неболее6, товсего монет былобы неболее"
    ],
    "21987": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Докажите, что из 52 целых чисел всегда найдутся два, разность квадратов которых делится на 100.",
        "Решение: См. задачу 30599."
    ],
    "77915": [
        "Принцип Дирихле (прочее)",
        "Сложность: 5",
        "Классы: 8,9,10,11",
        "Условие: Числа 1, 2, 3, ..., 101 выписаны в ряд в каком-то порядке.   Докажите, что из них можно вычеркнуть 90 так, что оставшиеся 11 будут расположены по их величине (либо возрастая, либо убывая).",
        "Решение: Пусть числа выписаны в порядке a1, ...,  a100; xk и yk –  соответственно наибольшие длины возрастающей и убывающей последовательностей, начинающихся с ak. Предположим, что xk ≤ 10 и yk ≤ 10 для всех k. Тогда количество всех различных пар (xk, yk) не превосходит 100. Поэтому xk = xl и yk = yl для некоторых номеров k < l. Но этого не может быть: если ak < al, то xk > xl, а если ak > al, то yk >  yl."
    ],
    "58099": [
        "Принцип Дирихле (углы и длины)",
        "Сложность: 6",
        "Классы: 8,9,10,11",
        "Условие: Даны две окружности, длина каждой из которых равна100см. На одной из них отмечено100 точек, ана другой— несколько дуг, сумма длин которых меньше1см. Докажите, что эти окружности можно совместить так, чтобы ни одна отмеченная точка не попала на отмеченную дугу.",
        "Решение: Совместим данные окружности ипосадим вфиксированную точку одной из них маляра. Будем вращать эту окружность ипоручим маляру красить ту точку окружности, мимо которой он проезжает, всякий раз, когда какая-либо отмеченная точка лежит на отмеченной дуге. Нужно доказать, что после полного оборота часть окружности останется неокрашенной. Конечный результат работы маляра будет такой же, как если бы ему поручили на"
    ],
    "58104": [
        "Принцип Дирихле (площадь и объем)",
        "Сложность: 6",
        "Классы: 8,9,10,11",
        "Условие: Попарные расстояния между точками",
        "Решение: Пусть"
    ],
    "58105": [
        "Принцип Дирихле (площадь и объем)",
        "Сложность: 6",
        "Классы: 8,9,10",
        "Условие: В круге радиуса16 расположено650 точек. Докажите, что найдется кольцо свнутренним радиусом2 ивнешним радиусом3, вкотором лежит не менее10 из данных точек.",
        "Решение: Заметим сначала, что точка"
    ],
    "58092": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 6",
        "Классы: 8,9",
        "Условие: Узлы бесконечной клетчатой бумаги раскрашены втри цвета. Докажите, что существует равнобедренный прямоугольный треугольник свершинами одного цвета.",
        "Решение: Предположим, что нет равнобедренного прямоугольного  треугольника скатетами, параллельными сторонами клеток,  ивершинами одного цвета. Для удобства можно считать, что раскрашены  не узлы, аклетки. Разобьем лист на квадраты со стороной4;  тогда на диагонали каждого такого квадрата найдутся две клетки  одного цвета. Пусть число"
    ],
    "58100": [
        "Принцип Дирихле (углы и длины)",
        "Сложность: 6",
        "Классы: 8,9,10,11",
        "Условие: Даны две одинаковые окружности. На каждой из них отмечено по",
        "Решение: Совместим данные окружности ипосадим вфиксированную точку одной из них маляра. Будем вращать эту окружность ипоручим маляру красить ту точку окружности, мимо которой он проезжает, всякий раз, когда пересекаются какие-либо отмеченные дуги. Нужно доказать, что после полного оборота часть окружности останется неокрашенной. Конечный результат работы маляра будет такой же, как если бы ему поручили на"
    ],
    "58109": [
        "Принцип Дирихле (площадь и объем)",
        "Сложность: 6+",
        "Классы: 9,10,11",
        "Условие: На отрезке длиной1 расположены попарно не пересекающиеся отрезки, сумма длин которых равна",
        "Решение: Пусть"
    ],
    "35054": [
        "Комбинаторная геометрия (прочее)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: В вершинах куба расставлены цифры 1, 2, ..., 8.  Докажите, что есть ребро, цифры на концах которого отличаются не менее чем на 3.",
        "Подсказка: От вершины с цифрой 1 до вершины с цифрой 8 можно дойти, двигаясь не более чем по трём ребрам.",
        "Решение: Назовём расстоянием между двумя вершинами куба наименьшее количество рёбер, которые нужно пройти от одной из этих вершин до другой. Легко видеть, что расстояние между любыми двумя вершинами не больше 3.     Рассмотрим три (или меньше) ребра, по которым можно пройти из вершины 1 в вершину 8. Поскольку, 8 – 1 > 3·2, то на концах одного из этих рёбер цифры отличаются не менее чем на 3."
    ],
    "35795": [
        "Покрытия",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: В коридоре длиной 100 м постелено 20 дорожек общей длиной 1 км. Ширина каждой дорожки равна ширине коридора.   Какова максимально возможная суммарная длина незастеленных участков коридора?",
        "Подсказка: Какова минимальная длина самой длинной из дорожек?",
        "Решение: Оценка. Из 20 дорожек суммарной длиной 1000 = 20·50  м длина хотя бы одной не меньше 50 м. Таким образом, даже одна из дорожек покрывает не меньше 50 м.     Пример. Возьмём 20 дорожек по 50 м и положим их точно друг на друга.",
        "Ответ: 50 м."
    ],
    "21990": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: В клетках таблицы 3×3 расставлены числа –1, 0, 1.   Докажите, что какие-то две из восьми сумм по всем строкам, всем столбцам и двум главным диагоналям будут равны.",
        "Решение: Эти суммы могут принимать лишь семь разных значений: от –3 до 3."
    ],
    "88044": [
        "Отношение порядка",
        "Сложность: 2+",
        "Классы: 5,6,7",
        "Условие: Четыре  подруги пришли накаток, каждая сосвоим братом. Они разбились напары  иначали кататься. Оказалось, что вкаждой паре кавалер выше  дамы иникто некатается сосвоей сестрой. Самым высоким вкомпании  был Юра Воробьёв, следующим поросту— Андрей Егоров, потом Люся  Егорова, Серёжа Петров, Оля Петрова, Дима Крымов, Инна Крымова иАня  Воробьёва. Определите, кто скем катался.",
        "Подсказка: Скем катается Люся Егорова— самая высокая среди девочек?",
        "Решение: Самая высокая издевочек— Люся Егорова, ипоусловию она катается смальчиком, который выше её. Таких мальчиков двое, ноодин изних её брат. Значит, Люся Егорова катается сЮрой Воробьёвым. Рассуждая аналогично, устанавливаем, что Оля Петрова катается сАндреем Егоровым, Инна Крымова— сСерёжей Петровым, аАня Воробьёва— сДимой Крымовым.",
        "Ответ: Люся Егорова иЮра Воробьёв, Оля Петрова иАндрей Егоров, Инна Крымова иСерёжа Петров, Аня Воробьёва иДима Крымов."
    ],
    "89934": [
        "Разрезания (прочее)",
        "Сложность: 2+",
        "Классы: 5,6,7",
        "Условие: В квадрате 4×4 нарисовано 15 точек Доказать, что из него можно вырезать квадратик 1×1, не содержащий внутри себя точек.",
        "Подсказка: Попробуйте разрезать исходный квадрат на квадраты 1×1.",
        "Решение: Разрежем наш квадрат на 16 квадратиков 1×1. Среди этих маленьких квадратиков обязательно найдется хотя бы один, в который не попала точка (не могут 15 точек попасть в 16 квадратов)."
    ],
    "78602": [
        "Комбинаторика (прочее)",
        "Сложность: 2+",
        "Классы: 9,10",
        "Условие: Для зашифровки телеграфных сообщений требуется разбить всевозможные  десятизначные слова – наборы из десяти точек и тире – на две группы  так, чтобы каждые два слова одной группы отличались не менее чем в трёх разрядах. Указать способ такого разбиения или доказать, что его не существует.",
        "Решение: Рассмотрим все слова, начинающиеся с одной и той же последовательности из восьми точек и тире. Таких слов четыре, и все они должны быть в разных группах. Но групп только две. Значит, требуемое разбиение невозможно."
    ],
    "107703": [
        "Упаковки",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Можно ли расположить 12 одинаковых монет вдоль стенок большой квадратной  коробки так, чтобы вдоль каждой стенки лежало ровно",
        "Решение: а) Так как по условию все монеты нужно положить вдоль стенок, и каждой стенки касается ровно две монеты, то общее количество монет — не больше 8.",
        "Ответ: а), е) нет; б), в), г), д) да."
    ],
    "35238": [
        "Раскраски",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Плоскость раскрашена в два цвета. Докажите, что найдутся две точки одного цвета, расстояние между которыми равно 1.",
        "Подсказка: Рассмотрите равносторонний треугольник со стороной   1.",
        "Решение: Рассмотрим равносторонний треугольник со стороной 1.   Некоторые две из этих трех его вершин имеют одинаковый цвет    (согласно принципу Дирихле)."
    ],
    "21994": [
        "Числовые таблицы и их свойства",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: В таблице 10×10 расставлены целые числа, причём каждые два числа в соседних клетках отличаются не более чем на 5.   Докажите, что среди этих чисел есть два равных.",
        "Решение: Поскольку от каждой клетки до любой другой можно добраться, не более 19 раз сдвинувшись в соседнюю клетку, то все числа находятся между числами a и  a + 95, где a – минимальное из всех расставленных чисел. Значит, среди этих чисел не более 96 различных."
    ],
    "32007": [
        "Сумма внутренних и внешних углов многоугольника",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Существует ли выпуклый 1978-угольник, у которого все углы выражаются целым числом градусов?",
        "Решение: Сумма внешних углов 1978-угольника равна 360°. Поэтому у него должен быть угол, меньший 1°.",
        "Ответ: Не существует."
    ],
    "78727": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 8",
        "Условие: На 99 карточках пишутся числа 1, 2, 3, ..., 99. Затем карточки перемешиваются, раскладываются чистыми сторонами вверх и на чистых сторонах снова пишутся числа 1, 2, 3, 4, ..., 99. Для каждой карточки числа, стоящие на ней, складываются и 99 полученных сумм перемножаются. Доказать, что в результате получится чётное число.",
        "Решение: Среди чисел 1, 2, ..., 99 есть 50 нечётных и 49 чётных. Рассмотрим 50 карточек, на которых написаны нечётные числа. На обратной стороне по крайней мере одной из этих карточек написано нечётное число, поэтому сумма стоящих на ней чисел чётна."
    ],
    "88235": [
        "Замощения костями домино и плитками",
        "Сложность: 3",
        "Классы: 5,6,7,8",
        "Условие: Квадратный лист бумаги разрезали нашесть кусков вформе выпуклых многоугольников; пять кусков затерялись, остался один кусок вформе правильного восьмиугольника (см.рисунок). Можно ли поодному этому восьмиугольнику восстановить исходный квадрат?",
        "Подсказка: Могутли какиенибудь два многоугольника граничить друг сдругом больше, чем поодной стороне?",
        "Решение: Поскольку пропавшие пять многоугольников являются выпуклыми, тониодин изних неможет иметь свосьмиугольником границу больше чем поодной стороне. Аэто значит, что как минимум три стороны восьмиугольника принадлежат квадрату. Это соображение позволяет однозначно восстановить размеры квадрата; длина его стороны равна расстоянию между противоположными сторонами восьмиугольника.",
        "Ответ: Да."
    ],
    "21991": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Сто человек сидят за круглым столом, причём более половины из них – мужчины.  Докажите, что какие-то два мужчины сидят друг напротив друга.",
        "Решение: Разобьём всех людей на 50 пар: в каждой паре – два человека, сидящих друг напротив друга. Ясно, что в одной из этих пар оба человека – мужчины."
    ],
    "21993": [
        "Произведения и факториалы",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Цифры 1, 2, ..., 9 разбили на три группы. Докажите, что произведение чисел в одной из групп не меньше 72.",
        "Решение: Произведение чисел во всех группах равно 9! = 362880, а 713 = 357911 < 9!."
    ],
    "30815": [
        "Теория графов (прочее)",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Каждое из рёбер полного графа с 6 вершинами покрашено в один из двух цветов.  Докажите, что есть три вершины, все рёбра между которыми – одного цвета.",
        "Решение: См. задачу 21995."
    ],
    "31363": [
        "Теория графов (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: а) В группе из четырёх человек, говорящих на разных языках, любые трое могут общаться (возможно, один переводит двум другим).   Доказать, что их можно разбить  на пары, в каждой из которых имеется общий язык.   б) То же для группы из 100 человек.   в) То же для группы из 102 человек.",
        "Решение: а) Рассмотрим граф с четырьмя вершинами A, B, C, D, соответствующими людям, и соединим ребрами людей, знающих общий язык. Условие означает, что каждая тройка вершин соединена хотя бы двумя рёбрами. А доказать нужно, что есть два ребра без общих вершин. Пусть это неверно.     Первый способ. Если в тройке (A, B, C) проведены рёбра AB и AC, то рёбер BD и CD нет. Но тогда в тройке (B, C, D) не больше одного ребра. Противоречие.     Второй способ. Всего есть 4 тройки. Каждое ребро входит в две тройки. Следовательно, рёбер не менее 4·2 : 2 = 4. С другой стороны, каждому ребру соответствует отсутствующее противоположное ребро. Следовательно, рёбер не более трёх. Противоречие."
    ],
    "32044": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Какое наименьшее число карточек спортлото (6 из 49) надо купить, чтобы наверняка хоть в одной из них был угадан хоть один номер?",
        "Решение: Заполним восемь карточек следующим образом: в первой зачеркнем числа от 1 до 6, во второй – от 7 до 12 и т. д., в последней – от 43 до 48. Не зачеркнутым ни в одной карточке останется только число 49. Поэтому среди \tвыигрышных номеров по крайней мере пять окажутся зачеркнутыми.     Докажем, что семи карточек может не хватить. Действительно, всего будет вычеркнуто не более 42 различных чисел. Поэтому не менее семи чисел окажутся не вычеркнутыми ни в одной из карточек. Может так случиться, что выигрышными окажутся как раз шесть чисел из этих семи.",
        "Ответ: 8 карточек."
    ],
    "32135": [
        "Системы точек и отрезков (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: В плоскости отмечена 101 точка, не все они лежат на одной прямой. Через каждую пару отмеченных точек красным карандашом проводится прямая. Докажите, что на плоскости существует точка, через которую проходит не меньше 11 красных прямых.",
        "Решение: Пусть через через одну из отмеченных точек A проходит не более десяти красных прямых. На этих прямых лежат, не считая A, 100 отмеченных точек. Значит, на одной из этих прямых l лежит не менее десяти из них. Вместе с A, прямая l содержит по крайней мере 11 отмеченных точек. Рассмотрим точку B, не лежащую на l. Она соединена красными прямыми с 11 отмеченными точками, лежащими на l."
    ],
    "35020": [
        "Арифметика. Устный счет и т.п.",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: 10 человек собрали вместе 46 грибов, причём известно, что нет двух человек, собравших одинаковое число грибов.  Сколько грибов собрал каждый?",
        "Решение: Упорядочим людей по возрастанию количества собранных грибов: a0 < a1 < a2 < ... < a9. Ясно, что a0 ≥ 0, a1 ≥ 1, ..., a9 ≥ 9. Оставим у каждого число грибов, равное его номеру, отложив лишние в сторону. Тогда у грибников останется 0 + 1 + ... + 9 = 45 грибов. Значит, в сторону был отложен ровно один гриб. Он мог быть взят только у грибника №9 (иначе у каких-то двух грибов было бы поровну).",
        "Ответ: 0, 1, 2, 3, 4, 5, 6, 7, 8, 10 грибов."
    ],
    "35295": [
        "Вспомогательная раскраска (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: На каждой клетке доски размером 9×9 сидит жук, По свистку каждый из жуков переползает в одну из соседних по диагонали клеток. При этом в некоторых клетках может оказаться больше одного жука, а некоторые клетки окажутся незанятыми.   Докажите, что при этом незанятых клеток будет не меньше 9.",
        "Подсказка: Покрасьте вертикали доски в чёрный и белый цвет через одну. Тогда с чёрной клетки жук переползает на белую, а с белой – на чёрную.",
        "Решение: Покрасим вертикали доски в чёрный и белый цвет через одну. В результате в чёрный цвет будет покрашено 5×9 = 45 клеток (5 вертикалей), а в белый – только 36. Заметим, что с чёрной клетки жук может переползти только на белую, а белой – только на чёрную. Следовательно, после того, как жуки переползли в соседние по диагонали клетки, на 45 чёрных клетках оказалось 36 жуков. Значит, по крайней мере 9 чёрных клеток оказались незанятыми."
    ],
    "54773": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Через точку на плоскости провели 10 прямых, после чего плоскость разрезали по этим прямым на углы.   Докажите, что хотя бы один из этих углов меньше 20°.",
        "Подсказка: Предположите, что каждый из полученных углов не меньше 20°.",
        "Решение: Десять прямых, проведённых через одну точку, разбивают плоскость на 20 углов. Если все они не меньше 20°, то их сумма не меньше   20·20° = 400° > 360°. Противоречие."
    ],
    "60367": [
        "Теория графов (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9,10",
        "Условие: На плоскости даны шесть точек так, что никакие три из них не лежат на одной прямой. Каждая пара точек соединена отрезком синего или красного цвета. Докажите, что среди данных точек можно выбрать такие три, что все стороны образованного ими треугольника будут окрашены в один цвет.",
        "Решение: См. задачу 21995."
    ],
    "60732": [
        "Арифметика остатков (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Докажите, что любые m чисел x1,..., xm, попарно не сравнимые по модулю m, представляют собой полную систему вычетов по модулю m.",
        "Решение: По принципу Дирихле такие числа попадают по одному в каждый из классов по модулю m."
    ],
    "21998": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: В алфавите языка племени Ни-Бум-Бум 22 согласных и 11 гласных; словом в этом языке называется произвольное буквосочетание, в котором нет двух согласных подряд и ни одна буква не использована дважды. Алфавит разбили на шесть непустых групп.  Докажите, что из всех букв одной из групп можно составить слово.",
        "Решение: Заменим согласные буквы единицами, а гласные – минус единицами. Так как сумма всех полученных чисел равна 11, а групп шесть, то в одной из групп сумма не превосходит 1. Это значит, что гласных в ней достаточно, чтобы заполнить все промежутки между согласными."
    ],
    "66005": [
        "Сочетания и размещения",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Жили-были двадцать шпионов. Каждый из них написал донос на десять своих коллег.   Докажите, что не менее, чем десять пар шпионов донесли друг на друга.",
        "Решение: См. решение задачи 98031  и замечание к нему."
    ],
    "79570": [
        "Степень вершины",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В компании из семи мальчиков каждый имеет среди остальных не менее трёх братьев.  Докажите, что все семеро – братья.",
        "Решение: Возьмём любых двух мальчиков из этой компании. Предположим, что они не братья. Тогда каждый из них имеет среди оставшихся пяти мальчиков по три брата. Следовательно, у них есть общий брат, а значит, они братья. Итак, любые два мальчика из этой компании – братья."
    ],
    "102879": [
        "Примеры и контрпримеры. Конструкции",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Какое максимальное число королей, не бьющих друг друга, можно расставить на шахматной доске 8×8?",
        "Решение: В квадрате 2×2 можно поставить не более одного короля. Не пересекающихся квадратов 2×2 на шахматной доске 16, следовательно, можно поставить не более 16 королей. Действительно, можно поставить 16 королей, если ставить их, например, в левый верхний угол каждого квадрата."
    ],
    "109018": [
        "Покрытия",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Окружность покрыта несколькими дугами. Эти дуги могут налегать друг на друга, но ни одна из них не покрывает окружность целиком. Доказать, что всегда можно выбрать несколько из этих дуг так, чтобы они тоже покрывали всю окружность и составляли в сумме не более",
        "Решение: Если три дуги покрывают некоторую часть окружности так, что все они имеют общую часть, то из них всегда можно выбрать две такие, которые покроют ту же часть окружности. Поэтому можно выбросить лишние дуги так, что каждая часть окружности будет покрыта не более чем два раза, а сумма покрывающих дуг будет не более"
    ],
    "79426": [
        "Раскраски",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Белая плоскость произвольным образом забрызгана чёрной тушью. Доказать, что для любого положительного",
        "Решение: Рассмотрим произвольный правильный треугольник со стороной"
    ],
    "23304": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Можно ли в таблице 6×6 расставить числа 0, 1 и –1 так, чтобы все суммы  чисел  по  вертикалям,  горизонталям и двум главным диагоналям были различны?",
        "Решение: См. задачу 35506."
    ],
    "30682": [
        "Малая теорема Ферма",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: Пусть p – простое число, и a не делится на p. Докажите, что найдется натуральное число b, для которого ab ≡ 1 (mod p).",
        "Решение: a·ap–2 = ap–1 ≡ 1 (mod p)."
    ],
    "30810": [
        "Степень вершины",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: На конференции присутствуют 50 учёных, каждый из которых знаком по крайней мере с 25 участниками конференции.   Докажите, что найдутся четверо из них, которых можно усадить за круглый стол так, чтобы каждый сидел рядом со знакомыми ему людьми.",
        "Подсказка: Рассмотрите двух незнакомых учёных и их знакомых.",
        "Решение: Рассмотрим двух незнакомых учёных (если таких нет, то всё в порядке). Каждый из них имеет по 25 знакомых среди оставшихся 48, значит, у них есть по крайней мере два общих знакомых. Этих четверых и усадим за стол."
    ],
    "31377": [
        "Правило произведения",
        "Сложность: 3+",
        "Классы: 6,7,8,9",
        "Условие: Имеются две одинаковых шестеренки по 14 зубьев на общей оси. Их совместили и выбили четыре пары зубьев.   Доказать, что шестеренки можно повернуть так, что они образуют полноценную шестеренку (без дырок).",
        "Решение: Пусть выбиты зубья A1, A2, A3, A4. Будем поворочивать верхнюю шестеренку относительно нижней. Помимо исходного положения есть еще 13 положений верхней шестеренки, когда из зубья совмещаются. Из них плохими являются не более 12 (когда зубец Ai верхней шестеренки совмещается с зубцом Aj нижней, i ≠ j). Значит, имеется и хорошее положение."
    ],
    "32032": [
        "Неравенство треугольника (прочее)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На плоскости имеется 1983 точки и окружность единичного радиуса.   Доказать, что на окружности найдётся точка, сумма расстояний от которой до данных точек не меньше 1983.",
        "Решение: Обозначим данные точки M1, M2, ..., M1983. Рассмотрим на окружности две произвольные диаметрально  противоположные точки N1 и N2. Согласно   неравенству треугольника, учитывая, что N1N2 = 2, для каждой точки Mi можно записать MiN1 + MiN2 ≥ 2. Сложив эти неравенства, получим    Значит, хотя бы одна из двух сумм в левой части последнего неравенства не меньше 1983."
    ],
    "32075": [
        "Разные задачи на разрезания",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Из шахматной доски вырезали одну угловую клетку. На какое наименьшее число равновеликих треугольников можно разрезать эту фигуру?",
        "Решение: Оценка. Примем за единицу площадь одной клетки. Данная фигура  представляет собой невыпуклый шестиугольник ABCDEF площади 63 с углом 270° в вершине D (рис. справа). Если фигура разбита на треугольники, то, очевидно, точка D должна принадлежать по крайней мере двум треугольникам, причём у одного из них сторона лежит на прямой DE, а у другого – на DC. Более того, по крайней мере для одного из них она лежит на соответствующем отрезке. Для определенности предположим, что это треугольник DKL, где K лежит на отрезке DC. Тогда основание DK этого треугольника не больше  DC = 1, а высота – не больше BC = 7. Поэтому SDKL ≤ 7/2. Если все треугольники равновелики, то их не меньше 63 : 7/2 = 18.     Пример разрезания на 18 равновеликих треугольников см. на рис. слева.",
        "Ответ: На 18 треугольников."
    ],
    "35053": [
        "Теория игр (прочее)",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: 2n конфет разложены по n коробкам. Девочка и мальчик по очереди берут по одной конфете, первой выбирает девочка.   Докажите, что мальчик может выбирать конфеты так, чтобы две последние конфеты оказались из одной коробки.",
        "Подсказка: Мальчик может брать конфеты таким образом, чтобы после того, как он возьмёт k-ю конфету, по крайней мере k коробок оказались пустыми.",
        "Решение: Мальчик может взять свою первую конфету так, чтобы после этого хотя бы одна коробка освободилась. Действительно, после первого хода девочки осталось 2n – 1 конфета в n коробках, и следовательно, в какой-то из коробок осталось не более одной конфеты. Если в этой коробке нет конфет, то мальчик может взять конфету из любой коробки.     Итак, после того, как мальчик берет первую конфету, одна коробка опустеет и остаётся 2(n – 1) конфет в n – 1 коробке. Если мальчик будет и дальше действовать таким образом, то после того, как он возьмёт вторую конфету, опустеют две коробки, ..., после того, как мальчик возьмёт (n–1)-ю конфету, опустеют все коробки, за исключением одной. Это и означает, что две оставшиеся конфеты лежат в одной коробке."
    ],
    "35149": [
        "Неравенства с площадями",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: В квадрате со стороной 1 расположено 100 фигур, суммарная площадь    которых больше 99. Докажите, что в квадрате найдется точка,   принадлежащая всем этим фигурам.",
        "Подсказка: Рассмотрите фигуры, дополняющие данные 100 фигур до квадрата.",
        "Решение: Обозначим данные 100 фигур A"
    ],
    "35249": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На плоскости даны 2004 точки. Запишем все попарные расстояния между ними.   Докажите, что среди записанных чисел не менее тридцати различных.",
        "Подсказка: В противном случае все точки, кроме одной,  расположены на 29 окружностях.",
        "Решение: Предположим, что имеется контрпример. Выберем одну из данных точек – A. Поскольку расстояние от точки A до любой другой точки принимает менее 30 различных значений, то оставшиеся 2003 точки лежат на 29 окружностях с центром A. Поскольку 69·29 = 2001 < 2003, на одной из этих окружностей расположено не менее 70 точек.  Рассмотрим только точки на этой окружности (назовём её S) и выберем одну из точек – B. Оставшиеся 69 точек расположены на 29 окружностях с центром B. Однако каждая из этих окружностей имеет не более двух общих точек с окружностью S, а 2·29 < 69. Противоречие."
    ],
    "60739": [
        "Арифметика остатков (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Докажите, что для любого натурального числа найдётся кратное ему число, десятичная запись которого состоит только из 0 и 1.",
        "Решение: См. решение задачи 34968."
    ],
    "60806": [
        "Признаки делимости на 3 и 9",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что в записи числа 230 есть по крайней мере две одинаковые цифры, не вычисляя его.",
        "Подсказка: Примените признак делимости на 3.",
        "Решение: 230 = (1024)3 > 109. С другой стороны, (1024)3 < (2000)3 = 8·109. Значит, число 230 – десятизначное. Далее см. решение задачи 78742."
    ],
    "32785": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Занятия Вечерней Математической Школы проходят в девяти аудиториях.  Среди прочих, на эти занятия приходят 19 учеников из одной и той же школы.",
        "Решение: а) Действительно, предположим, что в каждой из аудиторий сидят не более двух учеников из этой школы. Но тогда во всех девяти аудиториях сидят не больше 18 таких школьники - противоречие. Значит, в какой-то аудитории сидят по крайней мере три ученика из этой школы.",
        "Ответ: б) нет."
    ],
    "60877": [
        "Теорема Эйлера",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что если (m, 10) = 1, то существует репьюнит  En, делящийся на m. Будет ли их бесконечно много?",
        "Решение: По теореме Эйлера 9Ekφ(m) = 10kφ(m) – 1 ≡ 0 (mod m) при любом k ≥ 1. Если m не делится на 3, то Ekφ(m) ≡ 0 (mod m). Если же m делится на 3 или на 9, то на m делится число E9kφ(m).",
        "Ответ: Будет."
    ],
    "34875": [
        "Принцип Дирихле (углы и длины)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Внутри правильного шестиугольника со стороной 1 расположено 7 точек. Докажите, что среди них найдутся две точки на расстоянии не больше 1.",
        "Подсказка: Разбейте правильный шестиугольник на шесть правильных треугольников со стороной 1.",
        "Решение: Правильный шестиугольник можно разбить на шесть правильных треугольников со стороной 1. Тогда хотя бы в одном из этих треугольников будет лежать две отмеченные точки. Расстояние между ними не будет превосходить стороны треугольника."
    ],
    "73597": [
        "Деление с остатком",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что для любого нечётного натурального числа a существует такое натуральное число b, что 2b – 1 делится на a.",
        "Решение: Рассмотрим числа 20 – 1, 21 – 1, ..., 2a – 1. Этих чисел a + 1. Какие-то два из них дают одинаковые остатки при делении на a, потому что различных таких остатков существует всего a. Пусть, скажем, числа 2k – 1 и 2m – 1 дают одинаковые остатки при делении на a и k < m. Тогда число (2m – 1) – (2k – 1) = 2k(2m–k – 1) делится на a и, поскольку a нечётно, 2m–k – 1 делится на a."
    ],
    "76543": [
        "Деление с остатком",
        "Сложность: 3+",
        "Классы: 7,8,9,10",
        "Условие: Докажите, что каково бы ни было целое число n, среди чисел n, n + 1, n + 2, ..., n + 9 есть хотя бы одно, взаимно простое с остальными девятью.",
        "Решение: Среди данных чисел есть пять нечётных. Рассмотрим остатки от деления этих  пяти чисел на 3, 5 и 7. Среди остатков от деления на 3 нет трёх одинаковых, а среди остатков от деления на 5 и на 7 нет двух одинаковых. Поэтому среди указанных пяти чисел можно выбрать три числа, не кратных 3, а среди них выбрать число, не кратное ни 5, ни 7. Это число взаимно просто с остальными девятью числами."
    ],
    "78494": [
        "Числовые таблицы и их свойства",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В таблицу 8×8 вписаны все целые числа от 1 до 64. Доказать, что при  этом найдутся два соседних числа, разность между которыми не меньше 5.   (Соседними называются числа, стоящие в клетках, имеющих общую сторону.)",
        "Решение: Рассмотрим горизонтальную строку таблицы, содержащую число 1, и вертикальный столбец, содержащий число 64. Мы можем, двигаясь сначала по строке, а потом по столбцу, пройти от клетки, в которой написано число 1, к клетке, в которой написано число 64, причём наш путь будет состоять не более чем из 14 ходов (ходом мы называем переход из любой клетки в соседнюю).     Предположим, что разность между каждыми двумя соседними числами в  таблице меньше 5. Тогда за 14 или меньшее число ходов, которые мы сделали при переходе от 1 к 64, к исходному числу 1 прибавится не более чем 14×4 = 56. Между тем 64 – 1 = 63. Противоречие."
    ],
    "78501": [
        "Числовые таблицы и их свойства",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: В таблицу 9×9 вписаны все целые числа от 1 до 81. Доказать, что найдутся два соседних числа, разность между которыми не меньше 6.",
        "Решение: Где-то в таблице стоит 1, а где-то 81. Соединим эти числа цепочкой, переходя от одного числа к другому (стоящему в соседней клетке), сделав минимальное число переходов (их будет не более 16). Если в таблице разность между соседними меньше 6, то число переходов в цепочке ровно 16, иначе нашелся бы переход с разностью, большей 5. Значит, 1 и 81 стоят в противоположных углах таблицы, а в цепочке стоят числа 1, 6, 11, 16, 21, ..., 81. Рассмотрим другую минимальную цепочку, соединяющую 1 и 81. В ней тоже должны стоять числа 1, 6, 11, 16,..., 81. Но в таблице все числа различны. Противоречие."
    ],
    "78578": [
        "Арифметика остатков (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Все целые числа от 1 до 2n выписаны в строчку. Затем к каждому числу  прибавили номер того места, на котором оно стоит.   Доказать, что среди полученных сумм найдутся хотя бы две, дающие при делении на 2n одинаковый остаток.",
        "Решение: Пусть в строчку выписаны числа a1, a2, ..., a2n. Предположим, что все числа a1 + 1, a2 + 2, ..., a2n + 2n дают разные остатки при делении на 2n. Тогда эти остатки равны 1, 2, ..., 2n. Поэтому (a1 + 1) + (a2 + 2) + ... + (a2n + 2n) = 2(1 + 2 + ... + 2n) ≡ 1 + 2 + ... + 2n (mod 2n). Противоречие, поскольку   1 + 2 + ... + 2n = n(2n + 1) ≡ n (mod 2n)."
    ],
    "79473": [
        "Квадратичные неравенства (несколько переменных)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Числа a1, a2, ..., a1985 представляют собой переставленные в некотором порядке числа 1, 2, ..., 1985. Каждое число ak умножается на его номер k, а затем среди полученных 1985 произведений выбирается наибольшее. Доказать, что оно не меньше, чем 993².",
        "Решение: Чисел ak, не меньших 993, в точности 993. Поэтому хотя бы одно из них имеет номер, не меньший 993, и для него kak ≥ 993²."
    ],
    "79651": [
        "Деление с остатком",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Доказать, что найдётся число вида     а) 1989...19890...0 (несколько раз повторено число 1989, а затем стоит несколько нулей), делящееся на 1988;     б) 1988...1988, делящееся на 1989.",
        "Решение: а) Рассмотрим числа 1989, 19891989, ..., 19891989...1989 (в последнем числе 1989 повторено 1989 раз). Рассмотрим остатки от деления этого числа на 1988, так как остатков меньше, чем написанных чисел, то обязательно найдутся два числа с равными остатками (принцип Дирихле) и, следовательно, их разность будет делится на 1988. Если первое число содержит в своей записи n чисел 1989, а второе – m чисел 1989, то их разность будет записана с помощью n – m чисел 1989 и 4m нулей."
    ],
    "35453": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Имеется 101 пуговица одного из 11 цветов.    Докажите, что либо среди этих пуговиц найдутся 11 пуговиц одного    цвета, либо 11 пуговиц разных цветов.",
        "Подсказка: Предположите, что нет 11 пуговиц разных цветов.    Тогда каждая пуговица окрашена в один из 10 цветов.",
        "Решение: Предположим, что среди данных пуговиц нет 11 пуговиц разных цветов.    Тогда каждая пуговица окрашена в один из 10 цветов.    Если пуговиц каждого цвета не более десяти,    то всего пуговиц не более 100, и это противоречит условию.    Таким образом, пуговиц какого-то одного цвета не менее 11, что и    нужно было показать.    Отметим, что утверждение задачи становится неверным в том случае,    если изначально даны 100 пуговиц."
    ],
    "102844": [
        "Таблицы и турниры (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Клетки квадратной таблицы 15×15 раскрашены в красный, синий и зелёный цвета.   Докажите, что найдутся, по крайней мере, две строки, в которых клеток хотя бы одного цвета поровну.",
        "Решение: Допустим противное. Тогда в каждых двух строках разное количество клеток красного цвета, и всего их в таблице не менее   0 + 1 + 2 + ... + 13 + 14  = 105. То же верно для синих и зелёных клеток. Тогда всего в таблице должно быть не менее 3·105 = 315 клеток, в то время как всего их 15² = 225. Противоречие."
    ],
    "35506": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Можно ли таблицу n×n заполнить числами –1, 0, 1 так, чтобы суммы во всех строках, во всех столбцах и на главных диагоналях были различны?",
        "Подсказка: Сколько указанных сумм и возможных значений для указанных сумм?",
        "Решение: В условии требуется, чтобы значения 2n + 2 сумм (n строк, n столбцов и две диагонали) были различны. Каждая из этих сумм состоит из n слагаемых, принимающих одно из значений –1, 0, 1. Поэтому каждая из сумм принимает целочисленное значение в диапазоне от –n до n. Всего возможных значений сумм – 2n + 1. Поскольку 2n + 1 < 2n + 2, какие-то две из сумм обязательно принимают равные значения.",
        "Ответ: Нельзя."
    ],
    "35058": [
        "Покрытия",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: 10 журналов лежат на журнальном столе, полностью покрывая его.  Докажите,  что можно убрать пять из них так, что оставшиеся журналы будут  покрывать не менее половины площади стола.",
        "Подсказка: Сведите задачу к случаю, когда журналы не перекрываются.",
        "Решение: Занумеруем журналы числами от 1 до 10.  От второго журнала отрежем ту часть (если такая есть), которая  уже покрывается первым журналом.  От третьего журнала отрежем ту часть, которая  уже покрывается первым и вторым журналами.  Действуем так и дальше, в конце концов  от десятого журнала отрежем ту часть, которая  уже покрывается всеми журналами с первого по девятый.  После описанной процедуры 10 журналов  (у некоторых из них, возможно, отрезана какая-то часть, в частности,  может быть удален целый журнал)  будут покрывать стол в один слой. Следовательно,  5 журналов, наибольших по площади, покрывают не менее половины  площади стола. Ясно, что те же самые 5 журналов покрывали не менее  половины площади стола и до того, как мы резали журналы.  Следовательно, оставшиеся 5 журналов можно убрать со стола так, чтобы  условие задачи выполнялось."
    ],
    "35627": [
        "Обыкновенные дроби",
        "Сложность: 3+",
        "Классы: 7,8,9,10",
        "Условие: Хозяйка испекла для гостей пирог. К ней может прийти либо 10, либо 11 человек. На какое наименьшее число кусков ей нужно заранее разрезать пирог так, чтобы его можно было поделить поровну как между 10, так и между 11 гостями?",
        "Подсказка: Если придут 10 гостей, то каждый должен получить не меньше двух кусков.",
        "Решение: Если придут 10 гостей, то каждый должен получить не меньше двух кусков. В самом деле, иначе один из 10 гостей получил бы один кусок в 1/10 часть пирога, и если бы пришло 11 гостей, то этот кусок нужно было бы дополнительно разделить. Таким образом, количество кусков не меньше, чем 2·10 = 20.   Покажем, что двадцати кусков хватит. Разрежем пирог на 10 кусков по 1/11 части пирога и на 10 кусков по 1/110 пирога. Если придут 10 гостей, то каждому дадим один большой кусок и один маленький – всего 1/11 + 1/110 = 1/10. Если же придут 11 гостей, то десяти из них дадим по одному большому куску в 1/11, а одному – 10 маленьких кусков.",
        "Ответ: На 20 кусков."
    ],
    "58081": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Внутри равностороннего треугольника со стороной1 расположено пять точек. Докажите, что расстояние между некоторыми двумя из них меньше0, 5.",
        "Решение: Средние линии правильного треугольника со стороной 1 разбивают его на  четыре правильных треугольника со стороной 0,5. Поэтому в одном  из них лежат по крайней мере две данные точки, причем эти точки не могут  попасть в вершины треугольника. Расстояние между этими точками  меньше 0,5."
    ],
    "78607": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Чему равна максимальная разность между соседними числами из числа тех, сумма цифр которых делится на 7?",
        "Решение: Докажем сначала, что эта разность не может быть больше13. Действительно,  среди13 подряд идущих натуральных чисел хотя бы у одного сумма цифр делится  на7, поскольку среди13 подряд идущих натуральных чисел хотя бы7  лежат в одном десятке. Но тогда суммы цифр этих семи чисел—  последовательные натуральные числа, а значит, среди них есть число, делящееся  на семь. Итак, искомое число не больше13. Но между числами 993 и 1006  нет других чисел, сумма цифр которых делится на семь, а",
        "Ответ: 13.00"
    ],
    "78680": [
        "Индукция в геометрии",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На окружности радиуса 1 отмечена точка",
        "Решение: Докажем индукцией по",
        "Ответ: не более трех."
    ],
    "79384": [
        "Целочисленные решетки (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На прямоугольном листе клетчатой бумаги размером",
        "Решение: Отметим для каждого квадрата левый верхний угол. По условию для разных квадратов отмеченные точки разные. Поэтому число квадратов не превосходит",
        "Ответ: mn"
    ],
    "102796": [
        "Ортогональная (прямоугольная) проекция",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Внутри квадрата со стороной 1 расположены несколько кругов, сумма радиусов которых равна 0,51. Доказать, что найдется прямая, которая параллельна одной из сторон квадрата и пересекает, по крайней мере, 2 круга.",
        "Решение: Спроектируем данные круги на одну из сторон квадрата. Проекцией одного круга является отрезок, длина которого равна диаметру круга. Поэтому сумма длин проекций кругов на сторону равна 2×0,51=1,02, что больше стороны квадрата, следовательно, по крайней мере, проекция двух кругов имеет общую точку. Перпендикуляр к стороне квадрата, восстановленный в этой точке, является искомой точкой, т.к. он пересечет соответствующие два круга."
    ],
    "79650": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Доказать, что из любых 2001 целых чисел найдутся два, разность которых делится на 2000.",
        "Решение: См. задачу 21972."
    ],
    "108995": [
        "Упаковки",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Доказать, что в круге радиуса 10 нельзя поместить 400 точек так, чтобы расстояние между каждыми двумя было больше 1.",
        "Решение: Круг радиуса 10 имеет площадь"
    ],
    "32024": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Для того, чтобы застеклить 15 окон различных размеров и   форм, заготовлено 15 стекол в точности по окнам (окна такие, что   в каждом окне должно быть одно стекло). Стекольщик, не зная, что   стекла подобраны, работает так: он подходит к очередному окну и   перебирает неиспользованные стекла до тех пор, пока не найдет   достаточно большое (то есть либо в точности подходящее, либо   такое, из которого можно вырезать подходящее), если же такого   стекла нет, то переходит к следующему окну, и так, пока не   обойдет все окна. Составлять стекло из нескольких частей нельзя.   Какое максимальное число окон может остаться незастекленными?",
        "Решение: Покажем сначала, что если в какой-либо момент осталось \t\t\t\tне меньше 8 окон (и, соответственно, не меньше 8 стекол), то \t\t\t\tстекло для какого-нибудь окна из оставшихся можно подобрать. \t\t\t\tДействительно, разобрано не больше семи стекол, значит хотя бы \t\t\t\tодно из восьми стекол, предназначавшихся заранее для восьми \t\t\t\tоставшихся окон, осталось. Его-то и можно вставить в «свое \t\t\t\tокно. Поэтому больше семи окон остаться незастекленными не может."
    ],
    "35643": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: У правильного 5000-угольника покрашено 2001 вершина.   Докажите, что найдутся три покрашенные вершины, лежащие в вершинах равнобедренного треугольника.",
        "Подсказка: Если у правильного пятиугольника покрашены три вершины, то они лежат в вершинах равнобедренного треугольника.",
        "Решение: В правильном 5000-угольнике разобьём все вершины на 1000 групп по пять вершин, расположенных через 999 последовательных вершин. Точки в каждой группе являются вершинами правильного пятиугольника. Покрашенных вершин всего 2001 = 2·1000 + 1, следовательно, в какой-то из групп вершин покрашено не менее трёх. Но каждые три вершины правильного пятиугольника лежат в вершинах равнобедренного треугольника."
    ],
    "78086": [
        "Куб",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: В кубе, ребро которого равно 13, выбрано 1956 точек. Можно ли в этот куб поместить кубик с ребром 1 так, чтобы внутри него не было ни одной выбранной точки?",
        "Решение: Ответ:",
        "Ответ: 3"
    ],
    "79506": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Доказать, что из любых 27 различных натуральных чисел, меньших 100, можно  выбрать два числа, не являющихся взаимно простыми.",
        "Решение: Рассмотрим произвольный набор из 27 различных натуральных чисел, меньших 100.  Для каждого числа из набора отметим либо один из его простых делителей (если  это число не равно единице), либо единицу (если это число равно единице). Так  как простых чисел, меньших ста, всего 25, то какое-то число мы отметили  дважды.  Этим числом не могла быть единица, поскольку единицу мы отмечали  только для единицы. Следовательно, в наборе есть два числа с общим простым  делителем, то есть два числа, не являющихся взаимно простыми."
    ],
    "79515": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Даны 7 различных цифр. Доказать, что для любого натурального числа",
        "Решение: Пусть"
    ],
    "30811": [
        "Степень вершины",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Каждый из 102 учеников одной школы знаком не менее чем с 68 другими.   Докажите, что среди них найдутся четверо, имеющие одинаковое число знакомых.",
        "Решение: Предположим противное. Тогда для каждого числа от 68 до 101 есть ровно три человека, имеющие такое число знакомых. Но тогда количество людей, имеющих нечётное число знакомых, нечётно. Противоречие."
    ],
    "31295": [
        "Уравнения в целых числах",
        "Сложность: 4",
        "Классы: 6,7,8",
        "Условие: Есть 100 купюр двух типов: по a и b рублей, причём a ≠ b (mod 101).   Доказать, что можно выбрать несколько купюр так, что полученная сумма (в рублях) делится на 101.",
        "Решение: Пусть имеется m ≤ 50 купюр по a рублей и n = 100 – m купюр по b рублей. Рассмотрим суммы a, a + b, 2a + b, 2a + 2b, 2a + 3b, 3a + 3b, ..., ma + mb, ma + (m + 1)b, ..., ma + nb. Всего их 2m + (n – m) = 100. Есть три возможности.     1) Среди этих сумм найдётся кратная 101. Это и будет искомая сумма.     2) Найдутся две суммы, сравнимые по модулю 101. Тогда искомая сумма – их разность.     3) Остатки от деления этих сумм на 101 принимают все значения от 1 до 100. Тогда какая-то из них (но не a) сравнима с b по модулю 101. Вычитая из неё b, получим искомую сумму."
    ],
    "103987": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: a) Докажите, что в любой футбольной команде есть два игрока, которые родились в один и тот же день недели.",
        "Решение: а) Пусть футболисты - это кролики, а дни недели - это клетки. Получаем 7 клеток, в которые надо посадить по крайней мере 11 кроликов, а значит, по принципу Дирихле по крайней мере в одной клетке будут сидеть по крайней мере два кролика."
    ],
    "34873": [
        "Прямые и плоскости в пространстве (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: В пространстве даны n точек общего положения (никакие три не лежат на одной прямой, никакие четыре – в одной плоскости). Через каждые три из них проведена плоскость. Докажите, что какие бы n – 3 точки в пространстве ни взять, найдётся плоскость из проведённых, не содержащая ни одной из этих n – 3 точек.",
        "Подсказка: Найдите вначале прямую, проходящую через две из данных n точек и не содержащую ни одной из n – 3 взятых  точек.",
        "Решение: Пусть M – данное множество из n точек, A – произвольное множество из n – 3 точек. Возьмём точку x ∈ M \\ A (такая существует, так как в M точек больше, чем в A). Проведём через x и остальные точки множества M n – 1 прямую. Одна из прямых не пересекает A. Через эту прямую и оставшиеся  n – 2 точки множества M проведём n – 2 плоскости. Одна из плоскостей не пересекает A, так как плоскостей больше, чем точек в A."
    ],
    "104021": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: а) В каждой вершине куба написано число 1 или число 0. На каждой грани куба написана сумма четырёх чисел, написанных в вершинах этой грани. Может ли оказаться, что все числа, написанные на гранях, различны?   б) Тот же вопрос, если в вершинах написаны числа 1 или –1.",
        "Решение: а) На каждой грани написано одно из пяти чисел: 0, 1, 2, 3 или 4. Но граней всего шесть, и значит, на некоторых двух гранях будут написаны совпадающие числа."
    ],
    "115470": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: В классе",
        "Решение: Если в классе",
        "Ответ: 13."
    ],
    "21975": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: В стране Курляндии",
        "Решение: Так как перевезено всего 10m+1 футболистов, то, рассадив по клеткам-командам, получаем, что в какой-то клетке сидит 11 футболистов."
    ],
    "32786": [
        "Принцип Дирихле (углы и длины)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: На плоскости нарисовано 12 прямых, проходящих через точку О. Докажите, что можно выбрать две из них так, что угол между ними будет меньше 17 градусов.",
        "Решение: Воспользуемся методом от противного. Предположим, что угол между любыми двумя из этих прямых не меньше 17 градусов. Данные прямые разбивают плоскость на 24 угла, поэтому их сумма не менее 24*17=408 градусов, но, с другой стороны, их сумма равна 360 градусам, - противоречие. Значит, найдутся две прямые, угол между которыми меньше 17 градусов."
    ],
    "35339": [
        "Принцип Дирихле (площадь и объем)",
        "Сложность: 2+",
        "Классы: 8,9,10",
        "Условие: На планете Тау Кита суша занимает больше половины всей площади.        Доказать, что таукитяне могут прорыть через центр планеты шахту,        соединяющую сушу с сушей.",
        "Подсказка: Представьте себе проекцию суши относительно       центра земли",
        "Решение: Суша и область напротив суши перекрываются. Если бы они не     перекрывались, то суша занимала бы меньше половины всей площади."
    ],
    "35566": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 9,10",
        "Условие: В воздушном пространстве находятся облака.    Оказалось, что пространство можно разбить десятью плоскостями на части    так, чтобы в каждой из частей находилось не более одного облака.    Через какое наибольшее число облаков мог пролететь самолет,    придерживаясь прямолинейного курса?",
        "Подсказка: Сколько раз самолет пересекал границу между частями пространства?",
        "Решение: Придерживаясь прямого курса, самолет мог пересечь каждую из плоскостей,    являющихся границами частей пространства, не более одного раза.    Таким образом, самолет менял часть пространства в процессе    своего полета не более 10 раз.    Значит, он посетил не более 11 из частей пространств    следовательно, самолет пролетел не более, чем через 11    облаков.    Число 11 достигается, если курс самолета не параллелен    ни одной из плоскостей и не проходит через прямые пересечения    плоскостей.",
        "Ответ: 11.00"
    ],
    "35571": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: На шахматной доске более четверти полей занято шахматными     фигурами.     Докажите, что занятыми оказались хотя бы две соседние (по стороне     или диагонали) клетки.",
        "Подсказка: Разбейте доску на квадратики 2*2.",
        "Решение: Разделим доску на 16 квадратиков 2*2.    Если в каждом из этих квадратиков не более одной занятой клетки,    то всего фишками занято не более 16 клеток, что не превышает    (1/4)*64 вопреки условию.    Таким образом, в каком-то из квадратиков фишками занято не менее    двух клеток. Но это означает, что эти две клетки - соседние."
    ],
    "58093": [
        "Принцип Дирихле (углы и длины)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: На плоскости дано",
        "Решение: Возьмем на плоскости произвольную точку ипроведем через нее прямые, параллельные данным. Они разделят плоскость на2"
    ],
    "21970": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: В мешке лежат шарики двух разных цветов: черного и белого.  Какое наименьшее число шариков нужно вынуть из мешка вслепую так, чтобы среди них заведомо оказались два шарика одного цвета?",
        "Решение: Всего надо вынуть три шара, тогда у нас шары — это кролики, а цвета — это клетки. А так как клеток меньше, чем кроликов, то по принципу Дирихле найдется клетка, в которой сидят хотя бы два кролика. То есть два шара одного цвета. Легко заметить, что, вытащив два шара, мы можем получить шары разных цветов.",
        "Ответ: 3 шара."
    ],
    "60352": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: В мешке 70 шаров, отличающихся только цветом: 20 красных, 20 синих, 20 жёлтых, остальные – чёрные и белые.   Какое наименьшее число шаров надо вынуть из мешка, не видя их, чтобы среди них было не менее 10 шаров одного цвета?",
        "Решение: Вынув 37 шаров, мы рискуем получить по 9 красных, синих и жёлтых, и десяти шаров одного цвета не будет. Если же мы вытащим 38 шаров, то общее число красных, синих и жёлтых среди них не меньше 28, и шаров одного из этих цветов – не меньше десяти (поскольку 28 > 3·9).",
        "Ответ: 38 шаров."
    ],
    "110920": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: У Пети в кармане несколько монет.  Если Петя наугад вытащит из кармана  3 монеты, среди них обязательно найдётся монета 1 рубль.  Если Петя наугад вытащит 4 монеты из кармана, среди них обязательно  найдётся монета 2 рубля.  Петя вытащил из кармана 5 монет. Назовите эти монеты.",
        "Решение: Раз среди любых трёх монет обязательно найдётся  монета 1 рубль, значит монет другого достоинства не больше двух.  То есть все Петины монеты, кроме возможно двух,– это монеты 1 рубль.    Раз среди любых четырёх монет обязательно найдётся  монета 2 рубля, значит монет, отличных от 2 рублей, не больше  трёх. То есть все Петины монеты, кроме возможно трёх,– это монеты 2 рубля.    Следовательно, среди вытащенных 5 монет обязательно  есть 3 монеты 1 рубль (других монет может быть не больше двух)  и 2 монеты 2 рубля (других монет может быть не больше трёх).    Но",
        "Ответ: 1 рубль, 1 рубль, 1 рубль, 2 рубля, 2 рубля."
    ],
    "34962": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Можно ли расположить на плоскости 1000 отрезков так, чтобы каждый  отрезок своими концами упирался строго внутрь других отрезков.",
        "Подсказка: Рассмотрите самую левый конец отрезка,  см. принцип  крайнего.",
        "Решение: Введем систему координат таким образом, чтобы ось Oy не была  параллельна ни одному из отрезков.  Рассмотрите конец некоторого отрезка с наименьшей абсциссой  среди всех концов отрезков. Понятно, что этот конец не может  упираться внутрь ни одного из отрезков."
    ],
    "21976": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Дано 8 различных натуральных чисел, не больших 15.   Докажите, что среди их положительных попарных разностей есть три   одинаковых.",
        "Решение: Различных разностей может быть 14 - от 1 до 14 - это те 14 клеток, в которые мы будем сажать кроликов.  Кто же будет нашими кроликами?  Ими, конечно, должны быть разности между парами данных нам натуральных чисел.  Однако имеется 28 пар и их можно рассадить по 14 клеткам так, что в каждой клетке будет сидеть ровно два кролика (и значит, в каждой меньше трех).  Здесь надо использовать дополнительное соображение:  в клетке с номером 14 может сидеть не более одного кролика, ведь число 14 можно записать как разность двух натуральных чисел, не превосходящих 15, лишь одним способом: 14=15-1.  Значит, в оставшихся 13 клетках сидят не менее 27 кроликов, и применение обобщенного принципа Дирихле дает нам желаемый результат."
    ],
    "21980": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: 10 школьников на олимпиаде решили 35 задач, причем  известно, что среди них есть школьники, решившие ровно одну  задачу, школьники, решившие ровно две задачи и школьники,  решившие ровно три задачи.  Докажите, что есть школьник, решивший  не менее пяти задач.",
        "Решение: Из условий следует, что найдутся 7 школьников, решивших 35-6=29 задач. Так как 29=4·7+1, то найдется школьник, решивший не менее пяти задач."
    ],
    "21983": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: В квадрат со стороной 1 метр бросили 51 точку.  Докажите, что какие-то три из них можно накрыть квадратом со  стороной 20 см.",
        "Решение: Разобьем наш квадрат на 25 квадратов \t\t\t\tсо стороной 20 см.  По обобщенному принципу Дирихле, в какой-то \t\t\t\tиз них попадет по крайней мере три точки из 51 брошенной."
    ],
    "98634": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 6,7,8,9",
        "Условие: Вдоль правой стороны дороги припарковано 100 машин. Среди них — 30 красных, 20 желтых и 20 розовых мерседесов. Известно, что никакие два мерседеса разного цвета не стоят рядом. Докажите, что тогда какие-то три мерседеса, стоящие подряд — одного цвета.",
        "Решение: У нас есть 70 мерседесов и 30 «других» машин. По условию, рядом с мерседесом может стоять либо мерседес того же цвета, либо «другая» машина Чем больше мерседесов будут стоять парами, тем меньше понадобится «других» машин. Но пар мерседесов 35, а на их «окружение» понадобится 33 «другие» машины. Если мерседесы стоят не обязательно парами, то «других» понадобится еще больше. Но «других» по условию, всего 30, значит поставить можно только 32 пары. Значит должны рядом стоять три одинаковых мерседеса."
    ],
    "21982": [
        "Принцип Дирихле (углы и длины)",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Докажите, что равносторонний треугольник нельзя  покрыть двумя меньшими равносторонними треугольниками.",
        "Решение: Каждый из меньших треугольников не может накрывать более \t\t\t\tодной вершины большого треугольника."
    ],
    "32021": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Если класс из 30 человек рассадить в зале кинотеатра, то в любом случае хотя бы в одном ряду окажется не менее двух одноклассников. Если то же самое проделать с классом из 26 человек, то по крайней мере три ряда окажутся пустыми. Сколько рядов в зале?",
        "Решение: Первое условие означает, что в зале не более 29 рядов. Действительно, если бы количество рядов было не меньше 30, то, очевидно, класс из 30 человек можно было бы рассадить не более чем по одному на каждый ряд.     Второе условие означает, что количество рядов в зале не менее 29. Действительно, если количество рядов не больше 28, то сажая учеников класса из 26 человек по очереди на пустые ряды, получим, что либо в какой-то момент все ряды будут заняты, либо все 26 учеников будут сидеть по одному на 26 рядах, и в этом случае останутся свободными не более двух рядов.     Значит, в кинотеатре 29 рядов. Очевидно, что в этом случае оба условия выполнены."
    ],
    "21971": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: В лесу растет миллион елок. Известно, что на каждой из них не более 600000 иголок. Докажите, что в лесу найдутся две елки с одинаковым числом иголок.",
        "Решение: Перед нами миллион ``кроликов''-елок и, увы, всего лишь 600001 клетка с номерами от 0 до 600000. Каждый ``кролик''-елка сажается нами в клетку с номером, равным количеству иголок на этой елке. Так как ``кроликов'' гораздо больше, чем клеток, то в какой-то клетке сидит по крайней мере два ``кролика'' - если бы в каждой сидело не более одного, то всего ``кроликов''-елок было бы не более 600001 штук. Но ведь, если два ``кролика''-елки сидят в одной клетке, то количество иголок у них одинаково."
    ],
    "32057": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: В классе 25 человек. Известно, что среди любых  трех из них есть двое друзей. Докажите, что есть ученик, у  которого не менее 12 друзей.",
        "Решение: Рассмотрим двоих учеников класса, которые не дружат между собой.  \t\t\t\t(Если таких нет, то все ученики класса дружат между собой, значит,  \t\t\t\tу каждого ученика имеется 24 друга, и задача решена.)  \t\t\t\tПусть этими двумя будут Вася и Петя. Тогда из оставшихся 23  \t\t\t\tучеников каждый дружит либо с Васей, либо с Петей. Действительно,  \t\t\t\tесли бы кто-то (скажем, Коля) не дружил бы ни с Васей, ни с Петей,  \t\t\t\tто мы имели бы троих учеников, среди которых не было бы друзей.  \t\t\t\tТеперь если предположить, что и Вася, и Петя имеют не более 11  \t\t\t\tдрузей, то всего в классе, кроме этих двоих было бы не больше 22  \t\t\t\tчеловек   (см. статью"
    ],
    "35344": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что если a, b, c – нечётные числа, то хотя бы одно из   чисел ab – 1, bc – 1, ca – 1  делится на 4.",
        "Подсказка: Рассмотрите остатки от деления данных чисел на 4 и воспользуйтесь принципом Дирихле.",
        "Решение: Так как числа a, b, c нечётны, то при делении на 4 они могут дать остатки 1 или 3. Следовательно, по крайней мере два из них имеют один остаток. числа. Пусть это a, b и остаток 3 (остальные случаи рассматриваются аналогично). Тогда ab – 1 = (4k + 3)(4n + 3) – 1 = 16kn + 12(k + n) + 8, что делится на 4."
    ],
    "78475": [
        "Принцип Дирихле (углы и длины)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На плоскости даны 7 прямых, никакие две из которых не параллельны. Доказать,  что найдутся две из них, угол между которыми меньше 26°.",
        "Решение: Возьмём на плоскости произвольную точку A и проведём через неё 7 прямых, параллельных прямым данной системы. Углы между построенными прямыми будут равны соответствующим углам между прямыми исходной системы. Но через точку A у нас проходит 7 прямых, которые делят угол в 360° на 14 частей.   Значит, один из этих углов не больше 360° : 14 = 255/7° < 26°."
    ],
    "78552": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: 30 команд участвуют в розыгрыше первенства по футболу.   Доказать, что в любой момент состязаний имеются две команды, сыгравшие к этому моменту одинаковое число матчей.",
        "Решение: См. задачу 35512."
    ],
    "88135": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Вдоль правой стороны дороги припарковано 100 машин. Среди них – 30 красных, 20 жёлтых и 20 розовых мерседесов. Известно, что никакие два мерседеса разного цвета не стоят рядом. Докажите, что тогда какие-то три мерседеса, стоящие подряд, одного цвета.",
        "Решение: У нас есть 70 мерседесов и 30 других машин. Уберём эти 30 других. Останется не более 31 группы мерседесов, стоящих рядом. Поскольку 31&middot2 < 70, в одной из этих групп не менее 3 мерседесов. По условию все они – одного цвета."
    ],
    "98646": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: В фотоателье залетели 20 птиц – 8 скворцов, 7 трясогузок и 5 дятлов. Каждый раз, как только фотограф щелкнет затвором фотоаппарата, какая-то одна из птичек улетит (насовсем). Сколько кадров сможет сделать фотограф, чтобы быть уверенным: у него останется не меньше четырёх птиц одного вида, и не меньше трёх – другого?",
        "Решение: 8 снимков делать опасно: за это время могут улететь 3 дятла и 5 трясогузок, и как трясогузок, так и дятлов останется лишь по 2.  Покажем, что 7 снимков сделать можно. Тогда в ателье останется 20 – 7 = 13 птиц. Значит, птиц одного из видов не меньше  13 : 3, то есть не меньше 5. С другой стороны, их не больше 8, поэтому птиц двух оставшихся видов вместе не меньше 5, и, следовательно,  птиц одного из этих видов не меньше трёх.",
        "Ответ: 7 снимков."
    ],
    "32787": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Можно ли найти 57 различных двузначных чисел, чтобы сумма никаких  двух из них не равнялась 100?",
        "Решение: Предположим, что такие 57 двузначных чисел выбрать можно. Тогда из каждой пары вида (n, 100-n), где n принимает значения от 10 до 49, выбрано не более одного числа; таких пар - 40, значит, из чисел от 10 до 90 выбрано не более 41 числа (могло быть выбрано также и число 50). Остается еще 9 чисел от 91 до 99; значит, всего выбрано не более 50 чисел, но мы предположили, что выбрано 57 чисел, - противоречие. Значит, наше предположение было неверно.",
        "Ответ: Нет, нельзя."
    ],
    "34834": [
        "Принцип Дирихле (углы и длины)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Дорога протяженностью 1 км полностью освещена фонарями, причем каждый   фонарь  освещает  отрезок  дороги  длиной   1 м.   Какое   наибольшее   количество  фонарей  может  быть на дороге,  если известно,  что  после   выключения любого фонаря дорога будет освещена уже не полностью?",
        "Подсказка: Если отрезки,  освещенные n-м и   (n+2)-м фонарями,  пересекаются,  то (n+1)-й фонарь  можно  выключить.",
        "Решение: Занумеруем фонари  натуральными  числами  в   порядке  следования  вдоль  дороги.  Если отрезки,  освещенные n-м и   (n+2)-м фонарями,  пересекаются,  то (n+1)-й фонарь  можно  выключить.   Следовательно,   отрезки   с   различными   нечетными   номерами,  не   пересекаются.  На отрезке длины 1000 м нельзя расположить больше  999   непересекающихся отрезков длины 1 м. Значит, фонарей не больше 1998.    Расположим 1998   фонарей   так,   чтобы  центры  освещенных  отрезков   образовывали арифметическую  прогрессию,  первый  член  которой  равен   0,5 м,  а 1998-й равен 999,5 м. Между n-м и (n+2)-м   отрезком  остается  зазор  в  1/1997 м.  Его  освещает  только   (n+1)-й фонарь. Поэтому никакой фонарь нельзя выключить.",
        "Ответ: 1998.00"
    ],
    "32041": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2",
        "Классы: 5,6,7,8",
        "Условие: В поход пошли 20 туристов. Самому старшему из них 35 лет, а самому младшему 20 лет. Верно ли, что среди туристов есть одногодки?",
        "Решение: Возраст туриста – одно из чисел: 20, 21, 22, ..., 35 (всего 16 вариантов). А туристов больше.",
        "Ответ: Верно."
    ],
    "21978": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Несколько футбольных команд проводят турнир в один круг.   Докажите, что в любой момент турнира найдутся две команды, сыгравшие к этому моменту одинаковое число матчей.",
        "Решение: См. задачу 35512."
    ],
    "21979": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: а) Какое наибольшее число полей на доске 8×8 можно закрасить в чёрный цвет так, чтобы в каждом уголке из трёх полей было по крайней мере одно незакрашенное поле?",
        "Решение: а) Пример. 32 поля закрасить можно (например, в полоску).     Оценка. Разобъём доску на 16 квадратиков 2×2. В каждом из них можно закрасить не более двух полей (иначе получится чёрный уголок). Поэтому всего можно закрасить не более 32 полей.     б) Задача сводится к а) заменой чёрных полей на незакрашенные и наоборот.",
        "Ответ: а)-б) 32 поля."
    ],
    "21995": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Докажите, что среди любых шести человек есть либо трое попарно знакомых, либо трое попарно незнакомых.",
        "Решение: У данного человека среди остальных пяти есть либо не менее трёх знакомых, либо не менее трёх незнакомых ему. Разберём, например, первый случай. Среди этих трёх людей есть либо двое знакомых – тогда они вместе с выбранным нами исходно человеком образуют нужную тройку, либо они все трое попарно незнакомы."
    ],
    "21997": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: На складе имеется по 200 сапог 41, 42 и 43 размеров, причём среди этих 600 сапог 300 левых и 300 правых.  Докажите, что из них можно составить не менее 100 годных пар обуви.",
        "Решение: В каждом размере каких-то сапог меньше: правых или левых. Выпишем эти типы сапог по размерам. Какой-то тип, например, левый, повторится по крайней мере дважды, например, в 41 и 42 размерах. Но так как количество левых сапог в этих размерах cуммарно не меньше 100 (левых сапог 43-го размера не больше 200), то мы имеем не менее 100 годных пар обуви в этих размерах."
    ],
    "32068": [
        "Принцип Дирихле (площадь и объем)",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Квадратная площадь размером 100×100 выложена квадратными плитами 1×1 четырёх цветов: белого, красного, чёрного и серого – так, что никакие две плиты одинакового цвета не соприкасаются друг с другом (то есть не имеют общей стороны или вершины). Сколько может быть красных плит?",
        "Решение: Разобьём площадь на 2500 квадратиков 2×2, каждый из которых состоит из четырёх плит с общей вершиной. Значит, каждый из этих квадратиков может содержать не более одной красной плиты, и, тем самым, количество красных плит не может превышать 2500. То же верно и для плит других цветов, значит, плит каждого цвета ровно по 2500.",
        "Ответ: 2500 плит."
    ],
    "34851": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: В дискуссии приняли участие 15 депутатов. Каждый из них в своем выступлении   раскритиковал ровно k из оставшихся 14 депутатов.  При каком наименьшем k можно утверждать, что найдутся два депутата, которые раскритиковали друг друга?",
        "Подсказка: Рассмотрите ориентированный граф, вершины которого соответствуют депутатам, а ребро, ведущее из A в B, означает, что депутат A раскритиковал депутата B.",
        "Решение: Если каждый депутат раскритиковал 8 других, то число рёбер указанного в подсказке графа равно 15·8 = 120, что больше, чем число пар  его вершин. Это доказывает, что какие-то две вершины соединяются не менее чем двумя рёбрами, то есть найдутся два депутата, которые раскритиковали друг друга.    С другой стороны, пусть 15 депутатов сидят за круглым столом и каждый раскритиковал семь следующих за ним по часовой стрелке. Легко видеть, что при этом никакие два депутата не критиковали друг друга.",
        "Ответ: При k = 8."
    ],
    "34854": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: В последовательности цифр 1234096... каждая цифра, начиная с пятой, равна последней цифре суммы предыдущих четырёх цифр.   Встретятся ли в этой последовательности подряд четыре цифры 8123?",
        "Подсказка: Какая цифра следует за цифрами 8123?",
        "Решение: Заметим, что цифра, предшествующая четвёрке цифр, определяется этой четвёркой однозначно. Если в последовательности встретится ещё раз (не в начале   последовательности) четвёрка 1234, то цифра, предшествующая этой четвёрке, как легко убедиться, должна равняться 8, и таким образом в последовательности  встретится четвёрка 8123. Осталось доказать, что четвёрка 1234 встретится в последовательности ещё хотя бы один раз. Поскольку четвёрок цифр конечное число, в последовательности встретятся две одинаковые четвёрки цифр в разных местах. Тогда цифры, предшествующие этим четверкам, тоже одинаковы. Поэтому четвёрки, полученные из первоначальных сдвигом на одну цифру влево, тоже одинаковы. Рассуждая так и далее, мы придём к двум одинаковым четвёркам, одна из которых расположена в начале   последовательности (то есть эта четверка – 1234).",
        "Ответ: Встретятся."
    ],
    "34904": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 6,7,8,9",
        "Условие: Можно ли увезти из каменоломни 50 камней, веса которых равны 370, 372, ... , 468 кг, на семи трёхтонках?",
        "Подсказка: На какую-то трёхтонку придётся положить 8 камней.",
        "Решение: Даже восьми самых лёгких камней весят 370 + 372 + ... + 384 = 3016 кг, то есть больше 3 тонн. Поэтому на одной трёхтонке можно увезти   не более семи, а на семи трёхтонках – не более 49 камней.",
        "Ответ: Нельзя."
    ],
    "34980": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: Шарообразная планета окружена 25 точечными астероидами.   Доказать, что в любой момент на поверхности планеты найдётся  точка, из которой астроном не сможет наблюдать более 11 астероидов.",
        "Подсказка: Один астероид не может быть одновременно виден из двух диаметрально противоположных точек планеты.",
        "Решение: Проведём плоскость π через центр планеты и два произвольных астероида. Проведём через центр планеты также прямую, перпендикулярную π. Эта прямая пересечёт поверхность планеты в двух полюсах - A, B. Астрономы в точках A и B не могут видеть один и тот же астероид, а также не могут видеть два астероида, лежащие в плоскости π. Следовательно, вместе они наблюдают не более 25 – 2 = 23 астероидов. Значит, один из астрономов видит не более 11 астероидов."
    ],
    "35512": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Докажите, что в любой компании найдутся два человека, имеющие одинаковое число друзей (из этой компании).",
        "Подсказка: В компании не могут одновременно присутствовать человек, который дружит со всеми, и человек, который не дружит ни с кем.",
        "Решение: Пусть в компании n человек. Тогда у каждого человека имеется от 0 до n – 1 друзей. Таким образом, количество друзей может принимать n различных значений: 0, 1, 2, ..., n – 1. Поэтому если бы n человек имели различное число друзей, то в компании присутствовало бы по одному человеку, имеющему 0, 1, 2, ... , n – 1 друзей. С другой стороны, если есть человек, имеющий n – 1 друга, то он дружит со всеми, следовательно, нет человека, который имеет 0 друзей. Противоречие."
    ],
    "35679": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: Докажите, что найдутся двадцать москвичей, имеющих одинаковое число волос на голове.   (Известно, что у человека на голове не более 400000 волос, а в Москве не менее 8 миллионов жителей.)",
        "Подсказка: Если бы это было не так, то в Москве было бы меньше жителей.",
        "Решение: Всех москвичей разделим на 400001 группу – по числу волос. Предположим, что в каждой из этих групп не более 19 человек. Тогда всего жителей в Москве не более 19·400001 < 8000000. Противоречие."
    ],
    "35534": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Какое наибольшее число королей можно расставить на шахматной доске так, чтобы никакие два из них не били друг друга?",
        "Подсказка: Если в квадрате из четырёх клеток находятся два короля, то они бьют друг друга.",
        "Решение: Разобьём доску на 16 квадратов 2&times2.     Оценка. В каждом из этих 16 квадратов может стоять не более одного короля.     Пример. Поставим по королю в левый нижний угол каждого из 16 квадратов.",
        "Ответ: 16 королей."
    ],
    "35599": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: При установке кодового замка каждой из 26 латинских букв, расположенных на его клавиатуре, сопоставляется произвольное натуральное число, известное лишь обладателю замка. Разным буквам сопоставляются не обязательно разные числа. После набора произвольной комбинации попарно различных букв происходит суммирование числовых значений, соответствующих набранным буквам. Замок открывается, если сумма делится на 26. Докажите, что для любых числовых значений букв существует комбинация, открывающая замок.",
        "Подсказка: Докажите, что искомая комбинация может быть найдена как несколько последовательных букв алфавита.",
        "Решение: Обозначим через S(n) остаток от деления на 26 суммы чисел, которые соответствуют первым n буквам алфавита (n = 1, 2, ..., 26). Если среди чисел S(1), S(2), ..., S(26) есть нуль: S(t) = 0, то искомой ключевой комбинацией является цепочка первых t букв алфавита. Если среди чисел S(1), S(2), ..., S(26) нет нуля, то найдутся два одинаковых числа: S(k) = S(m) (считаем, что k < m). Тогда искомой ключевой комбинацией является участок алфавита,   начинающийся с (k+1)-й и заканчивающийся m-й буквой."
    ],
    "35719": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Из чисел 1, 2, ... , 49, 50 выбрали 26 чисел. Обязательно ли  среди них найдутся два числа, отличающиеся друг от друга на 1?",
        "Подсказка: Разделите все числа на пары соседних.",
        "Решение: Разделим все числа на 25 пар соседних: 1-2,  3-4, ... , 49-50.   Если бы из каждой пары было выбрано не более одного числа, то всего   было бы выбрано не более 25 чисел. Но по условию выбрано 26 чисел.   Это означает, что для какой-то пары оба числа из этой пары оказались    выбранными. Эти числа и составляют искомую пару выбранных чисел,    отличающихся на 1.",
        "Ответ: обязательно."
    ],
    "37549": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Докажите, что никакая прямая не может пересечь все три стороны треугольника (в точках, отличных от вершин).",
        "Решение: Прямая делит плоскость на две полуплоскости. По принципу Дирихле найдутся две вершины, лежащие в одной полуплоскости. Сторона, соединяющая эти вершины, не пересекает прямую."
    ],
    "53470": [
        "Принцип Дирихле (углы и длины)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что в каждом девятиугольнике есть пара диагоналей, угол между которыми меньше 7°.",
        "Подсказка: Через произвольную точку проведите 27 прямых, соответственно параллельных диагоналям данного девятиугольника.",
        "Решение: У девятиугольника 9·6 : 2 = 27 диагоналей. Через произвольную точку проведём 27 прямых, соответственно параллельных этим   диагоналям. Они разделят полный угол на 54 угла. Поэтому один из них не больше  360°/54 < 7°."
    ],
    "58080": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Узлы бесконечной клетчатой бумаги раскрашены вдва цвета. Докажите, что существуют две горизонтальные идве вертикальные прямые, на пересечении которых лежат точки одного цвета.",
        "Решение: Возьмем три вертикальные прямые идевять горизонтальных. Будем рассматривать только точки пересечения этих прямых. Так как имеется лишь 2"
    ],
    "58107": [
        "Принцип Дирихле (площадь и объем)",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: а) В квадрате площади 6 расположены три многоугольника площади 3. Докажите, что среди них найдутся два многоугольника,",
        "Решение: а) Согласно задаче 58106 а) 6 = 9 – (S12 + S23 + S13) + S123, то есть S12 + S23 + S13 = 3 + S123 ≥ 3.  Поэтому одно из чисел S12, S23, S13 не меньше 1."
    ],
    "60364": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: В волейбольном турнире команды играют друг с другом по одному матчу. За победу дается одно очко, за поражение – ноль. Известно, что в один из моментов турнира все команды имели разное количество очков. Сколько очков набрала в конце турнира предпоследняя команда, и как она сыграла с победителем?",
        "Решение: Пусть в турнире участвуют n команд. Тогда разыгрывается ½ n(n – 1) очков. Команды могли набрать разное количество очков (0, 1, ..., n – 1) лишь после окончания турнира. Поэтому предпоследняя команда набрала 1 очко и проиграла победителю.",
        "Ответ: 1 очко; проиграла."
    ],
    "64433": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: В классе 33 ученика, всем вместе 430 лет.   Докажите, что если выбрать 20 самых старших из них, то им вместе будет не меньше, чем 260 лет. (Возраст любого ученика – целое число.)",
        "Решение: Суммарный возраст старшей группы не меньше чем 20/33&middot430 = 260,6...  лет."
    ],
    "79639": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: В ковре  размером 4 х 4  метра моль  проела 15  дырок. Всегда  ли можно  вырезать  коврик  размером 1х1,  не  содержащий  внутри дырок?  (Дырки  считаются  точечными).",
        "Решение: Разобьем  ковер на 16  квадратов  размером 1х1.  Так как дырок  15, то  обязательно,  по крайней  мере, один  квадрат 1х1 не  будет иметь  дырок внутри."
    ],
    "79407": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 3",
        "Классы: 8",
        "Условие: В квадрате",
        "Решение: Проведя через центр квадрата прямые, параллельные его сторонам, разрежем  квадрат на 4 одинаковых квадрата. Какие-то 2 из 5 точек лежат в одном  из этих квадратов, и расстояние между ними не превосходит длины диагонали  этого квадрата."
    ],
    "32788": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: На поле 10 на 10 для игры в Морской Бой стоит один четырехпалубный корабль. Какое минимальное число выстрелов надо произвести, чтобы наверняка его ранить?"
    ],
    "88072": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: а) Покажите, что среди любых шести целых чисел найдутся два, разность которых  кратна 5.   б) Останетсяли это утверждение верным, если вместо разности  взять сумму?",
        "Решение: а) См. задачу 21972.",
        "Ответ: б) Не останется."
    ],
    "32789": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: На всех ребрах куба стоит по числу. На каждой грани (квадрате) пишется сумма четырех чисел, расположенных на ее ребрах (сторонах квадрата). Расставьте числа 1 и -1 на ребрах так, чтобы все числа на гранях были различны.",
        "Решение: Предположим, что нам это удалось. Тогда на каждой из граней куба стоит одно из пяти чисел: -4, -2, 0, 2 или 4. Но граней шесть, значит, на каких-то двух гранях стоит одно и то же число; противоречие. Значит, так расставить числа нельзя.",
        "Ответ: Этого сделать нельзя."
    ],
    "35151": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 9,10,11",
        "Условие: Каждая точка плоскости, имеющая целочисленные координаты,   раскрашена в один из n цветов.   Докажите, что найдется прямоугольник с вершинами в точках   одного цвета.",
        "Подсказка: Рассмотрим целые точки, расположенные в бесконечной   горизонтальной полосе. В этой полосе найдутся два одинаково    окрашенных вертикальных ряда точек.",
        "Решение: Рассмотрим полосу из n+1 подряд идущих горизонтальных рядов точек.    Рассмотрим вертикальные ряды этой полосы, состоящие из n+1 точек.     Существует лишь конечное число способов    раскрасить в n цветов n+1 точек (первую точку можно раскрасить    n способами, независимо от этого вторую точку также можно     окрасить n способами, и т.д., всего имеется    n"
    ],
    "35371": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Имеется  101 натуральное число, причем сумма этих чисел равна 200.    Докажите, что  из этих чисел всегда можно выбрать несколько чисел,    дающих в сумме 100.",
        "Подсказка: Может помочь решить задачу следующая интерпретация условия.    Пусть дана окружность длины 200, разобьем ее на 101 дугу,    длины которых равны данным числам.",
        "Решение: Пусть данные числа - a"
    ],
    "35606": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В таблице n*n отмечены некоторые 2n клеток. Докажите, что       найдется параллелограмм с вершинами в центрах отмеченных клеток.",
        "Подсказка: Докажите, что найдется параллелограмм, у которого есть пара       сторон,       параллельных строке таблицы.",
        "Решение: Докажем, что найдется параллелограмм, у которого есть       пара сторон, параллельных строке таблицы.       Рассмотрим в каждой строке самую левую из отмеченных клеток       (если там имеются отмеченные клетки).       Пусть в некоторой строке самая левая отмеченная клетка находится       на k-ом месте слева. Сдвинем тогда все отмеченные клетки этой       строки на (k-1) клетку влево, после этого самая левая отмеченная       клетка в этой строке будет находиться в самом левом столбце.       Проделаем такие сдвиги отмеченных клеток с каждой строкой, в       которой есть хотя бы одна отмеченная клетка.       От проделанных сдвигов свойство таблицы иметь 4 отмеченные       клетки в вершинах параллелограмма, сторона которого параллельна       строке таблицы не меняется. Поэтому достаточно доказать, что этим       свойством обладает уже новая таблица.       В первом столбце новой таблицы не более n отмеченных клеток.       В оставшихся (n-1) столбцах не менее n отмеченных клеток.       Тогда по"
    ],
    "35753": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: В выпуклом многоугольнике на плоскости содержится не меньше     m",
        "Подсказка: Раскрасьте целые точки плоскости в      m",
        "Решение: По принципу Дирихле среди m"
    ],
    "21988": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Докажите, что среди чисел, записываемых только единицами, есть число, которое делится на 1987.",
        "Решение: См. задачу 34968."
    ],
    "21989": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Докажите, что существует степень тройки, оканчивающаяся на 001.",
        "Решение: См. задачу 60778."
    ],
    "21999": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Докажите, что среди любых 10 целых чисел найдётся несколько, сумма которых делится на 10.",
        "Решение: См. задачу 103964."
    ],
    "22000": [
        "Принцип Дирихле (прочее)",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Дано 11 различных натуральных чисел, не больших 20. Докажите, что из них можно выбрать два числа, одно из которых делится на другое.",
        "Решение: См. задачу 60299."
    ]
}