{
    "60509": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что pn+1 ≤ 22n + 1, где pn – n-е простое число.",
        "Решение: Согласно задаче 10508 число 22n – 1 имеет n различных простых делителей, причём все они отличны от 2. Поэтому pn+1 ≤ 22n – 1 при n > 0."
    ],
    "61396": [
        "Алгебраические неравенства (прочее)",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Докажите, что для любых натуральных m и n хотя бы одно из чисел ,  не больше .",
        "Решение: Если n ≥ m, то    Поэтому достаточно доказать, что    то есть что 3n ≥ n3.  Докажем это по индукции.    База: 31 > 1³, 3² > 2³, 3³ = 3³.     Шаг индукции. 3n+1 = 3·3n ≥ 3n³ > (n + 1)³, поскольку    при n ≥ 3."
    ],
    "64482": [
        "Примеры и контрпримеры. Конструкции",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Существует ли такое значение α, что все члены бесконечной последовательности cos α, cos 2α, ..., cos(2nα), ... принимают отрицательные значения?",
        "Решение: Пусть, например, α = 2π/3, тогда cos α = cos 2π/3 = – ½. Далее можно рассуждать по-разному.",
        "Ответ: Существует."
    ],
    "78251": [
        "Числа Фибоначчи",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Дана последовательность чисел F1, F2, ...; F1 = F2 = 1 и   Fn+2 = Fn + Fn+1. Доказать, что F5k делится на 5 при k = 1, 2, ... .",
        "Решение: Индукция по k. База: F5 = 5.     Шаг индукции. F5k+2 ≡ F5k+1 (mod F5k), F5k+3 ≡ 2F5k+2 (mod F5k), F5k+4 ≡ 3F5k+1 (mod F5k), F5k+5 ≡ 5F5k+1 (mod F5k). По предположению индукции F5k делится на 5. Значит, и F5k+5 делится на 5."
    ],
    "78267": [
        "Арифметика остатков (прочее)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: a, b, p – любые целые числа. Доказать, что найдутся такие взаимно простые k, l, что ak + bl делится на p.",
        "Решение: Поскольку можно поменять знак у чисел k и l, можно  считать, что a ≥ 0 и b ≥ 0.     Докажем утверждение индукцией по a + b. Случай, когда a = 0 либо b = 0, очевиден.     Шаг индукции. Пусть 0 < b ≤ a. В силу предположения индукции найдутся такие взаимно простые числа m и n, что (a – b)m + bn делится на p, а значит,  am + b(n – m) делится на p. Поскольку m и n взаимно просты, то и m и n – m взаимно просты."
    ],
    "78667": [
        "Алгебраические неравенства (прочее)",
        "Сложность: 3+",
        "Классы: 11",
        "Условие: По заданной последовательности положительных чисел q1,..., qn, ... строится последовательность многочленов следующим образом:      f0(x) = 1,      f1(x) = x,       ...      fn+1(x) = (1 + qn)xfn(x) – qnfn–1(x).   Докажите, что все вещественные корни n-го многочлена заключены между –1 и  1.",
        "Решение: Докажем индукцией по n, что если |x| > 1, то | fn+1(x)| > |fn(x)|. При n = 0 это очевидно.     Шаг индукции. Если |x| > 1, то   | fn+1(x)| ≥ (1 + qn)|xfn(x)| – qn|fn–1(x)| > (1 + qn)| fn(x)| – qn|fn–1(x)| > | fn(x)|.     Таким образом, если |x| > 1, то | fn(x)| > 1, поэтому fn(x) ≠ 0."
    ],
    "97933": [
        "Примеры и контрпримеры. Конструкции",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Имеется много кубиков одинакового размера, раскрашенных в шесть цветов. При  этом каждый кубик раскрашен во все шесть цветов, каждая грань – в какой-нибудь один свой цвет, но расположение цветов на разных кубиках может быть различным. Кубики выложены на стол, так что получился прямоугольник. Разрешается взять любой столбец этого прямоугольника, повернуть его вокруг длинной оси и положить на место. То же самое разрешается делать и со строками. Всегда ли можно с  помощью таких операций добиться того, что все кубики будут смотреть вверх  гранями одного и того же цвета?",
        "Решение: Пусть φ – поворот на 90° некоторой строки, ψ – некоторого столбца. Коммутаторы φψφ–1ψ–1 и ψφψ–1φ–1 поворачивают только кубик, лежащий в их пересечении, возвращая все остальные кубики в исходное положение. Теперь ясно, как каждый кубик поворачивать произвольно, независимо от остальных.",
        "Ответ: Всегда."
    ],
    "77996": [
        "Индукция в геометрии",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Даны два выпуклых многоугольника",
        "Решение: Ответ:",
        "Ответ: n"
    ],
    "35104": [
        "Плоскость, разрезанная прямыми",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На плоскости проведено несколько прямых (не менее трех),   никакие две из которых не   параллельны и никакие три не проходят через одну точку.   Докажите, что среди частей, на которые они разбивают плоскость,   найдется хотя бы один треугольник.",
        "Подсказка: Рассмотрите некоторую прямую и точку пересечения двух других  прямых, расположенную ближе всего к выбранной прямой.",
        "Решение: Рассмотрим некоторую прямую l и точку пересечения A двух других  прямых k и m, расположенную ближе всего к выбранной прямой  среди всех попарных точек пересечения данных прямых (отличных от l).  Пусть прямые k и m пересекают прямую l в точках B и C  соответственно. Докажем, что треугольник ABC является одной из  частей, на которые плоскость разбита прямыми. Предположим  противное. Тогда некоторая прямая из данного множества прямых  пересекает треугольник ABC. Следовательно,  эта прямая пересекает две  стороны треугольника ABC, т.е. пересекает хотя бы одну из сторон  AB, AC. Пусть K - точка пересечения этой прямой  с одной из сторон AB, AC. Тогда расстояние от точки K до прямой l  меньше расстояния от точки A до прямой l вопреки выбору точки A.  Итак, найден искомый треугольник ABC."
    ],
    "78286": [
        "Числа Фибоначчи",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Доказать, что любое натуральное число можно представить в виде суммы нескольких различных членов последовательности 1, 2, 3, 5, 8, 13, ...,",
        "Решение: Докажем требуемое утверждение по индукции. База индукции очевидна.  Последовательность {"
    ],
    "78674": [
        "Примеры и контрпримеры. Конструкции",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: Разобьём все натуральные числа на группы так, чтобы в первой группе было одно число, во второй — два, в третьей — три и т.д. Можно ли это сделать таким образом, чтобы из суммы чисел в каждой группе нацело извлекался корень седьмой степени?",
        "Решение: Будем строить эти группы поочерёдно. Впервую группу отнесём только число1.  Вовторую группу отнесём числа2 и2",
        "Ответ: Можно."
    ],
    "78704": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 11",
        "Условие: Колода перфокарт четырёх цветов разложена в один ряд. Если две перфокарты одного цвета лежат рядом или через одну, то можно выбрасывать ту из них, которая левее. Кроме того, можно подкладывать справа любое количество перфокарт из других колод. Доказать, что можно подкладывать и выбрасывать перфокарты таким образом, чтобы в конце концов их осталось только четыре.",
        "Решение: Покажем, что если вколоде лежат перфокарты"
    ],
    "88306": [
        "Инварианты",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: На доске написаны числа 1, 2, 3, …, 20. Разрешается стереть любые два числа",
        "Решение: Заметим что  имеет место равенство",
        "Ответ: 21! − 1."
    ],
    "76431": [
        "Суммы числовых последовательностей и ряды разностей",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Найти сумму",
        "Решение: Индукцией по"
    ],
    "30825": [
        "Ориентированные графы",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В некоторой стране каждый город соединён с каждым дорогой с односторонним движением.   Докажите, что найдётся город, из которого можно добраться в любой другой.",
        "Решение: Индукция по числу городов. База очевидна.     Шаг индукции. Удалим один из городов. В силу предположения индукции есть город А с требуемым свойством.  Вспомним теперь про удалённый город. Если в него ведёт хотя бы одна дорога, то город А – искомый. В противном случае сам удалённый город удовлетворяет требуемому свойству."
    ],
    "35538": [
        "Покрытия",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Несколько отрезков покрывают отрезок [0, 1].   Докажите, что среди них можно выбрать несколько непересекающихся отрезков, сумма длин которых не меньше ½.",
        "Подсказка: Начните выбрасывать отрезки, которые покрываются другими отрезками.",
        "Решение: Используем индукцию по числу отрезков, покрывающих отрезок [0, 1].       База. Для покрытия одним отрезком утверждение очевидно.     Шаг индукции. Пусть отрезок [0, 1] покрыт n + 1 отрезком. Если среди них имеется отрезок, который покрыт остальными, то выкинем его из покрытия и воспользуемся предположением индукции.      Пусть таких отрезков нет. Обозначим отрезки Ii = [ai, bi] так, что a1 <  a2 < ... < an. Тогда bi < bi+1 для каждого i. С другой стороны, bi < ai+2, иначе отрезки Ii и Ii+2 покрывали бы отрезок Ii+1. Значит, отрезки с нечётными номерами попарно не  пересекаются, как и отрезки с чётными номерами. Поскольку все отрезки образуют покрытие отрезка [0, 1], либо сумма длин отрезков с чётными номерами, либо сумма длин отрезков с нечётными номерами не меньше ½. Тем самым найдена искомая система непересекающихся отрезков."
    ],
    "60741": [
        "Малая теорема Ферма",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: С помощью индукции докажите следующее утверждение, эквивалентное малой теореме Ферма: если  p – простое число, то для любого натурального a справедливо сравнение ap ≡ a (mod p).",
        "Решение: При a = 0 утверждение очевидно. Предположим, что оно  доказано для некоторого a ≥ 0. Из задачи 60668 следует, что   (a + 1)p ≡ ap + 1 (mod p). Применяя предположение индукции, приходим к нужному сравнению."
    ],
    "61453": [
        "Арифметика остатков (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Докажите, что при всех натуральных n число  f (n) = 22n–1 – 9n² + 21n – 14  делится на 27.",
        "Решение: 22n–1 + 1 = 3(22n–2 – 22n–3 + 22n–4 – ... – 2 + 1) = 3(22n–3 + 22n–5 + ... + 2) + 3, поэтому достаточно доказать, что   22n–3 + 22n–5 + ... + 2 ≡ 3n² – 7n + 2 ≡ 3n² + 2n + 2 (mod 9), или что (22n–3 + 1) + (22n–5 + 1) + ... + (2 + 1) ≡ 3n² + 3n + 3 (mod 9).     Сокращая на 3, получим (22n–4 – 22n–5 + ... + 1) + (22n–6 – 22n–7 + ... + 1) + ... + 1 ≡ n² + n + 1 ≡ (n – 1)² (mod 3).     Заменив в левой части 2 на –1, получим (2n – 3) + (2n – 5) + ... + 1 = (n – 1)²."
    ],
    "78160": [
        "Угол (экстремальные свойства)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Провести из точки",
        "Решение: Существует множество способов провести лучи так, чтобы добиться максимальной суммы углов. Например, такой. Если"
    ],
    "78616": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Доказать, что существует число",
        "Решение: Докажем индукцией по"
    ],
    "79480": [
        "Уравнения в целых числах",
        "Сложность: 4",
        "Классы: 10",
        "Условие: Доказать, что любое число 2n, где n = 3, 4, 5, ... можно представить в виде 7x² + y², где x и y – нечётные числа.",
        "Решение: Докажем это по индукции. База (n = 3). 2³ =7·1² + 1².     Шаг индукции. Пусть 2n = 7x² + y², х и у нечётны. Рассмотрим две пары чисел: (½ (x – y), ½ (7x + y)) и (½ (х + у), ½ (7x − у)). Для каждой пары усемерённый квадрат первого числа плюс квадрат второго даёт 2n+1. Остаётся заметить, что в каждой паре стоят числа одной чётности, а в разных – разной чётности, поэтому числа одной из пар нечётны."
    ],
    "60303": [
        "Индукция (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Докажите неравенство для натуральных n > 1:",
        "Решение: При n = 2, 3 неравенство проверяется непосредственно, а при n > 3"
    ],
    "78533": [
        "Обратный ход",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: В",
        "Решение: Ответ: при",
        "Ответ: n="
    ],
    "30827": [
        "Ориентированные графы",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В одном государстве 100 городов и каждый соединён с каждым дорогой с односторонним движением. Докажите, что можно поменять направление движения не более чем на одной дороге так, чтобы от каждого города можно было доехать до любого другого.",
        "Решение: Докажем по индукции, что утверждение верно для любого числа n городов, большего 2.     База – для трёх городов – очевидна.     Шаг индукции. Удалим город A, имеющий и входящие и выходящие дороги (такой найдётся, так как городов, из которых дороги только выходят, не больше одного; аналогично для городов, в которые дороги только входят). По предположению индукции в оставшемся графе можно добиться требуемого, поменяв направление не более чем одной дороги. Присоединение города A и соответствующих дорог сохраняет это свойство."
    ],
    "30908": [
        "Алгебраические неравенства (прочее)",
        "Сложность: 4",
        "Классы: 6,7",
        "Условие: Сумма положительных чисел x1, x2, ..., xn равна ½. Докажите, что",
        "Решение: Докажем по индукции более общее утверждение: если сумма положительных чисел x1, x2, ..., xn равна s < 1, то"
    ],
    "35222": [
        "Степень вершины",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На плоскости нарисовано несколько точек, некоторые пары точек соединены отрезками. Известно, что из каждой точки выходит не более k отрезков. Докажите, что точки можно покрасить в k + 1 цвет таким образом, чтобы каждые две точки, соединенные отрезком, были покрашены в разные цвета.",
        "Подсказка: Используйте индукцию по числу точек.",
        "Решение: Индукция по числу точек. База: для одной точки утверждение очевидно.     Шаг индукции. Пусть на плоскости нарисовано n + 1 точек, некоторые пары из которых соединены отрезками. Рассмотрим одну из точек - A. На время забудем про неё и про выходящие из неё отрезки. По предположению индукции оставшиеся n точек можно покрасить в k + 1 цвет таким образом, чтобы каждые две точки, соединённые отрезком, были покрашены в разные цвета. Покрасим эти n точек нужным образом. Вспомним про точку A. Она соединена отрезками  не более, чем с k точками. Поскольку цветов k + 1, покрасим  точку A в цвет, отличный от цветов точек, с которыми она соединена. Тем самым, получена требуемая раскраска точек."
    ],
    "60836": [
        "Арифметика остатков (прочее)",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: а) Трёхзначное число 625 обладает своеобразным свойством самовоспроизводимости, как то: 625² = 390625. БикЮ  Сколько четырёхзначных чисел удовлетворяют уравнению x² ≡ x (mod 10000)?     б) Докажите, что при любом k существует ровно четыре набора из k  цифр – 0...0, 0...01 и ещё два, оканчивающиеся пятеркой и шестёркой, – обладающие таким свойством: если натуральное число оканчивается одним из этих наборов цифр, то его квадрат оканчивается тем же набором цифр.",
        "Решение: См. задачу 73604.",
        "Ответ: а) Одно: 9376."
    ],
    "60312": [
        "Индукция (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Для каких n выполняются неравенства:  а) n! > 2n;  б) 2n > n².",
        "Решение: а) При n > 3  n! = 1·2·3·4·5·...·n > 1·2·2·2²·2·...·2 = 2n.",
        "Ответ: Для  а) n > 3;  б) n = 1 и n > 4."
    ],
    "65310": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: В автобусе n мест, и все билеты проданы n пассажирам. Первым в автобус заходит Рассеянный Учёный и, не посмотрев на билет, занимает первое попавшееся место. Далее пассажиры входят по одному. Если вошедший видит, что его место свободно, он занимает свое место. Если же место занято, то вошедший занимает первое попавшееся свободное место. Найдите вероятность того, что пассажир, вошедший последним, займет место согласно своему билету?",
        "Решение: Пронумеруем всех пассажиров, начиная с Учёного, в том порядке, в каком они заходили в автобус. Последний пассажир имеет номер n. Для простоты места пронумеруем так же. Пусть все, кроме последнего пассажира, уже вошли и заняли места. Осталось одно свободное место. Если бы это было второе место, то второй пассажир (или Учёный) уже занял бы его. То же верно для мест номерами 3, 4, 5, ..., n – 1. Значит, это место принадлежит либо последнему пассажиру, либо Рассеянному Учёному.     Ясно, что оно с равными шансами может принадлежать как первому, так и последнему. В первом случае последний пассажир сядет не на своё место, а во втором – на своё. Значит, вероятности обоих событий равны ½.",
        "Ответ: ½."
    ],
    "73604": [
        "Арифметика остатков (прочее)",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Число 76 обладает таким любопытным свойством: последние две цифры числа 76² = 5776 – это снова 76.     а) Есть ли ещё такие двузначные числа?     б) Найдите все такие трёхзначные числа A, что последние три цифры числа A² составляют число А.    в) Существует ли такая бесконечная последовательность цифр a1, a2, a3, ..., что для любого натурального n квадрат числа anan–1...a2a1 оканчивается на эти же n цифр? Очевидный ответ a1 = 1 и 0 = a2 = a3 = ... мы исключаем.",
        "Решение: а) Если A² оканчивается теми же двумя цифрами, что и A, то A² – A = A(A – 1) делится на 100 = 25·4, а поскольку числа A и A – 1 взаимно просты, то одно из них должно делиться на 25, а другое – на 4. Попробуем, подходит ли каждое из чисел 25, 50 и 75 на роль A или на роль A – 1 (оба эти числа двузначны). Для этого нужно лишь проверить, какие из соседних с ними чисел делятся на 4. Это будут только 76 и 24, поэтому A может равняться только 25 и 76.",
        "Ответ: а) Есть; б) 376 и 625; в) существует."
    ],
    "78272": [
        "Рекуррентные соотношения",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Дан произвольный набор из +1 и -1 длиной 2",
        "Решение: Рассмотрим несколько первых шагов исследуемого процесса. Исходный набор:"
    ],
    "78624": [
        "Примеры и контрпримеры. Конструкции",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Дана последовательность целых положительных чисел",
        "Решение: Обозначим через",
        "Ответ: L"
    ],
    "79330": [
        "Числовые таблицы и их свойства",
        "Сложность: 4",
        "Классы: 11",
        "Условие: В клетках таблицы размером 10×20 расставлено 200 различных чисел. В  каждой строчке отмечены три наибольших числа красным цветом, а в каждом столбце  отмечены три наибольших числа синим цветом. Доказать, что не менее девяти чисел  отмечены в таблице как красным, так и синим цветом.",
        "Решение: См. задачу 73615."
    ],
    "79440": [
        "Арифметика остатков (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Доказать, что 4m − 4n делится на 3k+1 тогда и только тогда, когда m − n делится на 3k.",
        "Решение: Пусть для определённости m > n. Число 4m − 4n = 4n(4m–n − 1) делится на 3k+1 тогда и только тогда, когда 4m–n − 1 делится на 3k+1. Докажем индукцией по k, что наименьшее натуральное число a, для которого 4a − 1 делится на 3k+1, равно 3k; при этом 4a − 1 не делится на 3k+2.     База (k = 1) проверяется непосредственно.     Шаг индукции. Предположим, что 4b − 1 делится на 3k+2. Тогда, в частности, 4b − 1 делится на 3k+1. Представим число b в виде b = 3kc + r, где   0 ≤ r < 3k. Тогда 4b ≡ 4r (mod 3k+1), поэтому r = 0. Таким образом, 4b − 1 = 43kc − 1 = (43k − 1)(43k(c–1) + 43k(c–2) + ... + 1).     По предположению индукции число 43k – 1 делится на 3k+1 и не делится на 3k+2. Поэтому 43k + 1 не делится на 3. Ясно, что 43k·2 + 43k + 1 делится на 3 и не делится на 9 (при делении на 9 это число даёт остаток 3), поэтому минимальное c = 3."
    ],
    "79482": [
        "Теория алгоритмов (прочее)",
        "Сложность: 4",
        "Классы: 11",
        "Условие: Назовём сложностью данного числа наименьшую длину числовой  последовательности (если такая найдётся), которая начинается с нуля и  заканчивается этим числом, причём каждый следующий член последовательности  либо равен половине предыдущего, либо в сумме с предыдущим составляет 1.  Среди всех чисел вида",
        "Решение: Ответ:",
        "Ответ: 51"
    ],
    "98651": [
        "Индукция (прочее)",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Любую ли сумму из целого числа рублей больше семи, можно уплатить без сдачи денежными купюрами по 3 и 5 рублей?",
        "Решение: Если эта сумма кратна 3 (наименьшее возможное число 9), используем только 3-рублевые купюры. Если при делении на 3 она даёт остаток 1 (наименьшее возможное число 10), то берём две 5-рублевые купюры, остальное доплачиваем 3-рублевыми. Если же при делении на 3 сумма даёт остаток 2 (наименьшее возможное число 8), то берём одну 5-рублевую купюру, остальное доплачиваем 3-рублевыми.",
        "Ответ: Любую."
    ],
    "35406": [
        "Деление с остатком",
        "Сложность: 4+",
        "Классы: 8,9,10",
        "Условие: Дано n целых чисел, каждое из которых взаимно просто с n. Также дано неотрицательное целое число r < n.   Докажите, что среди данных n чисел можно выбрать несколько чисел, сумма которых дает остаток r при делении на n.",
        "Подсказка: Доказывайте следующее более общее утверждение: если дано k (0 < k < n + 1) чисел, взаимно простых с n, то среди сумм некоторых из этих k чисел встретится не менее k остатков от деления на n.",
        "Решение: Утверждение задачи следует из более общего утверждения: если дано k (0 < k ≥ n) чисел, взаимно простых с n, то среди сумм некоторых из этих k чисел встретится не менее k остатков от деления на n. Последнее утверждение докажем индукцией по k. База (k = 1) очевидна.     Шаг индукции. Пусть даны числа a0, a1, a2, ..., ak (k + 1 ≤ n), взаимно простые с n. По предположению индукции среди сумм некоторых из чисел a1, a2, ..., ak встретится не менее k различных остатков от деления на n; пусть R – множество этих остатков. Если R в более k элементов, то все уже доказано. Пусть в R ровно k элементов и среди сумм некоторых из чисел a0, a1, a2, ..., ak встречаются только остатки из множества R. Рассмотрим сумму S некоторых из чисел a1, a2, ..., ak, дающую остаток r ∈ R от деления на n. Тогда сумма S + a0 снова даёт некоторый остаток r' ∈ R. Отсюда следует, что для любого остатка r ∈ R остаток числа r + a0 также принадлежит R. Значит, остатки всех чисел r, r + a0, r + 2a0, ..., r + (n – 1)a0 принадлежат множеству R, состоящему из k < n остатков. Однако, выписанные числа дают различные остатки от деления на n. Действительно, разность (r + ka0) – (r + ma0) = (k – m)a0 не делится на n, так как 0 < |k – m| < n, а (a0, n) = 1. Противоречие."
    ],
    "35235": [
        "Индукция (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Найдите все натуральные n, для которых 2n ≤ n².",
        "Подсказка: Показательная функция растет быстрее квадратичной. Пользуясь индукцией по n, покажите, что при n > 4 выполнено 2n > n².",
        "Решение: Непосредственная проверка показывает, что значения n = 2, 3, 4 подходят, а n = 1 – нет.     Докажем индукцией по n, что 2n > n² при n > 4. База (n = 5) очевидна.     Шаг индукции. 2n+1 = 2·2n > 2n² > (n + 1)². В самом деле, 2n2 – (n + 1)² = (n² – 2n + 1) – 2 = (n – 1)² – 2 > 0 при n > 4.",
        "Ответ: 2, 3, 4."
    ],
    "61474": [
        "Линейные рекуррентные соотношения",
        "Сложность: 4+",
        "Классы: 10,11",
        "Условие: Лягушка прыгает по вершинам шестиугольника ABCDEF, каждый раз перемещаясь в одну из соседних вершин.    а) Сколькими способами она может попасть из A в C за n прыжков?    б) Тот же вопрос, но при условии, что ей нельзя прыгать в D?  Лягушка-сапер.    в) Пусть путь лягушки начинается в вершине A, а в вершине D находится мина. Каждую секунду она делает очередной прыжок. Какова вероятность того, что она еще будет жива через n секунд?    г)* Какова средняя продолжительность жизни таких лягушек?",
        "Решение: а) Ясно, что после чётного числа прыжков лягушка может находиться только в вершинах A, C или E. Обозначим через ak, ck, ek число путей длины 2k, ведущих из A в A, C и E соответственно. В силу симметрии ck = ek. Легко видеть, что выполняются равенства  ck+1 = ak + 3ck,  ak+1 = 2ak + 2ck.      Отсюда  ck+2 = ak+1 + 3ck+1 = 2ak + 2ck + 3ck+1 = 2(ck+1 – 3ck) + 2ck + 3ck+1 = 5ck+1 – 4ck.     Из начальных условий  c0 = 0, c1 = 1, находим  ck = 1/3 (4k – 1)  (это нетрудно доказать по индукции).",
        "Ответ: а) 1/3 (2n – 1) способами при чётном n; нельзя попасть при нечётном n.    б) 3n/2–1 способами при чётном n; нельзя попасть при нечётном n.  в) (¾)k–1 при n = 2k – 1 и при n = 2k (k ≥ 1).    г) 9 секунд."
    ],
    "116396": [
        "Арифметика остатков (прочее)",
        "Сложность: 4+",
        "Классы: 10,11",
        "Условие: Докажите, что при n > 1 число  11 + 3³ + ... + (2n – 1)2n – 1  делится на 2n, но не делится на 2n+1.",
        "Решение: Лемма 1.  k2n ≡ 1 (mod 2n+2) для каждого нечётного числа k.    Доказательство.  k2n – 1 = (k – 1)(k + 1)(k² + 1)(k4 + 1)...(k2n–1 + 1)  – произведение n + 1 чётных множителей. Вдобавок один из первых двух множителей делится на 4."
    ],
    "58201": [
        "Вспомогательная раскраска (прочее)",
        "Сложность: 4+",
        "Классы: 7,8,9",
        "Условие: Несколько кругов одного радиуса положили на  стол так, что никакие два не перекрываются. Докажите, что  круги можно раскрасить вчетыре цвета так, что любые  два касающихся круга будут разного цвета.",
        "Решение: Доказательство проведем индукцией по числу кругов"
    ],
    "76515": [
        "Тождественные преобразования (тригонометрия)",
        "Сложность: 4+",
        "Классы: 9,10,11",
        "Условие: Некоторые из чисел",
        "Решение: Применим индукцию по"
    ],
    "77960": [
        "Плоскость, разрезанная прямыми",
        "Сложность: 4+",
        "Классы: 8,9",
        "Условие: 99 прямых разбивают плоскость на",
        "Решение: Индукцией по"
    ],
    "78609": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 4+",
        "Классы: 8,9,10",
        "Условие: В квадрате расположено",
        "Решение: Данное решение предполагает, что точкам не разрешается лежать на границе квадрата и на границах треугольников. Если же предполагать, что могут, то решение  останется тем же, за исключением случая",
        "Ответ: 3, если"
    ],
    "108407": [
        "Процессы и операции",
        "Сложность: 4+",
        "Классы: 7,8,9",
        "Условие: Среди 300 учеников одной математической школы некоторые путают лево и право, некоторые не путают, а некоторые делают все наоборот, чем им говорят. Первого сентября всех учеников выстроили в одну шеренгу (плечом к плечу) и скомандовали нале-во! По этой команде все одновременно повернулись на 90°,  кто налево, а кто направо. Ровно через секунду каждый, кто оказался лицом к лицу к соседу, понимает, что не прав, и поворачивается кругом (на 180°). Как долго это может продолжаться?",
        "Ответ: 299 секунд."
    ],
    "111713": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 4+",
        "Классы: 8,9,10",
        "Условие: а) Докажите, что при",
        "Решение: а) При"
    ],
    "35368": [
        "Теория алгоритмов (прочее)",
        "Сложность: 5",
        "Классы: 9,10,11",
        "Условие: Лабиринтом называется клетчатый квадрат     10*10, некоторые пары соседних узлов в     котором соединены отрезком - стеной таким образом, что     переходя из клетки в соседнюю по стороне клетку и не проходя через     стены, можно посетить все     клетки квадрата. Границу квадрата будем также считать обнесенной     стеной.    В некоторой клетке некоторого лабиринта стоит робот.    Он понимает 4 команды - Л, П, В, Н, по которым соответственно    идет влево, вправо, вверх и вниз, а если перед ним стена, то стоит    на месте. Как написать программу для робота, выполняя которую он    обойдет все клетки независимо от лабиринта и от своего начального    положения?",
        "Подсказка: Перенумеруем все начальные состояния (определяемые лабиринтом и начальным    положением робота). Для каждого состояния напишем программу,    являющуюся продолжением программы для предыдущего состояния.",
        "Решение: Рассмотрим все начальные состояния.    Каждое состояние определяется лабиринтом и начальным    положением робота в этом лабиринте. Тем самым, состояний всего    конечное число. Занумеруем состояния числами 1,2,...,N.    Нетрудно написать программу П"
    ],
    "60279": [
        "Индукция (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Даны  натуральные числа x1, ..., xn. Докажите, что число  можно представить в виде суммы квадратов двух целых чисел.",
        "Подсказка: Утверждение немедленно следует из того, что произведение двух сумм двух квадратов является суммой двух квадратов (см. задачу 61078)."
    ],
    "78597": [
        "Рекуррентные соотношения (прочее)",
        "Сложность: 5",
        "Классы: 9,10,11",
        "Условие: Дано:",
        "Решение: Докажем по индукции, что начальный отрезок нашей последовательности равен",
        "Ответ: 1024"
    ],
    "35557": [
        "Разрезания (прочее)",
        "Сложность: 5",
        "Классы: 10,11",
        "Условие: На прямоугольном столе лежат равные картонные квадраты k    различных цветов со сторонами, параллельными сторонам стола. Если рассмотреть    любые k квадратов различных цветов, то какие-нибудь два из них    можно прибить к столу одним гвоздем.     Докажите, что все квадраты некоторого цвета    можно прибить к столу 2k-2 гвоздями.",
        "Подсказка: Ведите индукцию по кличеству цветов.",
        "Решение: Докажем утверждение задачи индукцией по количеству цветов n.        База для n=2. Рассмотрим самый левый квадрат K.    Если он первого цвета, то все квадраты второго цвета имеют с ним общую    точку, следовательно, каждый квадрат второго цвета содержит одну из двух    правых вершин квадрата K, следовательно, все квадраты второй системы    можно прибить двумя гвоздями.        Индукционный переход.    Пусть мы доказали утверждение задачи для n цветов, докажем для    (n+1)-го цвета. Рассмотрим все квадраты и выберем из них самый левый    квадрат K. Пусть он покрашен в (n+1)-ый цвет. Все квадраты, пересекающие    K, содержат одну из двух его правых вершин, следовательно, их можно    прибить двумя гвоздями. Уберем со стола все квадраты (n+1)-го цвета и    квадраты других цветов, пересекающие K.    Остались квадраты n различных цветов. Нетрудно доказать, что если выбрать    n квадратов разных цветов, то среди них найдутся два пересекающихся.    (Иначе, добавим квадрат K и получим n+1 попарно не пересекающихся    квадратов разных цветов, что противоречит условию задачи.)    Таким образом, по индукционному предположению, можно выбрать один из цветов    i и прибить 2k-2 гвоздями все оставшиеся на столе квадраты этого цвета.    Убранные квадраты цвета i пересекают самый левый квадрат K,    следовательно, эти квадраты можно прибить, забив два гвоздя в правые    вершины квадрата K."
    ],
    "64857": [
        "Теория игр (прочее)",
        "Сложность: 5",
        "Классы: 9,10,11",
        "Условие: В некотором государстве ценятся золотой и платиновый песок. Золото можно менять на платину, а платину на золото по курсу, который определяется натуральными числами g и p так: x граммов золотого песка равноценны y граммам платинового, если xp = yg (числа x и y могут быть нецелыми). Сейчас у банкира есть по килограмму золотого и платинового песка, а g = p = 1001. Государство обещает каждый день уменьшать одно из чисел g и p на единицу, так что через 2000 дней они оба станут единицами; но последовательность уменьшений неизвестна. Может ли банкир каждый день менять песок так, чтобы в конце гарантированно получить хотя бы по 2 кг каждого песка?",
        "Решение: Докажем, что если вначале у банкира по 1 кг песка, и g = p = k, то в конце хотя бы одного песка будет не больше 2 – 1/k кг. Для этого достаточно доказать, что если вначале у банкира по    кг песка, то в конце он не может получить каждого песка больше чем по килограмму.     Назовём состоянием банкира число S = Gp + Pg,  если у него G кг золота и P кг платины. Заметим, что в результате обмена песка по курсу состояние не меняется. Покажем индукцией по числу дней, что наибольшее гарантированное состояние банкира в день, когда курсы равны g и p, не превосходит    В начальный день это так.     Пусть в некоторый день это так. Ясно, что при этом либо    либо    (Оба неравенство выполнены одновременно только в случае, когда оба превращаются в равенства.)     Пусть выполнено первое неравенство, то есть    Тогда государство уменьшит p на 1 (случай g > p = 1 будет разобран ниже). При этом из состояния вычтется G, то есть оно станет равно",
        "Ответ: Не может."
    ],
    "60281": [
        "Индукция (прочее)",
        "Сложность: 2",
        "Классы: 7,8,9",
        "Условие: Докажите тождество: 1 + 3 + 5 +...+ (2"
    ],
    "78045": [
        "Турниры и турнирные таблицы",
        "Сложность: 5",
        "Классы: 10,11",
        "Условие: В турнире собираются принять участие 25 шахматистов. Все они играют в разную  силу, и при встрече всегда побеждает сильнейший.   Какое наименьшее число партий требуется, чтобы определить двух сильнейших игроков?",
        "Решение: Пример. Устроим турнир по олимпийской системе в пять туров: сначала сыграют 12 пар, потом 6, потом 3. Останется четыре человека, сыграют две пары, а потом победители между собой. Тем самым определится сильнейший. Он сыграл не более пяти партий.     Так как выбыло 24 человека, было сыграно ровно 24 партии. Из пяти (или менее) участников, проигравших сильнейшему, снова по олимпийской системе выделим сильнейшего. На это потребуется не более четырёх партий. Итак, 28 партий достаточно.    Оценка. Проведём турнир по какой-то схеме, позволяющей определить двух сильнейших. Ясно, что все участники, кроме самого сильного, проиграли хотя бы по одной партии (иначе сильнейшего определить нельзя).     Можно считать, что все партии играются последовательно. На каждом шаге работы алгоритма будем называть лидером участника, который пока никому не проиграл. Пусть выполнены условия:      (1) при игре лидера с не лидером всегда выигрывает лидер;      (2) при сравнении двух лидеров выигрывает тот, у кого было больше выигрышей (если выигрышей было поровну, то результат произвольный.     Такие исходы партий возможны потому, что на лидера нет никаких ограничений сверху: если его силу увеличить, то результаты предыдущих партий не изменятся.     Введём понятие подчинения лидеру. Первоначально все участники подчинены только самим себе. После партии типа (2) проигравший и все его подчинённые переподчиняются новому лидеру.     Покажем индукцией по k, что если лидер выиграл k партий, то ему подчинено (вместе с ним самим) не более 2k участников. При k = 0 лидеру подчинён только он сам.     Пусть лидер, выигравший k партий, выигрывает у кого-то в очередной раз. Тот, у кого он выиграл, выиграл не более k партий. Поэтому как выигравшему, так и проигравшему, подчинено не более 2k участников; при объединении этих двух групп получается не более 2k+1 шахматистов.     Итак, при таком течении турнира сильнейший участник выиграл не менее пяти партий, поскольку ему в итоге будут подчинены 25 > 24 участников. Среди пяти шахматистов, проигравших сильнейшему, есть только один, который больше никому не проиграл (иначе мы не будем знать второго по силе участника). Каждый из четырёх остальных проиграл не менее двух партий. Следовательно, всего было не менее 24 + 4 = 28 проигрышей, а значит,  было сыграно не менее 28 партий.",
        "Ответ: 28 партий."
    ],
    "78803": [
        "Десятичная система счисления",
        "Сложность: 5",
        "Классы: 10,11",
        "Условие: Доказать, что сумма цифр числа",
        "Решение: Обозначим сумму цифр числа"
    ],
    "79371": [
        "Математическая логика (прочее)",
        "Сложность: 5+",
        "Классы: 10,11",
        "Условие: На химической конференции присутствовало",
        "Решение: См. решение задачи"
    ],
    "79367": [
        "Математическая логика (прочее)",
        "Сложность: 6",
        "Классы: 9,10,11",
        "Условие: На химической конференции присутствовало",
        "Решение: Приводимое решение дает возможность выяснить, кто— химик, а кто— алхимик, даже за меньшее, чем 2"
    ],
    "61473": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 3",
        "Классы: 9,10,11",
        "Условие: Лягушка прыгает по вершинам треугольника ABC, перемещаясь каждый раз в одну из соседних вершин.   Сколькими способами она может попасть из A в A за n прыжков?",
        "Решение: Пусть an – число способов вернуться за n прыжков в исходную вершину, а bn – попасть за n прыжков в соседнюю вершину. Легко видеть, что an+1 = 2bn, bn+1 = an + bn. Отсюда нетрудно вывести, что bn+2 = bn+1 + 2bn, an+2 = an+1 + 2an.    Из начальных условий a0 = 1, a1 = 0, получаем  (это нетрудно доказать по индукции).",
        "Ответ: способами."
    ],
    "30781": [
        "Степень вершины",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Докажите, что существует граф с 2n вершинами, степени которых равны 1, 1, 2, 2, ..., n, n.",
        "Подсказка: Используйте индукцию по n.",
        "Решение: Будем строить граф по индукции. База. Для n = 1 такой граф существует: две вершины, соединённые ребром.     Шаг индукции. Пусть граф с 2n вершинами и указанными степенями уже построен. Добавим к нему две вершины A и B. Вершину A соединим с n старыми вершинами со степенями 1, ..., n, а также с вершиной B. В результате у половины старых вершин степени не изменятся, у оставшихся – увеличатся на 1, степень A будет равна n + 1, а степень B будет равна 1. Это и есть искомый граф с 2n + 2 вершинами."
    ],
    "30905": [
        "Алгебраические неравенства (прочее)",
        "Сложность: 3+",
        "Классы: 6,7",
        "Условие: Какое из чисел    (10 двоек) или    (9 троек) больше? А если троек не 9, а 8?",
        "Решение: а) См. задачу 79303 а).",
        "Ответ: а) Второе число; б) первое число."
    ],
    "35713": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что число  делится на 2k и не делится на 2k+1.",
        "Подсказка: Покажите, что Nk+1 по сравнению с Nk делится еще на одну степень двойки.",
        "Решение: Докажем утверждение индукцией по k. База (k = 1) очевидна.     Шаг индукции.    Таким образом, число Nk+1 получается из Nk домножением на 2 и на нечётное число, поэтому по предположению индукции оно делится на на 2k+1 и не делится на 2k+2."
    ],
    "35739": [
        "Задачи на смеси и концентрации",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Имеется два стакана, в первом стакане налито некоторое количество воды, а во втором – такое же количество спирта. Разрешается переливать некоторое количество жидкости из одного стакана в другой (при этом раствор равномерно перемешивается). Можно ли с помощью таких операций получить в первом стакане раствор, в котором процентное содержание спирта больше, чем во втором?",
        "Подсказка: Докажите, что в первом стакане воды всегда будет не меньше, чем спирта, а во втором стакане – наоборот.",
        "Решение: Для определенности примем количество жидкости, налитое в каждом из стаканов, равным 100 г. Докажем, что в первом стакане процентное содержание спирта никогда не превысит 50%, а во втором никогда не будет ниже 50%.      В начальный момент данное утверждение верно. Пусть оно верно в некоторый момент: в первом стакане воды не меньше, чем спирта, а во втором спирта не меньше, чем воды. Пусть мы перелили некоторое количество жидкости из первого стакана во второй. Тогда процентное содержание спирта в первом стакане осталось тем же, то есть в нём по-прежнему воды не меньше, чем спирта. Но во втором стакане в сумме с первым 100 г воды и 100 г спирта. Следовательно, во втором стакане после переливания спирта будет не меньше, чем воды. Итак, утверждение остается верным при переливаниях.",
        "Ответ: Нельзя."
    ],
    "60488": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: а) Пусть m0 и m1 – целые числа, &nbsp0 < m1 ≤ m0.   Докажите, что при некотором k > 1 существуют такие целые числа a0, a1, ..., ak и m2, ..., mk, что  m1 > m2 > m3 > ... > mk > 0, ak > 1,     m0 = m1a0 + m2,     m1 = m2a1 + m3,     m2 = m3a2 + m4,      ...     mk–2 = mk–1ak–1 + mk,     mk–1 = mkak,    и (m0, m1) = mk.",
        "Решение: а) Числа a0 и m2 получаются как частное и остаток при делении m0 на m1 числа a1 и m2 – как частное и остаток при делении m1 на m2, и так далее. Поскольку числа все время уменьшаются, процесс когда-нибудь закончится, то есть на каком-то шаге остаток будет равен нулю."
    ],
    "73628": [
        "Четность и нечетность",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: 2m-значное число назовём справедливым, если его чётные разряды содержат столько же чётных цифр, сколько и нечётные. Докажите, что в любом (2m+1)-значном числе можно вычеркнуть одну из цифр так, чтобы полученное 2m-значное число было справедливым. Пример для числа 12345 показан на рисунке.",
        "Решение: См. решение задачи 79395."
    ],
    "79389": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Дано число, имеющее 13 разрядов. Доказать, что одну из его цифр можно  вычеркнуть так, что в полученном числе количество семёрок на чётных местах  будет равно количеству семёрок на нечётных местах.",
        "Решение: См. задачу 79395."
    ],
    "78292": [
        "Индукция в геометрии",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Проведём в выпуклом многоугольнике некоторые диагонали так, что никакие две из них не пересекаются (из одной вершины могут выходить несколько диагоналей). Доказать, что найдутся по крайней мере две вершины многоугольника, из которых не проведено ни одной диагонали.",
        "Решение: Пусть"
    ],
    "60581": [
        "Числа Фибоначчи",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Докажите равенство:     (Сумма, стоящая в левой части, может быть интерпретирована, как сумма элементов треугольника Паскаля, стоящих в одной диагонали.)",
        "Подсказка: Равенство можно доказать методом математической индукции. Другое решение можно получить, если воспользоваться задачами 60576 и 60403.",
        "Решение: Проверим, что данные суммы Sn удовлетворяют рекуррентному определению чисел Фибоначчи:"
    ],
    "77972": [
        "Квадратные корни (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Доказать неравенство",
        "Решение: Пусть"
    ],
    "30828": [
        "Ориентированные графы",
        "Сложность: 4",
        "Классы: 6,7",
        "Условие: 20 команд сыграли круговой турнир по волейболу.   Докажите, что команды можно занумеровать числами от 1 до 20 так, что 1-я команда выиграла у 2-й, 2-я – у 3-й, ..., 19-я – у 20-й.",
        "Решение: См. задачу 78303."
    ],
    "31089": [
        "Ориентированные графы",
        "Сложность: 4",
        "Классы: 6,7,8",
        "Условие: В стране каждые два города соединены дорогой с односторонним движением. Доказать, что можно проехать по всем городам, побывав в каждом по одному разу (то есть что в полном ориентированном  графе есть гамильтонов путь).",
        "Решение: Это – переформулировка задачи 30828."
    ],
    "31251": [
        "Арифметика остатков (прочее)",
        "Сложность: 4",
        "Классы: 6,7,8",
        "Условие: Доказать, что 22n–1 + 3n + 4 делится на 9 при любом n.",
        "Решение: 22n–1 + 3n + 4 = (22n–1 + 1) + 3n + 3 = 3(22n–2 – 22n–3 + ... – 2 + 1 + n + 1), а   22n–2 – 22n–3 + ... – 2 + 1 + n + 1 ≡ (–1)2n–2 – (–1)2n–3 + ... – (–1) + 1 + n + 1 = 3n (mod 3), то есть делится на 3."
    ],
    "60700": [
        "Простые числа и их свойства",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: В задаче 60477 были определены числа Евклида. Встретится ли каждое простое  число в качестве сомножителя некоторого числа Евклида en?",
        "Подсказка: Рассмотрите числа Евклида по модулю 5.",
        "Решение: Нетрудно проверить по индукции, что en ≡ (–1)n+1·2 (mod 5). Поэтому ни одно из чисел Евклида не делится на 5.",
        "Ответ: Нет."
    ],
    "61404": [
        "Алгебраические неравенства (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Используя результат задачи 61403, докажите неравенства:    а)   ≤   неравенство Коши);     б)",
        "Решение: а) Первый способ. Из неравенства Коши для двух чисел (см. задачу 20862) по индукции легко выводится неравенство Коши для n = 2k чисел. Поэтому достаточно доказать, что из неравенства Коши для n чисел следует неравенство Коши для n – 1 числа.     Действительно, согласно неравенству Коши для n чисел    откуда    что и требовалось.     Второй способ. Пусть  a1 + ... + an = n  (это не ограничивает общности). Надо доказать, что    Пусть среди чисел ai есть неравные. Тогда среди них найдутся такие два числа (можно считать, что это a1 и a2), что a1 < 1, a2 > 1. Заменим a1 на c1 = 1, а a2 на  c2 = a1 + a2 – 1. Тогда c1 + c2 + a3 + ... + an по-прежнему равно n, а    поскольку  c1c2 = 1·(a1 + a2 – 1) = a1a2 + (1 – a1)(a2 – 1) > a1a2.     Продолжая эти замены, мы дойдём до набора (1, 1, ..., 1). Следовательно,     Третий способ. Положим b1 = ... = bn = 1 и применим неравенство из задачи 61403.     Четвёртый способ. Это частный случай неравенства Мюрхеда (см. задачу 61425)."
    ],
    "77994": [
        "Шахматные доски и шахматные фигуры",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: На бесконечной шахматной доске стоит конь. Найти все клетки, куда он может  попасть за 2n ходов.",
        "Решение: Пусть для определённости конь стоит на чёрной клетке. Все клетки, куда он может попасть за два хода, окрашены в синий цвет на рисунке слева. Случай  n = 1 исключительный."
    ],
    "79246": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: С натуральным числом K производится следующая операция: оно представляется в виде произведения простых сомножителей K = p1p2...pn; затем вычисляется сумма p1 + p2 + ... + pn + 1. С полученным числом производится то же самое, и т.д.   Доказать, что образующаяся последовательность, начиная с некоторого номера, будет периодической.",
        "Решение: Обозначим через f(K) сумму p1 + p2 + ... + pn + 1.   Простым подсчётом проверим, что если K > 9, то последовательность с какого-нибудь момента станет периодической."
    ],
    "31369": [
        "Индукция (прочее)",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: В прямоугольнике 3×n стоят фишки трёх цветов,  по n штук  каждого цвета.   Доказать, что можно переставить фишки в каждой строке так, чтобы в каждом столбце были фишки всех цветов.",
        "Решение: Докажем это индукцией по n. База (n = 1) очевидна.     Шаг индукции. Пусть в верхней клетке последнего столбца стоит фишка цвета a. Разберём два случая.     1) В третьей строке есть фишки обоих оставшихся цветов. Заметим, что во второй строке есть фишка цвета, отличного от а (фишек цвета a всего n, а одна уже занята в первой строке). Пусть это фишка цвета b; переставим её в последний столбец. В третьей строке есть фишка третьего цвета c; переставим её в последний столбец.     2) В третьей строке есть фишки только одного цвета, отличного от a; обозначим этот цвет c. Переставим её в третий столбец. Во второй строке должна быть фишка цвета b (в третьей строке их нет, а в первой их меньше n); переставим её в последний столбец.     В любом случае в последнем столбце оказались фишки всех трёх цветов. Отбросив его, мы получим таблицу 3×(n–1), удовлетворяющую условию задачи. По предположению индукции фишки в ней можно переставить требуемым образом. Тем самым, мы переставили фишки и в исходной таблице 3×n."
    ],
    "30794": [
        "Деревья",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: В стране 100 городов, некоторые из которых соединены авиалиниями. Известно, что от каждого города можно долететь до любого другого (возможно, с пересадками).   Докажите, что можно побывать во всех городах, совершив не более а) 198 перёлетов; б) 196 перелётов.",
        "Решение: б) Рассмотрим соответствующий граф и выделим из него максимальное дерево (см. задачу"
    ],
    "30824": [
        "Ориентированные графы",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: На ребрах связного графа расставлены стрелки так, что для каждой вершины числа входящих и выходящих рёбер равны.   Докажите, что двигаясь по стрелкам, можно добраться от каждой вершины до любой другой.",
        "Подсказка: Доказательство проводится по индукции аналогично решению задачи 30806."
    ],
    "35154": [
        "Свойства коэффициентов многочлена",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Докажите, что при умножении многочлена (x + 1)n–1 на любой многочлен, отличный от нуля, получается многочлен, имеющий не менее n отличных от нуля коэффициентов.",
        "Подсказка: Используйте дифференцирование и индукцию.",
        "Решение: Докажем утверждение индукцией по n.      База. При n = 1 утверждение очевидно.      Шаг индукции. Рассмотрим произведение Q(x) = (x + 1)nP(x), где P(x) – некоторый ненулевой многочлен. Без ограничения общности можно считать, что свободный член многочлена P(x) отличен от нуля (умножение на x не меняет числа ненулевых коэффициентов), тогда у многочлена Q(x) свободный член также отличен от нуля и у производной Q'(x) на один ненулевой коэффициент меньше, чем у Q(x). Но  Q'(x) = (x + 1)nP'(x) + n(x + 1)n–1P(x) = (x + 1)n–1((x + 1)P'(x) + nP(x)), то есть Q'(x) получается домножением многочлена (x + 1)n–1 на ненулевой (как легко проверить) многочлен. По предположению индукции у многочлена Q'(x) не менее n ненулевых коэффициентов, следовательно, у многочлена Q(x) не менее  n + 1 ненулевых коэффициентов."
    ],
    "60601": [
        "Цепные (непрерывные) дроби",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Пусть a0 – целое, a1, ..., an – натуральные числа. Определим две последовательности P–1 = 1, P0 = a0, Pk = akPk–1 + Pk–2 (1 ≤ k ≤ n);  Q–1 = 0, Q0 = 1, Qk = akQk–1 + Qk–2 (1 ≤ k ≤ n).     Дроби Pk/Qk называются подходящими дробями к числу [a0; a1, a2, ..., an].     Докажите, что построенные последовательности для k = 0, 1, ..., n обладают следующими свойствами:      а) Pk/Qk = [a0; a1, a2,..., ak];      б) PkQk–1 – Pk–1Qk = (–1)k+1;      в)  (Pk, Qk) = 1.",
        "Решение: а) Индукция. База. При k = 0, 1 равенство проверяется непосредственно.     Шаг индукции. Подходящая дробь с номером k + 1 получается из k-й дроби заменой ak на   ak + : [a0; a1, ..., ak, ak+1] = [a0; a1, ..., ak + ].     Делая такую замену в равенстве    приходим к соотношению   [a0; a1, ..., ak, ak+1] =  = ."
    ],
    "64191": [
        "Раскраски",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Наострове все страны треугольной формы (границы прямые). Если две страны граничат, топоцелой стороне. Докажите, что страны можно раскрасить в3цвета так, что соседние постороне страны будут покрашены вразные цвета.",
        "Решение: Предположим, что некоторые острова, удовлетворяющие условию задачи, невозможно  покрасить втри цвета так, чтобы каждая страна была покрашена всвой  цвет, асоседние страны были покрашены вразные цвета. Выберем  изних остров, накотором число стран самое маленькое. Рассмотрим  какую–нибудь прибрежную страну (тоесть какую–нибудь страну,  одной изсторон выходящую наберег).  Всилу выбора, весь  остальной остров можно покрасить втри цвета.  Норассматриваемая  страна граничит только сдвумя странами, азначит, для неё запрещены  только два цвета. Поэтому её тоже можно покрасить. Получили противоречие.  Следовательно, карту любого острова, удовлетворяющего условию задачи, можно  раскрасить втри цвета так, чтобы выполнялись требования задачи."
    ],
    "35409": [
        "Индукция в геометрии",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Вершины выпуклого многоугольника раскрашены в три цвета так, что каждый цвет присутствует и никакие две соседние вершины не окрашены в один цвет. Докажите, что многоугольник можно разбить диагоналями на треугольники так, чтобы у каждого треугольника вершины были трёх разных цветов.",
        "Подсказка: Используйте индукцию по числу вершин многоугольника.",
        "Решение: Обозначим цвета цифрами 1, 2, 3. Доказательство проведём индукцией по числу n вершин многоугольника. База (n = 3) тривиальна.      Шаг индукции. Пусть n > 3. Выберем две вершины A и B одного цвета, пусть это цвет 1. Точки A и B делят контур многоугольника на две ломаные. На каждой из этих ломаных есть вершина цвета, отличного от 1. Заметим, что можно найти такие две точки C и D цветов 2 и 3, что C и D лежат на разных ломаных. Действительно, это легко сделать, если на каждой из двух ломаных присутствуют вершины как цвета 2, так и цвета 3. Если же на одной ломаной нет вершин, скажем, цвета 2, то на этой ломаной все вершины цвета 3, и значит, на другой ломаной найдётся вершина цвета 2. Разобьём наш n-угольник на два многоугольника M1, M2 диагональю CD. Каждый из этих многоугольников удовлетворяет условию задачи. По предположению индукции каждый из них разбить на треугольники, у которых вершины окрашены в разные цвета. Это и даст разбиение исходного многоугольника."
    ],
    "73732": [
        "Числовые таблицы и их свойства",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: В прямоугольную таблицу из m строк и n столбцов записаны mn положительных чисел. Найдём в каждом столбце произведение чисел и сложим все n таких произведений. Докажите, что если переставить числа в каждой строке в порядке возрастания, то сумма аналогичных произведений будет не меньше, чем в первоначальной. Решите эту задачу для     а) m = n = 2;     б) m = 2 и произвольного n;     в) любых натуральных m и n.",
        "Решение: в) Индукция по числу столбцов таблицы. База (один столбец) очевидна.     Шаг индукции. Обозначим через Pi произведение чисел в i-м столбце. Переставим теперь столбцы так (это не изменит сумму произведений), чтобы произведение P1 стало минимальным. Обозначим через xij число, стоящее в i-й строке и  j-м столбце. Предположим, что xi1 – не минимальное число в i-й строке: минимальным является xik. Поменяем местами xi1 и xik и проверим, что сумма произведений при этом возрастёт. Обозначим через П1 произведение всех чисел в первом столбце, кроме xi1, через Пk – произведение всех чисел в k-м столбце, кроме xik. Разность новой и старой сумм равна xi1Пk + xikП1 – xi1П1 – xikПk = (xi1 – xik)(Пk – П1). Эта величина положительна, так как xi1 > xik и Пk > П1, поскольку xikПk ≥ xi1П1. Значит, после  перестановки сумма увеличилась. Кроме того, произведение новых чисел в первом столбце по-прежнему минимально. Таким образом, мы можем переставить все числа,  минимальные в строках, в первый столбец, и сумма произведений увеличится.     Если упорядочить строки в таблице, образованной столбцами со 2-го по n-й, то мы получим исходную таблицу с упорядоченными строками. По предположению индукции при этом упорядочении сумма произведений P2 + ... + Pn не уменьшится. Следовательно, сумма P1 + ... + Pn в первоначальной таблице не больше, чем аналогичная сумма в таблице с упорядоченными строками."
    ],
    "76447": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: На сколько частей могут разделить пространство n плоскостей?   (Каждые три плоскости пересекаются в одной точке, никакие четыре плоскости не имеют общей точки.)",
        "Решение: Обозначим это число Kn. Посмотрим, как изменится это число при проведении (n+1)-й плоскости. Эта плоскость пересекается остальными плоскостями по n прямым общего положения и делится ими на ½ (n² + n + 2) кусков (см. задачу 60323). Каждый из этих кусков разбивает одну из старых частей пространства на две. Значит,   Kn+1 = Kn + ½ (n² + n + 2). Удобнее записать эту формулу в виде Kn = Kn–1 + ½ (n² – n + 2).     Поскольку K0 = 1, имеем   2Kn = 2 + (1² – 1 + 2) + (2² – 2 + 2) + ... + (n² – n + 2) = (1² + 2² + ... + n²) – (1 + 2 + ... + n) + 2(n + 1) =       = &frac16; n(n + 1)(2n + 1) – ½ n(n + 1) + 2(n + 1) = &frac13; (n + 1)(n² – n + 6).  (Формулу для суммы квадратов см. в задаче 60282.)",
        "Ответ: На &frac16; (n³ + 5n + 6) частей."
    ],
    "78014": [
        "Четность и нечетность",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Дано число H = 2·3·5·7·11·13·17·19·23·29·31·37 (произведение простых чисел). Пусть 1, 2, 3, 5, 6, 7, 10, 11, 13, 14, ..., H – все его делители, выписанные в порядке возрастания. Под рядом делителей выпишем ряд из единиц и минус единиц по следующему правилу: под единицей 1, под числом, которое разлагается на чётное число простых сомножителей, 1, и под числом, которое разлагается на нечётное число простых сомножителей, –1. Доказать, что сумма чисел полученного ряда равна 0.",
        "Решение: Будем называть чётным делитель, который разлагается на чётное число простых сомножителей (1 относится к чётным делителям), а нечётным – делитель, который разлагается на нечётное число простых сомножителей. Докажем индукцией по k, что число Nk = 2·3·5·7·...·pk (произведение первых k простых чисел) имеет 2k–1 чётных делителей и 2k–1 нечётных делителей. (Тогда для числа Nk рассматриваемая сумма равна 2k–1 – 2k–1 = 0.)     База. Для числа N1 = 2 утверждение очевидно.     Шаг индукции. Число Nk+1 имеет 2k–1 чётных делителей и 2k–1 нечётных делителей, не делящихся на pk+1 (все эти делители являются делителями числа Nk). Помимо этих делителей оно имеет делители, делящиеся на pk+1. А именно, 2k–1 чётных делителей, соответствующих нечётным делителям числа Nk, и 2k–1 нечётных делителей, соответствующих чётным делителям числа Nk. В  итоге получаем 2k–1 + 2k– 1 = 2k чётных делителей и 2k нечётных делителей."
    ],
    "78682": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Известно, что an – bn делится на n (a, b, n – натуральные числа, a ≠ b). Доказать, что  делится на n.",
        "Решение: Воспользуемся методом математической индукции.     База. Пусть n – простое число. Если число  a – b не делится на n, то всё ясно. Если же a ≡ b (mod n), то   = an–1 + an–2b + ... + abn–2 + bn–1 ≡ nbn–1 ≡ 0 (mod n).     Шаг индукции. Пусть для всех показателей, меньших n, утверждение доказано. Обозначим d = НОД(n, a – b), тогда n = kd.     Если d = 1, то все ясно. Если d = n, то a ≡ b (mod n), и можно повторить вышеприведённое доказательство.      Если же 1 < d < n, то    делится на n, так как первый множитель делится на k, а второй – на d (у последней дроби знаменатель, а тем более числитель делится на d)."
    ],
    "35490": [
        "Индукция (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На какую максимальную степень тройки делится число, десятичная запись которого состоит из 3n единиц?",
        "Подсказка: Используйте индукцию по n.",
        "Решение: Обозначим через Аn число, состоящее из 3n единиц. Докажем по индукции, что Аn делится на 3n и не делится на 3n+1. База (n = 1) очевидна.     Шаг индукции. Число Аn+1 получается умножением числа Аn на число вида 10...010...01. Число 10...010...01 делится на 3 и не делится на 32 = 9, поскольку сумма его цифр делится на 3 и не делится на 9. Следовательно, Аn+1 имеет в разложении на простые множители на одну тройку больше по сравнению с числом Аk, то есть делится на 3n+1, но не делится на 3n+2.",
        "Ответ: На n-ю степень."
    ],
    "78828": [
        "Обход графов",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: В городе Никитовка двустороннее движение. В течение двух лет в городе  проходил ремонт всех дорог. Вследствие этого в первый год на некоторых дорогах  было введено одностороннее движение. На следующий год на этих дорогах было  восстановлено двустороннее движение, а на остальных дорогах введено  одностороннее движение. Известно, что в каждый момент ремонта можно было проехать  из любой точки города в любую другую. Доказать, что в Никитовке можно ввести одностороннее движение так, что из каждой точки города удастся проехать в  любую другую точку.",
        "Решение: Индукция по числу городских перекрёстков (из которых исходят более двух дорог).     База. Если в Никитовке имеются всего два перекрёстка A и B, то утверждение очевидно: по условию из A в B ведут не менее двух дорог; поэтому достаточно установить по одной из этих дорог движение от A к B, а по второй – от B к A, мы сможем проехать от каждого перекрёстка до любого, отличного от него.     Шаг индукции. Рассмотрим город Никитовку, имеющий n + 1 перекрёсток и  два соседних из этих перекрёстков – перекрёстки A и B, соединённые улицей AB. Поскольку  после введения на улице AB (при её ремонте) одностороннего движения – скажем, от A к B – проехать от B к A было возможно, то из B в A ведёт некоторая не включающая улицы AB цепочка улиц (эту цепочку можно считать не имеющей самопересечений). Таким образом, мы приходим к существованию в Никитовке кольца s – замкнутой сети улиц, ведущей из A в B, а затем (через ряд промежуточных перекрёстков) – снова в A.     Рассмотрим теперь новый город, план которого получается из плана Никитовки склеиванием всех перекрёстков нашего кольца s в один перекрёсток S, из которого исходят все улицы, реально упирающиеся в кольцо s. Число перекрёстков такого условного города меньше n + 1; поэтому по предположению индукции в нём можно ввести по всем улицам одностороннее движение с соблюдением требований задачи. Если мы затем оставим движение по всем не входящим в кольцо s улицам таким же, каким оно было в этом новом городе, а по кольцу s пустим движение в одном (безразлично каком!) направлении, то на всех улицах Никитовки будет установлено одностороннее движение – и притом с каждого перекрёстка можно будет проехать в любой другой."
    ],
    "79343": [
        "Делимость чисел. Общие свойства",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Существуют ли а) 6, б)15, в) 1000 таких различных натуральных чисел, что для любых двух a и b из них сумма a + b делится на разность a − b?",
        "Решение: Докажем, что для любого натурального n ≥ 2 существуют n натуральных чисел, сумма любых двух из которых делится на их разность.     Для n = 2 можно взять числа 1 и 2. Пусть числа a1, ..., an удовлетворяют требуемому условию. Покажем, что тогда числа A, A + a1, ..., A + an, где  A = a1...an, тоже удовлетворяют требуемому условию.  Ясно, что A + ak + A делится на A + ak − A = ak, поскольку A делится на ak. Проверим, что A + ai + A + aj делится на A + ai − (A + aj) = ai − aj. По условию ai + aj делится на ai − aj. Кроме того, 2ai = (ai + aj) + (ai − aj) делится на ai − aj, а значит, 2A делится на ai − aj.",
        "Ответ: Существуют."
    ],
    "79414": [
        "Суммы числовых последовательностей и ряды разностей",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Считая известной формулу    доказать, что для различных натуральных чисел a1, a2, ..., an справедливо неравенство    Возможно ли равенство для каких-нибудь различных натуральных чисел a1, a2, ..., an?",
        "Решение: Доказательство проведём по индукции. База:   a7 + a5 ≥ 2a6 ⇔ a5(a − 1)² ≥ 0.    Шаг индукции. Пусть a1 < ... < an+1 – произвольные натуральные числа. По предположению индукции    Но     (здесь мы существенно использовали, что все аi различны). Сложив эти неравенства, получим:       Равенство справедливо при a1 = 1, а2 = 2, ..., аn = n. Это доказывается по индукции тем же способом, только все неравенства превращаются в равенства."
    ],
    "60315": [
        "Индукция (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: а) Головоломка Ханойская башня представляет собой восемь дисков, нанизанных в порядке уменьшения размеров на один из трёх колышков. Требуется переместить всю башню на другой колышек, перенося каждый раз только один диск и не помещая больший диск на меньший. Докажите, что головоломка имеет решение. Какой способ будет оптимальным (по числу перекладываний дисков)?",
        "Решение: а) Пусть минимальное число шагов для перемещения башни из n дисков равно Kn. Выразим Kn+1 через Kn.    Рассмотрим башню из n + 1 диска. Разобьём всю процедуру на три этапа.    Этап 1 – от начала до первого перемещения нижнего диска. В конце этого этапа стоящая на нижнем диске башня из n дисков должна переместиться на один из свободных колышков (колышек, на который следующим шагом должен переместиться нижний диск, должен быть свободен). Нижний диск в этих перемещениях не участвует, следовательно, для этого необходимо (и достаточно) Kn шагов.    Этап 2 – от первого до последнего перемещения нижнего диска. Одного шага достаточно: после первого перемещения нижний диск можно больше не трогать.    Этап 3 – после последнего перемещения нижнего диска. В начале этого этапа колышек, с которого перед этим был снят нижний диск, свободен. Значит, на третьем колышке стоит башня из n дисков, и ее надо переместить на нижний диск. Для такого перемещения также нужно Kn шагов.    Итак, Kn+1 = Kn + 1 + Kn = 2Kn + 1 (выше показано, что меньшим числом шагов обойтись нельзя, а такого количества достаточно).    Поскольку K1 = 1, мы можем последовательно вычислить K2, K3, ..., K8.    Нетрудно вывести и общую формулу: записав полученное соотношение в виде Kn+1 + 1 = 2(Kn + 1), имеем Kn + 1 = 2n–1(K1 + 1) = 2n.",
        "Ответ: а) Самый короткий способ содержит 28 – 1 = 255 перекладываний."
    ],
    "116873": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Даны n + 1 попарно различных натуральных чисел, меньших 2n (n > 1).   Докажите, что среди них найдутся три таких числа, что сумма двух из них равна третьему.",
        "Решение: Воспользуемся методом математической индукции.    База. При n = 2 выбранными оказываются числа 1, 2, 3. При этом 1 + 2 = 3.    Шаг индукции. Пусть есть n + 2 натуральных числа, меньших 2n + 2. Возможны два случая.    1) Среди выбранных чисел нет числа 2n + 1. Тогда из чисел, меньших 2n, выбрали по крайней мере n + 1 число. По предположению индукции, найдутся три числа, сумма которых равна третьему.    2) Среди выбранных чисел есть число 2n + 1. Разобьём числа 1, 2, ..., 2n на n пар, в сумме дающих 2n + 1: {1, 2n}, {2, 2n – 1}, ..., {n, n + 1}. Поскольку в набор входит ещё n + 1 число, то какая-то из пар входит в набор целиком. Числа этой пары и число 2n + 1 образуют искомую тройку."
    ],
    "73662": [
        "Десятичная система счисления",
        "Сложность: 4+",
        "Классы: 9,10,11",
        "Условие: Для каждого натурального n обозначим через s(n) сумму цифр его десятичной записи. Назовём натуральное число m особым, если его нельзя представить в виде m = n + s(n). (Например, число 117 не особое, поскольку 117 = 108 + s(108), а число 121, как нетрудно убедиться, – особое.) Верно ли, что особых чисел существует лишь конечное число?",
        "Решение: Рассмотрим все целые числа от 1 до какого-то N. Среди них найдётся некоторое количество R(N) особых чисел (например, число 1 – особое). Остается показать, что, выбирая соответствующим образом N, можно получить сколь угодно большое R(N).",
        "Ответ: Неверно."
    ],
    "34930": [
        "Индукция в геометрии",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Несколько прямых делят плоскость на части. Докажите, что эти части можно раскрасить в 2 цвета так, что граничащие части будут иметь разный цвет.",
        "Подсказка: Рассуждайте, используя индукцию по количеству прямых.",
        "Решение: Будем использовать индукцию по количеству прямых n. При n = 1 утверждение задачи очевидно: достаточно покрасить две полуплоскости, на которые одна прямая делит плоскость, в разные цвета. Пусть утверждение задачи верно для k прямых. Рассмотрим некоторые k + 1 прямых. Забывая пока про (k+1)-ю прямую, раскрасим области, на которые делят плоскость остальные k прямых, в два цвета так, что граничащие части будут иметь разный цвет (это можно сделать по предположению индукции). При такой раскраске области, граничащие по (k+1)-й прямой, будут иметь одинаковый цвет. Далее перекрасим все области, расположенные по одну из сторон относительно (k+1)-й прямой, в противоположный цвет. Полученная в результате раскраска удовлетворяет условию задачи."
    ],
    "35022": [
        "Индукция (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9,10",
        "Условие: n разбойников делят добычу. У каждого из них свое мнение о  ценности той или иной доли добычи, и  каждый из них хочет получить не меньше,  чем 1/n долю добычи (со своей точки зрения).  Придумайте, как разделить добычу между разбойниками.",
        "Подсказка: Воспользуйтесь индукцией  по числу разбойников.",
        "Решение: Для двух разбойников задача решается несложно - один делит добычу на  две равные по его мнению доли, а другой выбирает из них наибольшую  на его взгляд долю.  Будем решать задачу при помощи  индукции  по числу разбойников,   т.е. предположим,  что k разбойников уже имеют способ разделить добычу безобидно.  Будем делить добычу между k+1 разбойниками.  Разделим всю добычу между k разбойниками и затем пусть каждый из них  разделит свою долю на k+1 равных по его мнению частей.  Пусть теперь последний разбойник выберет по одной из этих частей  у каждого из k разбойников.  Последний разбойник взял (по его мнению) не менее, чем по 1/(k+1)  доле у каждого из k разбойников, т.е. всего он получил не менее  1/(k+1) от всей добычи.  Каждый из первых k разбойников также получил не менее, чем  (1/k)*(k/(k+1))=1/(k+1) от всей добычи."
    ],
    "58307": [
        "Индукция в геометрии",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что если плоскость разбита на части прямыми иокружностями, то получившуюся карту можно раскрасить вдва цвета так, что части, граничащие по дуге или отрезку, будут разного цвета.",
        "Решение: Доказательство проведем индукцией по общему числу прямых иокружностей. Для одной прямой или окружности утверждение очевидно. Предположим теперь, что можно раскрасить требуемым образом любую карту, заданную"
    ],
    "78680": [
        "Индукция в геометрии",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На окружности радиуса 1 отмечена точка",
        "Решение: Докажем индукцией по",
        "Ответ: не более трех."
    ],
    "78714": [
        "Индукция (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Из натуральных чисел составляются последовательности, в которых каждое  последующее число больше квадрата предыдущего, а последнее число в  последовательности равно 1969 (последовательности могут иметь разную длину).  Доказать, что различных последовательностей такого вида меньше чем 1969.",
        "Решение: Докажем индукцией по n, что при n ≥ 3 количество последовательностей, оканчивающихся на n, меньше n. (Для n = 1 и 2 количество таких последовательностей равно n.) Рассмотрим последовательность, оканчивающуюся на n, и отбросим её последний член. Для всех последовательностей, состоящих более, чем из одного члена n, получаем последовательности, оканчивающиеся на 1, 2, ...,   [].    Поэтому по предположению индукции количество всех последовательностей, оканчивающихся на n, не превосходит   1 + 1 + 2 + ... + [] = 1 + . При n ≥ 3 это число меньше n."
    ],
    "34952": [
        "Индукция (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что любое натуральное число можно представить в виде  суммы нескольких различных членов последовательности Фибоначчи.  (Последовательность Фибоначчи {a",
        "Подсказка: Вычитайте из числа наибольшее число Фибоначчи, не превосходящее  его.",
        "Решение: Будем использовать индукцию по n.  База индукции тривиальна - число 1 само является числом Фибоначчи.  Далее, предположим, что все натуральные числа, меньшие некоторого  числа k,  можно представить в виде  суммы нескольких различных членов последовательности Фибоначчи.  Найдем наибольшее число Фибоначчи a"
    ],
    "78240": [
        "Индукция в геометрии",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Дан остроугольный треугольник",
        "Решение: Заметим, что если"
    ],
    "78256": [
        "Индукция в геометрии",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Стороны произвольного выпуклого многоугольника покрашены снаружи. Проводится несколько диагоналей многоугольника, так, что никакие три не пересекаются в одной точке. Каждая из этих диагоналей тоже покрашена с одной стороны, т.е. с одной стороны отрезка проведена узкая цветная полоска. Доказать, что хотя бы один из многоугольников, на которые разбит диагоналями исходный многоугольник, весь покрашен снаружи.",
        "Решение: Нам дан многоугольник, в котором проведены какие-то диагонали. Сотрём их и  будем проводить снова, но уже по одной, по очереди.    Первая диагональ разделила многоугольник на два; каждый из них покрашен  снаружи всюду, кроме диагонали. Но так как диагональ покрашена с одной  стороны, ясно, что один из двух многоугольников целиком покрашен снаружи.    Проведём вторую диагональ. Если она проходит так, что не пересекает  выбранного нами многоугольника, то ничего не меняется— выбранный  многоугольник остается окрашенным снаружи, если же диагональ пересекает  многоугольник, то она снова разбивает его на две части, одна из которых, как  и раньше, окрашена снаружи.    И каждый раз, проводя новую диагональ, мы либо просто сохраняем уже имеющийся  многоугольник (окрашенный снаружи), либо получаем новый— и так пока не  проведём все диагонали."
    ],
    "30900": [
        "Индукция (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: n – натуральное число. Докажите, что nn > (n + 1)n–1.",
        "Решение: Применим метод математической индукции. База (n = 2) очевидна.     Шаг индукции.    по предположению индукции."
    ],
    "35210": [
        "Индукция (прочее)",
        "Сложность: 4",
        "Классы: 7,8,9,10",
        "Условие: Колода из 36 карт    сложена так, что через четыре карты    масть повторяется. Несколько карт сверху сняли, не    перекладывая перевернули и вставили      произвольным образом (не обязательно подряд)    между оставшимися. После этого колоду разделили на    9 стопок по 4 идущие подряд карты. Докажите,     что в каждой из этих    стопок встретится по одной карте каждой масти.",
        "Подсказка: Можно заметить, что первые четыре карты колоды,   полученной в результате описанной операции,   лежали подряд в первоначальной колоде.",
        "Решение: Обозначим через A начальное расположение карт в колоде,   через B - распожение карт в колоде, полученной из   колоды A указанным в условии задачи преобразованием.   Обозначим A' ту часть колоды A, котрую мы сняли сверху,   и через A'' оставшуюся часть.    Посмотрим, где в колоде A находятся первые четыре карты колоды   B. Нетрудно понять, что они находятся на стыке   колод A' и A'', т.е. в эту четверку карт входят   несколько (возможно, ни одной) последних карт   A' и несколько первых карт A''.   Поскольку масти в колоде A повторяются с периодом 4,   то в этой четверке по одной карте каждой масти.   Вынем эту четверку из колод A и B.   Мы приходим к аналогичной задаче для меньшей колоды   (так как в колоде A без четырех подряд идущих карт   масти снова повторяются с периодом 4).   Продолжая рассуждать аналогичным образом, рассматриваем    следующую четверку карт колоды B и т.д.   В конце концов, приходим к тому, что требуется доказать."
    ],
    "35259": [
        "Индукция (прочее)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Известно, что x + 1/x – целое число. Докажите, что xn + 1/xn – также целое при любом целом n.",
        "Решение: Очевидно, достаточно доказать утверждение для неотрицательных n. Сделаем это по индукции.     База. Для n = 0 утверждение очевидно, а для n = 1 дано в условии.     Шаг индукции. Пусть утверждение уже доказано для всех чисел от 0 до n. Тогда число    – целое как разность двух целых чисел."
    ],
    "78303": [
        "Индукция (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: В шахматном турнире каждый участник сыграл с каждым из остальных одну партию.    Доказать, что участников можно так занумеровать, что окажется, что ни один  участник не проиграл непосредственно за ним следующему.",
        "Подсказка: Примените индукцию по числу участников турнира.",
        "Решение: Применим индукцию по числу n участников турнира. База (два участника) очевидна.     Шаг индукции. Рассмотрим некоторый турнир с n + 1 участником. Выделим одного из участников – C, все встречи между остальными участниками образуют турнир для n участников. Согласно предположению индукции, этих n участников можно обозначить A1, A2, ..., An так, что участник Ai не проиграл Ai+1 (для всех i = 1, 2, ..., n – 1). Пусть m – наибольший номер, для которого участник С проиграл участникам A1, A2, ..., Am (если C выиграл у участника A1, то полагаем m = 0). Тогда C не проиграл участнику Am+1 (кроме случая m = n). Поэтому ряд A1, A2, ..., Am, C, Am+1, Am+2, ..., An удовлетворяет условию (если m = 0, то ряд начинается с С, если m = n, то ряд заканчивается на C)."
    ],
    "78541": [
        "Индукция (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: В n мензурок налиты n разных жидкостей, кроме того, имеется одна пустая мензурка. Можно ли за конечное число операций составить равномерные смеси  в каждой мензурке, то есть сделать так, чтобы в каждой мензурке было равно  1/n от начального количества каждой жидкости, и при этом одна мензурка была бы пустой. (Мензурки одинаковые, но количества жидкостей в них могут быть разными; предполагается, что можно отмерять любой объём жидкости.)",
        "Решение: Докажем, что это возможно, индукцией по n. При n = 1 доказывать нечего – мы уже имеем в первой мензурке  равномерную смесь из одной жидкости.     Шаг индукции. Пусть мензурка M1 – пустая, а M2, ..., Mn+2 – полные. Вначале отложим в сторону мензурку Mn+2. Воспользовавшись предположением индукции, сделаем так, чтобы в каждой из мензурок M2, ..., Mn+1 была равномерная смесь первых n жидкостей, а мензурка M1 была пустой.     Разольём жидкость из M2, ..., Mn+1 поровну в M1, ..., Mn+1. После этого перельём в каждую из этих мензурок по 1/n+1 жидкости из Mn+2.",
        "Ответ: Можно"
    ],
    "58309": [
        "Индукция в геометрии",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: ПустьE – точка пересечения боковых сторон AD и BC трапеции ABCD, Bn+1 – точка пересечения прямых AnC и BD (A0 = A), An+1 – точка пересечения прямых  EBn+1 и AB. Докажите, что AnB = AB/n+1.",
        "Решение: Индукция по n. База: A0B = AB.     Шаг индукции. ПустьCn – точка пересечения прямых EAn и DC, DC/AB = k, AB = a, AnB = an/n+1 и An+1B = x. Так как  CCn+1 : AnAn+1 = DCn+1 : BAn+1, то kx : (an – x) = (ka – kx) : x, то есть x = aan/a+an = a/n+2."
    ],
    "60280": [
        "Индукция (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Числовая последовательность A1, A2, ..., An, ... определена равенствами  A1 = 1,  A2 = – 1,  An = – An–1 – 2An–2  (n ≥ 3).   Докажите, что при любом натуральном n число    является полным квадратом.",
        "Решение: Рассмотрим другую последовательность B1, ..., Bn, ..., определенную тем же рекуррентным соотношением, но с другими начальными условиями:  B1 = 1, B2 = 3. Докажем по индукции соотношения:      База.       Шаг индукции."
    ],
    "78144": [
        "Индукция в геометрии",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Отрезок длиной 3",
        "Решение: Назовём отрезок, у которого оба конца являются отмеченными точками,"
    ],
    "98100": [
        "Индукция (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: В соревновании участвуют 32 боксёра. Каждый боксёр в течение одного дня  может проводить только один бой. Известно, что все боксёры имеют разную силу,  и что сильнейший всегда выигрывает. Докажите, что за 15 дней можно определить место каждого боксёра.   (Расписание каждого дня соревнований составляется вечером накануне и в день  соревнований не изменяется.)",
        "Решение: Лемма. Пусть 2n+1 участников соревнований разбиты на две группы по 2n боксёров, причём в каждой из групп боксёры уже упорядочены по силе. Тогда упорядочить всех боксёров можно за n + 1 день.    Доказательство. Индукция по n. База. При n = 1 утверждение очевидно.     Шаг индукции. По предположению индукции, за n дней соревнований мы сможем упорядочить 2n боксёров, занимающих чётные места в каждой из групп, а также 2n боксёров, занимающих нечётные места. Для окончательного упорядочивания всех боксёров достаточно одного дня, так как для каждого боксёра существует не более одного соперника, о котором не известно, сильнее он его или слабее. Действительно, если боксёр занимает в одной из групп чётное место, то известно, между какими двумя боксёрами другой группы, занимающими последовательные чётные места, он располагается по силе. Между этими двумя боксёрами в группе находится лишь один боксёр с нечётным местом."
    ],
    "31374": [
        "Индукция (прочее)",
        "Сложность: 4",
        "Классы: 6,7,8,9",
        "Условие: В  городе  100  домов.  Какое  наибольшее  число   замкнутых непересекающихся заборов  можно  построить  так,  чтобы  любые  2 забора ограничивали разные группы домов?",
        "Решение: 199 (если каждый забор что-то ограничивает). Указание: воспользуйтесь индукцией."
    ],
    "58308": [
        "Индукция в геометрии",
        "Сложность: 4+",
        "Классы: 8,9",
        "Условие: Докажите, что ввыпуклом",
        "Решение: Докажем индукцией по"
    ],
    "78140": [
        "Индукция в геометрии",
        "Сложность: 4+",
        "Классы: 9,10,11",
        "Условие: Бесконечная плоская ломаная",
        "Решение: Заметим, что координаты вектора"
    ],
    "58310": [
        "Индукция в геометрии",
        "Сложность: 5",
        "Классы: 8,9,10,11",
        "Условие: На прямой даны точки",
        "Решение: Докажем сначала требуемое утверждение при"
    ],
    "58311": [
        "Индукция в геометрии",
        "Сложность: 6+",
        "Классы: 8,9",
        "Условие: Докажите, что если",
        "Решение: Доказательство проведем индукцией по"
    ],
    "60304": [
        "Индукция (прочее)",
        "Сложность: 2+",
        "Классы: 8,9,10",
        "Условие: Докажите неравенство для натуральных n > 1:",
        "Решение: Индукция по n. База: 1/3 + 1/4 = 7/12 = 14/24 > 13/24.    Шаг индукции. При переходе от n к n + 1 левая часть увеличивается, поскольку"
    ],
    "30902": [
        "Алгебраические неравенства (прочее)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: n – натуральное число. Докажите, что 2n ≥ 2n.",
        "Решение: См. решение задачи 60306."
    ],
    "60298": [
        "Признаки делимости на 3 и 9",
        "Сложность: 2+",
        "Классы: 8,9,10",
        "Условие: Докажите, что для всех натуральных n число, записываемое 3n единицами, делится на 3n.",
        "Решение: См. задачу 35490."
    ],
    "35714": [
        "Теория алгоритмов (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: На столе стоят восемь стаканов с водой. Разрешается взять любые  два стакана и уравнять в них количества воды, перелив часть воды  из одного стакана в другой.  Докажите, что с помощью таких операций можно добиться того, чтобы  во всех стаканах было поровну воды.",
        "Подсказка: 8 - это степень двойки. Решите эту задачу сначала для четырех  стаканов, а затем - для восьми.",
        "Решение: Разделим стаканы на пары A - A', B - B', C - C', D - D',  и уравняем количества воды в каждой  паре стаканов. Теперь у нас две совершенно одинаковые четверки:  A, B, C, D и A', B', C', D'.  Уравняем количество воды в первой четверке, а затем точно таким же  способом - во второй четверке. Итак, мы свели нашу задачу к  той же самой задаче, но уже для четырех стаканов.  Точно также разделим четыре стакана по парам и, уравняв  количества воды в этих парах, сведем задачу к случаю двух  стаканов. Но в двух стаканов количества воды можно уравнять по  условию."
    ],
    "30895": [
        "Алгебраические неравенства (прочее)",
        "Сложность: 3",
        "Классы: 8",
        "Условие: Докажите, что при n ≥ 3 выполняется неравенство",
        "Решение: Индукция по n. База: 1/4 + 1/5 + 1/6 = 37/60 > 3/5. Шаг индукции делается как в задаче 60304."
    ],
    "30899": [
        "Классические неравенства (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: x ≥ –1, n – натуральное число. Докажите, что  (1 + x)n ≥ 1 + nx.",
        "Решение: Докажем неравенство индукцией по n."
    ],
    "30903": [
        "Алгебраические неравенства (прочее)",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: При каких натуральных n выполняется неравенство 2n ≥ n³?",
        "Решение: 29 = 526 < 729 = 93.    Докажем индукцией по n, что 2n > n³ при n > 9. База (n = 10) очевидна.     Шаг индукции. 2n+1 = 2·2n > 2n³ > (n + 1)³. В самом деле,    при n > 9.",
        "Ответ: При n ≥ 10."
    ],
    "30904": [
        "Алгебраические неравенства (прочее)",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: Докажите, что для любого натурального n выполняется неравенство 3n > n·2n.",
        "Решение: Применим метод математической индукции. База (n = 1) очевидна.     Шаг индукции. 3n+1 = 3·3n > 3n·2n = n·2n + 2n·2n ≥ 2·2n + n·2n+1 = (n + 1)·2n+1."
    ],
    "35081": [
        "Математическая логика (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Двум гениям сообщили по натуральному числу и сказали, что эти числа отличаются на 1. После этого они по очереди задают друг другу один и тот же вопрос: Знаешь ли ты мое число?. Докажите, что рано или поздно один из них ответит положительно.",
        "Подсказка: Если одному из гениев сообщили число 1, то он знает, что второму сообщили число 2.",
        "Решение: Если число одного из гениев равно m, то он знает, что число другого гения равно либо m + 1, либо m – 1; ему остаётся определить только то, какая из этих двух возможностей имеет место. Когда гений A отвечает на вопрос Знаешь ли ты моё число? в первый раз, он может ответить положительно только если его число равно 1 (в этом случае число второго однозначно равно 2). Если ответ был отрицательный, то второй гений B узнает, что  число A не равно 1 (хотя он это и так знает, если его число больше 2!). Далее, если при втором задании вопроса B отвечает отрицательно, то A узнает, что число B не равно 1 и 2 (если число B равно 2, он наверняка знал бы, что число A равно 3, поскольку после первого вопроса он знает, что оно не равно 1).     Пусть перед очередным вопросом одного из гениев (для определенности, A) обоим гениям известно, что число A не равно 1, 2, ..., k, а число B не равно 1, 2, ..., k – 1. Если B ответил отрицательно, то его число не равно k (иначе он бы знал, что число A равно k + 1, также его число не равно k + 1 (иначе он бы знал, что число A равно k + 2, поскольку оно не может быть равно k). Итак, в случае отрицательного ответа B мы приходим к ситуации, аналогичной только что рассмотренной: перед вопросом B обоим гениям известно, что число B не равно 1, 2, ..., k + 1, а число A не равно 1, 2, ..., k.     Далее при повторении отрицательных ответов каждый из гениев будет постепенно определять, что число другого гения не равно ни одному числу из начального отрезка натурального ряда. Так как числа гениев конечны, то процесс отрицательных ответов рано или поздно прекратится; это означает, что один из гениев ответит на вопрос положительно."
    ],
    "35446": [
        "Отношение порядка",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Человечество бессмертно и начинает свою историю    от Адама и Евы;  каждый человек - смертен.    Докажите, что найдется бесконечная мужская цепочка, начинающаяся с    Адама, в который  каждый следующий человек - сын предыдущего.",
        "Подсказка: Выстраивайте цепочку, начиная с Адама, выбирая из сыновей того,    у которого бесконечное число потомков мужского пола.",
        "Решение: Рассмотрим всех мужчин, которые когда-либо жили в истории    человечества. Их бесконечно много, так как человечество    бессмертно, и все они - потомки Адама.    Рассмотрим сыновей Адама (их конечное число),    назовем их A"
    ],
    "60306": [
        "Индукция (прочее)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите неравенство: 2n > n.",
        "Решение: Заметим, что (a – 1)(b – 1) ≥ 1 при a, b ≥ 2. Отсюда ab ≥ a + b. Следовательно,    2n ≥ 2 + 2 + ... + 2 = 2n > n."
    ],
    "35522": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В клетчатом квадрате 64*64 вырезали одну из клеток. Докажите, что    оставшуюся часть квадрата можно разрезать на уголки из трех клеток.",
        "Подсказка: Доказывайте общее утверждение для квадрата    2",
        "Решение: Будем доказывать общее утверждение для квадрата    2"
    ],
    "60323": [
        "Плоскость, разрезанная прямыми",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: На сколько частей делят плоскость n прямых общего положения, то есть таких, что никакие две не параллельны и никакие три не проходят через одну точку?",
        "Решение: Докажем по индукции, что количество частей равно 1 + ½ n(n + 1). База (n = 1) очевидна.    Шаг индукции. Пусть n > 1. По предположению индукции перед проведением n-й прямой было 1 + ½ (n – 1)n частей. Новая прямая делится точками пересечения со старыми прямыми на n интервалов. Каждый из этих интервалов разбивает одну часть на две. Следовательно, добавится n частей. Поэтому всего частей станет 1 + ½ (n – 1)n + n = 1 + ½ n(n + 1).",
        "Ответ: 1 + ½ n(n + 1)."
    ],
    "78214": [
        "Обыкновенные дроби",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Доказать, что любая правильная дробь может быть представлена в виде (конечной)  суммы обратных величин попарно различных целых чисел.",
        "Решение: Пусть m/n – правильная дробь. Докажем требуемое утверждение индукцией по m.     База. При m = 1 утверждение очевидно.     Шаг индукции. Пусть m > 1. Запишем n в  виде n = qm – r, где 0 ≤ r < m. Тогда m/n = 1/q + r/qn. При r = 0 всё в порядке. В противном случае правильную дробь r/qn можно представить в требуемом виде по предположению индукции. В полученном представлении для m/n не появится одинаковых слагаемых, поскольку r/qn < 1/q."
    ],
    "60311": [
        "Индукция (прочее)",
        "Сложность: 2+",
        "Классы: 8,9,10",
        "Условие: Докажите неравенство 2m+n–2 ≥ mn, где m и n – натуральные числа.",
        "Решение: Индукция по m. База (2n–1 ≥ n) фактически доказана в задаче 60306.     Шаг индукции. 2m+n–1 ≥ 2mn ≥ (m + 1)n."
    ],
    "78266": [
        "Деревья",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: n точек соединены отрезками так, что каждая точка с чем-нибудь соединена и нет таких двух точек, которые соединялись бы двумя разными путями.  Доказать, что общее число отрезков равно n – 1.",
        "Решение: См. задачу 31098 б)."
    ],
    "78699": [
        "Раскраски",
        "Сложность: 3",
        "Классы: 10",
        "Условие: Остров",
        "Решение: Будем называть такое разбиение острова на треугольники триангуляцией. Докажем требуемое утверждение индукцией по числу треугольников триангуляции. Для одного треугольника требуемая раскраска существует. Предположим теперь, что можно раскрасить требуемым образом любую триангуляцию, состоящую менее чем из"
    ],
    "79299": [
        "Показательные неравенства",
        "Сложность: 3",
        "Классы: 8",
        "Условие: Какое из двух чисел больше:",
        "Решение: См. решение задачи 79303.",
        "Ответ: а) Второе число; б) первое число."
    ],
    "79303": [
        "Показательные неравенства",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Какое из двух чисел больше:",
        "Решение: а) Пусть an =   (n двоек),  bn =     (n – 1 тройка). При n = 2 22 > 3. Докажем по индукции, что an < bn при n ≥ 3.    База: 22² < 3³.     Шаг индукции. an+1 = 2an < 2bn < 3bn = bn+1.",
        "Ответ: а) Второе число при n ≥ 3; &nbsp  б) первое число."
    ],
    "30940": [
        "Четность и нечетность",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: В выражении 1*2*3*...*9 звёздочки заменяют на минус или плюс.    a) Может ли получиться 0?    б) Может ли получиться 1?    в) Какие числа могут получиться?",
        "Решение: а) Чётное число получиться не может, так как количество нечётных слагаемых (их 5) нечётно.",
        "Ответ: а) Не может; б) может; в) все нечётные числа от –45 до 45."
    ],
    "34972": [
        "Комбинаторика (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: При каких n > 3 набор гирь с массами 1, 2, 3, ..., n граммов можно разложить на три равные по массе кучки?",
        "Подсказка: Шесть гирь, массы которых – шесть последовательных чисел, легко разложить на три равные по массе кучки.",
        "Решение: Назовём число n хорошим, если набор гирь с массами 1, 2, 3, ..., n можно разложить на три равные по массе кучки. Для хорошего n суммарная масса гирь, равная ½ n(n+1), кратна 3. Поэтому n может давать только остатки 0 или 2 при делении на 3.    Если число n хорошее, то число n + 6 тоже хорошее, поскольку гири массами n + 1, n + 2, ..., n + 6 легко разложить на три равные по массе кучки.     Легко проверить, что числа 5, 8, 9 хорошие: 1 + 4 = 2 + 3 = 5; 1 + 2 + 3 + 6 = 4 + 8 = 5 + 7; 1 + 2 + 3 + 4 + 5 = 6 + 9 = 7 + 8. То, что 6 – хорошее число, показано выше. Значит, хорошими являются все числа вида 3k (k ≥ 3) и 3k + 2 (k ≥ 1).",
        "Ответ: При n, кратных 3 или дающих остаток 2 при делении на 3."
    ],
    "35025": [
        "Разные задачи на разрезания",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На какое наибольшее число частей могут разбить плоскость n окружностей?",
        "Подсказка: Если k окружностей уже проведены, то (k+1)-я окружность разбивается ими не более чем на 2k дуг.",
        "Решение: Одна окружность делит плоскость на две части. Пусть уже проведены k окружностей. Рассмотрим (k+1)-ю окружность. Она пересекает предыдущие k окружностей не более чем в 2k точках (каждую окружность – не более чем в двух точках). Следовательно, (k+1)-я окружность разбивается первыми k окружностями не более чем на 2k дуг. Каждая дуга делит одну из частей, на которые плоскость была разделена k окружностями, еще на две части. Тем самым, каждая дуга прибавляет одну часть плоскости, и (k1)-я окружность прибавляет не более 2k частей плоскости. Более того, (k+1)-я окружность прибавляет ровно 2k частей плоскости тогда и только тогда, когда она пересекает каждую из предыдущих окружностей в двух точках и все эти точки различны. Таким образом, n окружностей делят плоскость не более чем на 2 + (2 + 4 + 6 + ... + 2(n – 1)) = n(n – 1) + 2 части, причём равенство достигается, если каждая пара окружностей пересекается в двух точках и все эти точки пересечения различны (то есть никакие три окружности не проходят через одну точку).     Можно указать пример такой системы n окружностей: возьмём одну окружность, а все остальные получим из неё сдвигами на вектора a, 2a, ..., (n – 1)a, где a – достаточно малый по длине вектор (настолько малый, что первая и последняя окружности пересекаются в двух точках).",
        "Ответ: На n(n – 1) + 2 части."
    ],
    "35136": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что если в числе 12008 между нулями вставить любое количество троек, то получится число, делящееся на 19.",
        "Решение: 3·1203...308 = 3609...924 = 3610...000 – 76, а числа 361 и 76 делятся на 19."
    ]
}