{
    "35583": [
        "Инварианты",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: 100 фишек выставлены в ряд. Разрешено менять местами две фишки, стоящие через одну фишку.   Можно ли с помощью таких операций переставить все фишки в обратном порядке?",
        "Подсказка: Фишка, стоящая на чётном месте, остаётся на чётном месте.",
        "Решение: Занумеруем места, на которых стоят фишки, числами от 1 до 100. Заметим, что после выполнения указанной операции номер каждой фишки либо не изменился, либо изменился (увеличился или уменьшился) на 2. Таким образом, фишка, стоящая вначале на месте с чётным номером, в любой момент будет стоять на месте с чётным номером. Следовательно, фишка, стоящая на месте номером 100, никогда не сможет попасть на  клетку с номером 1.",
        "Ответ: Нельзя."
    ],
    "30767": [
        "Инварианты",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: Разменный автомат меняет одну монету на пять других.  Можно ли с его помощью разменять металлический рубль на 26  монет?",
        "Решение: Нельзя.  Проследите за остатками по модулю 4."
    ],
    "31347": [
        "Задачи на смеси и концентрации",
        "Сложность: 2+",
        "Классы: 5,6,7",
        "Условие: Есть два стакана: один с молоком, другой с водой.     a) Из первого перелили ложку во второй, перемешали и перелили ложку смеси обратно. Чего больше: воды в стакане  с  молоком  или молока в стакане с водой?    б) Тот же вопрос, если описанную процедуру повторили 100 раз.",
        "Решение: См. задачу 35045.",
        "Ответ: Одинаковое количество."
    ],
    "32924": [
        "Задачи на смеси и концентрации",
        "Сложность: 2+",
        "Классы: 7",
        "Условие: Из бочки с водой в бочку с вином перелили стакан воды. Потом передумали и перелили обратно стакан вина. Чего больше: вина в воде или воды в вине?",
        "Решение: См. задачу 35045.",
        "Ответ: Одинаковое количество."
    ],
    "35045": [
        "Задачи на смеси и концентрации",
        "Сложность: 2+",
        "Классы: 6,7,8,9",
        "Условие: В одном стакане было молоко, а в другом – столько же кофе. Из стакана молока перелили одну ложку в стакан с кофе и размешали. Затем такую же ложку смеси перелили обратно в стакан с молоком. Чего теперь больше: кофе в стакане с молоком или молока в стакане с кофе?",
        "Решение: См. задачу 30274.",
        "Ответ: Поровну."
    ],
    "66043": [
        "Задачи на смеси и концентрации",
        "Сложность: 2+",
        "Классы: 6,7,8,9",
        "Условие: В красном ящике 100 красных шаров, а в зелёном ящике – 100 зелёных шаров. Восемь красных шаров переложили в зелёный ящик, а потом столько же шаров переложили из зелёного ящика в красный. Шары в ящиках хорошенько перемешали. Что теперь больше: вероятность вытащить наудачу из красного ящика зелёный шар или из зелёного ящика красный?",
        "Подсказка: См. задачу 30274.",
        "Ответ: Вероятности равны."
    ],
    "88011": [
        "Четность и нечетность",
        "Сложность: 2+",
        "Классы: 5,6,7,8",
        "Условие: Дядька Черномор написал на листке бумаги число 20. 33 богатыря передают листок друг другу, и каждый или прибавляет к числу, или отнимает от него единицу. Может ли в результате получиться число 10?",
        "Решение: После того как листок побывает в руках у богатыря, число, на нём написанное, будет менять свою чётность. Поэтому после 33 изменений число станет нечётным.",
        "Ответ: Не может."
    ],
    "86556": [
        "Теория игр (прочее)",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Игра с тремя кучками камней.",
        "Решение: Всего имеется 45 камней. В итоге мы получим 45 кучек по одному камню. Для того, чтобы первую кучку разложить по одному камню, надо 9 ходов, для второй кучки понадобиться 14 ходов, для третьей — 19 ((число ходов не зависит от того, отделяем по одному камню или по несколько). Итак, число ходов 9+14+19=42 и это число не зависит от того какие ходы делают партнеры. Последний, четный ход делает второй и выигрывает."
    ],
    "88037": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: На волшебной яблоне выросли 15 бананов и 20 апельсинов. Одновременно разрешается срывать один или два плода. Если сорвать один  из плодов вырастет такой же, если сорвать сразу два одинаковых плода – вырастет апельсин, а если два разных – вырастет банан.     а) В каком порядке надо срывать плоды, чтобы на яблоне остался ровно один плод?     б) Можете ли вы определить, какой это будет плод?     в) Можно ли срывать плоды так, чтобы на яблоне ничего не осталось?",
        "Подсказка: Можно ли срывать плоды так, чтобы число бананов на яблоне стало чётным?",
        "Решение: б), в) Заметим, что число бананов на яблоне всегда будет нечётным.",
        "Ответ: б) Банан;  в)нельзя."
    ],
    "35608": [
        "Инварианты и полуинварианты",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: По кругу стоят натуральные числа от 1 до 6 по порядку.    Разрешается к любым трем подряд идущим числам  прибавить по 1    или из любых, стоящих через одно, вычесть 1. Можно ли с помощью    нескольких таких операций сделать все числа равными?",
        "Подсказка: Рассмотрите суммы диаметрально противоположных чисел.",
        "Решение: Рассмотрим три суммы - первого и четвертого, второго и    пятого, третьего и шестого. Вначале эти суммы были равны    соответственно 1+4=5, 2+5=7, 3+6=9.    Заметим, что при выполнении первой операции, описанной в условии,    каждая из этих трех сумм возрастает на 1, а при выполнении второй    операции - каждая из сумм уменьшается на 1.    Таким образом, эти три суммы никогда не станут равными. Отсюда    следует, что все шесть чисел также не могут стать равными."
    ],
    "88319": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Хулиганы Вася и Петя порвали стенгазету, причём Петя рвал каждый кусок на 5 частей, а Вася на 9. При попытке собрать стенгазету нашли 1988 обрывков. Докажите, что нашли не все кусочки.",
        "Решение: Как Петя, так и Вася на каждом шаге добавляли чётное число кусков. Значит, общее число кусочков было нечётно. Но 1988 – число чётное."
    ],
    "102809": [
        "Процессы и операции",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: На доске написано число 12. В течение каждой минуты число либо умножают, либо делят либо на 2, либо на 3, и результат записывают на доску вместо исходного числа. Докажите, что число, которое будет написано на доске ровно через час, не будет равно 54.",
        "Решение: После каждой операции меняется чётность общего количества двоек и троек в разложении на простые множители числа на доске. В начале это число нечётно (равно 3), так как 12 = 2·2·3. Поэтому через 60 операций (секунд) оно должно быть нечётным, но в разложении 54 = 2·3·3·3 четыре множителя."
    ],
    "103012": [
        "Задачи на смеси и концентрации",
        "Сложность: 3",
        "Классы: 5,6,7,8,9",
        "Условие: Винни-Пух решил позавтракать. Он налил себе стакан чая и добавил сливок из большого кувшина. Но как только он перемешал сливки и чай, то понял, что хочет пить чай без сливок. Недолго думая, он вылил из стакана в кувшин столько же чая со сливками, сколько сначала взял оттуда сливок. Конечно же, при переливании чай от сливок не отделился, и у Винни-Пуха образовались две смеси чая и сливок   – в стакане и в кувшине. Тогда Винни-Пух задумался: чего же получилось больше – чая в кувшине со сливками или сливок в стакане чая? А как думаете вы?",
        "Решение: См. задачу 30274.",
        "Ответ: Поровну."
    ],
    "107706": [
        "Делимость чисел. Общие свойства",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Сумасшедший кассир меняет любые две монеты на любые три по вашему выбору,  а любые три – на любые две. Сможет ли Петя обменять у него 100 монет достоинством 1 рубль на 100 монет достоинством 1 форинт, отдав ему  при обмене ровно 2001 монету?",
        "Решение: Если Петя меняет две монеты на три, то количество монет у него увеличивается на одну. Пусть он произвёл N таких обменов. Отдал кассиру 2N монет. Чтобы сохранить общее число монет, Петя вынужден совершить столько же обменов трёх монет на две. При этом он отдаст кассиру ещё 3N монет. Всего он отдаст, таким образом, 2N + 3N = 5N монет. Но 2001 не делится на 5.",
        "Ответ: Не может."
    ],
    "30755": [
        "Таблицы и турниры (прочее)",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: В таблице 8×8 одна из клеток закрашена чёрным цветом, все остальные – белым. Докажите, что с помощью перекрашивания строк и столбцов нельзя добиться того, чтобы все клетки стали белыми. Под перекрашиванием строки или столбца понимается изменение цвета всех клеток в строке или столбце.",
        "Решение: При перекрашивании строки или столбца чётность количества чёрных клеток в таблице не изменяется, а сначала их количество нечётно."
    ],
    "32018": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: На доске написаны числа 0, 1, 0, 0. За один шаг разрешается прибавлять единицу к любым двум из них.   Можно ли, повторяя эту операцию, добиться, чтобы все числа стали равными?",
        "Решение: См. задачу 35134."
    ],
    "35106": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Клетки доски 7×7 окрашены в шахматном порядке так, что углы окрашены в чёрный цвет. Разрешается перекрашивать в противоположный цвет любые две соседние клетки. Можно ли с помощью таких операций перекрасить всю доску в белый цвет?",
        "Подсказка: При перекрашивании чётность числа клеток каждого цвета не изменяется.",
        "Решение: Заметим, что при перекрашивании двух клеток количество клеток белого (или чёрного) цвета либо увеличивается на 2, либо уменьшается на 2, либо остаётся неизменным. В любом случае чётность числа клеток каждого цвета не изменяется. Вначале было 24 клетки белого цвета. Если в конце вся доска стала бы белой цвет, то белых клеток стало бы 49. Поскольку 24 и 49 – числа разной чётности, то данное перекрашивание невозможно.",
        "Ответ: Нельзя."
    ],
    "35111": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: На столе стоят семь стаканов – все вверх дном.  За один ход можно перевернуть любые четыре стакана.   Можно ли за несколько ходов добиться того, чтобы все стаканы стояли правильно?",
        "Подсказка: Как изменяется чётность числа стаканов, стоящих вверх дном?",
        "Решение: Первый способ. Пусть в некоторый момент мы перевернули 4 стакана, из которых k стаканов стояли вверх дном, а 4 – k – правильно (k может принимать значения от 0 до 4). После переворачивания из этих четырёх стаканов k будут стоять правильно, а 4 – k – вверх дном. Таким образом, количество стаканов, стоящих вверх дном, изменится на чётное число 4 – k – k = 2(2 – k). Таким образом, чётность числа стаканов, стоящих вверх дном, не меняется. Поэтому в любой момент имеется нечётное число стаканов, стоящих вверх дном (так как вначале так стояли 7 стаканов).",
        "Ответ: Нельзя."
    ],
    "35553": [
        "Деление с остатком",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Из книги вырвали 25 страниц. Может ли сумма 50 чисел, являющихся номерами (с двух сторон) этих страниц, быть равной 2001?",
        "Подсказка: Сумма двух номеров, написанных с двух сторон одной страницы, даёт остаток 3 от деления на 4.",
        "Решение: Рассмотрим одну из страниц. С одной стороны нее написано нечётное число 2m – 1,  а с другой – следующее за ним чётное число 2m. Сумма этих двух номеров равна 4m – 1, то есть даёт от деления на 4 остаток 3. Значит, сумма 50 номеров страниц, о которых говорится в условии, даёт такой же остаток от деления на 4, как и 3·25 = 75, то есть 3. Однако 2001 даёт остаток 1 при делении на 4.",
        "Ответ: Не может."
    ],
    "35617": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Петя вынимает из мешка чёрные и красные карточки и складывает их в две стопки. Класть карточку на другую карточку того же цвета запрещено. Десятая и одиннадцатая карточки, выложенные Петей, – красные, а двадцать пятая – чёрная. Какого цвета двадцать шестая выложенная карточка?",
        "Подсказка: Покажите, что после того, как была положена карточка с нечётным номером, сверху оказались две карточки одного цвета.",
        "Решение: Заметим, что положения, когда сверху лежат две карточки одного цвета, и положения, когда сверху лежат две карточки разного цвета, чередуются. Поскольку 10-я и 11-я карточки – красные, то после того как была положена 11-я карточка, сверху лежали две карточки одного цвета (красные). Значит, и после того, как была положена 25-я карточка (как и любая карточка с нечётным номером), сверху оказались две карточки одного цвета. Так как 25-я карточка чёрная, то две верхние карточки – чёрные. Поэтому, следующая, 26-я карточка может быть только красной (на чёрную карточку можно положить только красную).",
        "Ответ: Красная."
    ],
    "88026": [
        "Инварианты",
        "Сложность: 3",
        "Классы: 5,6,7,8",
        "Условие: Вязыке Древнего Племени алфавит состоит всего издвух букв: М иО.Два слова являются синонимами, если одно издругого можно получить при помощи исключения или добавления буквосочетаний МО иООММ, повторяемых влюбом порядке илюбом количестве. Являютсяли синонимами вязыке Древнего Племени слова ОММ иМОО?",
        "Подсказка: Заметьте, разность между количествами букв М иОнеменяется при добавлении или удалении разрешённых буквосочетаний.",
        "Решение: Заметьте, что при каждом добавлении или удалении разрешённых буквосочетаний неменяется разность между количеством буквМ иО вслове— она всегда равна1 для слова ОММ и-1 для слова МОО. Значит, эти слова несинонимы.",
        "Ответ: Эти слова несинонимы."
    ],
    "35767": [
        "Процессы и операции",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Имеется полоска 1×99, разбитая на 99 клеток 1×1, которые раскрашены через одну в чёрный и белый цвет. Разрешается перекрашивать одновременно все клетки любого клетчатого прямоугольника 1×k. За какое наименьшее число перекрашиваний можно сделать всю полоску одноцветной?",
        "Подсказка: Каждое перекрашивание разрушает не более двух границ между клетками разных цветов.",
        "Решение: Оценка. Назовём перемычкой отрезок, разделяющий две клетки разных цветов. В начале у нас имеется 98 перемычек. Каждое перекрашивание изменяет число перемычек не более чем на 2. Значит, 48 перекрашиваний не хватит.    Алгоритм. Перекрасим все клетки со второй по 98-ю, затем все клетки с третьей по 97-ю, ..., наконец, одну 50-ю клетку. После этого полоска станет одноцветной.",
        "Ответ: За 49 перекрашиваний."
    ],
    "58170": [
        "Шахматные доски и шахматные фигуры",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Дана шахматная доска. Разрешается перекрашивать в другой цвет сразу все клетки какой-либо горизонтали или вертикали.   Может ли при этом получиться доска, у которой ровно одна чёрная клетка?",
        "Решение: При перекрашивании горизонтали или вертикали, содержащей k чёрных  и 8 – k белых клеток, получится 8 – k чёрных и k белых клеток. Поэтому число чёрных клеток изменится на (8 – k) – k = 8 – 2k, то есть на чётное число. Так как чётность числа чёрных клеток сохраняется, из исходных 32 чёрных клеток мы не сможем получить одну чёрную клетку."
    ],
    "60646": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: В пробирке находятся марсианские амёбы трёх типов A, B и C. Две амёбы любых двух разных типов могут слиться в одну амёбу третьего типа. После нескольких таких слияний в пробирке оказалась одна амёба. Каков её тип, если исходно амёб типа A было 20 штук, типа B – 21 штука и типа C – 22 штуки?",
        "Решение: См. решение задачи 34853.",
        "Ответ: B."
    ],
    "60682": [
        "Деление с остатком",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Разочарованный вкладчик фонда Нефтьалмазинвест разорвал акцию на 8 кусков. Не  удовлетворившись этим, он разорвал один из кусков еще на 8, и т.д.   Могло ли у него получиться 2002 куска?",
        "Решение: Каждое разрывание добавляет 7 кусков, поэтому количество кусков всегда даёт остаток 1 при делении на 7. А 2002 кратно 7.",
        "Ответ: Не могло."
    ],
    "64992": [
        "Турниры и турнирные таблицы",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: По окончании шахматного турнира Незнайка сказал: Я набрал на 3,5 очка больше, чем потерял. Могут ли его слова быть правдой?   (Победа – 1 очко, ничья – ½ очка, поражение – 0.)",
        "Решение: Перед началом турнира разность между набранными и потерянными очками Незнайки равнялась нулю. Если партия результативна, то эта разность изменяется на 1, а если партия закончилась вничью, то разность не изменяется. Следовательно, такая разность может принимать только целые значения, то есть не может быть равна 3,5.",
        "Ответ: Не могут."
    ],
    "88187": [
        "Числовые таблицы и их свойства",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: На клетке b8 шахматной доски написано число –1, а на всех остальных клетках число 1. Разрешается одновременно менять знак во всех клетках одной  вертикали или одной горизонтали. Докажите, что сколько бы раз мы это ни проделывали, невозможно добиться, чтобы все числа в таблице стали положительными.",
        "Подсказка: Обратите внимание: при перемене знаков в строке или столбце произведение всех чисел в таблице не меняется.",
        "Решение: Поскольку мы меняем знаки каждый раз в восьми клетках, то произведение всех чисел в таблице не меняется. А раз в начале оно было отрицательным, то стать положительным оно не сможет."
    ],
    "108732": [
        "Арифметика остатков (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: У Ивана-царевича есть два волшебных меча. Первым он может отрубить Змею  Горынычу 21 голову. Вторым – 4 головы, но при этом у Змея Горыныча  отрастает 2006 голов. Может ли Иван отрубить Змею Горынычу все головы, если в  самом начале у него было 100 голов? (Если, например, у Змея Горыныча осталось лишь три головы, то рубить их ни тем, ни другим мечом нельзя.)",
        "Решение: Остаток числа голов Змея Горыныча по модулю 7 не меняется, а вначале этот  остаток равен 2.",
        "Ответ: Не сможет."
    ],
    "30433": [
        "Полуинварианты",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Двое по очереди ломают шоколадку 6×8. За ход разрешается сделать прямолинейный разлом любого из кусков вдоль углубления. Проигрывает тот, кто не сможет сделать ход. Кто выиграет в этой игре?",
        "Решение: Игра будет продолжаться ровно 47 ходов (см. задачу 35544). Последний, 47-й ход (так же как и все другие ходы с нечётными номерами) сделает первый игрок.",
        "Ответ: Начинающий."
    ],
    "108751": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: На столе стоят 13 перевёрнутых стаканов. Разрешается одновременно переворачивать любые два стакана.   Можно ли добиться того, чтобы все стаканы стояли правильно?",
        "Подсказка: См. задачу 35111.",
        "Ответ: Нельзя."
    ],
    "35449": [
        "Разные задачи на разрезания",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: От пирога, имеющего форму выпуклого многоугольника, разрешается    отрезать треугольный кусок ABC, где A - некоторая вершина, а B и C    - точки, лежащие строго внутри сторон, имеющих вершину A.    Вначале пирог имеет форму квадрата. В центре этого квадрата    расположена изюминка. Докажите, что ни на каком шаге от пирога    нельзя отрезать кусок, содержащий изюминку.",
        "Подсказка: Кусок пирога всегда имеет стороны, принадлежащие сторонам    исходного квадратного пирога.",
        "Решение: Операция отрезания устроена таким образом, что после отрезания    две стороны многоугольника укорачиваются, а также появляется новая    сторона. Таким образом, никакая сторона не отрезается полностью.    Значит, после любого числа отрезаний    кусок пирога всегда имеет четыре стороны, принадлежащие сторонам    исходного квадратного пирога.    Пусть некоторая прямая l на некотором шаге отрезала кусок,    содержащий изюминку - центр квадрата.    Тогда, как нетрудно видеть, в отрезанной части окажется целиком    одна из сторон исходного квадрата (см. картинку).    Мы получили противоречие, которое показывает, что отрезать кусок с    изюминкой невозможно."
    ],
    "30756": [
        "Таблицы и турниры (прочее)",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: В таблице 3×3 одна из угловых клеток закрашена чёрным цветом, все остальные – белым.  Докажите, что с помощью перекрашивания строк и столбцов нельзя добиться того, чтобы все клетки стали белыми. Под перекрашиванием строки или столбца понимается изменение цвета всех клеток в строке или столбце.",
        "Подсказка: Чётность числа чёрных клеток среди четырёх угловых не меняется при перекрашиваниях.",
        "Решение: Первый способ. Выделим квадрат 2×2, содержащий чёрную клетку и заметим, что чётность числа чёрных клеток в нём не меняется."
    ],
    "35134": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В строку выписано m натуральных чисел. За один ход можно прибавить по единице к некоторым n из этих чисел.   Всегда ли можно сделать все числа равными?",
        "Подсказка: Если числа",
        "Решение: Пусть числа m и n имеют общий делитель d > 1, а сумма выписанных вначале чисел на d не делится. При прибавлении по единице к некоторым n из этих чисел сумма всех чисел увеличивается на n. Поскольку n делится на d, сумма выписанных чисел всегда будет иметь один и тот же остаток от деления на d, следовательно, сумма всех чисел никогда не будет делиться на d. Если же в некоторый момент все m чисел станут равными, то сумма всех чисел разделится на m и, следовательно, на d.",
        "Ответ: Не всегда."
    ],
    "35739": [
        "Задачи на смеси и концентрации",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Имеется два стакана, в первом стакане налито некоторое количество воды, а во втором – такое же количество спирта. Разрешается переливать некоторое количество жидкости из одного стакана в другой (при этом раствор равномерно перемешивается). Можно ли с помощью таких операций получить в первом стакане раствор, в котором процентное содержание спирта больше, чем во втором?",
        "Подсказка: Докажите, что в первом стакане воды всегда будет не меньше, чем спирта, а во втором стакане – наоборот.",
        "Решение: Для определенности примем количество жидкости, налитое в каждом из стаканов, равным 100 г. Докажем, что в первом стакане процентное содержание спирта никогда не превысит 50%, а во втором никогда не будет ниже 50%.      В начальный момент данное утверждение верно. Пусть оно верно в некоторый момент: в первом стакане воды не меньше, чем спирта, а во втором спирта не меньше, чем воды. Пусть мы перелили некоторое количество жидкости из первого стакана во второй. Тогда процентное содержание спирта в первом стакане осталось тем же, то есть в нём по-прежнему воды не меньше, чем спирта. Но во втором стакане в сумме с первым 100 г воды и 100 г спирта. Следовательно, во втором стакане после переливания спирта будет не меньше, чем воды. Итак, утверждение остается верным при переливаниях.",
        "Ответ: Нельзя."
    ],
    "64536": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: На доске были записаны числа 3, 9 и 15. Разрешалось сложить два записанных числа, вычесть из этой суммы третье, а результат записать на доску вместо того числа, которое вычиталось. После многократного выполнения такой операции на доске оказались три числа, наименьшее из которых было 2013. Каковы были два остальных числа?",
        "Решение: Заметим, что 9 – 3 = 6 и 15 – 9 = 6. Покажем, что в любой момент одно из чисел на доске будет на 6 меньше второго и на 6 больше третьего.    Действительно, пусть это свойство выполнено, и на доске записаны числа x – 6, x и x + 6. Если сложить два крайних числа и вычесть среднее, то тройка чисел не изменится. Если сложить первых два числа и вычесть третье, то получится тройка x – 6, x и x – 12, а если сложить два последних числа и вычесть первое, то получится тройка x + 12, x и x + 6. Во всех случаях указанное свойство сохраняется, поэтому оно будет выполняться после каждого шага. Значит, искомые числа: 2013 + 6 = 2019 и 2019 + 6 = 2025.",
        "Ответ: 2019 и 2025."
    ],
    "64554": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: ",
        "Условие: На экране компьютера – число 12. Каждую секунду число на экране умножают или делят либо на 2, либо на 3. Результат действия возникает на экране вместо записанного числа. Ровно через минуту на экране появилось число. Могло ли это быть число 54?",
        "Решение: Заметим, что 12 = 22·31, то есть суммарный показатель степени множителей (двоек и троек) равен 3. Независимо от произведённого действия, при каждой смене числа суммарный показатель степени множителей изменяется на 1. Всего должно произойти 60 таких изменений. Следовательно, через 60 секунд суммарный показатель степени должен быть той же чётности, что и в исходном числе 12.    Но 54 = 21·33, то есть этот показатель равен 4 – чётному числу. Значит, получить число 54 ровно через минуту невозможно.",
        "Ответ: Не могло."
    ],
    "30750": [
        "Инварианты",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: В алфавите языка племени УЫУ всего две буквы: У и Ы. Известно, что смысл слова не изменится     если из слова выкинуть стоящие рядом буквы УЫ и     при добавлении в любое место слова буквосочетания ЫУ или УУЫЫ.  Можно ли утверждать, что слова УЫЫ и ЫУУ имеют одинаковый смысл?",
        "Решение: Заметим, что при любой разрешённой операции разность между числом букв У и числом букв Ы в слове не изменяется. Но в словах УЫЫ и ЫУУ эти разности разные. Значит, из слова УЫЫ нельзя разрешенными операциями получить слово ЫУУ, и, следовательно, нельзя утверждать, что эти слова обязательно имеют одинаковый смысл.",
        "Ответ: Нельзя."
    ],
    "64959": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: В одной из вершин шестиугольника лежит золотая монета, а в остальных ничего не лежит. Кощей Бессмертный чахнет над златом и каждое утро снимает с одной вершины произвольное количество монет, после чего тут же кладёт на соседнюю вершину в шесть раз больше монет. Если к исходу какого-то дня во всех вершинах будет поровну монет, Кощей станет Властелином Мира. Докажите, что хоть злата у него сколько угодно, но Властелином Мира ему не бывать.",
        "Решение: Занумеруем вершины шестиугольника, начиная с той, где лежит монета, последовательными натуральными числами от 1 до 6. По условию разность между числом монет в нечётных вершинах и числом монет в чётных вершинах каждый день меняется на число, кратное 7.     В начальный момент эта разность равнялась 1. Поэтому сделать её равной нулю Кощею не удастся. Тем более ему не удастся уравнять количество монет во всех   вершинах."
    ],
    "65294": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: В окружность вписан неправильный многоугольник. Если вершина A разбивает дугу, заключенную между двумя другими вершинами, на две неравные части, то такая вершина A называется неустойчивой. Каждую секунду какая-нибудь неустойчивая вершина перепрыгивает в середину своей дуги. В результате каждую секунду образуется новый многоугольник. Докажите, что сколько бы секунд ни прошло, многоугольник никогда не будет равным исходному.",
        "Решение: Рассмотрим длины дуг между соседними точками. В силу неравенства a² + b² > (a+b/2)² (при a ≠ b) сумма квадратов этих дуг каждую секунду уменьшается. Следовательно, многоугольник никогда не станет таким же, как был."
    ],
    "65424": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: На доске записаны числа 20 и 100. Разрешается дописать на доску произведение любых двух имеющихся на ней чисел. Можно ли такими операциями когда-нибудь получить на доске число 50...0 (2015 нулей)?",
        "Решение: Так как 20 = 2²·5, 100 = 2²·5², то изначально на доске записаны числа, в разложении которых простые множители двоек не меньше, чем пятерок. При умножении двух чисел, обладающим этим свойством, получится число с этим же свойством, то есть оно будет выполняться для всех чисел, записанных на доске. В разложении числа 50...0 на простые множители количество пятерок на 1 больше, чем количество двоек, поэтому его получить нельзя.",
        "Ответ: Нельзя."
    ],
    "79529": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Над строкой из четырёх чисел 1, 9, 8, 8 проделаем следующую операцию: между каждыми двумя соседними числами впишем число, которое получится в результате вычитания левого числа из правого. Над новой строкой проделаем ту же операцию и т.д. Найдите сумму чисел строки, которая получится после ста таких операций.",
        "Решение: Посмотрим, как изменяется сумма чисел строки после одной операции. Пусть",
        "Ответ: 726"
    ],
    "86560": [
        "Таблицы и турниры (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: В угловой клетке таблицы 5×5 стоит плюс, а в остальных клетках стоят минусы. Разрешается в любой строке или любом столбце поменять знаки на противоположные. Можно ли за несколько таких операций получить все знаки плюсами?",
        "Решение: См. задачу 30756."
    ],
    "30752": [
        "Инварианты",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: На доске написаны числа 1, 2, 3, ..., 19, 20. Разрешается стереть любые два числа a и b и вместо них написать число a + b – 1.   Какое число может остаться на доске после 19 таких операций?",
        "Решение: Для любого набора из n чисел на доске рассмотрим следующую величину X: сумму всех чисел, уменьшенную на n. Нетрудно проверить, что это – инвариант. В наборе из условия X = (1 + 2 + ... +  20) – 20 = 190. После 19 операций, когда на доске останется одно число p, X = p – 1. Значит, p = 191.",
        "Ответ: 191."
    ],
    "35529": [
        "Теория алгоритмов (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На столе - куча из 1001 камня. Ход состоит в том, что из    какой-либо кучи, содержащей более одного камня, выкидывают камень,    а затем одну из куч делят на две.    Можно ли через несколько ходов оставить на столе только кучки,    состоящие из трех камней?",
        "Подсказка: При выполнении хода сумма числа камней и числа кучек остается    постоянной.",
        "Решение: Заметим, что при выполнении одного хода    число камней на столе уменьшается на 1, а число кучек    увеличивается на единицу.    Таким образом, при выполнении хода или нескольких ходов    сумма числа камней и числа кучек остается    постоянной, равной 1002 (так как вначале число кучек было равно 1,    а число камней - 1001).    Если бы в конце концов мы получили n кучек по 3 камня,    то в этот момент число камней на столе было  бы равным 3n,    и следовательно,    сумма числа камней и числа кучек была бы равна 3n+n=4n.    Но ни при каком натуральном n число 4n не может быть равно 1002,    так как 1002 не делится на 4. Тем самым, получено противоречие,    доказывающее, что требуемое в условии задачи не возможно.",
        "Ответ: нельзя."
    ],
    "35369": [
        "Свойства симметрий и осей симметрии",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: С многоугольником разрешено проделывать следующую операцию.    Если многоугольник делится отрезком AB на на два многоугольника,    то один из этих многоугольников можно отразить симметрично    относительно серединного перпендикуляра к отрезку AB. (Операция    разрешается только в том случае, когда    в результате получается несамопересекающийся    многоугольник.) Можно ли путем нескольких таким операций получить    из квадрата правильный треугольник?",
        "Подсказка: При проведении данных операций не изменяются площадь и периметр    многоугольника (как говорят, площадь и периметр являются",
        "Решение: Заметим, что при проведении данных операций не изменяются площадь и периметр    многоугольника.    Предположим, что нам удалось путем нескольких таких операций    получить из квадрата правильный треугольник.    Примем за 1 сторону квадрата. Тогда вначале площадь многоугольника    равнялась 1, а периметр равнялся 4.    В полученном правильном треугольнике. следовательно, периметр    также должен равняться 4 (т.е. сторона треугольника должна равняться    4/3), а площадь - 1.    Однако, площадь правильного треугольника со стороной  4/3 равна    (как легко посчитать) (4*3",
        "Ответ: нельзя."
    ],
    "64538": [
        "Процессы и операции",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Саша начертил квадрат размером 6×6 клеток и поочередно закрашивает в нём по одной клетке. Закрасив очередную клетку, он записывает в ней число – количество закрашенных клеток, соседних с ней. Закрасив весь квадрат, Саша складывает числа, записанные во всех клетках. Докажите, что в каком бы порядке Саша ни красил клетки, у него в итоге получится одна и та же сумма. (Соседними считаются клетки, имеющие общую сторону.)",
        "Решение: Рассмотрим все единичные отрезки, которые являются общими сторонами для двух клеток. Таких отрезков ровно шестьдесят – 30 вертикальных и 30 горизонтальных. Если отрезок разграничивает две закрашенные клетки, то будем говорить, что он окрашен. Заметим, что когда Саша пишет какое-то число в клетке, он указывает количество отрезков, которые не были окрашены до закрашивания этой клетки, а теперь стали окрашенными. Когда Саша приступает к суммированию, окрашены все 60 отрезков, то есть сумма чисел, которые записывает Саша, всегда будет равна 60."
    ],
    "64965": [
        "Процессы и операции",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На экране компьютера сгенерирована некоторая конечная последовательность нулей и единиц. С ней можно производить следующую операцию: набор цифр 01 заменять на набор цифр 1000. Может ли такой процесс замен продолжаться бесконечно или  когда-нибудь он обязательно прекратится?",
        "Решение: Первый способ. Каждую операцию можно понимать как ход  какой-то единицы: единица меняется местами со стоящим перед нею нулём, а потом после нуля появляются ещё два нуля. Пусть ежеминутно делается один такой ход, и процесс продолжается бесконечно долго. Тогда найдутся единицы, которые ходили  бесконечное число раз. Рассмотрим самую левую из них и покрасим её в красный цвет. Все единицы левее красной через несколько минут перестанут перемещаться. После этого красная единица каждым своим ходом будет перемещаться  ближе к началу последовательности, то есть сделает ещё лишь конечное  число ходов, что противоречит её выбору.",
        "Ответ: Процесс прекратится."
    ],
    "88309": [
        "Инварианты",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Круг разделен на 6 секторов, в котором по часовой стрелке стоят числа 1,0,1,0,0,0. Можно прибавлять по единице к любым числам, стоящим в двух соседних секторах. Можно ли сделать все числа равными?",
        "Решение: Занумеруем сектора числами от 1 до 6. Допустим, что единицы стоят в первом и третьем секторах (общность решения не теряется). Сумма чисел, стоящих в нечетных секторах вначале равна двум, а в четных секторах — нулю. Т.к. мы добавляем по единице одновременно  в сектора с четным и нечетным номерами, то разность между этими суммами по-прежнему будет равна 2, и, следовательно, числа нельзя сделать равными."
    ],
    "79613": [
        "Разные задачи на разрезания",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: В центре квадратного пирога находится изюминка. От пирога можно отрезать  треугольный кусок по линии, пересекающей в точках, отличных от вершин, две  соседние стороны; от оставшейся части пирога — следующий кусок (таким же  образом) и т.д. Можно ли отрезать изюминку?",
        "Решение: В решении задачи",
        "Ответ: нельзя."
    ],
    "102984": [
        "Инварианты",
        "Сложность: 3",
        "Классы: 5,6,7",
        "Условие: Можно ли ходом коня обойти все клетки шахматной доски, начав с клетки",
        "Подсказка: Заметьте, после каждого нечетного хода конь находится на белой клетке, после каждого четного — на чеpной.",
        "Решение: Нет, нельзя. Чтобы обойти все клетки шахматной доски, надо сделать 63 хода. После каждого нечетного хода конь находится в белой клетке, после каждого четного — в черной. Значит на 63-м ходу конь обязательно придет в белую клетку. Но клетка"
    ],
    "79618": [
        "Разные задачи на разрезания",
        "Сложность: 4",
        "Классы: 7,8,9,10",
        "Условие: От пирога, имеющего форму выпуклого пятиугольника, можно отрезать треугольный кусок по линии, пересекающей в точках, отличных от вершин, две соседние стороны; от оставшейся части пирога — следующий кусок (таким же образом) и т.д. В какие точки пирога можно воткнуть свечку, чтобы её нельзя было отрезать?",
        "Решение: Ответ: свечку можно воткнуть в одну из точек многоугольника (включая  границу), закрашенного на рисунке. Будем решать задачу для произвольного многоугольника. Пусть",
        "Ответ: A"
    ],
    "64192": [
        "Квадратные уравнения. Теорема Виета",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: На доске было написано уравнение вида x² + px + q = 0 с целыми ненулевыми коэффициентами p и q. Временами к доске подходили разные школьники, стирали уравнение, после чего составляли и записывали уравнение такого же вида, корнями которого являются коэффициенты стёртого уравнения. В какой-то момент составленное уравнение совпало с тем, что было написано на доске изначально. Какое уравнение изначально было написано на доске?",
        "Решение: По теореме Виета, коэффициенты нового трёхчлена равны –(p + q) и pq соответственно. Заметим, что ни у одного из написанных трёхчленов второй коэффициент (при x) не может быть равен нулю. Действительно, в этом случае у всех последующих трёхчленов свободный член был бы равен нулю, а значит, среди них не мог встретиться исходный многочлен. Далее, у каждого следующего трёхчлена модуль свободного члена не меньше, чем у предыдущего. Следовательно, модули всех свободных членов равны, а значит, все вторые коэффициенты равны ±1. Итак, – (p + q) = ± 1, p = ± 1. Поэтому для первого трёхчлена возможны только два варианта: x² + x – 2 и x² – x + 2. Несложно проверить, что в первом случае трёхчлен не изменяется, а во втором сначала получается трёхчлен x² – x – 2, а потом – трёхчлен x² + 3x + 2, модуль второго коэффициента которого не равен единице.",
        "Ответ: x² + x – 2."
    ],
    "73732": [
        "Числовые таблицы и их свойства",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: В прямоугольную таблицу из m строк и n столбцов записаны mn положительных чисел. Найдём в каждом столбце произведение чисел и сложим все n таких произведений. Докажите, что если переставить числа в каждой строке в порядке возрастания, то сумма аналогичных произведений будет не меньше, чем в первоначальной. Решите эту задачу для     а) m = n = 2;     б) m = 2 и произвольного n;     в) любых натуральных m и n.",
        "Решение: в) Индукция по числу столбцов таблицы. База (один столбец) очевидна.     Шаг индукции. Обозначим через Pi произведение чисел в i-м столбце. Переставим теперь столбцы так (это не изменит сумму произведений), чтобы произведение P1 стало минимальным. Обозначим через xij число, стоящее в i-й строке и  j-м столбце. Предположим, что xi1 – не минимальное число в i-й строке: минимальным является xik. Поменяем местами xi1 и xik и проверим, что сумма произведений при этом возрастёт. Обозначим через П1 произведение всех чисел в первом столбце, кроме xi1, через Пk – произведение всех чисел в k-м столбце, кроме xik. Разность новой и старой сумм равна xi1Пk + xikП1 – xi1П1 – xikПk = (xi1 – xik)(Пk – П1). Эта величина положительна, так как xi1 > xik и Пk > П1, поскольку xikПk ≥ xi1П1. Значит, после  перестановки сумма увеличилась. Кроме того, произведение новых чисел в первом столбце по-прежнему минимально. Таким образом, мы можем переставить все числа,  минимальные в строках, в первый столбец, и сумма произведений увеличится.     Если упорядочить строки в таблице, образованной столбцами со 2-го по n-й, то мы получим исходную таблицу с упорядоченными строками. По предположению индукции при этом упорядочении сумма произведений P2 + ... + Pn не уменьшится. Следовательно, сумма P1 + ... + Pn в первоначальной таблице не больше, чем аналогичная сумма в таблице с упорядоченными строками."
    ],
    "30754": [
        "Инварианты",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: На шести ёлках сидят шесть чижей, на каждой ёлке – по чижу. Ёлки растут в ряд с интервалами в 10 метров. Если какой-то чиж перелетает с одной ёлки на другую, то какой-то другой чиж обязательно перелетает на столько же метров, но в   обратном направлении.     а) Могут ли все чижи собраться на одной ёлке?     б) А если чижей и ёлок – семь?",
        "Решение: а) Первый способ. Занумеруем ёлки числами от 1 до 6 по порядку. Пусть каждый чиж получает номер, равный номеру ёлки, на которой он сидит (в данный момент). Тогда сумма номеров чижей – инвариант. В начале она равна 1 + 2 + ... + 6 = 21. Поскольку 21 не делится на 6, то собраться на одной ёлке чижи не смогут.     Второй способ. Заменим нечётные елки дубами и заметим, что на дубах всегда будет нечётное число чижей.",
        "Ответ: а) Не могут; б) могут."
    ],
    "104068": [
        "Целочисленные решетки (прочее)",
        "Сложность: 4",
        "Классы: 6,7,8",
        "Условие: Петя закрасил одну клетку прямоугольника. Саша может закрашивать другие клетки этого прямоугольника по следующему правилу: можно красить любую клетку, у которой нечётное число закрашенных соседей (по стороне). Сможет ли Саша закрасить все клетки прямоугольника (независимо от того, какую клетку выбрал Петя), если размеры прямоугольника а) 8×9 клеток? б) 8×10 клеток?",
        "Решение: а) Сначала закрасим ряд длиной 9 клеток, содержащий изначально закрашенную клетку (см. первый рисунок). Далее будем красить столбцы через один, начиная закраску от покрашенного ряда (см. второй рисунок). После этого закрасить оставшиеся клетки доски совсем просто.",
        "Ответ: а) Да; б) нет."
    ],
    "30758": [
        "Инварианты",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: На доске написаны числа 1, 2, 3, ..., 1989. Разрешается стереть любые два числа и написать вместо них разность этих чисел.   Можно ли добиться того, чтобы все числа на доске стали нулями?",
        "Подсказка: Заметьте, что чётность суммы чисел на доске неизменна.",
        "Ответ: Нельзя."
    ],
    "79493": [
        "Геометрия на клетчатой бумаге",
        "Сложность: 4+",
        "Классы: 9,10",
        "Условие: Квадратное поле разбито на 100 одинаковых участков, 9 из которых поросли бурьяном. Известно, что бурьян за год распространяется на те и только те участки, у каждого из которых не менее двух соседних участков уже поражены бурьяном (участки соседние, если они имеют общую сторону). Докажите, что полностью все поле бурьяном не зарастёт.",
        "Решение: Легко проверить, что длина границы всего заросшего бурьяном участка (или нескольких участков) не возрастает. В начальный момент она не превосходит"
    ],
    "89932": [
        "Инварианты и полуинварианты",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: На вешалке висят 20 платков. 17 девочек по очереди подходят к вешалке, и каждая либо снимает, либо вешает ровно один платок.   Может ли после ухода девочек на вешалке остаться 10 платков?",
        "Решение: После ухода последней девочки на вешалке будет нечётное количество платков.",
        "Ответ: Не может."
    ],
    "30772": [
        "Инварианты",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: В таблице",
        "Решение: Сумма чисел в таблице не зависит от способа ее подсчета. \t\t\t\tИменно в этом смысле это - задача на инвариант."
    ],
    "88278": [
        "Обыкновенные дроби",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Какое число нужно вычесть из числителя дроби 537/463 и прибавить к знаменателю, чтобы после сокращения получить 1/9?",
        "Подсказка: Заметьте, что 537 + 463 = 1000.",
        "Решение: Сумма числителя и знаменателя не изменится, если из одного из них вычесть, а ко второму – прибавить одно и то же число. Поскольку эта сумма равна 1000, тодробь перед сокращением должна быть 100/900, а чтобы её получить, надо отнять и, соответственно, прибавить число 437.",
        "Ответ: 437."
    ],
    "78726": [
        "Шахматные доски и шахматные фигуры",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: На бесконечной шахматной доске на двух соседних по диагонали чёрных полях  стоят две чёрные шашки. Можно ли дополнительно поставить на эту доску   некоторое число чёрных шашек и одну белую таким образом, чтобы белая   одним ходом взяла все чёрные шашки, включая две первоначально  стоявшие?",
        "Решение: При каждом взятии чёрной шашки белая шашка перемещается на чётное число вертикалей. Поэтому после того как белая шашка взяла первую чёрную, она всегда будет отстоять от второй чёрной шашки на чётное число вертикалей. Следовательно, она не сможет её взять.",
        "Ответ: Нельзя."
    ],
    "88002": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Незнайка взял у Пилюлькина книжку и сосчитал, сколько понадобилось цифр, чтобы пронумеровать все страницы, начиная с первой. У него получилось 100 цифр. Могло ли так быть, или Незнайка ошибся? Если могло, скажите, сколько было страниц.",
        "Подсказка: Заметьте, номер последней страницы – двузначное число.",
        "Решение: При этих условиях номер последней страницы – двузначное число (количество  цифр во всех двузначных и однозначных числах равно 9 + 90×2 > 100). Но все однозначные страницы дадут 9 цифр, то есть нечётное число, а добавление любого количества страниц с двузначным номером прибавит чётное число цифр, то есть оставит количество цифр нечётным.",
        "Ответ: Незнайка ошибся."
    ],
    "88019": [
        "Четность и нечетность",
        "Сложность: 2+",
        "Классы: 5,6,7,8",
        "Условие: На шахматной доске 5×5 клеток расставили 25 шашек – по одной на каждой клетке. Потом все шашки сняли с доски, но запомнили, на какой клетке стояла каждая. Можно ли ещё раз расставить шашки на доске таким образом, чтобы каждая шашка стояла на клетке, соседней с той, на которой она стояла в прошлый раз (соседняя по горизонтали или вертикали, но не наискосок)?",
        "Подсказка: Заметьте, что на этой доске количество белых и чёрных клеток неодинаково.",
        "Решение: Шахматная доска из 25 клеток содержит 12 клеток одного цвета и 13 другого. Для  того чтобы каждая шашка переместилась на соседнюю клетку, необходимо,  чтобы все шашки, которые стояли на белых клетках, встали на чёрные,  и наоборот. Но поскольку количество белых и чёрных клеток неодинаково,  сделать это невозможно.",
        "Ответ: Нельзя."
    ],
    "30303": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: На доске написаны числа 1, 2, 3, ..., 1984, 1985. Разрешается стереть с доски любые два числа и вместо них записать модуль их разности. В конце концов на доске останется одно число. Может ли оно равняться нулю?",
        "Подсказка: При указанных операциях чётность суммы всех написанных на доске чисел не меняется.",
        "Решение: Модуль разности двух целых чисел имеет ту же чётность, что и сумма этих чисел. Поэтому, при указанной замене чётность суммы всех чисел не меняется. Сумма целых чисел от 1 до 1985 нечётна (среди них нечётное количество нечётных чисел). Поэтому она не может стать равной нулю.",
        "Ответ: Не может."
    ],
    "32042": [
        "Инварианты",
        "Сложность: 3",
        "Классы: 5,6,7,8,9",
        "Условие: На столе стоят 16 стаканов. Из них 15 стаканов стоят правильно, а один перевёрнут донышком вверх. Разрешается одновременно переворачивать любые четыре стакана. Можно ли, повторяя эту операцию, поставить все стаканы правильно?",
        "Решение: См. задачу 35111."
    ],
    "35056": [
        "Системы точек и отрезков (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: На плоскости даны 10 точек: несколько из них – белые, а остальные – чёрные. Некоторые точки соединены отрезками. Назовём точку особой, если более половины соединенных с ней точек имеют цвет, отличный от её цвета. Каждым ходом выбирается одна из особых точек (если такие есть) и перекрашивается в противоположный цвет. Докажите, что через несколько ходов не останется ни одной особой точки.",
        "Подсказка: В момент перекрашивания особой точки количество отрезков, имеющих концы разного цвета, уменьшается.",
        "Решение: Допустим, что в какой-то момент мы перекрашиваем особую точку A (для определенности, пусть эта особая точка до перекрашивания была белой). Пусть точка A соединена с m белыми и n черными точками; m < n согласно определению особой точки. Поэтому после перекрашивания особой точки количество отрезков, имеющих один белый и один чёрный конец, уменьшается (до перекрашивания из точки A выходило n таких отрезков, а после – только m). Поскольку число отрезков конечно, через несколько перекрашиваний мы не сможем сделать больше ни одного, то есть особых точек не останется."
    ],
    "60630": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: На доске написано 10 плюсов и 15 минусов. Разрешается стереть любые два знака и написать вместо них плюс, если они одинаковы, и минус в противном случае. Какой  знак останется на доске после выполнения 24 таких операций?",
        "Решение: При каждой операции количество минусов либо не изменяется, либо уменьшается на 2. Поэтому чётность количества минусов не меняется.",
        "Ответ: Минус."
    ],
    "60634": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Вдоль улицы стоят шесть деревьев, и на каждом из них сидит по вороне. Раз в час две из них взлетают, и каждая садится на одно из соседних деревьев. Может ли  получиться так, что все вороны соберутся на одном дереве?",
        "Решение: Пусть первое, третье и пятое деревья – дубы, а остальные – берёзы. Заметим, что чётность числа ворон на дубах не меняется. В начале это число равно 3, поэтому оно никогда не станет чётным. В частности, вороны не могут собраться на одном дереве.",
        "Ответ: Не может."
    ],
    "116845": [
        "Процессы и операции",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: В клетках квадрата 3×3 расставлены числа (рис. слева).   Разрешается к числам, стоящим в двух соседних клетках, одновременно прибавлять одно и то же число, не обязательно положительное. Можно ли в какой-то момент получить такой квадрат с числами, как на рисунке справа? (Клетки считаются соседними, если имеют общую сторону.)",
        "Решение: Раскрасим все клетки в шахматном порядке (см. рисунок).",
        "Ответ: Нельзя."
    ],
    "61385": [
        "Классические неравенства (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Докажите, что если  a1 ≥ a2 ≥ ... ≥ an, b1 ≥ b2 ≥ ... ≥ bn,  то наибольшая из сумм вида  a1bk1 + a2bk2 + ... + anbkn    (k1, k2, ..., kn – перестановка чисел   1, 2, ..., n), это сумма  a1b1 + a2b2 + ... + anbn,  а наименьшая – сумма  a1bn + a2bn–1 + ... + anb1.",
        "Решение: Заметим, что если x ≥ y, z ≥ w, то  xz + yw ≥ xw + yz.  Действительно,  (xz + yw) – (xw + yz) = (x – y)(z – w) ≥ 0.    Рассмотрим в сумме  a1bk1 + a2bk2 + ... + anbkn  член ajb1, содержащий множитель b1. Если j > 1, то, заменив  aj–1bkj–1 + ajb1    на  aj–1b1 + ajbkj–1, мы не уменьшим сумму. Так можно продолжать, пока множитель b1 не перейдёт в первое слагаемое. Затем поступим так же с множителем b2 и т. д. В конце концов мы превратим нашу сумму в  a1b1 + a2b2 + ... + anbn,  не  уменьшив её.    Аналогично доказывается, что сумма  a1bn + a2bn–1 + ... + anb1  – наименьшая."
    ],
    "30759": [
        "Планарные графы. Формула Эйлера",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Пусть связный плоский граф с V вершинами и E рёбрами разрезает плоскость на F кусков. Докажите формулу Эйлера: V – E + F = 2.",
        "Решение: Будем удалять рёбра по одному, пока граф не превратится в дерево (как в задаче 31098 а). На каждом шаге число как число рёбер, так и число кусков уменьшается на 1 (при удалении ребра два примыкающих к нему куска сливаются в один). Поэтому величина V – E + F не меняется. Но для полученного дерева она равна 2, поскольку E = V – 1 (см. задачу 31098 б), а F = 1."
    ],
    "33138": [
        "Четность и нечетность",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: На доске написаны числа     а) 1, 2. 3, ..., 1997, 1998;     б) 1, 2, 3, ..., 1998, 1999;     в) 1, 2, 3, ..., 1999, 2000.   Разрешается стереть с доски любые два числа, заменив их разностью большего и меньшего. Можно ли, выполнив эту операцию много раз. получить на доске единственное число – 0? Если да, то как это сделать?",
        "Решение: а) См. решение задачи 30303.",
        "Ответ: а) Нельзя; б)-в) можно."
    ],
    "34853": [
        "Четность и нечетность",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: На доске записано несколько нулей, единиц и двоек. Разрешается стереть две неравные цифры и записать вместо них одну цифру, отличную от стёртых. Докажите, что если в результате нескольких таких операций на доске останется одна-единственная цифра, то она не зависит от порядка, в котором производились стирания.",
        "Подсказка: Как меняется чётность числа нулей, единиц, двоек?",
        "Решение: Пусть вначале было A нулей, B единиц и C двоек. После каждой операции эти числа меняются, но чётность сумм A + B, A + C и B + C не меняется. Значит, если числа A и B одной чётности, то в конце их сумма равна нулю, то есть на доске может остаться только двойка. (Если все три числа одной чётности, то одна цифра на доске остаться не может.)"
    ],
    "64430": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: На экране компьютера – число 141. Каждую секунду компьютер перемножает все цифры числа на экране, полученное произведение либо прибавляет к этому числу, либо вычитает из него, а результат появляется на экране вместо исходного числа. Появится ли еще когда-нибудь на экране число 141?",
        "Решение: На первом шаге на экране появится либо число 145, либо число 137.     В первом случае число 141 никогда появиться не сможет, так как если число на экране оканчивается на 5, то произведение его цифр кратно пяти. Поэтому из числа, оканчивающегося на 5, можно получить только число, оканчивающееся на 5 или на 0. Если же число оканчивается на 0, то оно в дальнейшем не изменяется.     Во втором случае на следующем шаге возникнет либо число 158, либо число 116. Но произведение цифр чётного числа чётно, поэтому из чётного числа можно получить только чётное. А так как 141 – число нечётное, то и в этом случае его получить не удастся.",
        "Ответ: Не появится."
    ],
    "35493": [
        "Полуинварианты",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В каждой из n стран правит либо партия правых, либо партия левых. Каждый год в одной из стран A может поменяться власть. Это может произойти в том случае, если в большинстве граничащих со страной A стран правит не та партия, которая правит в стране A. Докажите, что смены правительств не могут продолжаться бесконечно.",
        "Подсказка: Как меняется количество пар граничащих стран, имеющих одну и ту же партию у власти?",
        "Решение: Пусть власть сменилась в некоторой стране A, в которой правят левые (для определённости). Пусть среди граничащих с ней стран было k стран, где правят левые и m стран, где правят правые, k < m. При смене власти в стране A количество стран среди граничащих с ней стран, в которых правит та же партия, что и в А, возрастёт: 2(m – k) > 0. Таким образом, после смены власти в какой-либо из стран, число пар граничащих стран, имеющих одну и ту же партию у власти, возрастает. Это возрастание не может продолжаться бесконечно долго, поскольку число пар граничащих стран конечно."
    ],
    "64517": [
        "Четность и нечетность",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: В ряд выписаны несколько нулей и единиц. Рассмотрим пары цифр в этом ряду (не только соседних), где левая цифра равна 1, а правая 0. Пусть среди этих пар ровно M таких, что между единицей и нулем этой пары стоит чётное число цифр, и ровно N таких, что между единицей и нулем этой пары стоит нечётное число цифр. Докажите, что M ≥ N.",
        "Решение: Если в ряду есть две единицы подряд, вычеркнем их. При этом разность M – N не изменится: число чётных пар с одной единицей равно числу нечётных пар с другой; а на чётности пар, куда эти единицы не входят, это не повлияет. Также можно стереть и два нуля, стоящих подряд. Продолжая эти стирания, мы придём к ряду (возможно, пустому), где нули и единицы чередуются. Но у такого ряда N = 0."
    ],
    "35467": [
        "Средние величины",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Даны 10 чисел – одна единица и 9 нулей. Разрешается выбирать два числа и заменять каждое из них их средним арифметическим.   Какое наименьшее число может оказаться на месте единицы?",
        "Решение: Докажем индукцией по k следующее утверждение: если в некоторый момент среди чисел имеется ровно k отличных от нуля, то каждое из этих чисел не меньше 21–k.      База. Для k = 1 это верно, так как после первой же нетривиальной операции появятся по крайней мере два ненулевых числа, а в дальнейшем число ненулевых чисел не уменьшается.     Шаг индукции. Пусть в некоторый момент имеется k + 1 ненулевое число. Рассмотрим последовательность операций, в результате которой эти числа появились. В этой последовательности операций найдем последний момент, когда было ровно k ненулевых чисел. По предположению индукции каждое из этих чисел не меньше чем 21–k. При следующей операции один ноль и одно ненулевое число заменили на их среднее. После этого каждое из этих чисел стало не меньше чем 2–k. В дальнейшем в результате операций только с ненулевыми числами минимум ненулевых чисел не увеличивается.",
        "Ответ: 1/512."
    ],
    "78011": [
        "Вспомогательная раскраска (прочее)",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: План города представляет собой плоскость, разбитую на одинаковые правильные треугольники. Стороны треугольников – шоссейные дороги, а вершины треугольников – перекрестки. Из точек A и B, расположенных на одной дороге (стороне треугольника), одновременно в одном направлении с одинаковыми скоростями выезжают две машины. Доехав до любого перекрёстка, каждая машина может или продолжить свое движение в том же направлении, или же повернуть на 120° вправо или влево. Могут ли машины встретиться?",
        "Решение: Машины проезжают перекрёстки в разные моменты времени, поэтому они могли бы встретиться только на некоторой улице, двигаясь навстречу друг другу. Далее см. решение задачи 97895.",
        "Ответ: Не могут."
    ],
    "35754": [
        "Инварианты и полуинварианты",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Написанное на доске четырехзначное число можно заменить на другое, прибавив к двум  его соседним цифрам по единице, если ни одна из этих цифр не равна 9; либо, вычтя из  соседних двух цифр по единице, если ни одна из них не равна 0.  Можно ли с помощью таких операций из числа 1234 получить число 2002?",
        "Подсказка: Сумма цифр на четных местах и сумма цифр на нечетных местах меняются одинаково.",
        "Решение: Пусть на доске написано число abcd.  Тогда рассматриваемые операции не изменяют число M=(d+b)-(a+c),  так как они увеличивают (уменьшают) на единицу одно число из первой скобки,  и одно число - из второй.  Для числа 1234 число M=(4+2)-(1+3)=2,  для числа 2002 число M=(2+0)-(2+0)=0.  Поэтому требуемое невозможно."
    ],
    "98512": [
        "Шахматные доски и шахматные фигуры",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: На доске размером 15×15 клеток расставили 15 ладей, не бьющих друг друга.  Затем каждую ладью передвинули ходом коня.   Докажите, что теперь какие-то две ладьи будут бить друг друга.",
        "Решение: Введём на доске систему координат: занумеруем горизонтали и вертикали числами от 1 до 15. Если ладьи не бьют друг друга, то в каждой горизонтали и в каждой вертикали находится ровно одна ладья, поэтому сумма координат всех ладей равна 2(1 + 2 + ... + 15), то есть чётна. Когда ладья передвинута ходом коня, сумма её координат изменяется на 1 или на 3, то есть меняет чётность. Так как количество ладей нечётно, после перестановки сумма координат всех ладей нечётна. Следовательно, некоторые ладьи бьют друг друга."
    ],
    "35024": [
        "Перестановки и подстановки",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: На книжной полке стоят 30 томов энциклопедии в некотором порядке. За одну операцию разрешается менять местами любые два соседних тома. За какое наименьшее число операций можно гарантированно выстроить все тома  в правильном порядке (с первого по тридцатый слева направо) независимо от начального положения?",
        "Подсказка: Назовём беспорядком пару томов, в которой том с большим номером стоит левее тома с меньшим номером. За одну операцию число беспорядков меняется не более чем на 1.",
        "Решение: Пусть имеется некоторое расположение томов на полке. Рассмотрим всевозможные пары томов (всего таких пар 30·29 : 2 = 435). Назовем беспорядком пару томов, в которой том с большим номером стоит левее тома с меньшим номером. В конечной ситуации не должно быть ни одного беспорядка. Заметим, что за одну операцию число беспорядков меняется не более, чем на 1. В самом деле, только в паре переставляемых томов может появиться или исчезнуть один беспорядок.  Следовательно, при начальном расположении, в котором тома идут в обратном порядке (каждая пара томов образует беспорядок), потребуется сделать не менее 435 операций.    Покажем, что 435 операций всегда достаточно. Если в некотором расположении томов есть беспорядки, то найдётся пара соседних томов, образующая беспорядок. Поменяв местами эту пару томов, мы уменьшаем число беспорядков на 1. Таким образом, каждой операцией мы можем уменьшать число беспорядков на 1 и не более, чем через 435 операций прийти к расположению, в котором нет беспорядков, то есть к правильному порядку томов.",
        "Ответ: За 435 операций."
    ],
    "58171": [
        "Инварианты",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Дана шахматная доска. Разрешается перекрашивать вдругой цвет сразу все клетки, расположенные внутри квадрата размером 2×2. Может ли при этом на доске остаться ровно одна черная клетка?",
        "Решение: При перекрашивании квадрата 2×2, содержащего"
    ],
    "78681": [
        "Шахматные доски и шахматные фигуры",
        "Сложность: 5",
        "Классы: 8,9,10",
        "Условие: Белые и чёрные играют в следующую игру. В углах шахматной доски стоят два  короля: белый на a1, чёрный на h8. Играющие делают ход по очереди. Начинают белые. Играющий может ставить своего короля на любое соседнее поле  (если только оно свободно), соблюдая следующие правила: нельзя увеличивать  расстояние между королями (расстоянием между двумя полями называется наименьшее  число шагов короля, за которое он может пройти с одного поля на другое: так, в  начале игры расстояние между королями – 7 ходов). Выигрывает тот, кто  поставит своего короля на противоположную кромку доски (белого короля на  вертикаль h или восьмую горизонталь, чёрного – на вертикаль a или первую горизонталь). Кто выиграет при правильной игре?",
        "Решение: Опишем выигрышную стратегию белых. Сначала белый король должен ходить по 1-й горизонтали вправо, пока чёрные своим ходом не уменьшат расстояние между королями. Если чёрные этого не сделают, то расстояние между королями остаётся равным 7, и белый король без помех дойдет первым до правого края.     Пусть чёрные уменьшат расстояние, тогда чёрный король сойдёт с 8-й горизонтали. В ответ белый король тоже сходит с 1-й горизонтали, делая ход в клетку того же цвета, что и клетка, в которой находится чёрный король (если таких две, он выбирает правую).     Будем считать, что шахматная доска – середина достаточно большого клетчатого квадрата. Когда оба короля стоят на клетках одного цвета, назовём зоной наименьший квадрат из клеток, включающий обоих королей, в котором они расположены центрально симметрично (зона может частично выходить за пределы доски). До ухода чёрного короля с 8-й горизонтали зона возникала после его ходов и совпадала с доской. После ухода белого короля с 1-й горизонтали возникает зона 6×6, которая не содержит клеток тех краёв доски, к которым стремится чёрный король. Покажем, что белые могут действовать так, чтобы после каждого их хода зона существует (для этого белый король ходит на клетку того же цвета, что и чёрный) и обладает тем же свойством.     Перед ходом чёрных короли стоят на противоположных краях зоны. Выйти за пределы зоны чёрный король не может, ходом вдоль края он не уменьшает расстояние между королями, а любой другой ход это расстояние уменьшает. Ход вдоль края может быть ходом вперёд или назад, то есть приближать чёрного короля к заветному краю доски или удалять от него.     Разберём четыре случая варианта ходов чёрных. Перед этим короли всегда стоят в противоположных клетках зоны чётного размера.     1) Чёрные не уменьшают расстояние, сходив вперёд. Тогда белые ходят в зоне центрально симметрично, уменьшая на 1 сумму расстояний до правого и верхнего краёв доски. При этом зона не меняется.     2) Чёрные не уменьшают расстояние, сходив назад. Тогда белые ходят в том же направлении (для них – вперёд). При этом зона сдвинется на 1 в том же направлении, а сумма расстояний от белого короля до победных краёв уменьшится.    3) Чёрные уменьшают расстояние, уйдя с края зоны. Тогда белые ходят в зоне центрально симметрично, уменьшая размер зоны на 2. При этом центр зоны не меняется.     4) Чёрные уменьшают расстояние, не уходя с края зоны. Это возможно только если чёрный король пойдёт по диагонали с одного края зоны на другой (между клетками, примыкающими к углу зоны, см. рис.). При этом возникнет зона размера на 1 меньше, и короли будут находиться в её противоположных углах, то есть на одной диагонали. Поскольку размер зоны стал нечётным, то на диагонали есть ещё хотя бы одна клетка. Белые ходят по этой диагонали, уменьшая размер зоны ещё на 1. Новая зона – часть той, которая была перед ходом чёрных.",
        "Ответ: Белые."
    ],
    "79659": [
        "Инварианты",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Даны шесть чисел: 1, 2, 3, 4, 5, 6. Разрешается к любым двум из них прибавлять по 1.   Можно ли, проделав это несколько раз, сделать эти числа равными?",
        "Решение: См. задачу 35134.",
        "Ответ: Нельзя."
    ],
    "105174": [
        "Замощения костями домино и плитками",
        "Сложность: 5",
        "Классы: 8",
        "Условие: На шахматную доску произвольным образом уложили 32доминошки   (прямоугольника 1×2), так что доминошки не перекрываются. Затем к доске добавили   одну клетку, как показано на рисунке. Разрешается вынимать любую доминошку, а   затем класть её на две соседние пустые клетки.  Докажите, что можно расположить все доминошки   горизонтально.",
        "Решение: Все доминошки занимают 64клетки, поэтому одна клетка всегда свободна. Будем называть ее дыркой. Заметим сначала, что если в(горизонтальном) ряду сдыркой есть хотябы одна вертикальная доминошка, то одну изтаких доминошек можно сделать горизонтальной. Действительно, для этого достаточно сдвинуть все горизонтальные доминошки, находящиеся между дыркой ивертикальной доминошкой, после чего повернуть вертикальную доминошку. Будем повторять такую операцию, пока дырка неокажется вряду без вертикальных доминошек (это обязательно случится, так как после каждой операции число вертикальных доминошек уменьшается)."
    ],
    "88307": [
        "Инварианты",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Набор чисел",
        "Решение: Инвариантом служит сумма чисел. Действительно,"
    ],
    "64667": [
        "Таблицы и турниры (прочее)",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Дана таблица размером 8×8, изображающая шахматную доску. За каждый шаг разрешается поменять местами любые два столбца или любые две строки. Можно ли за несколько шагов сделать так, чтобы верхняя половина таблицы стала белой, а нижняя половина – чёрной?",
        "Решение: Обе разрешённые операции не изменяют количество чёрных и белых клеток в любой строке, следовательно, требуемую раскраску таблицы получить не удастся.",
        "Ответ: Нельзя."
    ],
    "32803": [
        "Четность и нечетность",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: На каждой клетке шахматной доски стоит шашка, с одной стороны белая, с другой черная. За один ход можно выбрать любую шашку и перевернуть все шашки, стоящие с выбранной на одной вертикали, и все шашки, стоящие с ней на одной горизонтали.     а) Придумайте, как перевернуть ровно одну шашку на доске 6×6, произвольно уставленной шашками.    б) Можно ли добиться того, чтобы все шашки на доске 5×6 стали белыми, если чёрными изначально была ровно половина шашек.",
        "Решение: а) Проделаем описанную операцию с данной шашкой и со всеми шашками в тех же строке и столбце. Тогда данная шашка сменит цвет 11 раз и, следовательно, перевернётся, а все остальные шашки на доске перевернутся чётное число раз и, значит, не сменят цвет.",
        "Ответ: б) Нельзя."
    ],
    "60672": [
        "Инварианты",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Камни лежат в трёх кучках: в одной – 51 камень, в другой – 49 камней, а в третьей – 5 камней. Разрешается объединять любые кучки в одну, а также разделять кучку из чётного количества камней на две равные. Можно ли  получить 105 кучек по одному камню в каждой?",
        "Решение: На первом шаге разделить кучку нельзя. Если мы мы объединим две первых кучки, то дальше в любой из получающихся кучек количество камней будет кратно 5. В дальнейшем это свойство сохранится. Если мы объединим первую и третью кучки, то в дальнейшем число камней в каждой кучке будет кратно 7, а если объединим две последние кучки, то в дальнейшем число камней в каждой кучке будет кратно 3.",
        "Ответ: Нельзя."
    ],
    "34865": [
        "Делимость чисел. Общие свойства",
        "Сложность: 4",
        "Классы: ",
        "Условие: Во всех клетках таблицы 20×20 расставлены плюсы. Разрешается менять знак  одновременно во всех клетках строки или столбца.   Можно ли, пользуясь этими операциями, получить ровно 199 минусов?",
        "Подсказка: Результат не зависит от порядка операций.",
        "Решение: См. задачу 78755.",
        "Ответ: Нельзя."
    ],
    "60522": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На доске написано n натуральных чисел. За одну операцию вместо двух чисел, не делящих друг друга, можно написать их наибольший общий делитель и их наименьшее общее кратное.     а) Докажите, что можно провести только конечное число операций.     б) Финальный результат независимо от порядка действий будет одним  и тем же. Например:      (4, 6, 9) → (2, 12, 9) → (2, 3, 36) → (1, 6, 36),        (4, 6, 9) → (4, 3, 18) → (1, 12, 18) → (1, 6, 36).",
        "Решение: а) Назовём пару чисел правильной, если одно из них делится на другое. заметим, что при каждой операции число правильных пар увеличивается. Когда все пары станут правильными, процесс прекратится."
    ],
    "98630": [
        "Инварианты",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: На столе лежит куча из 637 ракушек. Из неё убирают одну ракушку и кучу делят на две (не обязательно поровну). Затем из какой-нибудь кучи, содержащей больше одной ракушки, снова убирают одну ракушку и снова кучу делят на две. И так далее. Можно ли через несколько ходов оставить на столе только кучи, состоящие из трёх ракушек?",
        "Подсказка: Каждый раз после изъятия камушка и раздвоения кучки число камушков на 1 уменьшается, а число кучек на 1 увеличивается.",
        "Решение: После каждой процедуры (изъятия камушка и раздвоения кучки) число ракушек на 1 уменьшается, а число кучек на 1 увеличивается. Поскольку первоначально ракушек было 637, а кучек – одна, то после n процедур ракушек окажется (637 − n), а кучек станет (n + 1). В задаче требуется, чтобы выполнялось равенство 637 − n = 3(n + 1), или 634 = 4n, что невозможно, поскольку правая часть уравнения кратна 4."
    ],
    "104028": [
        "Инварианты",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: У племени семпоальтеков было 24 слитка золота, 26 редких жемчужин и 25 стеклянных бус. У Кортеса они могут обменять слиток золота и жемчужину на одни бусы, у Монтесумы – один слиток и одни бусы на одну жемчужину, а у тотонаков – одну жемчужину и одни бусы на один золотой слиток. После долгих обменов у семпоальтеков осталось только одна вещь. Какая?",
        "Решение: См. решение задачи 60646.",
        "Ответ: Бусы."
    ],
    "30274": [
        "Инварианты",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Из стакана молока три ложки содержимого переливают в стакан с чаем и небрежно помешивают. Затем зачёрпывают три ложки полученной смеси и переливают их обратно в стакан с молоком. Чего теперь больше: чая в стакане с молоком или молока в стакане с чаем?",
        "Решение: После второго переливания в стакане с молоком оказывается ровно столько чая, сколько оттуда было взято молока: ведь объём жидкости не изменился. Значит, в итоге чая в молоке столько же, сколько молока в чае.",
        "Ответ: Поровну."
    ],
    "108406": [
        "Инварианты",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: На доске написаны числа 1 и 2. Каждый день научный консультант Выбегалло заменяет два написанных числа на их среднее арифметическое и среднее гармоническое.",
        "Решение: а) 665857/470832: произведение написанных на доске чисел всегда равно 2.",
        "Ответ: а) 665857/470832; б) нет."
    ],
    "30769": [
        "Инварианты",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: На доске написано число 8",
        "Решение: Используйте то, что у суммы цифр тот же остаток при \t\t\t\tделении на 9, что и у самого числа."
    ],
    "35475": [
        "Полуинварианты",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: На квадратном поле 10*10 девять клеток 1*1 поросли бурьяном.    После этого бурьян может распространиться на клетку,    у которой не менее двух соседних клеток уже поросли бурьяном.    Докажите, что тем не менее бурьян не сможет распространиться на    все клетки.",
        "Подсказка: Как изменяется периметр области, поросшей бурьяном?",
        "Решение: Рассмотрим границу области, поросшей бурьяном (т.е.    все отрезки длиной 1 между узлами, по одну сторону от которых бурьян,    а по другую - нет).    Вначале длина границы была не более 9*4=36, поскольку бурьян рос     только в девяти клетках.    Нетрудно заметить, что в процессе распространения бурьяна    длина границы не может увеличиваться.    Но если бы все поле 10*10 в некоторый момент оказалось поросшим    бурьяном, то длина границы стала бы равной 10*4=40,    что противоречит соображениям, приведенным выше."
    ],
    "104027": [
        "Инварианты",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: В вершинах шестиугольника записаны числа 12, 1, 10, 6, 8, 3 (в таком порядке). За один ход разрешено выбрать две соседние вершины и к числам, стоящим в данных вершинах, одновременно прибавить единицу или одновременно вычесть из них единицу. Можно ли получить в итоге шесть чисел в таком порядке:",
        "Решение: а) Да, например, так: (12, 1, 10, 6, 8, 3) - (12, 1, 10, 6, 7, 2) - (14, 3, 10, 6, 7, 2) - (14, 3, 10, 4, 5, 2) - (14, 6, 13, 4, 5, 2).",
        "Ответ: а) да; б) нет."
    ],
    "30751": [
        "Инварианты",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Круг разделён на шесть секторов, в каждом из которых стоит фишка. Разрешается за один ход сдвинуть любые две фишки в соседние с ними сектора.   Можно ли с помощью таких операций собрать все фишки в одном секторе?",
        "Решение: Занумеруем сектора по кругу числами от 1 до 6 и для любой расстановки фишек рассмотрим сумму S номеров секторов, в которых стоят данные нам шесть фишек (с учётом кратности). Очевидно, что при сдвиге фишки в соседний сектор соответствующее ей слагаемое в сумме S меняет чётность. Значит, если сдвигаются одновременно две фишки, то чётность величины S не меняется. Для начальной расстановки S = 21. Если же все фишки находятся в одном секторе с номером А, то S = 6А – это чётное число.",
        "Ответ: Нельзя."
    ],
    "30753": [
        "Инварианты",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: На доске выписаны числа 1, 2, ..., 20. Разрешается стереть любые два числа a и b и заменить их на число ab + a + b.   Какое число может остаться на доске после 19 таких операций?",
        "Решение: Заметим, что ab + a + b + 1 = (a + 1)(b + 1). Это, значит, что если все числа увеличить на 1, то произведение новых чисел при указанной операции не меняется. В начале (а значит, и в конце) оно равно 21!.",
        "Ответ: 21! – 1."
    ],
    "30757": [
        "Инварианты",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: В таблице 8×8 все четыре угловые клетки закрашены чёрным цветом, все остальные – белым.  Докажите, что с помощью перекрашивания строк и столбцов нельзя добиться того, чтобы все клетки стали белыми. Под перекрашиванием строки или столбца понимается изменение цвета всех клеток в строке или столбце.",
        "Подсказка: Чётность числа чёрных клеток в квадрате из клеток a1, a2, b1, b2 не меняется при перекрашиваниях.",
        "Решение: Выделим квадрат 2&times2, содержащий ровно одну чёрную клетку. Далее см. задачу 30756."
    ],
    "35431": [
        "Инварианты и полуинварианты (прочее)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: На столе лежат две кучки камней: в    первой кучке 10 камней, а во    второй - 15. За ход    разрешается разделить любую кучку    на две меньшие. Проигрывает тот, кто    не сможет делать ход. Может ли    выиграть второй игрок?",
        "Подсказка: Подсчитайте, сколько ходов     всего будет сделано.",
        "Решение: В конце игры мы получим 25    кучек камней, содержащих по    одному камню. Всего будет сделано 23    хода (и это не зависит от того,    как делают ходы игроки),    следовательно, последний (нечетный)    ход сделает первый игрок."
    ],
    "30766": [
        "Инварианты",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: В странах Диллии и Даллии денежными единицами  являются диллеры и даллеры соответственно, причем в Диллии диллер  меняется на 10 даллеров, а в Даллии даллер меняется на 10  диллеров.  Начинающий финансист имеет 1 диллер и может свободно  перезжать из одной страны в другую и менять свои деньги в обеих  странах.  Докажите, что количество даллеров у него никогда не  сравняется с количеством диллеров.",
        "Решение: Инвариант - остаток по модулю 11 разности между числом диллеров и числом даллеров у финансиста."
    ],
    "30777": [
        "Инварианты",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: На столе лежит куча из 1001 камня.  Ход состоит в  том, что из какой-либо кучи, содержащей более одного камня,  выкидывают камень, а затем одну из куч делят на две.  Можно ли через  несколько ходов оставить на столе только кучки, состоящие из трех  камней?",
        "Решение: Нельзя. Рассмотрите величину"
    ],
    "30779": [
        "Инварианты",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Дана некоторая тройка чисел.  С любыми двумя из них разрешается проделывать следующее: если эти числа равны a и b, то их можно заменить на   и  . Можно ли с помощью таких операций получить тройку    из тройки",
        "Подсказка: Рассмотрите сумму квадратов чисел тройки.",
        "Решение: Заметим, что    Поэтому сумма квадратов чисел тройки не меняется. Но   а",
        "Ответ: Нельзя."
    ],
    "34845": [
        "Инварианты",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: См. задачу 73546 а)."
    ],
    "35138": [
        "Полуинварианты",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: На доске записаны несколько чисел. За один ход разрешается любые два из них a и b, одновременно не равные нулю, заменить на числа a – b/2 и b + a/2. Можно ли через несколько таких ходов получить на доске исходные числа?",
        "Подсказка: Что происходит с суммой квадратов чисел, выписанных на доске?",
        "Решение: Рассмотрим сумму квадратов чисел, выписанных на доске, и покажем, что эта сумма увеличивается. Этим будет обоснован отрицательный ответ на вопрос задачи.     Действительно, (a – b/2)² + (b + a/2)² = 5/4 (a² + b²) > a² + b².",
        "Ответ: Нельзя."
    ],
    "35225": [
        "Инварианты",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На доске выписаны числа 1, ½, ..., 1/n. Разрешается стереть любые два числа a и b и заменить их на число ab + a + b.   Какое число останется после n – 1 такой операции?",
        "Подсказка: При этой операции сохраняется произведение чисел, увеличенных на 1.",
        "Решение: Пусть в некоторый момент на доске написаны числа a, b, ... , z. Рассмотрим произведение P = (a + 1)(b + 1)...(z + 1). После замены пары чисел a, b на ab + a + b в указанном произведении (a + 1)(b + 1) заменится на ab + a + b + 1 = (a + 1)(b + 1). Таким образом, операция величину P не меняет. Отсюда следует, что число, которое остаётся в конце, не зависит от порядка выполнения операций и равно   (1 + 1)(½ + 1)...(1/n + 1) – 1 = 2/1·3/2·...·n+1/n – 1 = (n + 1) – 1 = n.",
        "Ответ: n."
    ],
    "35681": [
        "Инварианты и полуинварианты",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Дана квадратная таблица 4×4, в каждой клетке которой стоит знак + или – :",
        "Решение: См. решение задачи 30756.",
        "Ответ: Нельзя."
    ],
    "88305": [
        "Инварианты",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: На доске написаны числа    а) 1, 2, 3, ..., 2003;    б) 1, 2, 3, ..., 2005.  Разрешается стереть два любых числа и вместо них написать их разность. Можно ли добиться того, чтобы все числа стали нулями?",
        "Решение: а) См. решение задачи 33138 б).",
        "Ответ: а) Можно; б) нельзя."
    ],
    "88311": [
        "Инварианты",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Круг разделён на шесть секторов, в каждом из которых лежит по селёдке. Разрешается за один ход передвинуть любые две селёдки в соседних секторах, двигая их в разные стороны. Можно ли с помощью этой операции собрать все селёдки в одном секторе?",
        "Решение: Закрасим сектора через один в два цвета. например, белый и чёрный; будем считать, что селёдки имеют цвет своего сектора. Вначале имеется три чёрных и три белых селёдки. При выполнении указанной операции две селёдки разных цветов меняют свой цвет: белая становится чёрной, а чёрная – белой, но по-прежнему имеется три чёрных и три белых селёдки. Следовательно, нельзя получить шесть селёдок одного цвета и тем более нельзя их собрать в одном секторе."
    ],
    "88312": [
        "Инварианты",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: В ряд выписаны числа  1, 2, 3, ..., 99, 100. Разрешается менять местами два числа, между которыми стоит ровно одно число.",
        "Решение: Чётные числа всегда остаются на чётных местах, а нечётные – на нечётных. Поэтому число 100 не может встать на первое место.",
        "Ответ: Нельзя."
    ],
    "35544": [
        "Полуинварианты",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Шоколадка имеет размер 4×10 плиток. За один ход разрешается разломать один из уже имеющихся кусочков на два вдоль прямолинейного разлома. За какое наименьшее число ходов можно разбить всю шоколадку на кусочки размером в одну плитку?",
        "Подсказка: После каждого разламывания количество кусочков увеличивается на 1.",
        "Решение: Заметим, что после каждого разламывания количество кусочков увеличивается на 1. Вначале у нас была целая шоколадка, т.е. один кусок, в конце нам требуется получить 40 кусочков размером в одну плитку. Таким образом, требуется произвести ровно 39 разламываний.",
        "Ответ: За 39 ходов."
    ],
    "109454": [
        "Инварианты",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: В выпуклом пятиугольнике проведены все диагонали. Каждая вершина и каждая точка пересечения диагоналей окрашены в синий цвет. Вася хочет перекрасить эти синие точки в красный цвет. За одну операцию ему разрешается поменять цвет всех окрашенных точек, принадлежащих либо одной из сторон либо одной из диагоналей на противоположный (синие точки становятся красными, а красные – синими).   Сможет ли он добиться желаемого, выполнив какое-то количество описанных операций?",
        "Решение: Рассмотрим внутренний пятиугольник, образованный точками пересечений диагоналей исходного пятиугольника (cм. рис.).",
        "Ответ: Не сможет."
    ],
    "35237": [
        "Инварианты и полуинварианты",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: В марсианском алфавите есть две буквы - У и Ы,   причем если из любого слова выкинуть стоящие рядом буквы УЫ,   то смысл слова не изменится.   Точно также смысл не изменится при добавлении в любое место   слова буквосочетания ЫУ или УУЫЫ.   Верно ли, что слова ЫУЫУЫ и УЫУЫУ имеют одинаковый смысл?",
        "Подсказка: При переходе от любого слова к слову, имеющему тот же смысл,   не меняется разность между количеством букв У и Ы.",
        "Решение: Предположим противное -  слова   ЫУЫУЫ и УЫУЫУ имеют одинаковый смысл.   Тогда от слова ЫУЫУЫ к слову УЫУЫУ можно перейти путем   нескольких преобразований, описанных в условии   (т.е. выкидываний стоящих рядом букв УЫ   и добавлений в любое место   последовательностей букв ЫУ или УУЫЫ).   При каждом из этих преобразований добавляется или   убирается одинаковое число букв У и Ы.   Таким образом, разность между количеством букв У и Ы   сохраняется  (т.е. является инвариантом   рассматриваемого преобразования). Однако в слове ЫУЫУЫ букв У на 1 меньше,   чем букв Ы,   а в слове УЫУЫУ букв У на 1 больше.   Это противоречит нашему предположению.",
        "Ответ: не верно."
    ],
    "30761": [
        "Инварианты",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Фигура верблюд ходит по доске 10×10 ходом типа (1, 3) (то есть, она сдвигается сначала на соседнее поле, а затем сдвигается еще на три поля в перпендикулярном направлении; конь, например, ходит ходом типа (1, 2)).  Можно ли пройти ходом верблюда с какого-то исходного поля на соседнее с ним?",
        "Решение: Ответ: нельзя.  Рассмотрим шахматную раскраску доски в черный и белый цвета.  Тогда,  как легко проверить, каждым своим ходом верблюд ходит с одного поля на поле того же цвета; иными словами, цвет поля, на котором стоит верблюд - инвариант.  Но так как два соседних поля имеют разную окраску, то пройти с одного на другое ходом верблюда невозможно.",
        "Ответ: Источники и прецеденты использования"
    ],
    "88306": [
        "Инварианты",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: На доске написаны числа 1, 2, 3, …, 20. Разрешается стереть любые два числа",
        "Решение: Заметим что  имеет место равенство",
        "Ответ: 21! − 1."
    ],
    "30768": [
        "Инварианты",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Есть три печатающих автомата.  Первый по карточке с числами",
        "Решение: Попробуем промоделировать сам процесс решения задачи."
    ],
    "104025": [
        "Инварианты",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Миша написал на доске в некотором порядке 2004 плюса и 2005 минусов. Время от времени Юра подходит к доске, стирает любые два знака и пишет вместо них один, причём если он стёр одинаковые знаки, то вместо них он пишет плюс, а если разные, то минус. После нескольких таких действий на доске остался только один знак. Какой?",
        "Решение: См. задачу 60630.",
        "Ответ: Минус."
    ],
    "30770": [
        "Инварианты",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: В пробирке находятся марсианские амебы трех типов:",
        "Решение: Ее тип -"
    ],
    "30774": [
        "Инварианты",
        "Сложность: 4",
        "Классы: 7,8",
        "Условие: В вершинах куба расставлены числа: 7 нулей и одна  единица.  За один ход разрешается прибавить по единице к числам в  концах любого ребра куба.  Можно ли добиться того, чтобы все  числа стали равными?  А можно ли добиться того, чтобы все числа  делились на 3?",
        "Решение: Нельзя. Нужно пометить четыре вершины куба такие, что никакие две из них не соединены ребром, после чего рассмотреть разность между суммой чисел в помеченных вершинах и суммой чисел в непомеченных вершинах."
    ],
    "30775": [
        "Инварианты",
        "Сложность: 4",
        "Классы: 7,8",
        "Условие: Круг разделен на 6 секторов и в них   по часовой стрелке расставлены числа: 1, 0, 1, 0, 0, 0.   Разрешается прибавить по единице к числам в любых двух соседних   секторах.  Можно ли такими операциями добиться того, чтобы все   числа в секторах были одинаковыми?",
        "Решение: Нельзя. Нужно занумеровать сектора числами от 1 до 6 по порядку, после чего рассмотреть разность между суммой чисел в четных секторах и суммой чисел в нечетных секторах."
    ],
    "30760": [
        "Инварианты",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: В вершинах правильного 12-угольника расставлены числа 1 и –1 так, что во всех вершинах, кроме одной, стоят единицы. Разрешается изменять знак в любых k подряд идущих вершинах. Можно ли такими операциями добиться того, чтобы единственное число –1 сдвинулось в соседнюю с исходной вершину, если  а) k = 3;  б) k = 4;  в) k = 6.",
        "Решение: Отметим некоторое множество вершин 12-угольника:  а) рис. слева;  б) рис. в центре;  в) рис. справа. Заметим, что любой набор из k вершин подряд содержит ровно две отмеченные вершины, поэтому произведение всех чисел в отмеченных вершинах не меняется.",
        "Ответ: Нельзя."
    ],
    "58172": [
        "Инварианты",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Дан выпуклый 2n-угольник A1...A2n. Внутри него взята точка P, не лежащая ни на одной из диагоналей.  Докажите, что точка P принадлежит чётному числу треугольников с вершинами в точках A1,..., A2n.",
        "Решение: Диагонали разбивают многоугольник на несколько частей. Будем называть соседними те из них, у которых есть общая сторона. Ясно, что из любой внутренней точки многоугольника можно попасть в любую другую, переходя каждый раз только в соседнюю часть. Часть плоскости, лежащую вне многоугольника, также можно считать одной из этих частей. Число рассматриваемых треугольников для точек этой части равно нулю, поэтому достаточно доказать, что при переходе в соседнюю часть чётность числа треугольников сохраняется.     Пусть общая сторона двух соседних частей лежит на диагонали (или  стороне) PQ. Тогда всем рассматриваемым треугольникам, кроме   треугольников со стороной PQ, обе эти части одновременно либо  принадлежат, либо не принадлежат. Поэтому при переходе из одной части  в другую число треугольников изменяется на k1 – k2, где k1 – число вершин многоугольника, лежащих по одну сторону от PQ, k2 – число вершин, лежащих по другую сторону от PQ. Так как k1 + k2 = 2m – 2, то число k1 – k2 чётно."
    ],
    "64544": [
        "Инварианты",
        "Сложность: 4",
        "Классы: ",
        "Условие: Двадцать пять монет раскладывают по кучкам следующим образом. Сначала их произвольно разбивают на две группы. Затем любую из имеющихся групп снова разбивают на две группы, и так далее до тех пор, пока каждая группа не будет состоять из одной монеты. При каждом разбиении какой-либо группы на две записывается произведение количеств монет в двух получившихся группах. Чему может быть равна сумма всех записанных чисел?",
        "Решение: Первый способ. Изобразим монеты точками и соединим каждую пару точек отрезком. Получим 25(25 – 1) : 2 = 300 отрезков. При каждом разбиении одной группы монет на две будем стирать все отрезки, соединяющие точки, соответствующие монетам, оказавшимся в разных группах. Пусть на некотором шаге мы разбили монеты одной из уже имевшихся групп на две группы по x и y монет. Тогда мы стираем xy отрезков. Это же число мы записываем. Таким образом, сумма записанных чисел – это количество всех стёртых отрезков. Так как изначально было 300 отрезков, а в итоге все отрезки стёрты, то общее количество стёртых отрезков равно 300.",
        "Ответ: 300."
    ],
    "73546": [
        "Инварианты",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: а) На 44 деревьях, расположенных по окружности, сидели 44 весёлых чижа (на каждом дереве по чижу). Время от времени два чижа одновременно перелетают на соседние деревья в противоположных направлениях (один – по часовой стрелке, другой – против). Докажите, что чижи никогда не соберутся на одном дереве.   б) А если чижей и деревьев n?",
        "Решение: а) Занумеруем деревья по порядку, начиная с некоторого дерева. Для каждого чижа рассмотрим номер дерева, на котором он сидит, и сложим эти 44 номера. Заметим, что в процессе перелетания чижей эта сумма либо не менятся, либо меняется на 44. Следовательно, остаток от деления данной суммы на 4 остается неизменным. Вначале сумма номеров деревьев равна 1 + 2 + ... + 44 = 22·45, что даёт остаток 2 от деления на 4. Но если все чижи перелетят на одно дерево с номером n, то рассматриваемая сумма станет равной 44n, что кратно 4. Значит, это невозможно."
    ],
    "88308": [
        "Инварианты",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: В одной вершине куба написано число 1, а в остальных – нули. Можно прибавлять по единице к числам в концах любого ребра.   Можно ли добиться, чтобы все числа делились а) на 2; б) на 3?",
        "Решение: а) Вначале сумма чисел, стоявших в вершинах куба, равна единице, то есть нечётна. Каждый раз мы к двум вершинам добавляем по единице, так что сумма остаётся нечётной. Поэтому числа во всех вершинах не могут стать чётными.",
        "Ответ: а), б) Нельзя."
    ],
    "35445": [
        "Полуинварианты",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: В стране несколько городов, попарные расстояния между которыми различны.    Путешественник отправился из города А в самый удаленный от него город Б,    оттуда - в самый удаленный от него город С и т.д. Докажите, что    если С не совпадает с А, то путешественник никогда не вернется в А.",
        "Подсказка: Каждое следующее путешествие не короче предыдущего.",
        "Решение: Предположим, что на втором шаге путешественник не возвратился в А,    т.е. город С отличен от города А.    Тогда маршрут от А до Б короче  маршрута из Б в С    (поскольку С - наиболее удаленный от Б город).    В дальнейшем каждый следующий маршрут будет не короче предыдущего,    так как каждый раз мы в качестве следующего пункта назначения выбираем    наиболее удаленный город.    Пусть на некотором шаге путешетвенник все же вернулся в город А, выйдя из    некоторого города Х. По доказанному, маршрут от Х до А длиннее    маршрута от А до Б, а это противоречит тому, что Б - наиболее удаленный от А    город."
    ],
    "30763": [
        "Инварианты",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Дно прямоугольной коробки вымощено плитками 1×4 и 2×2. Плитки высыпали из коробки и одна плитка 2×2 потерялась.  Ее заменили на плитку 1×4. Докажите, что теперь дно коробки вымостить не удастся.",
        "Решение: Рассмотрим раскраску в 4 цвета, такую, что каждая плитка 2×2 содержит ровно одну клетку цвета 1, а каждая плитка 1×4 - ни одной или две клетки цвета 1. Следовательно, четность числа плиток 2×2 должна совпадать с четностью числа клеток цвета 1, что и доказывает утверждение задачи."
    ],
    "30776": [
        "Инварианты",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В задаче 19 выясните, какие карточки можно получить из карточки (5, 19), а какие нельзя.",
        "Решение: В точности те  ("
    ],
    "30771": [
        "Инварианты",
        "Сложность: 4+",
        "Классы: 8,9",
        "Условие: Фишка ходит по квадратной доске, каждым своим ходом  сдвигаясь либо на клетку вверх, либо на клетку вправо, либо  по диагонали вниз-влево. Может ли она обойти всю  доску, побывав на всех полях ровно по одному разу, и закончить на  поле, соседнем справа от исходного?",
        "Решение: Сумма номеров строки и столбца при каждом ходе либо уменьшается на 2, либо увеличивается на 1.  Значит, ее остаток по модулю 3 каждый раз увеличивается на 1.  Так как всего ходов"
    ],
    "30764": [
        "Инварианты",
        "Сложность: 5",
        "Классы: 8,9",
        "Условие: Можно ли доску размерами 4×",
        "Решение: Раскрасим доску 4×"
    ],
    "58173": [
        "Инварианты",
        "Сложность: 5",
        "Классы: 8,9",
        "Условие: Вцентре каждой клетки шахматной доски стоит по фишке. Фишки переставили так, что попарные расстояния между ними не уменьшились. Докажите, что вдействительности попарные расстояния не изменились.",
        "Решение: Если хотя бы одно из расстояний между фишками увеличилось бы, то увеличилась бы исумма всех попарных расстояний между фишками, но сумма всех попарных расстояний между фишками не изменяется при любой перестановке."
    ],
    "108402": [
        "Инварианты",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: На столе рубашкой вниз лежит игральная карта. Можно ли, перекатывая ее по столу через ребро, добиться того, чтобы она оказалась на прежнем месте, но",
        "Ответ: а) нет; б) нет."
    ],
    "58177": [
        "Инварианты",
        "Сложность: 7",
        "Классы: 8,9",
        "Условие: Докажите, что существуют равновеликие многоугольники, которые нельзя разбить на многоугольники (возможно, невыпуклые), переводящиеся друг вдруга параллельным переносом.",
        "Решение: Фиксируем на плоскости некоторый луч"
    ],
    "58178": [
        "Инварианты",
        "Сложность: 7",
        "Классы: 8,9",
        "Условие: Докажите, что выпуклый многоугольник нельзя разрезать на конечное число невыпуклых четырехугольников.",
        "Решение: Предположим, что выпуклый многоугольник"
    ],
    "58179": [
        "Инварианты",
        "Сложность: 7",
        "Классы: 8,9",
        "Условие: Даны точки",
        "Решение: Пусть"
    ],
    "87954": [
        "Разрезания (прочее)",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Накакое максимальное число кусков можно разделить круглый блинчик при помощи трех прямолинейных разрезов?",
        "Подсказка: Вспомните задачу11.",
        "Решение: Если изтрех прямых каждые две пересекаются внутри блинчика, получится 7кусков (см.рис.11.4). Еслиже изэтих прямых какиенибудь две параллельны или пересекаются запределами блинчика, токусков будет меньше.",
        "Ответ: 7кусков."
    ],
    "35822": [
        "Четность и нечетность",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: а) На столе лежит 21 монета решкой вверх. За одну операцию разрешается перевернуть любые 20 монет. Можно ли за несколько операций добиться, чтобы все монеты легли орлом вверх?   б) Тот же вопрос,  если монет  20, а разрешается переворачивать по 19.",
        "Решение: а) См. задачу 35111.",
        "Ответ: а) Нельзя; б) можно."
    ],
    "88247": [
        "Подсчет двумя способами",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Рита, Люба иВаря решали задачи. Чтобы дело шло быстрее, они купили конфет иусловились, что закаждую решённую задачу девочка, решившая её первой, получает четыре конфеты, решившая второй— две, арешившая последней—одну.  Девочки говорят, что каждая изних решила все задачи иполучила 20конфет, причём одновременных решений небыло. Они ошибаются. Как вы думаете, почему?",
        "Подсказка: Заметьте, зарешение каждой задачи все три девочки вместе получали 7 конфет.",
        "Решение: Если зарешение каждой задачи все три девочки вместе получали 7конфет (первая— 4, вторая— 2, третья— 1конфету), значит, сумма всех полученных ими конфет должна обязательно делиться на7, но60 на7 неделится. Следовательно, девочки ошиблись.",
        "Ответ: Сумма конфет, полученных всеми девочками, должна делиться насумму конфет, получаемых заодну задачу, т.е. должна быть кратна7."
    ]
}