{
    "88025": [
        "https://www.problems.ru/view_problem_details_new.php?id=88025",
        "Математическая логика (прочее)",
        "Сложность: 2",
        "Классы: 5,6,7,8",
        "Условие:  В Стране Чудес проводилось следствие по делу об украденномбульоне. На суде Мартовский Заяц заявил, что бульон украл Болванщик.Соня и Болванщик тоже дали показания, но что они сказали, никтоне запомнил, а запись смыло алисиными слезами. В ходе судебногозаседания выяснилось, что бульон украл лишь один из подсудимых и чтотолько он дал правдивые показания. Так кто украл бульон?      ",
        "Подсказка:       Подумайте, почему Мартовский Заяц не может бытьвором.",
        "Решение:       Вором не может быть Мартовский Заяц, потому что вор сказалправду, а Заяц, в этом случае, соврал. Вором не может быть Болванщик,потому что, в этом случае, Заяц сказал правду, а правду сказал тольковор. Значит, вор — Соня.      ",
        "Ответ:        Бульон украл Соня.      "
    ],
    "88041": [
        "https://www.problems.ru/view_problem_details_new.php?id=88041",
        "Математическая логика (прочее)",
        "Сложность: 2",
        "Классы: 5,6,7,8",
        "Условие:  На столележат в ряд четыре фигуры: треугольник, круг, прямоугольник и ромб. Ониокрашены в разные цвета: красный, синий, жёлтый, зелёный. Известно, чтокрасная фигура лежит между синей и зелёной справа от жёлтой фигурылежит ромб круг лежит правее и треугольника и ромба треугольник лежитне с краю синяя и жёлтая фигуры лежат не рядом. Определите, в какомпорядке лежат фигуры и какого они цвета.      ",
        "Подсказка:       Попробуйте сначала определить, как расположены фигурыпо цвету, не обращая внимание на их форму.      ",
        "Решение:       Для удобства изложения повторим все условия задачи: 1) красная фигура — между синей и зелёной 2) справа от жёлтой фигуры — ромб 3) круг — правее и треугольника и ромба 4) треугольник — не с краю 5) синяя и жёлтая фигуры — не рядом. Поскольку красная фигура лежит между синей и зелёной (условие 1), а жёлтая — не рядом с синей (условие 5), то возможны только два варианта расположения фигур по цвету: \"синяя, красная, зелёная, жёлтая\" или \"жёлтая, зелёная, красная, синяя\". Первый из приведённых вариантов неверен, поскольку по условию 2 жёлтая фигура не может лежать на правом крае. Остаётся только одна возможность расположения фигур по цветам: \"жёлтая, зелёная, красная, синяя\". Из условия 2 сразу же определяется, что ромб зелёный. Отсюда и из условия 4 следует, что треугольник красный. В свою очередь отсюда и из условия 3 следует, что круг синий. Значит, прямоугольник может быть только жёлтым. Окончательный ответ: жёлтый прямоугольник, зелёный ромб, красный треугольник, синий круг.       ",
        "Ответ: Жёлтый прямоугольник, зелёный ромб, красный треугольник, синий круг.       "
    ],
    "88281": [
        "https://www.problems.ru/view_problem_details_new.php?id=88281",
        "Математическая логика (прочее)",
        "Сложность: 2",
        "Классы: 5,6,7,8,9",
        "Условие:  Корольрешил уволить в отставку премьер-министра, но не хотел его обидеть.Когда премьер-министр пришёл к королю, тот сказал: \"В этотпортфель я положил два листа бумаги. На одном из них написано\"`Останьтесь\"', на другом — \"`Уходите\"'. Листок, который вы сейчасне глядя вытянете из портфеля, решит вашу судьбу\".Премьер-министр догадался, что на обоих листках написано\"Уходите\". Однако ему удалось сделать так, что король его оставил.Как поступил премьер-министр?      ",
        "Подсказка:       Вспомните задачи 140, 148,149, 153.      ",
        "Решение:       Премьер-министр мог вытащить любой из листови, не разворачивая, уничтожить его. Тогда королю ничего другогоне останется, как признать, что на уничтоженном листе было написаноне то, что осталось в портфеле, т.е. \"Останьтесь\".      ",
        "Ответ:        Вытащил один из листов и уничтожил его.      "
    ],
    "102859": [
        "https://www.problems.ru/view_problem_details_new.php?id=102859",
        "Ребусы",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: Может ли  быть верным равенство  К×О×Т = У×Ч×Е×Н×Ы×Й,  если вместо букв в него подставить цифры от 1 до 9 (разным буквам соответствуют разные цифры)? ",
        "Решение: Левая часть не больше  7·8·9 = 513,  а правая – не меньше  1·2·3·4·5·6 = 720,  то есть больше левой. ",
        "Ответ: Не может. "
    ],
    "103850": [
        "https://www.problems.ru/view_problem_details_new.php?id=103850",
        "Ребусы",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: Авторы: Митягин А.Ю., Клепцын В.А.Шифр кодового замка является двузначным числом. Буратино забыл код, нопомнит, что сумма цифр этого числа, сложенная с их произведением, равнасамому числу. Напишите все возможные варианты кода, чтобы Буратино смогбыстрее открыть замок.",
        "Решение: Пусть первая цифра кода x, а вторая y. Тогда само число записывается как10x + y, а условие задачи можно записать уравнением (x + y) + x . y = 10x + y.Следовательно, x . y = 9x.Так как код — двузначное число, то x не равно 0, а значит, y = 9. При этом xможно взять любым, кроме 0. Проверьте!",
        "Ответ:   19, 29, 39, 49, 59, 69, 79, 89, 99.      "
    ],
    "115477": [
        "https://www.problems.ru/view_problem_details_new.php?id=115477",
        "Математическая логика (прочее)",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: В тюрьме Кощея пять камер, пронумерованных числами от  1  до 5 . В каждой камере сидит по одному узнику. Василиса уговорилаКощея провести эксперимент: на стене каждой камеры она один разнапишет какой-нибудь номер и в полночь каждый узник перейдёт вкамеру с указанным номером (если номер на стене совпадает сномером камеры, то узник никуда не переходит). В следующую полночьузники опять должны перейти из камеры в камеру согласно указаниямна стене, и так они действуют в течение пяти ночей. Еслирасположение узников в камерах в течение всех шести дней (включаяпервый) ни разу не повторится, то Василисе дадут звание Премудрой,а узников отпустят. Помогите Василисе написать номера в камерах.",
        "Решение: Пусть Василиса запишет на стенах камер указанный набор номеров.Тогда первые два узника будут каждую ночь меняться местами, тоесть каждый из них будет возвращаться на свое изначальное местораз в два дня. Остальные три узника будут возвращаться на своиместа раз в три дня. Поскольку числа  2  и  3  взаимно просты, томы получим шесть различных размещений узников по камерам.",
        "Ответ: например:  2 ,  1 ,  4 ,  5 ,  3  (в порядке номеров камер). "
    ],
    "60906": [
        "https://www.problems.ru/view_problem_details_new.php?id=60906",
        "Математическая логика (прочее)",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие:  Коля Васин задумал число: 1, 2 или 3. Вызадаете ему только один вопрос, на который он может ответить ``да'', ``нет'' или ``не знаю''. Сможете ли выугадать число, задав всего лишь один вопрос?"
    ],
    "35503": [
        "https://www.problems.ru/view_problem_details_new.php?id=35503",
        "Математическая логика (прочее)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: На острове Невезения живут только рыцари, которые всегда говорят правду, и лжецы, которые всегда лгут. В Думе острова – 101 депутат. В целях сокращения бюджета было решено сократить Думу на одного депутата. Но каждый из депутатов заявил, что, если его выведут из состава Думы, то среди оставшихся депутатов большинство будут лжецами. Сколько рыцарей и сколько лжецов в Думе? ",
        "Подсказка: Запишите два неравенства, соответствующих высказываниям депутата-лжеца и депутата-рыцаря. ",
        "Решение: Пусть Р – количество рыцарей в Думе, Л – количество лжецов  (Р + Л = 101).  Тогда в соответствии с высказыванием депутата-рыцаря  Р – 1 < 50.  Следовательно,  Р < 51  (отсюда, в частности, следует, что Дума не может состоять из одних рыцарей). В соответствии с высказыванием депутата-лжеца Л – 1 ≤ 50.  Следовательно,  Л ≤ 51  (отсюда, в частности, следует, что Дума не может состоять из одних лжецов). ",
        "Ответ: 51 лжец и 50 рыцарей. "
    ],
    "86492": [
        "https://www.problems.ru/view_problem_details_new.php?id=86492",
        "Математическая логика (прочее)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: На острове проживают 1234 жителя, каждый из которых либо рыцарь (который всегда говорит правду) либо лжец (который всегда лжёт). Однажды все жители острова разбились на пары, и каждый про своего соседа по паре сказал: \"Он – рыцарь!\", либо \"Он – лжец!\". Могло ли в итоге оказаться, что тех и других фраз произнесено поровну? ",
        "Решение:    Предположим, что описанная ситуация возможна. Тогда, каждая из фраз произнесена по  1234 : 2 = 617  раз.    Cуществует только три возможных вида пар: два рыцаря два лжеца рыцарь и лжец. В парах первого и второго вида каждый произнёс: \"Он – рыцарь!\", а в парах третьего вида каждый произнёс: \"Он – лжец!\". Таким образом, каждая из фраз произнесена чётное количество раз, что противоречит тому, что их должно быть по 617. ",
        "Ответ: Не могло. "
    ],
    "88162": [
        "https://www.problems.ru/view_problem_details_new.php?id=88162",
        "Математическая логика (прочее)",
        "Сложность: 2+",
        "Классы: 5,6,7,8",
        "Условие:  ОднаждыАлиса оказалась в какой-то из двух стран — А или Я. Она знает,что все жители страны А всегда говорят правду, а все жители страны Я —всегда лгут. Притом все они часто ездят в гости друг к другу. Может лиАлиса, задав один-единственный вопрос первому встречному, узнать,в какой из стран она находится?      ",
        "Подсказка:       Попробуйте найти такие вопросы, на которые все люди,находящиеся в данный момент в стране А, ответят одинаково, а затем средиэтих вопросов выберите такие, на которые в стране Я ответят тожеодинаково, но подругому.      ",
        "Решение:       Определим сначала такие вопросы, на которые все, находящиесяв данный момент в стране А, ответят одинаково, а затем среди этихвопросов выберем такие, на которые в стране Я ответят тожеодинаково, но подругому.Итак, находясь в стране честных людей, Алиса должна задать такой вопрос,на который и честный местный житель, и приезжий лгун дали бы одини тот же ответ, например \"да\". Смысл в том, чтобы ответ \"да\" на этотвопрос был для местного правдой, а для приезжего лгуна — ложью. Инымисловами, этот вопрос должен относиться к таким обстоятельствамвопрошаемого, которые верны лишь для местных жителей. Такихобстоятельств два: наличие честности и принадлежность к числу местныхжителей. Поэтому и вопросов два: либо \"Вы честный?\", либо \"Выместный?\". На любой из этих вопросов в стране А всегда ответят\"да\". Но на первый вопрос: \"Вы честный?\" и в стране Я, каки повсюду в мире, тоже любой ответит \"да\". Поэтому первый вопрос Алисене подойдёт, а вот второй (\"Вы местный?\") — годится:в стране А на него всегда ответят \"да\",а в стране Я — \"нет\".      ",
        "Ответ:        Да. \"Вы житель этой страны?\"      "
    ],
    "103869": [
        "https://www.problems.ru/view_problem_details_new.php?id=103869",
        "Ребусы",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Авторы: Блинков А.Д., Хачатурян А.В.Решите ребус:  БАО×БА×Б = 2002. ",
        "Подсказка: 2002 = 2·7·11·13. ",
        "Решение:    Заметим, что  Б = 1.  Действительно, если  Б ≥ 2,  то  БАО×БАtimeБ ≥ 200·20·2 = 8000 > 2002.     2002 = 2·7·11·13.  БА является двузначным делителем числа 2002, начинающимся  на цифру 1, то есть БА может быть равно 11, 13 или  2·7 = 14.  Так как  Б ≠ А,  то  БА ≠ 11.  Если  БА = 13,  то  БАО = 2002 : 13 = 154,  откуда А равно и 3, и 5. Противоречие.     Оставшийся вариант  БА = 14,  БАО = 2002 : 14 = 143  является решением. ",
        "Ответ: 143·14·1 = 2002. "
    ],
    "35342": [
        "https://www.problems.ru/view_problem_details_new.php?id=35342",
        "Математическая логика (прочее)",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: На острове живут два племени: аборигены и пришельцы. Аборигены        всегда говорят правду, а пришельцы всегда лгут. Путешественник,        приехавший на остров, нанял островитянина в проводники. Они пошли и        увидели другого островитянина. Путешественник послал проводника узнать,        к какому племени принадлежит этот туземец. Проводник вернулся и сказал:        \"Туземец говорит, что он абориген\". Кем был проводник: пришельцем или        аборигеном? ",
        "Подсказка: Задумайтесь над вопросом, что мог сказать встречный островитянин.",
        "Решение: Из сообщения проводника следует, что проводник-абориген.       Действительно, ответ встреченного островитянина мог быть только один:       Я  абориген, так как этот ответ является правдой для аборигена и       ложью для пришельца. Следовательно, проводник сказал правду, и       поэтому он принадлежит к аборигенам. "
    ],
    "35184": [
        "https://www.problems.ru/view_problem_details_new.php?id=35184",
        "Математическая логика (прочее)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: На острове живут лжецы и рыцари, всего 2001 человек.   Рыцари всегда говорят   правду, а лжецы лгут. Каждый житель острова заявил:   \"Среди оставшихся жителей острова более половины - лжецы\".   Сколько лжецов на острове? ",
        "Подсказка: Возьмите одного рыцаря и одного лжеца. Из высказанных ими заявлений  вытекают оценки снизу и сверху на число лжецов.",
        "Решение: Все жители острова не могут быть лжецами, иначе каждый из них  сказал бы правду. Возьмем некоторого рыцаря.  Из его заявления вытекает,  что лжецов на острове больше, чем  (2001-1)/2=1000.   Возьмем теперь некоторого лжеца.  Его заяление  ложно, поэтому кроме него не более половины жителей острова - лжецы.  Это означает, что кроме него на острове не более 2000/2=1000 лжецов,  т.е. вместе с ним лжецов не более 1001.  Таким образом, из полученных оценок на число лжецов получаем, что  единственная возможность - когда на острове ровно 1001 лжец.",
        "Ответ: 1001.00"
    ],
    "104009": [
        "https://www.problems.ru/view_problem_details_new.php?id=104009",
        "Математическая логика (прочее)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Король устроил испытание жениху своей дочери. В одну из трех комнат он посадил принцессу, в другую - тигра, а последнюю комнату оставил пустой. Известно, что табличка на той двери, где сидит принцесса, истинна, где тигр - ложна, а про табличку на третьей комнате ничего не известно. Таблички эти таковы:123Комната 3 пустаТигр в комнате 1Эта комната пустаСможет ли принц правильно угадать комнату с принцессой?      "
    ],
    "32056": [
        "https://www.problems.ru/view_problem_details_new.php?id=32056",
        "Математическая логика (прочее)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Каждый из четырех гномов — Беня, Веня, Женя, Сеня — либо всегда говорит правду, либо всегда врет. Мы услышали такой разговор: Беня — Вене: \"ты врун\" Женя — Бене: \"сам ты врун\" Сеня — Жене: \"да оба они вруны, — (подумав), — впрочем, ты тоже\". Кто из них говорит правду? ",
        "Решение: Предположим, Сеня говорит правду. Тогда, согласно его словам, три остальных гнома — вруны. И, тем самым, фраза Бени является правдой. Значит, предположение приводит к противоречию, поэтому Сеня — врун, и его утверждение, что Женя — врун, является ложным. Отсюда заключаем, что Женя говорит правду. Тем самым, Беня — врун, а Веня говорит правду. Отметим, что фраза Сени \"да оба они вруны\" (относительно Бени и Вени) является ложной (несмотря на то, что Беня действительно врун), поскольку Веня — не врун. ",
        "Замечания:  Источник решения: книга \"В.О.Бугаенко. Турниры им. Ломоносова.  Конкурсы по математике. МЦНМО-ЧеРо. 1998\"."
    ],
    "34840": [
        "https://www.problems.ru/view_problem_details_new.php?id=34840",
        "Математическая логика (прочее)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: За круглым столом сидят несколько гостей.  Некоторые  из  них  знакомы  между собой знакомство взаимно.  Все знакомые любого гостя (считая его  самого) сидят вокруг  стола  через  равные  промежутки.  (Для  другого  человека эти промежутки могут быть другими.)  Известно,  что любые двое  имеют хотя бы одного общего знакомого.  Докажите, что все гости знакомы  друг с другом.",
        "Подсказка: Вначале докажите, что найдется человек, знакомый со всеми остальными.",
        "Решение: Заметим,  что если у человека есть знакомые,  сидящие рядом  (в частности, если он знаком со своим соседом), то этот человек  знаком  со всеми.  Докажем, что такой гость найдется. Пусть A и B - двое  соседей.  Если  они  не знакомы между собой,  то их общий знакомый C  знаком со всеми,  так  как  его  знакомые  сидят  без  промежутков. В  противном случае знаком со всеми человек A (по той же причине).  Итак, пусть  X - гость,  знакомый со всеми.  Тогда его соседи тоже  знакомы со всеми,  так как они  знакомы  с  X  (являющимся  для  них  соседом).  Соседи этих соседей также знакомы со всеми,  и так далее по  кругу в обе стороны."
    ],
    "32792": [
        "https://www.problems.ru/view_problem_details_new.php?id=32792",
        "Математическая логика (прочее)",
        "Сложность: 3-",
        "Классы: 7,8,9",
        "Условие: Государство Диполия населено лжецами и рыцарями, причем лжецывсегда лгут, а рыцари всегда говорят правду. Путешественник едет по этойстране в сопровождении официального гида и знакомится с другим жителем.\"Вы, конечно, рыцарь?\" -- спрашивает он. Туземец его понимает и отвечает\"Ырг\", что значает то ли \"да\", то ли \"нет\". На просьбу перевести гид говорит:\"Он сказал -- да. Добавлю, что на самом деле он лжец\". А вы как думаете?",
        "Решение: 1) Заметим сначала, что путешественник и без помощи гида мог определить, что слово \"Ырг\" обозначает \"да\". Действительно, независимо от того, является ли житель острова рыцарем или лжецом, на вопрос \"Вы, конечно, рыцарь?\" он ответит \"да\".  2) Значит, гид является рыцарем и говорит правду, но из его слов следует, что туземец - лжец. Следовательно, так оно и есть.",
        "Ответ: Действительно, \"Ырг\" обозначает \"да\", а туземец - лжец."
    ],
    "88233": [
        "https://www.problems.ru/view_problem_details_new.php?id=88233",
        "Математическая логика (прочее)",
        "Сложность: 3-",
        "Классы: 6,7,8",
        "Условие:  Тридруга — Пётр, Роман и Сергей — учатся на математическом, физическоми химическом факультетах. Если Пётр математик, то Сергей не физик. ЕслиРоман не физик, то Пётр математик. Если Сергей не математик,то Роман — химик. Сможете ли вы определить специальности каждого?      ",
        "Подсказка:       Подумайте, может ли Роман быть математиком. Вспомнитезадачи 71, 132, 144,189, 195.      ",
        "Решение:       Предположим, что Роман не физик, тогда (по условию 2) Пётрматематик, но если Пётр математик, то Сергей (по условию 1) не физик —получилось явное противоречие. Значит, Роман — физик. Тогда Сергейматематик — иначе (по условию 3) Роман был бы химиком. Значит,Пётр — химик. Итак: Пётр — химик, Роман — физик, Сергей —математик.      ",
        "Ответ:        Пётр — химик, Роман — физик,Сергей — математик.      "
    ],
    "108736": [
        "https://www.problems.ru/view_problem_details_new.php?id=108736",
        "Ребусы",
        "Сложность: 3-",
        "Классы: 7,8,9",
        "Условие: На доске было написано несколько натуральных чисел, причём разность любых двухсоседних чисел равна одному и тому же числу. Коля заменил в этой записи разныецифры разными буквами, а одинаковые цифры  одинаковыми буквами.Восстановите исходные числа, если на доске написаноТ, ЕЛ, ЕК, ЛА, СС.      ",
        "Решение: Заметим, что все эти числа можно определить, если знать первое число и разностьd двух соседних. Посмотрим на первое число. Про него можносказать только, что оно однозначное. А что можно сказать про разностьd? Посмотрев на первое и второе, можно сказать только, чтоd < 90. Зато, так как у второго и третьего чиселсовпадают первые цифры, они лежат в одном десятке, и их разность (равнаяd) не превосходит 9. А значит, прибавив dк первому (однозначному) числу, мы можем получить только двузначное число,начинающееся на 1, то есть Е = 1. Аналогично, Л = 2, С = 3. Получаем запись: Т,12, 1К, 2А, 33. Заметим, что 1К - 12 = 2А - 1К = 33 - 2А = d, откуда33 - 12 = 3d, d = 7. Мы восстановили последнее число и разность. Дальше легковосстановить запись: 5, 12, 19, 26, 33.      ",
        "Ответ: 5, 12, 19, 26, 33.      "
    ],
    "116817": [
        "https://www.problems.ru/view_problem_details_new.php?id=116817",
        "Математическая логика (прочее)",
        "Сложность: 3-",
        "Классы: 8,9",
        "Условие: Автор: Бакаев Е.В.Про группу из пяти человек известно, что:  Алеша на 1 год старше Алексеева,   Боря на 2 года старше Борисова,  Вася на 3 года старше Васильева,  Гриша на 4 года старше Григорьева,  а еще в этой группе есть Дима и Дмитриев.Кто старше и на сколько: Дима или Дмитриев?",
        "Решение: Сумма возрастов Алеши, Бори, Васи, Гриши и Димы равна сумме возрастов Алексеева, Борисова, Васильева, Григорьева и Дмитриева. Значит, Дмитриев старше Димы на  1 + 2 + 3 + 4 = 10  лет.",
        "Ответ: Дмитриев старше Димы на 10 лет. ",
        "Замечания:   3 балла"
    ],
    "35178": [
        "https://www.problems.ru/view_problem_details_new.php?id=35178",
        "Парадоксы",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Каждый вечер Иван Таранов приходит в случайное время на автобусную  остановку. На этой остановке останавливаются два маршрута -   на одном из них Иван может ехать к себе домой, а на другом -   в гости к другу Козявкину.   Иван ждет первого автобуса и в зависимости от того, какой  автобус подошел, он едет либо домой, либо к другу.  Через некоторое время Иван заметил, что  в гостях у Козявкина он оказывается при этом примерно в два   раза чаще, чем дома. На основе этого Иван делает вывод,  что один из автобусов ходит в два раза чаще другого.  Прав ли он? Могут ли при выполнении условия задачи  автобусы ходить с одинаковой частотой?  (Предполагается, что автобусы ходят не случайным образом,  а по некоторому расписанию.)",
        "Подсказка: Если расписание устроено таким образом, что маршрут B всегда  приходит почти сразу после маршрута A, то на автобусе  маршрута B почти никогда не поедешь.",
        "Решение: Рассмотрим следующий пример. Пусть маршрут A, который везет  Ивана домой, приходит каждый час в 00 минут (т.е. в 0.00, 1.00, 2.00,  ... ,23.00), а маршрут B, который везет к другу,  приходит каждый час через 40 минут после автобуса маршрута A  (т.е. в 0.40, 1,40, ... ,23.40).  Таким образом, если Ваня подходит к остановке в первые 40 минут   каждого часа, то он оказывается у друга, а если в последние 20  минут каждого часа (это происходит в два раза реже),  то у себя дома."
    ],
    "35564": [
        "https://www.problems.ru/view_problem_details_new.php?id=35564",
        "Ребусы",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Криптограмма                12 2 24 5 3 21    6 29    28 2 20 18    20 21 5 10     27 17 2 11 2 16 -          19 2     27 5     8 29 12 31 22 2 16,     19 2     19 5     17 29 8 29 6 29 16:          8 2 19 19 29     10    19 29 14 19 29    29 19 10     2 24 2 11 2 16          10 14 18 21     17 2 20 2 28 29 16     21 29 28 6 29 16.                получена заменой букв на числа (от 1 до 32) так, что разным буквам соответствуют разные числа. Отдельные слова разделены несколькими пробелами, буквы - одним пробелом, знаки         препинания сохранены. Буквы ``е'' и ``ё'' не различаются. Прочтите четверостишие В. Высоцкого. ",
        "Подсказка: Поскольку пробелы и знаки препинания в тексте сохранены,         проще всего начать с угадывания слов текста, содержащих две буквы.         Зафиксировав         \"догадку\", проставляем полученные буквы по всему тексту в надежде получить         легко угадываемые участки в других местах.",
        "Решение: Бегают по лесу стаи зверей -          Не за добычей, не на водопой:          Денно и нощно они егерей          Ищут веселой толпой.                   "
    ],
    "64322": [
        "https://www.problems.ru/view_problem_details_new.php?id=64322",
        "Математическая логика (прочее)",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Автор: Шаповалов А.В. Перед началом чемпионата школы по шахматам каждый из участников сказал, какое место он рассчитывает занять. Семиклассник Ваня сказал, что займёт последнее место. По итогам чемпионата все заняли различные места, и оказалось, что каждый, кроме, разумеется, Вани, занял место хуже, чем ожидал. Какое место занял Ваня? ",
        "Решение: Так как каждый из школьников (кроме Вани) занял место хуже, чем ожидал, то первое место не занял никто из них. Следовательно, первое место занял Ваня.",
        "Ответ: Первое место. ",
        "Замечания:  Задача предлагалась также на IX Уральском турнире юных математиков в 1997 г. "
    ],
    "64787": [
        "https://www.problems.ru/view_problem_details_new.php?id=64787",
        "Ребусы",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Найдите наибольшее четырёхзначное число, которое делится на 7 и записывается четырьмя различными цифрами.",
        "Решение: Выберем последовательно наибольшие возможные значения в разрядах тысяч, сотен и десятков, то есть будем искать число вида 987А. Число 987 делится на 7, значит, и А должно делиться на 7. Так как значение  А = 7  выбрать нельзя, то  А = 0.",
        "Ответ: 9870. "
    ],
    "65084": [
        "https://www.problems.ru/view_problem_details_new.php?id=65084",
        "Математическая логика (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Автор: Рубанов И.С.На доске нарисованы три четырёхугольника. Петя сказал: \"На доске нарисованы по крайней мере две трапеции\". Вася сказал: \"На доске нарисованы по крайней мере два прямоугольника\". Коля сказал: \"На доске нарисованы по крайней мере два ромба\". Известно, что один из мальчиков сказал неправду, а двое других – правду. Докажите, что среди нарисованных на доске четырёхугольников есть квадрат. ",
        "Решение: Трапеция – не параллелограмм. Поэтому, если Петя прав, то на доске нарисовано не больше одного параллелограмма, и Вася с Колей оба неправы. Но по условию неправду сказал только один человек. Следовательно, это Петя, а Вася и Коля сказали правду. Это значит, что по крайней мере один из трёх нарисованных на доске четырёхугольников одновременно является прямоугольником и ромбом, то есть квадратом."
    ],
    "66071": [
        "https://www.problems.ru/view_problem_details_new.php?id=66071",
        "Ребусы",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Автор: Бакаев Е.В.Замените в выражении  ABC = DEF  буквы цифрами так, чтобы равенство стало верным, использовав каждую цифру от 1 до 6 ровно один раз.  (ABC – двузначное число из цифр A и B, возведённое в степень C. Достаточно привести один способ замены.) ",
        "Решение: Например,  165 = 220 = 324. ",
        "Ответ: 165 = 324. ",
        "Замечания:  Нетрудно доказать, что других решений нет (не считая перестановки правой и левой частей равенства). "
    ],
    "88190": [
        "https://www.problems.ru/view_problem_details_new.php?id=88190",
        "Математическая логика (прочее)",
        "Сложность: 3",
        "Классы: 5,6,7,8",
        "Условие:  Ваняи Вася — братья-близнецы. Один из них всегда говорит правду,а другой всегда лжёт. Вы можете задать только один вопрос одномуиз братьев, на который он ответит \"да\" или \"нет\". Попробуйтевыяснить, как зовут каждого из близнецов.      ",
        "Подсказка:       Вспомните задачи 140, 148,149, 153.      ",
        "Решение:       Если мы спросим: \"Что ответит твой брат на вопрос: \"`ТыВася?\"'\" — то в ответ всегда услышим неправду, так как будет либоложно передан истинный ответ, либо истинно — ложный. Вася скажет\"да\", а Ваня — \"нет\".      ",
        "Ответ:        \"Что ответит твой брат на вопрос: \"`Ты — Вася?\"'\"      "
    ],
    "88332": [
        "https://www.problems.ru/view_problem_details_new.php?id=88332",
        "Ребусы",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Налим-лиман. Найти такие цифры, которые при подстановке их вместо букв в выражение НАЛИМ × 4 = ЛИМАН давали тождество (разным буквам соответствуют разные цифры, а одинаковым одинаковые)",
        "Решение: Т.к. 4 × М четно, то Н — четная цифра. Тогда Н = 2, ибо иначе произведение слева было бы шестизначным числом.  Поэтому Л = 8 или Л = 9, а М = 3 или М = 8. Так как произведение слева дает пятизначное число, то A ≤ 4. Пусть М = 3. Так как 4 × И + 1 оканчивается на А, то А — нечетное, т.е. А = 1, тогда И = 5, но тогда Л = 8 или Л = 9 не подходят. Пусть М = 8, а тогда Л = 8, т.к. число 4 × И + 3 оканчивается на А, то А — нечетное число, т.е. А = 1 или А = 3. Если А = 1, то Л не равно 9. Следовательно, А = 3, а И = 5.",
        "Ответ: 23958 × 4 = 95832."
    ],
    "98167": [
        "https://www.problems.ru/view_problem_details_new.php?id=98167",
        "Математическая логика (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Автор: Борисов Л.Мудрецу С. сообщили сумму трёх натуральных чисел, а мудрецу П. – их произведение.  – Если бы я знал, – сказал С., – что твоё число больше, чем моё, я бы сразу назвал три искомых числа.  – Мое число меньше, чем твоё, – ответил П., – а искомые числа ..., ... и ... .  Какие числа назвал П.? ",
        "Решение: Сумму чисел обозначим через S, произведение – через P. Если S равно 3, 4 или 5, то  P < S  и высказывание С. не имеет смысла. Если  S ≥ 7,  то среди вариантов наборов, имеющих сумму S, есть такие:  (1, 2, S – 3)  и  (2, 2, S – 4).  В обоих случаях  P > S,  что противоречит высказыванию С. Остаётся вариант  S = 6.  При этом P может равняться 4, 6 и 8. Но П. сказал, что его число меньше. Значит, П. назвал числа 1, 1 и 4 (после слов С. он понял, что  S ≠ 5,  и отбросил вариант 1, 2, 2). ",
        "Ответ: 1, 1 и 4. ",
        "Замечания:  4 балла "
    ],
    "98645": [
        "https://www.problems.ru/view_problem_details_new.php?id=98645",
        "Математическая логика (прочее)",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Разбирается дело Брауна, Джонса и Смита. Один из них совершил преступление. В ходе следствия каждый из них сделал по два заявления. Браун: «Я не делал этого. Джонс не делал этого». Смит: «Я не делал этого. Это сделал Браун.» Джонс: «Браун не делал этого. Это сделал Смит.» Потом оказалось, что один из них дважды сказал правду, другой — дважды солгал, третий — раз сказал правду, раз солгал. Кто совершил преступление?",
        "Подсказка: Подумайте, мог ли Джонс быть вором.",
        "Решение: Вор — Браун. Если мы рассмотрим три возможности — «украл Браун», «украл Смит» и «украл Джонс», то увидим, что только в случае «вор — Браун» выполняются условия задачи. Если же вор — Смит, то и Браун, и Джонс оба сказали правду. Если вор — Джонс, то и Браун, и Смит одновременно сказали и правду, и ложь."
    ],
    "116581": [
        "https://www.problems.ru/view_problem_details_new.php?id=116581",
        "Математическая логика (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Автор: Агаханов Н.Х.За круглым столом сидят 30 человек – рыцари и лжецы (рыцари всегда говорят правду, а лжецы всегда лгут). Известно, что у каждого из них за этим же столом есть ровно один друг, причём у рыцаря этот друг – лжец, а у лжеца этот друг – рыцарь (дружба всегда взаимна). На вопрос \"Сидит ли рядом с вами ваш друг?\" сидевшие через одного ответили \"Да\". Сколько из остальных могли также ответить \"Да\"? ",
        "Решение: Все сидящие за столом разбиваются на пары друзей значит, рыцарей и лжецов поровну. Рассмотрим любую пару друзей. Если они сидят рядом, то рыцарь на заданный вопрос ответит \"Да\", а лжец – \"Нет\". Если же они не сидят рядом, то их  ответы будут противоположными. В любом случае ровно один из пары друзей даст ответ \"Да\". Значит, все остальные 15 ответов будут \"нет\".",
        "Ответ: 0. "
    ],
    "116936": [
        "https://www.problems.ru/view_problem_details_new.php?id=116936",
        "Математическая логика (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Автор: Женодаров Р.Г.30 девочек – 13 в красных платьях и 17 в синих платьях – водили хоровод вокруг новогодней ёлки. Впоследствии каждую из них спросили, была ли её соседка справа в синем платье. Оказалось, что правильно ответили те и только те девочки, которые стояли между девочками в платьях одного цвета. Сколько девочек могли ответить утвердительно? ",
        "Решение:    Рассмотрим любую девочку. Цвета платьев её соседок слева и справа могли быть такими: синий – синий, синий – красный, красный – синий, красный – красный. Девочка отвечает \"да\" только в первых двух случаях то есть ровно в тех случаях, когда её соседка слева – в синем платье.    Но соседка слева была в синем платье ровно у 17 девочек, поэтому ответ \"да\" прозвучал 17 раз.",
        "Ответ: 17 девочек. "
    ],
    "35638": [
        "https://www.problems.ru/view_problem_details_new.php?id=35638",
        "Ребусы",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Текст   М  И  М  О  П  Р  А  С  Т  Е  Т  И  Р  А  С  И  С  П  Д  А   И  С  А  Ф  Е  И  И  Б  О  Е  Т  К  Ж  Р  Г  Л  Е  О  Л  О    И  Ш  И  С  А  Н  Н  С  Й  С  А  О  О  Л  Т  Л  Е  Я  Т  У    И  Ц  В  Ы  И  П  И  Я  Д  П  И  Щ  П  Ь  П  С  Е  Ю  Я  Я    получен из исходного сообщения перестановкой его букв.   Текст   У  Щ  Ф  М  Ш  П  Д  Р  Е  Ц  Ч  Е  Ш  Ю  Ш  Ч  Д  А  К  Е    Ч  М  Д  В  К  Ш  Б  Е  Е  Ч  Д  Ф  Э  П  Й  Щ  Г  Ш  Ф  Щ    Ц  Е  Ю  Щ  Ф  П  М  Е  Ч  П  М  Е  Р  Щ  М  Е  О  Ф  Ч  Щ    Х  Е  Ш  Р  Т  Г  Д  И  Ф  Р  С  Я  Ы  Л  К  Д  Ф  Ф  Е  Е    получен из того же исходного сообщения заменой каждой буквы на другую букву   так, что разные буквы заменены разными, а одинаковые - одинаковыми.   Восстановите исходное сообщение.   (Задача с сайта www.crytograhy.ru.) ",
        "Подсказка: Пусть некоторая буква a при зашифровании первым способом заменялась на букву .  Тогда количество повторов буквы a в первой криптограмме будет равно числу повторов буквы    во второй криптограмме. ",
        "Решение: Используя указание, подбираем Ответ: ШЕСТАЯОЛИМПИАДАПОКРИПТОГРАФИИПОСВЯЩЕНАСЕМИДЕСЯТИ  ПЯТИЛЕТИЮСПЕЦИАЛЬНОЙСЛУЖБЫРОССИИ "
    ],
    "64576": [
        "https://www.problems.ru/view_problem_details_new.php?id=64576",
        "Ребусы",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: Автор: Хачатурян А.В.Замените в слове МАТЕМАТИКА буквы цифрами и знаками сложения и вычитания так, чтобы получилось числовое выражение, равное 2014.  (Одинаковыми буквами обозначены одинаковые цифры или знаки, разными – разные. Достаточно привести пример.)",
        "Ответ: 183 + 1839 – 8. ",
        "Замечания:     1. Чтобы найти решение (а также доказать его единственность), полезно задуматься над тем, какие из букв являются знаками действий.     Ясно, что это не может быть A (как последний символ выражения). Тогда между двумя первыми цифрами А должен стоять хотя бы один знак. Знак Т не может быть ни минусом, ни плюсом (даже  МА + ЕМА + ИКА  заведомо меньше  99 + 999 + 899 < 2000).  Небольшой перебор показывает, что (даже если считать, что выражение может начинаться со знака плюс или минус) М тоже не может быть знаком.     Остается случай, когда плюс – это Е, а еще где-то стоит минус. Выражение  МАТ + МАТ – ИКА  заведомо меньше 2000, поэтому минус – это не И, а К. Выражение  МАТ + МАТИ – А  равно  МАТ·11 + (И – А),  поэтому  МАТ·11 = 2013  (другие числа, делящиеся на 11, далеки от 2014) – это приводит к единственному ответу.   2. 6 баллов. "
    ],
    "65111": [
        "https://www.problems.ru/view_problem_details_new.php?id=65111",
        "Математическая логика (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Автор: Подлипский О.К.За круглым столом сидят 2015 человек, каждый из них – либо рыцарь, либо лжец. Рыцари всегда говорят правду, лжецы всегда лгут. Им раздали по одной карточке, на каждой карточке написано по числу при этом все числа на карточках различны. Посмотрев на карточки соседей, каждый из сидящих за столом сказал:  \"Мое число больше, чем у каждого из двух моих соседей\". После этого k из сидящих сказали: \"Мое число меньше, чем у каждого из двух моих соседей\". При каком наибольшем k это могло случиться? ",
        "Решение:    Пусть A и B – люди, которым достались карточки с самым большим и самым маленьким числами, соответственно. Поскольку они оба сказали первую фразу, A – рыцарь, а B – лжец. Поэтому ни один из них не мог произнести вторую фразу. Следовательно,  k ≤ 2013.    Ситуация, когда оставшиеся 2013 человек смогут сказать вторую фразу, возможна. Пусть сидящим за столом достались (по часовой стрелке) карточки с числами 1, 2, 3, ..., 2015 при этом карточка с числом 2015 досталась рыцарю, а остальные – лжецам. Тогда первую фразу могут сказать все, а вторую –  все, кроме людей с карточками 1 и 2015.",
        "Ответ: При  k = 2013. ",
        "Замечания:  Существуют и другие примеры распределения карточек, при которых 2013 человек могут сказать вторую фразу."
    ],
    "66278": [
        "https://www.problems.ru/view_problem_details_new.php?id=66278",
        "Математическая логика (прочее)",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: Автор: Евдокимов М.А.Состоялся матч по футболу 10 на 10 игроков между командой лжецов (которые всегда лгут) и командой правдолюбов (которые всегда говорят правду). После матча каждого игрока спросили: \"Сколько голов ты забил?\" Некоторые участники матча ответили \"один\", Миша сказал \"два\", некоторые ответили \"три\", а остальные сказали \"пять\". Лжёт ли Миша, если правдолюбы победили со счётом  20 : 17? ",
        "Решение: Предположим, что Миша – правдолюб. Тогда девять из десяти игроков команды правдолюбов забили по нечётному количеству голов (один, три или пять), а Миша – чётное. Но тогда команда правдолюбов забила нечётное число голов, что противоречит условию. Следовательно, наше предположение неверно и Миша – лжец. ",
        "Ответ: Лжёт. "
    ],
    "97999": [
        "https://www.problems.ru/view_problem_details_new.php?id=97999",
        "Ребусы",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Автор: Гусаров М.Какую цифру надо поставить вместо знака \"?\" в числе 888...88?99...999 (восьмёрка и девятка написаны по 50 раз), чтобы оно делилось на 7? ",
        "Решение: Заметим, что число 111111 делится на 7, поэтому можно спереди отбросить 48 восьмерок, а сзади – 48 девяток. Таким образом, задача свелась к такой же для числа 88?99. Вычитая еще кратное 7 число 84049, получим, что на 7 должно делиться число 4?5. Наконец, вычитая 399, получим, что ?6 кратно 7. Отсюда  ? = 5.  ",
        "Ответ: 5. ",
        "Замечания:  3 балла "
    ],
    "107853": [
        "https://www.problems.ru/view_problem_details_new.php?id=107853",
        "Математическая логика (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Автор: Френкин Б.Р.Путешественник посетил деревню, в котором каждый человек либо всегда говорит правду, либо всегда лжёт.  Жители деревни стали в круг, и каждый сказал путешественнику про соседа справа, правдив ли он. На основании этих сообщений путешественник смог однозначно определить, какую долю от всех жителей деревни составляют лжецы. Определите и вы, чему она равна. ",
        "Решение: Пусть x – доля лжецов. Представим себе, что все правдивые жители стали лжецами, а все лжецы \"исправились\". Тогда путешественник услышит то же самое! Действительно, правдивость любого жителя изменилась, но изменилась и правдивость соседа, о котором он говорит. Но доля правдивых в этом круге равна  1 – x.  Таким образом, путешественник не может отличить круг с долей лжецов x от круга с долей лжецов  1 – x.  Значит, он мог определить долю лжецов только при  x = 1 – x.  Но это значит, что  x = ½.  ",
        "Ответ: 50%. ",
        "Замечания:  1. Нетрудно понять, что при любой доле лжецов и любом порядке расположения жителей в круге, путешественник сможет разделить жителей на две группы: лжецов и правдивых, но, разумеется, не может определить, какая из этих групп состоит из лжецов. 2. 4 балла. "
    ],
    "35338": [
        "https://www.problems.ru/view_problem_details_new.php?id=35338",
        "Математическая логика (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: При построении восемь мальчиков разместились так, что    1) А был впереди Б и В 2) Б - впереди К через одного    3) Л впереди А, но после Д 4)В - после Е через одного    5) Д - между Б и Г  6) Е - рядом с К, но впереди В.    В каком порядке выстроились мальчики?",
        "Подсказка: Пробуйте удовлетворить все условия задачи",
        "Решение: Из условия задачи 3 следует, что в строю мальчики стояли в следующем    порядке: сначала Д, потом Л, а за ним А.    Из условий 1 и 2 следует, что Б стоял после А, а за Б через одного    стоит К.    Из условия 5 следует, что Г впереди Д, так как Б стоит за А и,    следовательно, за Д.    И наконец, из условия 6 следует, что Е стоит рядом с К, причем слева    от К. Если бы Е стоял справа от К, то он был бы впереди В (как и    требует условие 6), но при этом нарушилось бы условие 4 (В стоял бы    после Е, но не через одного, а рядом с ним).    Таким образом, мальчики выстроились в следующем порядке:Г,Д,Л,А,Б,Е,К,В. "
    ],
    "66373": [
        "https://www.problems.ru/view_problem_details_new.php?id=66373",
        "Ребусы",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В следующих многозначных числах цифры заменены буквами (одинаковые цифры – одинаковыми буквами, а разные цифры – разными буквами). Оказалось, что ДЕВЯНОСТО делится на 90, а ДЕВЯТКА делится на 9. Может ли СОТКА делиться на 9?",
        "Решение: Так как ДЕВЯНОСТО делится на 90, то О = 0, тогда сумма Д + Е + В + Я + (Н + С) + Т делится на 9. Так как ДЕВЯТКА делится на 9, то и сумма Д + Е + В + Я + Т + (К + А) делится на 9. Заметим, что всего в этих двух суммах присутствует девять различных букв, значит, в них использованы все цифры от 1 до 9. Сумма всех цифр от 1 до 9 равна 45, значит, Д + Е + В + Я + Т + (К + А) + (Н + С) = 45, что также делится на 9. Следовательно, К + А делится на 9 и Н + С делится на 9. Предположим, что СОТКА делится на 9, то есть на 9 делится сумма С + Т + К + А. Так как К + А делится на 9, то С + Т делится на 9. Тогда, учитывая, что Н + С делится на 9, получим: (Н + С) – (С + Т) = Н – Т делится на 9. А это возможно только в случае, когда Н = Т. Противоречие, из которого следует, что предположение неверно, то есть СОТКА на 9 не делится. ",
        "Ответ: Не может."
    ],
    "66401": [
        "https://www.problems.ru/view_problem_details_new.php?id=66401",
        "Математическая логика (прочее)",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Автор: Пешнин А.В какое наименьшее количество цветов можно покрасить натуральные числа так, чтобы любые два числа, отличающиеся на 2 или в два раза, были покрашены в разные цвета?",
        "Решение: Пример. Будем последовательно красить натуральные числа по возрастанию. 1 и 2 покрасим двумя разными цветами. Для цвета каждого числа k > 2 есть не более двух ограничений: оно не может быть одного цвета ни с числом k/2, ни с числом k – 2. Поэтому для любого такого k обязательно найдется третий цвет.  Оценка. Рассмотрим числа 4, 6 и 8. Любые два из них должны быть покрашены в разные цвета, поэтому цветов не может быть меньше трех. Комментарий.Пример раскраски в три цвета можно построить и по-другому. Покрасим все числа в два цвета с соблюдением только первого условия. Например, все числа, дающие остаток 0 или 1 при делении на 4 – в красный цвет, а остальные числа – в синий цвет. Теперь надо добиться выполнения первого условия. Для этого перекрасим в фиолетовый цвет все числа, в разложение на простые множители которых число 2 входит в нечетной степени. Тогда первое условие, очевидно, не нарушится, а второе также будет выполнено, поскольку числа, различающиеся в два раза, имеют в разложении на простые множители разную четность показателя степени двойки. ",
        "Ответ: В три цвета."
    ],
    "88065": [
        "https://www.problems.ru/view_problem_details_new.php?id=88065",
        "Математическая логика (прочее)",
        "Сложность: 2",
        "Классы: 5,6,7,8",
        "Условие:  Однажды на лестнице была найдена странная тетрадь. В ней было записано сто утверждений:  \"В этой тетради ровно одно неверное утверждение\"  \"В этой тетради ровно два неверных утверждения\"  \"В этой тетради ровно три неверных утверждения\" ...  \"В этой тетради ровно сто неверных утверждений\". Есть ли среди этих утверждений верные, и если да, то какие?       ",
        "Подсказка:       Заметьте, в тетради написано сто утверждений, каждые дваиз которых противоречат друг другу.      ",
        "Решение:       То, что в тетради записано 100 утверждений, каждые дваиз которых противоречат друг другу, означает, что если среди них и естьверные утверждения, то их не может быть более одного. Посмотрим,может ли здесь быть хотя бы одно верное утверждение. Если верно ровноодно утверждение, то ровно девяносто девять неверных. А такоеутверждение в тетради есть: \"В этой тетради ровно девяносто девятьневерных утверждений\". Итак, в тетради записано ровно одно верноеутверждение.      ",
        "Ответ:        Одно верное утверждение: \"В этой тетрадировно девяносто девять неверных утверждений\".      "
    ],
    "88220": [
        "https://www.problems.ru/view_problem_details_new.php?id=88220",
        "Математическая логика (прочее)",
        "Сложность: 2",
        "Классы: 5,6,7,8",
        "Условие:  Мастерспорта Седов, кандидат в мастера Чернов и перворазрядник Рыжоввстретились в клубе перед тренировкой.-- Обратите внимание, — заметил черноволосый, — один из нас седой,другой — рыжий, третий — черноволосый. Но ни у одного из нас цветволос не совпадает с фамилией. Забавно, не правда ли?-- Ты прав, — подтвердил мастер спорта.Какого цвета волосы у кандидата в мастера?      ",
        "Подсказка:       Вспомните задачи 71, 132, 144.      ",
        "Решение:       Черноволосым был не мастер (так как мастер подтвердил егослова). Это значит, что черноволосый — Рыжов. Седов тогда может бытьтолько рыжим, а кандидат в мастера Чернов — седым.      ",
        "Ответ:        Седые.      "
    ],
    "88331": [
        "https://www.problems.ru/view_problem_details_new.php?id=88331",
        "Ребусы",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Замените буквы в слове ТРАНСПОРТИРОВКА цифрами (разным буквам соответствуют разные цифры, а одинаковым одинаковые) так, чтобы выполнялось неравенство  Т > Р > А > Н < С < П < О < Р < Т > И > Р > О < В < К < А. ",
        "Решение: Использованы десять букв и, следовательно, все цифры. Ясно, что самая большая из цифр – Т, значит,  Т = 9.  Убрав из неравенств Т, видим, что наибольшая из оставшихся цифр – И. И так далее. ",
        "Ответ: 9 > 7 > 6 > 0 < 1 < 2 < 3 < 7 < 9 > 8 > 7 > 3 < 4 < 5 < 6. "
    ],
    "103848": [
        "https://www.problems.ru/view_problem_details_new.php?id=103848",
        "Ребусы",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: Автор: Митягин А.Ю.В записи *1*2*4*8*16*32*64 = 27 вместо знаков ''*'' поставьте знаки ''+'' или ''-'' так, чтобы равенство стало верным.",
        "Подсказка: Найти требуемое расположение знаков легко, если расставлять знаки справа налево.Попробуйте сами доказать, чтоа) при любой расстановке знаков в левой части равенства получается нечётное числоб) выбором знаков можно получить любое нечётное число между числами -128 и128, причём единственным способом.",
        "Решение: Будем заменять звёздочки справа налево.  Так как 1 + 2 + 4 + 8 + 16 + 32 = 63 < 64,то перед 64 должен стоять ''+'' (иначе результат будет отрицательным).Получаем 1*2*4*8*16*32 + 64 = 27. Перед 32 должен стоять ''-'', иначе слева будетслишком большое число, даже если остальные звёздочки заменить на ''-''.Продолжая аналогично, получим+1 - 2 + 4 + 8 - 16 - 32 + 64 = 27.",
        "Ответ: Знаки можно расставить следующим образом: +1 - 2 + 4 + 8 - 16 - 32 + 64 = 27."
    ],
    "103858": [
        "https://www.problems.ru/view_problem_details_new.php?id=103858",
        "Ребусы",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: Автор: Блинков А.Д.Решите ребус:  АХtimeУХ = 2001. ",
        "Решение: 2001 = 3·23·29.  Поэтому число 2001 можно представить в виде произведения двузначных чисел лишь следующими способами:  69·29  или  23·87.  Подходит только первый вариант.  ",
        "Ответ: 29·69 = 69·29 = 2001."
    ],
    "115707": [
        "https://www.problems.ru/view_problem_details_new.php?id=115707",
        "Ребусы",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Можно ли заменить буквы цифрами в ребусе ШЕ· СТЬ + 1=СЕ· МЬтак, чтобы получилось верное равенство (разные буквы нужно заменять разными цифрами, одинаковые буквы — одинаковыми цифрами)?",
        "Решение: И число   ШЕ· СТЬ , и число   СЕ· МЬ  оканчиваются на одну и ту же цифру — последнюю цифру числа   Е· Ь . Поэтому левая и правая части равенства оканчиваются на разные цифры и не могут быть равны.",
        "Ответ: нет."
    ],
    "32790": [
        "https://www.problems.ru/view_problem_details_new.php?id=32790",
        "Математическая логика (прочее)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Известно, что среди членов правительства Лимонии (а всего внем 20 членов) заведомо имеется хотя бы один честный, а также что из любыхдвух хотя бы один -- взяточник. Сколько в правительстве взяточников?",
        "Решение: Заметим, что в правительстве Лимонии ровно один честный чиновник. Действительно, по условию один честный там есть но двух честных там быть не может - тогда из них не было бы ни одного взяточника, что противоречит условию. Значит, честный в правительстве ровно один, следовательно, взяточников - 19.",
        "Ответ: В правительстве 19 взяточников."
    ],
    "64533": [
        "https://www.problems.ru/view_problem_details_new.php?id=64533",
        "Ребусы",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: В записи   * + * + * + * + * + * + * + * = **  замените звёздочки различными цифрами так, чтобы равенство было верным.",
        "Ответ: 1 + 2 + 4 + 5 + 7 + 8 + 9 + 0 = 36. ",
        "Замечания:  Приведённый пример единственен с точностью до порядка слагаемых в левой части равенства. Действительно, пусть в правой части стоит число  a.  Так как сумма десяти различных цифр равна 45, то данное равенство можно записать в виде  45 – a –  = 10a + ,  то есть  11a + 2 = 45.  Так как  2 ≤ 18,  то единственный вариант  a = 3,   = 6."
    ],
    "86508": [
        "https://www.problems.ru/view_problem_details_new.php?id=86508",
        "Математическая логика (прочее)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Решая задачу:  \"Какое значение принимает выражение  x2000 + x1999 + x1998 + 1000x1000 + 1000x999 + 1000x998 + 2000x³ + 2000x² + 2000x + 3000  (x – действительное число), если  x² + x + 1 = 0?\",  Вася получил ответ 3000. Прав ли Вася? ",
        "Решение: Так как трёхчлен  x² + x + 1  не имеет действительных корней, то из того, что некоторое число является его корнем (ложное утверждение), следует все, что угодно, в том числе и то, что данное выражение равно 3000. ",
        "Ответ: Прав. "
    ],
    "88325": [
        "https://www.problems.ru/view_problem_details_new.php?id=88325",
        "Математическая логика (прочее)",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: В забеге шести спортсменов Андрей отстал от Бориса и еще от двух спортсменов. Виктор финишировал после Дмитрия, но ранее Геннадия. Дмитрий опередил Бориса, но все же пришел после Евгения. Какое место занял каждый спортсмен? ",
        "Решение:    Перенумеруем условия.       1) Андрей отстал от Бориса и еще от двух спортсменов.      2) Виктор финишировал после Дмитрия, но ранее Геннадия.       3) Дмитрий опередил Бориса, но все же пришёл после Евгения.    Из 1) следует, что Андрей занял четвёртое место, а Борис – одно из первых трёх. Из 3) следует, что Дмитрий финишировал впереди Бориса, но позже Евгения. Итак, первая четвёрка определена: Евгений, Дмитрий, Борис, Андрей.    Из 2) следует, что Виктор был впереди Геннадия.",
        "Ответ: Спортсмены пришли к финишу в следующем порядке: Евгений, Дмитрий, Борис, Андрей, Виктор, Геннадий. "
    ],
    "98403": [
        "https://www.problems.ru/view_problem_details_new.php?id=98403",
        "Математическая логика (прочее)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Автор: Шаповалов А.В.12 кандидатов в мэры рассказывали о себе. Через некоторое время один сказал: \"До меня соврали один раз\". Другой сказал: \"А теперь – дважды\". – \"А теперь – трижды\", – сказал третий, и так далее до 12-го, который сказал: \"А теперь соврали 12 раз\". Тут ведущий прервал дискуссию. Оказалось, что по крайней мере один кандидат правильно подсчитал, сколько раз соврали до него. Так сколько же раз всего соврали кандидаты? ",
        "Решение: Пусть последним сказавшим правду был k-й кандидат. Тогда до него солгали k раз, а после него –  12 – k  раз. ",
        "Ответ: 12 раз. ",
        "Замечания:  1. Нетрудно убедиться в том, что прав был ровно один кандидат, причём именно первый. 4 балла. "
    ],
    "115492": [
        "https://www.problems.ru/view_problem_details_new.php?id=115492",
        "Ребусы",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Автор: Хачатурян А.В.КУБ является кубом. Докажите, что ШАР кубом неявляется. (КУБ и ШАР  трёхзначные числа, разные буквы обозначаютразличные цифры.)",
        "Решение: Рассмотрим все кубы, являющиеся трёхзначными числами. Это 53=125 ,  63=216 ,  73=343 ,  83=512 ,  93=729  (других нет, так как 43=64<100 , а  103=1000>999 ). Так как разные буквы обозначаютразные цифры, ни одно из чисел КУБ и ШАР не равно 343. Но во всехоставшихся кубах есть общая цифра 2, а в числах КУБ и ШАР общих цифрнет."
    ],
    "35676": [
        "https://www.problems.ru/view_problem_details_new.php?id=35676",
        "Математическая логика (прочее)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Пусть x - некоторое натуральное число.  Среди утверждений:   2x больше 70 x меньше 100 3x больше 25  x не меньше 10  x больше 5   три верных и два  неверных. Чему равно x? ",
        "Подсказка: Упростите первое и третье утверждение проведите разбор случаев.",
        "Решение: Первое утверждение эквивалентно тому, что x > 35,  а третье утверждение эквивалентно тому, что x > 8,  поскольку x - натуральное число.  Первое утверждение неверно, так как если бы оно было верно,  то были бы верны также третье, четвертое и пятое утверждения,  т.е. бы хотя бы 4 верных утверждения. Поэтому x не превосходит  35.   Отсюда следует, что второе утверждение верно. Но тогда неверно четвертое  утверждение (иначе были бы верны третье и пятое утверждения,  и снова мы получили бы по крайней мере 4 верных утверждения).    Отсюда вывод: утверждения 3 и 5 - верные. А из неверности  четвертого утверждения и верности третьего утверждения  сразу следует, что x=9. ",
        "Ответ: 9.00"
    ],
    "35648": [
        "https://www.problems.ru/view_problem_details_new.php?id=35648",
        "Парадоксы",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: У деда Мороза бесконечное число конфет.  За минуту до Нового года дед Мороз дает детям 100 конфет, а  Снегурочка одну конфету отбирает. За полминуты  до наступления Нового года дед Мороз дает детям еще 100 конфет, а  Снегурочка снова одну конфету отбирает.  То же самое повторяется за 15 секунд, за 7,5 секунд и т.д.  до Нового года. Докажите, что Снегурочка сможет к Новому году  отобрать у детей все конфеты.",
        "Подсказка: Занумеруйте конфеты. Пусть в первый раз Снегурочка отбирает  конфету с номером 1, второй раз - конфету с номером 2 и т.д.",
        "Решение: Занумеруем конфеты натуральными числами 1, 2, ... так, что в первый  раз дед Мороз раздает конфеты с номерами от 1 до 100, во второй раз -  конфеты с номерами от 101 до 200 и т.д.  Пусть в первый раз Снегурочка отбирает у детей  конфету с номером 1, второй раз - конфету с номером 2 и т.д.  Тогда для любого   конфета с номером  окажется у Снегурочки за 1/2-1  минут до наступления Нового года."
    ],
    "109476": [
        "https://www.problems.ru/view_problem_details_new.php?id=109476",
        "Математическая логика (прочее)",
        "Сложность: 2+",
        "Классы: 6,7,8,9",
        "Условие: Маша считает, что два арбуза тяжелее трёх дынь, Аня считает, что три арбуза тяжелее четырёх дынь. Известно, что одна из девочек права, а другая ошибается.  Верно ли, что 12 арбузов тяжелее 18 дынь? (Считается, что все арбузы весят одинаково и все дыни весят одинаково.) ",
        "Решение: Машино высказывание равносильно тому, что шесть арбузов тяжелее девяти дынь.  Анино – тому, что шесть арбузов тяжелее восьми дынь. Поэтому если права Маша, то права и Аня. Но обе они правы быть не могут. Значит, Аня права, а Маша ошибается. То есть шесть арбузов тяжелее восьми дынь, но не тяжелее девяти.  Следовательно, двенадцать арбузов тяжелее шестнадцати дынь, но не тяжелее восемнадцати. ",
        "Ответ: Неверно. "
    ],
    "32104": [
        "https://www.problems.ru/view_problem_details_new.php?id=32104",
        "Математическая логика (прочее)",
        "Сложность: 2+",
        "Классы: 5,6,7,8",
        "Условие: Один из пяти братьев испек маме пирог. Андрей сказал: \"Это Витя или Толя\". Витя сказал: \"Это сделал не я и не Юра\". Толя сказал: \"Вы оба шутите\". Дима сказал: \"Нет, один из них сказал правду, а другой — нет\". Юра сказал: \"Нет Дима, ты не прав\". Мама знает, что трое из ее сыновей всегда говорят правду.Кто испек пирог? ",
        "Решение: Рассмотрим отдельно три возможных случая.1) Андрей и Витя оба лгут. Это значит, что Толя говорит правду, Дима лжет, Юра говорит правду.2) Один из ребят (Андрей или Витя) говорит правду, а второй лжет. В этом случае Толя лжет, Дима говорит правду, Юра лжет.3) Андрей и Витя оба говорят правду. Тогда Толя и Дима лгут, Юра говорит правду.Лишь в третьем случае правду говорят трое из братьев. Значит, только этот случай мог иметь место. Поскольку Андрей говорит правду, то пирог испек либо Витя, либо Толя. Однако Витя (а он, как мы выяснили, тоже говорит правду) отрицает, что он это сделал. Значит, пирог испек Толя. При этом Андрей, Витя и Юра сказали правду. ",
        "Замечания:  Источник решения: книга \"В.О.Бугаенко. Турниры им. Ломоносова.  Конкурсы по математике. МЦНМО-ЧеРо. 1998\"."
    ],
    "88327": [
        "https://www.problems.ru/view_problem_details_new.php?id=88327",
        "Математическая логика (прочее)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Познакомимся с тремя людьми: Алешиным, Беляевым и Белкиным. Один из них – архитектор, другой – бухгалтер, третий – археолог. Один живет в Белгороде, другой – в Брянске, третий в Астрахани. Требуется узнать, кто где живет и у кого какая профессия.    1) Белкин бывает в Белгороде лишь наездами и то весьма редко, хотя все его родственники постоянно живут в этом городе.    2) У двух из этих людей названия профессий и городов, в которых они живут, начинаются с той же буквы, что и их фамилии.    3) Жена архитектора доводится Белкину младшей сестрой. ",
        "Решение: Из 1) и 3) следует, что архитектор — родственник Белкина живет в Белгороде, а из 2) тогда следует, что археолог живет в городе на букву А, т.е. в Астрахани, и фамилия его начинается с буквы А, т.е. он Алешин. Можно сделать вывод, что архитектор Беляев живет в Белгороде.",
        "Ответ: Белкин — бухгалтер из Брянска, Беляев — архитектор из Белгорода, Алёшин — археолог из Астрахани."
    ],
    "32832": [
        "https://www.problems.ru/view_problem_details_new.php?id=32832",
        "Математическая логика (прочее)",
        "Сложность: 3-",
        "Классы: 7,8,9",
        "Условие: В Трансильвании живут беспартийные (которые всегда говорят правду) и члены одной единственной партии (которые всегда лгут). Кроме того, половина трансильванцев не в своем уме, и считает все истинные утверждения ложными и наоборот. Как с помощью одного вопроса (допускающего ответ \"да-нет\") выяснить,  а) в своем ли уме ваш собеседник из Трансильвании  б) является ли он членом партии? ",
        "Ответ: а) Ты член партии?  б) Ты в своем уме?"
    ],
    "104879": [
        "https://www.problems.ru/view_problem_details_new.php?id=104879",
        "Математическая логика (прочее)",
        "Сложность: 3-",
        "Классы: 6,7,8",
        "Условие:  В комнате 12 человек некоторые из них честные, то есть всегда говорят правду,остальные всегда лгут. \"Здесь нет ни одного честного человека\", -  сказал первый. \"Здесь не более одногочестного человека\", -  сказал второй. Третий сказал, что честных не более двух, четвёртый -  что не более трёх,и так далее до двенадцатого, который сказал, что честных людей не более одиннадцати. Сколько честных людейв комнате на самом деле?",
        "Решение:  Заметим, что если кто-то из присутствующих солгал, то и все предыдущие солгали.Такие в комнате есть, иначе первый сказал правду, а по его словам, честных в комнате нет. По аналогичной причинев комнате обязательно есть и честные.Пусть в комнате x лжецов. Последний лжец сказал, что в комнате не более (x - 1) честного.Значит, на самом деле в комнате не менее x честных. Далее, (x + 1)-й человек уже сказал правдупро то, что в комнате не более x честных. Значит, количество честных в точности равно x,то есть количеству лжецов. Следовательно, в комнате 6 честных человек.",
        "Ответ:   6 человек."
    ],
    "111236": [
        "https://www.problems.ru/view_problem_details_new.php?id=111236",
        "Математическая логика (прочее)",
        "Сложность: 3-",
        "Классы: 6,7,8",
        "Условие: В городе живут рыцари и лжецы. Рыцари всегда говорят правду, а лжецы всегда лгут. Рыцари носят с собой шпагу, а лжецы– нет. Собрались вместе два рыцаря и два лжеца и посмотрели друг на друга. Кто из них мог сказать фразу:1) \"Cреди нас все рыцари\".2) \"Среди вас есть ровно один рыцарь\".3) \"Среди вас есть ровно два рыцаря\" ?Для каждой фразы укажите всех, кто мог ее сказать, и объясните. ",
        "Решение: 1) Рыцарь это сказать не мог, поскольку это неправда, значит  эту фразу мог сказать любой из лжецов.2) Мог сказать любой рыцарь, так как для него это верно. Мог сказать любой лжец, так как для него это неправда. 3) Эту фразу не мог сказать никто, поскольку для любого рыцаря это высказывание неверно, а для любого лжеца– верно. "
    ],
    "35081": [
        "https://www.problems.ru/view_problem_details_new.php?id=35081",
        "Математическая логика (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Двум гениям сообщили по натуральному числу и сказали, что эти числа отличаются на 1. После этого они по очереди задают друг другу один и тот же вопрос: \"Знаешь ли ты мое число?\". Докажите, что рано или поздно один из них ответит положительно. ",
        "Подсказка: Если одному из гениев сообщили число 1, то он знает, что второму сообщили число 2.",
        "Решение:    Если число одного из гениев равно m, то он знает, что число другого гения равно либо  m + 1,  либо  m – 1  ему остаётся определить только то, какая из этих двух возможностей имеет место. Когда гений A отвечает на вопрос \"Знаешь ли ты моё число?\" в первый раз, он может ответить положительно только если его число равно 1 (в этом случае число второго однозначно равно 2). Если ответ был отрицательный, то второй гений B узнает, что  число A не равно 1 (хотя он это и так знает, если его число больше 2!). Далее, если при втором задании вопроса B отвечает отрицательно, то A узнает, что число B не равно 1 и 2 (если число B равно 2, он наверняка знал бы, что число A равно 3, поскольку после первого вопроса он знает, что оно не равно 1).     Пусть перед очередным вопросом одного из гениев (для определенности, A) обоим гениям известно, что число A не равно 1, 2, ..., k, а число B не равно  1, 2, ..., k – 1.  Если B ответил отрицательно, то его число не равно k (иначе он бы знал, что число A равно k + 1, также его число не равно  k + 1  (иначе он бы знал, что число A равно  k + 2,  поскольку оно не может быть равно k). Итак, в случае отрицательного ответа B мы приходим к ситуации, аналогичной только что рассмотренной: перед вопросом B обоим гениям известно, что число B не равно  1, 2, ..., k + 1,  а число A не равно 1, 2, ..., k.     Далее при повторении отрицательных ответов каждый из гениев будет постепенно определять, что число другого гения не равно ни одному числу из начального отрезка натурального ряда. Так как числа гениев конечны, то процесс отрицательных ответов рано или поздно прекратится это означает, что один из гениев ответит на вопрос положительно. "
    ],
    "35502": [
        "https://www.problems.ru/view_problem_details_new.php?id=35502",
        "Математическая логика (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Одного из близнецов зовут Ваня, другого – Витя. Один из братьев всегда говорит правду, а другой всегда лжет. Можно задать один вопрос одному из братьев, на который тот ответит \"да\" или \"нет\". Выясните, кого из близнецов как зовут. ",
        "Подсказка: Для близнеца, которому мы задаём вопрос, имеется четыре возможности: он Ваня-лжец, Ваня-правдивец, Витя-лжец, либо Витя-правдивец. Попробуйте задать такой вопрос, положительный ответ на который означал бы, что выполнена одна из первых двух возможностей. ",
        "Решение: Зададим вопрос: \"Верно ли, что ты либо Ваня-правдивец, либо Витя-лжец?\". Легко проверить, что Ваня должен ответить \"да\", а Витя – \"нет\". "
    ],
    "60322": [
        "https://www.problems.ru/view_problem_details_new.php?id=60322",
        "Математическая логика (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Гениальные математики. а) Каждому из двух гениальных математиков сообщили по натуральному числу, причем им известно, что эти числа отличаются на единицу. Они поочередно спрашивают друг друга: \"Известно ли тебе мое число?\" Докажите, что рано или поздно кто-то из них ответит \"да\". Сколько вопросов они зададут друг другу? (Математики предполагаются правдивыми и бессмертными.) б) Как изменится число заданных вопросов, если с самого начала известно, что данные числа не превосходят 1000? "
    ],
    "64325": [
        "https://www.problems.ru/view_problem_details_new.php?id=64325",
        "Ребусы",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Имеет ли решение ребус  АПЕЛЬСИН – СПАНИЕЛЬ = 2012·2013?",
        "Решение 1: Числа АПЕЛЬСИН и СПАНИЕЛЬ состоят из одних и тех же цифр, значит, их разность делится на 9. Но 2012·2013 на 9 не делится. ",
        "Решение 2: 2012·2013 – семизначное число, начинающееся на 4. Но числа АПЕЛЬСИН и СПАНИЕЛЬ в седьмом разряде имеют одну и ту же цифру, поэтому у их разности в этом разряде может стоять только 0 или 9. ",
        "Ответ: Не имеет. "
    ],
    "64790": [
        "https://www.problems.ru/view_problem_details_new.php?id=64790",
        "Математическая логика (прочее)",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: По кругу стоят 12 детей. Мальчики всегда говорят правду мальчикам и врут девочкам, а девочки всегда говорят правду девочкам и врут мальчикам. Каждый из них сказал одну фразу своему соседу справа: \"Ты – мальчик\" или \"Ты – девочка\". Таких фраз оказалось поровну. Сколько мальчиков и сколько девочек стоит по кругу? ",
        "Решение: Из условия следует, что каждый мальчик произносил одну и ту же фразу: \"Ты – мальчик\". Действительно, если его сосед справа – мальчик, то он этой фразой говорил правду, а если это девочка, то он этой фразой лгал. Аналогичное рассуждение показывает, что каждая девочка говорила только фразу: \"Ты – девочка\". Так как этих фраз было произнесено поровну, то по кругу стоят 6 мальчиков и 6 девочек.",
        "Ответ: 6 мальчиков и 6 девочек. "
    ],
    "65661": [
        "https://www.problems.ru/view_problem_details_new.php?id=65661",
        "Математическая логика (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: На острове живут лжецы, которые всегда лгут, и рыцари, которые всегда говорят правду. Каждый из них сделал по два заявления: 1) \"Среди моих друзей – нечётное количество рыцарей\" 2) \"Среди моих друзей – чётное количество лжецов\". Чётно или нечётно количество жителей острова? ",
        "Решение:    Вне зависимости от того, кто произносит указанные две фразы, рыцарь или лжец, у этого жителя нечётное количество друзей. Действительно, обе фразы одновременно либо правдивы, либо ложны, поэтому и в том, и в другом случае, количество друзей – это сумма чётного и нечётного чисел.     Согласно задаче 87972 число вершин нечётной степени чётно. Следовательно, на острове – чётное количество жителей.",
        "Ответ: Чётно."
    ],
    "66419": [
        "https://www.problems.ru/view_problem_details_new.php?id=66419",
        "Математическая логика (прочее)",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Автор: ФольклорВ коробке лежат фрукты (не менее пяти). Если вытащить наугад три фрукта, то среди них обязательно найдется яблоко. Если вытащить наугад четыре фрукта, то среди них обязательно найдется груша. Какие фрукты могут быть вытащены и в каком количестве, если взять наугад пять фруктов?",
        "Решение: Из условия задачи следует, что в коробке не яблоками являются не более двух фруктов (иначе можно вытащить 3 фрукта, среди которых не будет яблок). Аналогично, не грушами являются не более трех фруктов (иначе  можно вытащить 4 фрукта, среди которых не будет груш). Таким образом, в коробке лежит ровно 5 фруктов: три яблока и две груши. Они все и будут вытащены. ",
        "Ответ: Три яблока и две груши. "
    ],
    "88328": [
        "https://www.problems.ru/view_problem_details_new.php?id=88328",
        "Математическая логика (прочее)",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Профессии членов семьи. В семье Семеновых 5 человек: муж, жена, их сын, сестра мужа и отец жены. Все они работают. Один — инженер, другой — юрист, третий — слесарь, четвертый — экономист, пятый — учитель. Вот что еще известно о них.  Юрист и учитель не кровные родственники.  Слесарь — хороший спортсмен.  Он пошел по стопам экономиста и играет в футбол за сборную завода.  Инженер старше жены своего брата, но моложе, чем учитель.  Экономист старше, чем слесарь. Назовите профессии каждого члена семьи Семеновых.",
        "Решение: Перепишем условие задачи, занумеровав данные. 1) Юрист и учитель не кровные родственники. 2) Слесарь — хороший спортсмен. 3) Он пошел по стопам экономиста и играет в футбол за сборную завода. 4) Инженер старше жены своего брата, но моложе, чем учитель. 5) Экономист старше, чем слесарь. Назовите профессии каждого члена семьи Семеновых. Слесарь мужского рода. Сестра старше брата 4), следовательно,  сын самый молодой, следовательно, он не экономист. СестраБрат-мужЖенаСынОтец женыИнженер+ 4)−−−−Юрист−   Слесарь−  − 2), 3) Экономист−− − 4), 5) Учитель−−−− 4)+ Самый старший учитель, следовательно, это отец жены, но тогда (из 3)) отец сына − экономист, тогда сын − слесарь.",
        "Ответ: Муж — юрист, жена — экономист, сын — слесарь, сестра мужа — инженер, отец жены — учитель."
    ],
    "98209": [
        "https://www.problems.ru/view_problem_details_new.php?id=98209",
        "Ребусы",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Автор: Ковальджи А.К.Ученик не заметил знака умножения между двумя трёхзначными числами и написал одно шестизначное число. Результат получился в три раза больше.  Найти эти числа. ",
        "Решение: Пусть A – первое трёхзначное число, B – второе. По условию  1000A + B = 3AB,  откуда  (3A – 1)B = 1000A.  Числа A и  3A – 1  взаимно просты, следовательно, 1000 делится на  3A – 1.  Но A – трёхзначное число, значит,  3A – 1  – трёхзначное или четырёхзначное. Таких делителей у 1000 два: 500 и 1000.  3A – 1  не может равняться 1000, так как 1001 не делится на 3. Итак,  3A – 1 = 500,  откуда  A = 167,  B = 334.  ",
        "Ответ: 167 и 334.",
        "Замечания:  3 балла. Ср. с задачами 107749, 107760. "
    ],
    "104011": [
        "https://www.problems.ru/view_problem_details_new.php?id=104011",
        "Математическая логика (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: На острове Вопростров люди задают друг другу вопросы, на которые можно ответить лишь \"да\" или \"нет\". При этом каждый из них относится ровно к одному из племён A или B. Люди из племени A задают только те вопросы, на которые правильный ответ \"да\", а из племени B - те вопросы, на который правильный ответ \"нет\". В одном доме жила семейная пара Итан и Вайолет Рассел. Когда инспектор Кругг подошёл к дому, на пороге его встретил хозяин со словами: \"Скажите, мы с Вайолет относимся к племени B?\". Инспектор подумал и дал правильный ответ. Какой?       "
    ],
    "108737": [
        "https://www.problems.ru/view_problem_details_new.php?id=108737",
        "Ребусы",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Решите задачу 3 для надписи A, BC, DEF, CGH, CBE, EKG.       ",
        "Решение: Аналогично предыдущей задаче, посмотрим на первые два числа. Первое число однозначное, а второе  двузначное. Следовательно, их разность меньше 100. Следовательно, цифра, стоящая в разряде сотен, каждый раз увеличивается не более, чем на 1, откуда D = 1, C = 2, E = 3. Получаем запись: A, B2, 13F, 2GH, 2B3, 3KG. Аналогично предыдущей задаче, 3d = 2B3 - B2 = 201, d = 67. Дальше легко восстановить запись: 5, 72, 139, 206, 273, 340.       ",
        "Ответ: 5, 72, 139, 206, 273, 340.      "
    ],
    "32794": [
        "https://www.problems.ru/view_problem_details_new.php?id=32794",
        "Математическая логика (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: (Продолжение задачи 32792) Путешественник, попавший в государство, встретил четырех людей из задачи 3 и задал им вопрос:\"Кто вы?\".   Он получил такие ответы: 1-ый: \"Все мы лжецы\". 2-ой: \"Среди нас 1 лжец\". 3-ий: \"Среди нас 2 лжеца\". 4-ый: \"Я ни разу не соврал и сейчас не вру\". Путешественник быстро сообразил, кем является четвертый житель. Как он это сделал? ",
        "Решение: Предположим, что четвертый житель - лжец. Заметим, что первый житель - тоже лжец, так как иначе он будет противоречить собственным словам. Значит, лжецов среди них не меньше двух, следовательно, второй житель - тоже лжец но тогда и третий житель - лжец, то есть первый житель сказал правду, но он, как мы уже решили, лжец, - противоречие. Значит, четвертый житель - рыцарь."
    ],
    "64427": [
        "https://www.problems.ru/view_problem_details_new.php?id=64427",
        "Математическая логика (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: На острове 100 рыцарей и 100 лжецов. У каждого из них есть хотя бы один друг. Однажды ровно 100 человек сказали: \"Все мои друзья – рыцари\", и ровно 100 человек сказали: \"Все мои друзья – лжецы\". Каково наименьшее возможное количество пар друзей, один из которых рыцарь, а другой лжец?",
        "Решение:    Рассмотрим какого-нибудь жителя А острова, утверждающего: \"Все мои друзья – лжецы\". Если А – рыцарь, то его друг – лжец. Если А – лжец, то его друг – рыцарь. В любом случае А входит в пару друзей \"разного\" сорта. Так как такое высказывание сделали 100 человек, то количество таких пар не может быть меньше, чем  100 : 2 = 50.     Пример: пусть 50 рыцарей дружат между собой, 50 лжецов дружат между собой, и есть 50 пар друзей вида \"рыцарь – лжец\", причём других друзей у жителей из этих пар нет. Тогда каждыйиз первых двух групп вправе сказать: \"Все мои друзья – рыцари\", а каждый из третьей группы: \"Все мои друзья – лжецы\".",
        "Ответ: 50 пар. "
    ],
    "65637": [
        "https://www.problems.ru/view_problem_details_new.php?id=65637",
        "Ребусы",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: Автор: Акопян Э.Мальвина записала равенство  МА·ТЕ·МА·ТИ·КА = 2016000  и предложила Буратино заменить одинаковые буквы одинаковыми цифрами, разные буквы – разными цифрами, чтобы равенство стало верным. Есть ли у Буратино шанс выполнить задание? ",
        "Подсказка: 2016000 = 28·3²·5³·7. ",
        "Решение: Например:  10·24·10·28·30 = 2016000  или  10·28·10·24·30 = 2016000. ",
        "Ответ: Есть."
    ],
    "65902": [
        "https://www.problems.ru/view_problem_details_new.php?id=65902",
        "Математическая логика (прочее)",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: В классе учатся 30 человек: отличники, троечники и двоечники. Отличники на все вопросы отвечают правильно, двоечники всегда ошибаются, а троечники на заданные им вопросы строго по очереди то отвечают верно, то ошибаются. Всем ученикам было задано по три вопроса: \"Ты отличник?\", \"Ты троечник?\", \"Ты двоечник?\". Ответили \"Да\" на первый вопрос – 19 учащихся, на второй – 12, на третий – 9. Сколько троечников учится в этом классе? ",
        "Решение:    Пусть a – количество отличников,  – количество двоечников, c – количество троечников, которые ошиблись в ответе на первый вопрос, правильно ответили на второй и ошиблись в ответе на третий.     По условию  a +  + c = 19,   + c = 12,  c = 9.  Отсюда   = 3,  a = 7.  Значит, троечников  30 – 7 – 3 = 20.  ",
        "Ответ: 20 троечников. "
    ],
    "66172": [
        "https://www.problems.ru/view_problem_details_new.php?id=66172",
        "Математическая логика (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9,10",
        "Условие: Авторы: Гервер М.Л., Гинзбург Б.Д.Известно, что вруны всегда врут, правдивые всегда говорят правду, а хитрецы могут и врать, и говорить правду. Вы можете задавать вопросы, на которые есть ответ \"да\" или \"нет\" (например: \"верно ли, что этот человек –  хитрец?\").     a) Перед вами трое –  врун, правдивый и хитрец, которые знают, кто из них кто. Как и вам это узнать?     б) Перед вами четверо – врун, правдивый и два хитреца (все четверо знают, кто из них кто). Докажите, что хитрецы могут договориться отвечать так, что вы, спрашивая этих четверых, ни про кого из них не узнаете наверняка, кто он. ",
        "Решение:    a) Зададим каждому вопрос, ответ на который нам известен (например, \"Верно ли, что сегодня четверг?\"). Пусть получен только один правдивый ответ. Тогда давший его – правдивый. Спросив его про одного из двух других \"Верно ли, что он хитрец?\", мы все узнаем.     Если на первые три вопроса получен ровно один ложный ответ, то давший его – лжец, и четвёртый вопрос надо задать ему.    б) Обозначим участников: врун – В, правдивый – П, хитрецы – ХВ и ХП. Поставим их лицом друг против друга, так что ХП как бы служит отражением П, а ХВ – отражением В, и наоборот. Пусть хитрецы договорятся отвечать так, как будто вопрос адресован их отражению, и все упомянутые в вопросе лица тоже заменены на их отражения. Тогда невозможно отличить, кто стоит \"перед зеркалом\", а кто \"за зеркалом\" – ответы отражений всегда совпадают. ",
        "Замечания:  1. Баллы – 1 + 3.2. Задача также опубликована в Задачнике \"Кванта\" (\"Квант\", 2007, №1, задача М2028)."
    ],
    "87938": [
        "https://www.problems.ru/view_problem_details_new.php?id=87938",
        "Математическая логика (прочее)",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие:  В дремучем Муромском лесу из-под земли бьют десятьисточников мёртвой воды: от N 1 до N 10. Из первых девяти источниковмёртвую воду может взять каждый, но источник N 10 находится в пещереКощея, в которую никто, кроме самого Кощея, попасть не может.На вкус и цвет мёртвая вода ничем не отличается от обыкновенной, однако,если человек выпьет из какого-нибудь источника, он умрёт. Спастиего может только одно: если он запьёт ядом из источника, номер которогобольше. Например, если он выпьет из седьмого источника, то ему надообязательно запить ядом N 8, N 9 или N 10. Если он выпьет не седьмойяд, а девятый, ему может помочь только яд N 10. А если он сразу выпьетдесятый яд, то ему уже ничто не поможет.Иванушка-дурачок вызвал Кощея на дуэль. Условия дуэли были такие:каждый приносит с собой кружку с жидкостью и даёт её выпить своемупротивнику. Кощей обрадовался: \"Ура! Я дам яд N 10, и Иванушка-дурачок не сможет спастись! А сам выпью яд, который Иванушка-дурачок мне принесёт, запью его своим десятым и спасусь!\"В назначенный день оба противника встретились в условленном месте. Оничестно обменялись кружками и выпили то, что в них было. Каковы же былирадость и удивление обитателей Муромского леса, когда оказалось, чтоКощей умер, а Иванушка-дурачок остался жив!Только Василиса Премудрая догадалась, как удалось Иванушке победитьКощея. Попробуйте догадаться и вы.      ",
        "Решение: Иванушка, даром что дурачок, подготовился к дуэли: выпил заранее из первого источника  (можно было и из любого другого, кроме десятого).  И поэтому яд из Кощеева источника N 10 подействовал на него как противоядие, а не как яд. Кощею же Иванушка дал обыкновенную воду.  После этого Кощей пришел в свою пещеру, выпил яду из источника N 10  и отравился."
    ],
    "88184": [
        "https://www.problems.ru/view_problem_details_new.php?id=88184",
        "Математическая логика (прочее)",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие:  Ковбоя Джоприговорили к смертной казни на электрическом стуле. Ему известно, чтоиз двух электрических стульев, стоящих в специальной камере, одиннеисправен. Кроме того, Джо известно, что если он сядет на этотнеисправный стул, казнь не повторится и он будет помилован. Ему известнотакже, что стражник, охраняющий стулья, через день на все вопросыотвечает правду, а через день — ложь.Приговорённому разрешается задать стражнику ровно один вопрос, после чегонадо выбрать, на какой электрический стул садиться. Какой вопрос Джо можетзадать стражнику, чтобы наверняка выяснить, какой стул неисправен?      ",
        "Подсказка:       Вспомните задачи 140,148, 149.      ",
        "Решение:       Джо может, например, спросить: \"Что бы Вы мне ответили вчерана вопрос, какой стул неисправен?\" И независимо от того, говорит лисегодня стражник правду или ложь, ответ на это вопрос всегда будетневерным.Интересно, что, если Джо в этом вопросе вместо слова \"вчера\"использует \"позавчера\", т.е. спросит: \"Что бы Вы мне ответилипозавчера на вопрос, какой стул неисправен?\", ответ всегда будетправдивым, независимо от того, говорит ли стражник правду сегодня илиговорил её вчера.      ",
        "Ответ:        \"Что быВы мне ответили вчерана вопрос, какой стул неисправен?\"      "
    ],
    "98581": [
        "https://www.problems.ru/view_problem_details_new.php?id=98581",
        "Математическая логика (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Автор: Кириенко Д.Саша и Маша загадали по натуральному числу и сообщили их Васе. Вася написал на одном листе бумаги сумму загаданных чисел, а на другом – их произведение, после чего один из листов спрятал, а другой (на нём оказалось написано число 2002) показал Саше и Маше. Увидев это число, Саша сказал, что не знает, какое число загадала Маша. Услышав это, Маша сказала, что не знает, какое число загадал Саша. Какое число загадала Маша?  ",
        "Решение: Оба загадали делители числа 2002 (иначе кто-то понял бы, что 2002 – сумма загаданных чисел, и определил бы второе число). Однако, даже зная, что Саша загадал делитель, Маша не может исключить, что 2002 – сумма. Но сумма делителей равна 2002 только в случае  1001 + 1001  (другие делители равны 2002 либо меньше 1001). Значит, Маша загадала 1001 (а Саша – 2 или 1001, и тогда оба действительно не могли узнать числа друг друга). ",
        "Ответ: 1001.",
        "Замечания:  Баллы: 8-9 кл. – 5, 10-11 кл. – 4. "
    ],
    "111901": [
        "https://www.problems.ru/view_problem_details_new.php?id=111901",
        "Математическая логика (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Автор: Шноль Д.Э.У подводного царя служат осьминоги с шестью, семьюили восемью ногами. Те, у кого 7 ног, всегда лгут, а у кого 6 или8 ног, всегда говорят правду. Встретились четыре осьминога. Синийсказал: \"Вместе у нас 28 ног\",  зеленый: \"Вместе у нас27 ног\", желтый: \"Вместе у нас 26 ног\", красный: \"Вместе унас 25 ног\". У кого сколько ног?",
        "Решение: Так как осьминоги противоречат друг другу, товозможны два случая: либо все осьминоги лгут, либо ровно один из нихговорит правду.Если все осьминоги лгут, то у каждого из них по 7 ног. Значит, вместеу них 28 ног. Но тогда синий осьминог сказал правду -противоречие.Если же три осьминога солгали, а четвёртый сказал правду, то усолгавших осьминогов должно быть по 7 ног, а у сказавшего правду -либо 6, либо 8. Поэтому вместе у них либо 27, либо 29 ног, то естьправду сказал зелёный осьминог.Таким образом, у зелёного осьминога 6 ног, а у остальных по 7 ног.",
        "Ответ: у зелёного осьминога 6 ног, а у остальных по7 ног."
    ],
    "35725": [
        "https://www.problems.ru/view_problem_details_new.php?id=35725",
        "Ребусы",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Для проверки телетайпа, печатающего буквами русского алфавита   АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ   передан набор из 9 слов, содержащий все 33 буквы алфавита.   В результате неисправности телетайпа на приемном конце   получены слова   ГЪЙ АЭЁ БПРК ЕЖЩЮ НМЬЧ СЫЛЗ ШДУ ЦХОТ ЯФВИ   Восстановите исходный текст, если известно,   что характер неисправности таков, что каждая буква   заменяется буквой, отстоящей от нее в указанном алфавите   не дальше, чем на две буквы. Например, буква Б может   перейти в одну из букв А, Б, В, Г.     (Задача с сайта www.crytograhy.ru.) ",
        "Подсказка: Перебирая варианты, легче найти вначале определить  второе и последнее слова. На основе этого сокращайте перебор оставшихся вариантов.Также доступны документы в формате TXT"
    ],
    "66399": [
        "https://www.problems.ru/view_problem_details_new.php?id=66399",
        "Математическая логика (прочее)",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Автор: Пешнин А.На острове рыцарей и лжецов каждый дружит с десятью другими жителями (рыцари всегда говорят правду, лжецы всегда лгут). Каждый житель острова заявил, что среди его друзей больше лжецов, чем рыцарей. Может ли количество рыцарей быть вдвое больше, чем количество лжецов?",
        "Решение: Пусть на острове живут x рыцарей и y лжецов, а количество пар друзей вида рыцарь – лжец равно D. Рыцари говорит правду, поэтому каждый из них входит хотя бы в 6 таких пар. Каждый лжец имеет не более 10 друзей – рыцарей, поэтому входит не более, чем в 10 таких пар. Следовательно, 6x ≤ D ≤ 10y, откуда x ≤ 5y/3 < 2y, так как какие-то аборигены на острове есть (значит, обязательно есть и лжецы).  Таким образом, рыцарей не может быть вдвое больше, чем лжецов. ",
        "Ответ: Не может."
    ],
    "89926": [
        "https://www.problems.ru/view_problem_details_new.php?id=89926",
        "Математическая логика (прочее)",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: Путешественник оказался в какой-то из двух стран — А или Я. Он знает, что все жители страны А по четным числам говорят правду, а по нечетным — лгут, а жители страны Я — наоборот, по нечетным числам говорят правду, а по четным — лгут. Притом все они часто ездят в гости друг к другу. Может ли путешественник, задав один-единственный вопрос первому встречному, узнать, в какой из стран он находится?",
        "Подсказка: Обратите внимание, все жители обеих стран, из двух подряд идущих дней, говорят один день правду, а другой — лгут.",
        "Решение: Поскольку все жители обоих стран, из двух подряд идущих дней, говорят один день правду, а другой — лгут, то, если задать вопрос: «Что бы Вы вчера ответили мне на вопрос:…?», то любой из них ответит неправду (либо правдиво передав вчерашний лживый ответ, либо лживо передав вчерашний правдивый). Значит, мы можем спросить, например: «Что бы Вы ответили мне вчера на вопрос: \"Это страна А?\"». Кто бы ни был отвечающий, его ответ всегда будет лжив."
    ]
}