{
    "87981": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Попробуйте найти все натуральные числа, которые больше своей последней цифры в5раз.",
        "Подсказка: Подумайте, чему может быть равна последняя цифра искомого числа.",
        "Решение: При умножении на5 последняя цифра неизменилась, значит, она была0 или5. Еслибы последняя цифра была0, товсё число былобы0, амы ищем натуральные числа. Значит, последняя цифра была5. Авсё число 25. Естественно, больше25 это число быть неможет, поскольку оно в5раз больше",
        "Ответ: 25."
    ],
    "30832": [
        "Системы счисления",
        "Сложность: 2",
        "Классы: 8",
        "Условие: В какой системе счисления справедливо равенство 3·4=10?",
        "Ответ: В 12-ричной."
    ],
    "65899": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Последняя цифра в записи натурального числа в 2016 раз меньше самого числа. Найдите все такие числа.",
        "Решение: Пусть x – последняя цифра числа. Далее можно рассуждать по-разному.",
        "Ответ: 4032, 8064, 12096, 16128."
    ],
    "76470": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Найти четырёхзначное число, являющееся точным квадратом и такое, что две первые цифры одинаковы между собой и две последние также.",
        "Решение: Пусть a – первая и вторая цифры, b – третья и четвёртая. Тогда данное число равно 11(b + 100a), поэтому b + 100a = 11x² для некоторого натурального числа x. Кроме того, 100 ≤ b + 100a ≤ 908, а значит, 3 ≤ x ≤ 9. Вычисляя квадраты чисел 33, 44, ..., 99, получаем, что ровно один из них имеет требуемый вид: 88² = 7744.",
        "Ответ: 7744."
    ],
    "76510": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Даны 6 цифр: 0, 1, 2, 3, 4, 5. Найти сумму всех четырёхзначных чётных чисел,  которые можно написать этими цифрами (одна и та же цифра в числе может  повторяться).",
        "Решение: Будем отдельно подсчитывать сумму тысяч, сотен, десятков и единиц для  рассматриваемых чисел. На первом месте может стоять любая из пяти цифр  1, 2, 3, 4, 5. Количество всех чисел с фиксированной первой цифрой равно  6·6·3 = 108, поскольку на втором и третьем месте может стоять любая из шести цифр, а на четвёртом месте – любая из трёх цифр 0, 2, 4. Поэтому сумма тысяч равна (1 + 2 + 3 + 4 + 5)·108·1000 = 1620000. Количество чисел с фиксированной второй цифрой равно 6·3 = 90 (на первом месте стоит любая из пяти цифр). Поэтому сумма сотен равна",
        "Ответ: 1769580."
    ],
    "77928": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что число  не является кубом никакого целого числа.",
        "Решение: Рассматриваемое число равно 10150 + 5·10100 + 1. Оно больше (1050 + 1)³ = 10150 + 3·10100 + 3·1050 + 1, но меньше   (1050 + 2)³ = 10150 + 6·10100 + 12·1050 + 8."
    ],
    "77999": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Определить наибольшее значение отношения трёхзначного числа к числу, равному  сумме цифр этого числа.",
        "Решение: Сумма цифр трёхзначного числа 100a + 10b + c равна a + b + c. Ясно, что  ≤ 100. Кроме того, для числа 100 указанное отношение равно 100.",
        "Ответ: 100."
    ],
    "78175": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 7,8,9,10",
        "Условие: Заметим, что если перевернуть лист, на котором написаны цифры, то цифры 0,  1, 8 не изменятся, 6 и 9 поменяются местами, остальные потеряют смысл.  Сколько существует девятизначных чисел, которые при переворачивании листа не  изменяются?",
        "Решение: Все такие числа должны состоять из цифр, имеющих смысл при переворачивании  листа, причём число определяется первыми пятью своими цифрами. Заметим, что  пятая цифра не может быть 6 или 9, а также первая цифра не может быть 0.  Итак, для первой цифры имеем 4 варианта, для второй, третьей и четвёртой – по 5, а для пятой – 3 варианта. Таким образом, всего таких чисел 4·5³·3 = 1500.",
        "Ответ: 1500 чисел."
    ],
    "78061": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Найти все двузначные числа, сумма цифр которых не меняется при умножении числа  на 2, 3, 4, 5, 6, 7, 8 и 9.",
        "Решение: По условию сумма цифр числа a и числа 9a одна и та же. Поэтому согласно признаку делимости на 9 число a делится на 9. Двузначные числа, кратные 9, следующие: 18, 27, 36, 45, 54, 63, 72, 81, 90 и 99. Из них числа 27, 36, 54, 63, 72 и 81 не обладают требуемым свойством; в этом можно убедиться,  умножая их, соответственно, на 7, 8, 7, 3, 4 и 9. Оставшиеся числа требуемым  свойством обладают.",
        "Ответ: 18, 45, 90 и 99."
    ],
    "78097": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: От",
        "Решение: Если число слева составлено из цифр a, b, c, то число слева составлено из цифр  a1 = 9 – a, b1 = 9 – b и c1 = 9 – c. Если a = b = c, то требуемое условие выполняется. Таких столбов ровно 10.    Пусть теперь среди цифр a, b, c есть ровно две различных. Среди цифр a1, b1, c1 будут в точности те же самые две цифры тогда и только тогда, когда эти две цифры в сумме дают 9. Таких пар цифр 5: (0, 9), (1, 8), (2, 7), (3, 6) и (4, 5). Трёхзначных чисел, записывающихся двумя данными цифрами ровно шесть: три из них записываются двумя цифрами a и одной цифрой b, а ещё три – одной цифрой a и двумя цифрами b. Так мы получаем ещё 5·6 = 30 столбов.",
        "Ответ: 40 столбов."
    ],
    "78132": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Сколько существует четырёхзначных номеров (от 0001 до 9999), у которых  сумма двух первых цифр равна сумме двух последних цифр?",
        "Решение: Пусть сумма первых двух цифр равна",
        "Ответ: 669 номеров."
    ],
    "78525": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Число",
        "Решение: Пусть",
        "Ответ: 1681.00"
    ],
    "78742": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: У числа 21970 зачеркнули его первую цифру и прибавили её к оставшемуся числу. С результатом проделали ту же операцию и т.д., до тех пор пока не получили десятизначное число. Доказать, что в этом числе есть две одинаковые  цифры.",
        "Решение: Поскольку при каждой операции изчисла вычитается число вида a(10k – 1), остаток при делении на 9 не меняется. Следовательно, получившееся десятизначное число не делится на 9. С другой стороны, если все его цифры различны, то их сумма равна   0 + 1 + ... + 9 = 45, то есть делится на 9. Таким образом, среди его цифр есть две одинаковые."
    ],
    "79237": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Может ли число, состоящее из шестисот шестёрок и некоторого количества нулей,  быть квадратом целого числа?",
        "Решение: Квадрат целого числа оканчивается на чётное число нулей; их можно не рассматривать. Таким образом, можно считать, что рассматриваемое число имеет вид 2n, причём n состоит из шестисот троек и некоторого количества нулей. Поскольку n нечётно, то число 2n не может быть квадратом целого числа.",
        "Ответ: Не может."
    ],
    "79444": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Назовём автобусный билет счастливым, если сумма цифр его номера делится  на 7. Могут ли два билета подряд быть счастливыми?",
        "Решение: Например, суммы цифр номеров 159999 и 160000 делятся на 7.",
        "Ответ: Могут."
    ],
    "87956": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Отличник Поликарп и двоечник Колька составляли максимальное пятизначное число,  которое состоит из различных нечётных цифр. Поликарп своё число составил  правильно, а Колька ошибся – он не заметил в условии слово различных и очень радовался, что его число оказалось больше, чем число Поликарпа. Какие числа составили Поликарп и Колька?",
        "Подсказка: Подумайте, какими должны быть первые цифры искомых чисел.",
        "Решение: В число Поликарпа будут входить цифры1, 3, 5, 7, 9. Для того, чтобы оно было наибольшим, надо цифры в нём записать строго в обратном порядке: 97531. В Колькино же число войдут пять цифр 9, и его число будет 99999.",
        "Ответ: 97531 и 99999."
    ],
    "102795": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Доказать, что каждое из чисел последовательности 11, 111, 1111, ... не является квадратом натурального числа.",
        "Решение: Все эти числа при делении на 4 дают остаток 3, а квадраты – только остатки 0 и 1."
    ],
    "102858": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Подсчитать сумму цифр числа (999..99)",
        "Решение: Преобразуем число"
    ],
    "107712": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Пятизначное число называется неразложимым, если оно не раскладывается  в произведение двух трёхзначных чисел.   Какое наибольшее число неразложимых пятизначных чисел может идти подряд?",
        "Решение: Заметим, что все числа, кратные 100, являются разложимыми. Поэтому более 99 неразложимых чисел подряд быть не может. С другой стороны, между числами 100·100 и 100·101 все числа разложимые, и их ровно 99.",
        "Ответ: 99."
    ],
    "107727": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Разделим каждое четырёхзначное число на сумму его цифр. Какой самый большой результат может получиться?",
        "Решение: См. задачу 77999.",
        "Ответ: 1000."
    ],
    "108978": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Найти такое трёхзначное число, удвоив которое, мы получим число, выражающее количество цифр, необходимое для написания всех последовательных целых чисел от единицы до этого искомого трёхзначного числа (включительно).",
        "Решение: Пусть x – искомое число. Однозначных чисел всего 9, двузначных – 90, трёхзначных чисел до x включительно – x – 99. Количество цифр, необходимое для написания всех последовательных чисел от 1 до x, равно 9 + 2·90 + 3·(x – 99) = 3x – 108. Получим уравнение 2x = 3x – 108, откуда x = 108.",
        "Ответ: 108."
    ],
    "87957": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Отличник Поликарп идвоечник Колька составляли минимальное 5-значное число, которое состоит изразличных чётных цифр. Поликарп своё число составил правильно, аКолька ошибся. Однако оказалось, что разность между Колькиным числом иправильным ответом меньше100. Какие числа составили Поликарп иКолька?",
        "Подсказка: Подумайте, какими должны быть две первые цифры числа Поликарпа идве последние цифры Колькиного числа.",
        "Решение: Если действовать также, как впредыдущей задаче, Поликарп должен былбы составить число 02468, нопервая цифра неможет быть нулём, так что Поликарп составил число 20468. Попробуем найти Колькино число. Оно больше, чем число Поликарпа, носостоит изтехже цифр. Первые три цифры изменить нельзя, поскольку тогда разность между числами Кольки иПоликарпа будет больше100. Заменить можно только 4ю цифру, причём менять её можно только напятую, иначе опять разность будет больше100. Значит, Колькино число 20486.",
        "Ответ: 20486."
    ],
    "109147": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Найти двузначное число, которое равно сумме куба числа его десятков и квадрата числа его единиц.",
        "Решение: Обозначим число десятков через x, а число единиц – через y.  Тогда 10x + y = x³ + y&sup2 или x(10 – x²) = y(y – 1), где y(y – 1) – чётное натуральное число. Поэтому x –  чётно и 10 – x² > 0. Следовательно, x = 2. Подставив в уравнение, найдём y = 4.",
        "Ответ: 24."
    ],
    "30643": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Между цифрами двузначного числа, кратного трем,  вставили нуль, и к полученному трехзначному числу прибавили  удвоенную цифру его сотен.  Получилось число, в 9 раз большее  первоначального.  Найдите исходное число.",
        "Ответ: 69."
    ],
    "35800": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Докажите, что если из числа 111...1 (2002 единицы)  вычесть число 22...2 (1001 двойка), то получится  полный квадрат.",
        "Подсказка: Выразите требуемую разность через число   A = 11...1 (1001 единица).",
        "Решение: Обозначим A = 11...1 (1001 единица),   В = 111...1 (2002 единицы),   С = 22...2 (1001 двойка).   Тогда C=2A, B=D*A, где   D=100..01 (1002 цифры).   Таким образом,    B-C = (D-2)A = 99..9*A (1001 девятка).      Окончательно,    B-C = 9A*A = (3A)"
    ],
    "30616": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Найдите 100-значное число без нулевых цифр, которое делится на сумму своих цифр.",
        "Подсказка: Подберите число с суммой цифр 125.",
        "Решение: Делимость числа на 125 определяется тремя его последними цифрами. Следовательно, годится число"
    ],
    "87959": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Отличник Поликарп составил огромное число, выписав подряд натуральные числа от1 до500:",
        "Подсказка: Обратите внимание: Колька стирал цифры, аПоликарп записывал числа— однозначные, двузначные, трехзначные.",
        "Решение: Из500 цифр, стёртых Колькой, наоднозначные числа уйдёт 9цифр, значит, наостальные останется 491цифра. Надвузначные числа уйдёт",
        "Ответ: 3."
    ],
    "30618": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Можно ли записать точный квадрат, использовав по 10 раз цифры     а) 2, 3, 6;    б) 1, 2, 3?",
        "Подсказка: Рассмотрите остатки по модулю 9.",
        "Решение: а) Сумма цифр такого числа равна 110 ≡ 2 (mod 3). А квадрат при делении на 3 может давать только остатки 0 и 1.",
        "Ответ: Нельзя."
    ],
    "30619": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: У числа 2100 нашли сумму цифр, у результата снова нашли сумму цифр и т.д. В конце концов получилось однозначное число. Найдите его.",
        "Решение: 2100 = (26)16·24 ≡ 116·16 ≡ 7 (mod 9).",
        "Ответ: 7."
    ],
    "30624": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите, что произведение последней цифры числа 2n и суммы всех цифр этого числа, кроме последней, делится на 3.",
        "Решение: Пусть a – последняя цифра числа 2n. Надо доказать, что a(2n – a) кратно 3. Разберём два случая.     1) n нечётно. Тогда 2n ≡ 2 (mod 3), a = 2 или 8. В любом случае 2n – a кратно 3.     2) n чётно. Тогда 2n ≡ 1 (mod 3), a = 4 или 6. В первом случае 2n – a кратно 3, во втором а кратно 3."
    ],
    "30625": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Может ли сумма цифр точного квадрата равняться 1970?",
        "Подсказка: См. задачу 30618 а).",
        "Ответ: Не может."
    ],
    "30626": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Из трёхзначного числа вычли сумму его цифр.  С полученным числом проделали то же самое и так далее, 100 раз. Докажите, что в результате получится нуль.",
        "Решение: После первого вычитания получается число, кратное 9. Поэтому на каждом следующем шаге (пока не получился 0) вычитается не меньше 9. Следовательно, для чисел, меньших 99·9 + 9 = 900 всё доказано. Для чисел от 900 до 999 чисел заметим, что среди 33 кратных 9 трёхзначных чисел, начинающихся с цифр 6, 7, 8, только девять имеют сумму цифр 9, а о остальные 24 имеют сумму цифр 18. Таким образом, не менее 12 раз вычиталось не 9, а 18."
    ],
    "30634": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Можно ли составить из цифр 2, 3, 4, 9 (каждую цифру\tможно использовать сколько угодно раз) два числа, одно из\tкоторых в 19 раз больше другого?",
        "Подсказка: Проследите за последней цифрой.",
        "Решение: Сумма этих чисел должна делиться на 20, значит, сумма их последних цифр равна 10. Но никакие две их данных цифр в сумме не дают 10.",
        "Ответ: Нельзя."
    ],
    "30636": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Сумма цифр трёхзначного числа равна 7. Докажите, что это число делится на 7 тогда и только тогда, когда две его последние цифры равны.",
        "Решение: 100a + 10b + c ≡ 2a + 3b + c ≡ b – c (mod 7). Значит, abc делится на 7 тогда и только тогда, когда b – c делится на 7. Но так как b, c < 7, то это условие равносильно тому, что b = c."
    ],
    "32078": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Найти все числа, которые в 12 раз больше суммы своих цифр.",
        "Решение: Пусть искомое число содержит n цифр. Тогда оно не меньше чем 10n–1 (это наименьшее n-значное число). С другой стороны, сумма его цифр не больше 9n (так как каждая цифра не больше 9). Поэтому искомое число не превосходит 129n = 108n. Но согласно неравенству Бернулли (см. задачу 30899)   10n–1 = 1000·5·10n–4 > 200·5·(1 + 9(n – 4)) = 200(45n – 175) > 200n при n ≥ 4.     Однозначным искомое число, очевидно, быть не может. Осталось рассмотреть два случая.     1) n = 2. Но 10a + b < 12(a + b) (a и b – цифры).     2) n = 3. В этом случае получаем 100a + 10b + c = 12(a + b + c), откуда 11(8a – c) = 2b, т.е. b делится на 11. Значит, b = 0, 8a = c, откуда a = 1, c = 8.",
        "Ответ: 108."
    ],
    "35029": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Подряд выписаны числа 2",
        "Подсказка: Если  число 2",
        "Решение: Пусть  число 2",
        "Ответ: 2001.00"
    ],
    "35136": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что если в числе 12008 между нулями вставить любое количество троек, то получится число, делящееся на 19.",
        "Решение: 3·1203...308 = 3609...924 = 3610...000 – 76, а числа 361 и 76 делятся на 19."
    ],
    "88085": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Заодин ход разрешается или удваивать число, или стирать его последнюю цифру. Можноли занесколько ходов получить изчисла 458 число 14?",
        "Подсказка: Попробуйте умножать исходное число на2 дотех пор, пока первая цифра результата нестанет равна7.",
        "Решение: Можно сначала удвоить число, потом зачеркнуть последнюю цифру, аможно наоборот— сначала зачеркнуть последнюю цифру, апотом удвоить число. Назначение первой цифры результата это почти невлияет. Поэтому можно, например, удваивать число дотех пор, пока первая цифра результата нестанет равна7; зачеркнуть все цифры, кроме первой; удвоить её. Получим: 458, 916, 1832, 3664, 7328, 732, 73, 7,14.",
        "Ответ: Да: 458, 45, 90, 9, 18, 36, 72, 7, 14."
    ],
    "35487": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Будем обозначать сумму цифр числа X через S(X). Пусть A = 9999, B = s(A), C = s(B) и D = s(C). Найдите D.",
        "Подсказка: См. задачу 30627.",
        "Ответ: D = 9."
    ],
    "35513": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Докажите, что для любого натурального n в десятичной записи чисел 2002n и 2002n + 2n одинаковое число цифр.",
        "Подсказка: Двойное неравенство 10k–1 < A < 10k означает, что десятичная запись натурального числа A состоит из k цифр.",
        "Решение: Поскольку число 2002n не является степенью числа 10, то для некоторого k выполнено двойное неравенство 10k–1 < 2002n < 10k, которое означает, что в числе 2002n k цифр. При этом очевидно, что k > n, поэтому оба числа 2002n и 10k делятся на 2n. Рассмотрим следующее за 2002n число, кратное 2n – это число 2002n + 2n. Из предыдущих рассуждений следует, что 2002n + 2n не превосходит 10k. Если 2002n + 2n < 10k, то 2002n + 2n имеет в десятичной записи k цифр. Осталось показать, что равенство   2002n + 2n = 10k невозможно. Разделив обе части равенства на 2n, получим 1001n + 1 = 5k·2k–n. Правая часть делится на 5, а левая – нет, следовательно, равенство невозможно."
    ],
    "35626": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: В десятичной записи числа имеется ноль. При вычеркивании этого нуля число уменьшилось в 9 раз. На каком месте стоял этот ноль?",
        "Решение: Пусть",
        "Ответ: На втором месте слева."
    ],
    "60690": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Шестизначное число делится на 7. Его первую цифру стёрли, а затем записали её позади последней цифры.   Докажите, что новое число также делится на 7.",
        "Решение: См. задачу 78235."
    ],
    "60716": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Найдите все такие пары чисел вида 1xy2 и x12y, что оба числа делятся на 7.",
        "Решение: 0 ≡ 1000 + 100x + 10y + 2 ≡ –1 + 23x + 33y + 2 = 2x + 3y + 1 (mod 7).   0 ≡ 1000x + 120 + y ≡ – x + 1 + y (mod 7).  Значит,   0 ≡ 2x + 3y + 1 + 2(– x + 1 + y) = 5y + 3 (mod 7), откуда y ≡ 5 (mod 7). Аналогично   0 ≡ 2x + 3y + 1 – 3(– x + 1 + y) = 5x – 2 (mod 7), откуда x ≡ 6 (mod 7).",
        "Ответ: 1652 и 6125."
    ],
    "64493": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Найдите все трёхзначные числа, квадраты которых оканчиваются на 1001.",
        "Решение: Первый способ. Пусть abc = 100а + 10b + c –   искомое число. Тогда  abc² = 100000a² + 2000ab + 100b² + 200ac² + 20bc² + c².     Последняя цифра этого числа зависит только от с². Так как с² оканчивается  на 1, то c = 1 или 9. Предпоследняя цифра зависит от выражения   20bc + c² = 20b + 1 или 180b + 81. Перебором находим, что окончанию 01 могут удовлетворять только три пары значений (b, c): (5, 1), (0, 1) или (4, 9). Таким образом, квадрат искомого числа имеет вид: 10000а² + 10200а + 2601, 10000а² + 200а + 1 или 10000а² + 9800а + 1201.     Перебором убеждаемся, что в первом случае ни одно значение а не удовлетворяет условию, во втором случае а = 5, а в третьем – а = 7.",
        "Ответ: 501, 749."
    ],
    "88191": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6,7,8",
        "Условие: В 100-значном числе 12345678901234...7890, вычеркнули все цифры, стоящие на нечётных местах; в полученном 50-значном числе вновь вычеркнули все цифры, стоящие нанечётных местах, и т.д. Вычёркивание продолжалось до тех пор, пока было что вычёркивать. Какая цифра была вычеркнута последней?",
        "Подсказка: Чем характеризуются порядковые номера цифр, оставшихся после первого вычёркивания? А после второго?",
        "Решение: После первого вычёркивания останутся лишь те цифры, первоначальные номера которых чётны, после второго – те, чьи первоначальные номера делились на 4, после третьего – на 8 и т.д. Перед последним вычёркиванием останется цифра, первоначальный номер которой равен наибольшей возможной степени 2, то есть равен 64. Это цифра 4.",
        "Ответ: 4."
    ],
    "64604": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Число N является произведением двух последовательных натуральных чисел. Докажите, что     а) можно приписать к этому числу справа две цифры так, чтобы получился точный квадрат;     б) если N > 12, это можно сделать единственным способом.",
        "Решение: а) Припишем 25 к числу N = n(n + 1). Получится число 100n(n + 1) + 25 = (10n + 5)²."
    ],
    "64902": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Сумма цифр натурального числа n равна сумме цифр числа 2n + 1. Могут ли быть равными суммы цифр чисел 3n – 3 и n – 2?",
        "Решение: Воспользуемся тем, что любое натуральное число и его сумма цифр имеют одинаковые остатки от деления на 9. Следовательно, если у двух чисел одинаковые суммы цифр, то разность этих чисел делится на 9. Значит, (2n + 1) – n = n + 1 делится на 9. Поэтому на 9 делится число  2n + 2 и  не делится число 2n + 2 – 3 = 2n – 1 = (3n – 3) – (n – 2). Следовательно, суммы цифр чисел 3n – 3 и n – 2 не равны.",
        "Ответ: Не могут."
    ],
    "65223": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Верно ли, что изменив одну цифру в десятичной записи любого натурального числа, можно получить простое число?",
        "Решение: Приведём три контрпримера.    1. Рассмотрим число 10! = 3628800. Оно делится на 10, поэтому если изменить любую цифру, кроме последней, то делимость на 10 сохранится. Если последнюю цифру заменить на любую из цифр от 2 до 9, то полученное число 10! + k. будет делиться на k. А если последнюю цифру заменить на 1, то получится число 3628801, кратное 11.     2. Рассмотрим число (10!)3. Изменение любой цифры, кроме последней, а также замена последней цифры на любую цифру от 2 до 9 не дает простого числа по соображениям, изложенным выше. А если последнюю цифру заменить на 1, то получится число   (10!)³ + 1 = (10! + 1)((10!)² – 10! + 1).     3. Рассмотрим число 19! + 10. Бесполезность изменения любой его цифры, кроме последней, объяснена выше, а замена последней цифры на 1, 2, ..., 9 приведёт к тому, что полученные числа будут делиться на 11, 12, ..., 19 соответственно.",
        "Ответ: Неверно."
    ],
    "65427": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Каких натуральных чисел от 1 до 1000000 (включительно) больше: чётных с нечётной суммой цифр или нечётных с чётной суммой цифр?",
        "Решение: Назовём числа, о которых говорится в условии задачи, интересными. Рассмотрим сначала первые два десятка. Среди чисел от 1 до 9 интересных нет, а все числа от 10 до 19 будут интересными, причём среди них 5 чётных чисел с нечётной суммой цифр и 5 нечётных чисел с чётной суммой цифр.     Теперь рассмотрим произвольный десяток чисел, идущих подряд, от *0 до *9 (знаком * обозначена одна и та же последовательность цифр). Если сумма цифр в последовательности * чётна, то в этом десятке не встретится интересных чисел. Если же она нечётна, то все числа этого десятка будут интересными, и их опять-таки будет поровну каждого вида. При разбиении числового ряда от 10 до 999999 на такие десятки, интересных чисел обоих видов получится поровну, но останется ещё число 1000000, которое, будучи чётным, имеет нечётную сумму цифр, поэтому таких чисел будет больше.",
        "Ответ: Чётных чисел с нечётной суммой цифр."
    ],
    "65511": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: Могут ли произведения всех ненулевых цифр двух последовательных натуральных чисел отличаться ровно в 54 раза?",
        "Решение: Таким свойством обладают, например, числа 299 и 300. Действительно, 2·9·9 = 54·3.",
        "Ответ: Могут."
    ],
    "88222": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Я купил лотерейный билет, укоторого сумма цифр его пятизначного номера оказалась равна возрасту моего соседа. Определите номер этого билета, если известно, что мой сосед без труда решил эту задачу.",
        "Подсказка: Заметьте, вбилете неможет быть двух неравныхцифр.",
        "Решение: Номер билета— 99999. Еслибы вбилете были хотябы две неравные цифры, тоих можно былобы поменять местами исосед несмогбы",
        "Ответ: Номер билета99999."
    ],
    "65664": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: В десятичной записи числа – 36 цифр. Разрешается разбить его на группы по 6 цифр в каждой и как-нибудь переставить эти группы. Известно, что число, полученное при одной из перестановок, в 7 раз больше числа, полученного при другой перестановке. Докажите, что большее из этих чисел делится на 49.",
        "Решение: Обозначим группы из шести цифр слева направо буквами a, b, c, d, e и f соответственно. Тогда исходное число можно записать так:  1030a + 1024b + 1018c + 1012d + 106e + f. Заметим, что натуральное число вида 106n дает остаток 1 при делении на 7, так как 106n – 1 делится на   106 – 1 = 999999, а 999999 делится на 7. Следовательно, исходное число имеет такой же остаток от деления на 7, что и число a + b + c + d + e + f. Значит, и любая перестановка, указанная в условии, даёт тот же остаток от деления на 7."
    ],
    "65950": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите, что натуральные числа n и n2017 оканчиваются на одну и ту же цифру.",
        "Решение: Если число n оканчивается на 0, 1, 5 или 6, то и любая степень этого числа оканчивается на ту же самую цифру.     Если число n оканчивается на 4 или на 9, то последние цифры степеней этого числа чередуются в зависимости от чётности показателя степени, то есть образуют цикл длины два (4 – 6 – 4 или 9 – 1 – 9 соответственно).     Если число n оканчивается на 2, 3, 7 или 8, то последние цифры степеней этого числа образуют цикл длины четыре (2 – 4 – 8 – 6 – 2, 3 – 9 – 7 – 1 – 3,  7 – 9 – 3 – 1 – 7 или 8 – 4 – 2 – 6 – 8 соответственно).     Так как 2017 – 1 = 2016, а 2016 делится на 4, то при любых значениях n число n2017 оканчивается на ту же цифру, что и число n."
    ],
    "66189": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Последовательность нулей и единиц строится следующим образом: на k-м месте ставится 0, если сумма цифр числа k чётна, а иначе (если сумма цифр числа k нечётна) ставится 1. Докажите, что эта последовательность непериодична.",
        "Решение: Допустим, последовательность имеет период d и предпериод m. Возьмём такое n, что 10n > m + d. Суммы цифр чисел 10n и 10n+1 равны 1, а суммы цифр чисел 10n – d и 10n+1 – d отличаются на 9, то есть имеют разную чётность. Противоречие."
    ],
    "88284": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Сколько существует двузначных чисел, у которых цифра десятков больше цифры единиц?",
        "Решение: Задачу можно решить простым перебором."
    ],
    "66362": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Известно, что в десятичной записи числа 229 все цифры различны. Есть ли среди них цифра 0?",
        "Решение: Заметим, что 2·229 = 230 = (1024)³ < 2·109. Следовательно, 229 < 109. С другой стороны, 229 = (210)²·29 = (1024)²·512 > 5·108. Поэтому в записи числа 229 ровно девять цифр.     Если среди них нет нуля, то сумма цифр в десятичной записи этого числа равна 1 + 2 + ... + 9 = 45. Отсюда следует, что 229 делится на 3, что не так. Противоречие.",
        "Ответ: Есть."
    ],
    "76469": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Найти все трёхзначные числа, равные сумме факториалов своих цифр.",
        "Решение: См. задачу 35322.",
        "Ответ: 145."
    ],
    "77959": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: Имеются семь жетонов с цифрами 1, 2, 3, 4, 5, 6, 7.   Докажите, что ни одно семизначное число, составленное посредством этих жетонов, не делится на другое.",
        "Решение: Все такие числа дают одинаковые остатки при делении на 9 (но сами на 9 не делятся). Пусть a = kb, где a и b – разные семизначные числа, составленные посредством этих жетонов. Тогда (k – 1)b = a – b делится на 9, то есть k – 1 делится на 9. Но это невозможно, так как, очевидно, k < 7."
    ],
    "78235": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: 6n-значное число делится на 7. Последнюю цифру перенесли в начало.  Доказать, что полученное число также делится на 7.",
        "Решение: Представим исходное число A в виде A = 10a + b. После перестановки последней цифры b в начало мы получим,  очевидно, число В = 106n–1b + a.    10B – A = (106n – 1)b  делится на 106 – 1 = 999·1001 = 999·143·7, то есть делится на 7. Следовательно, и B делится на 7."
    ],
    "78617": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Число y получается из натурального числа x некоторой перестановкой его цифр. Докажите, что каково бы ни было x,",
        "Решение: См. задачу 97958."
    ],
    "78692": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Доказать, что никакая степень числа 2 не оканчивается четырьмя одинаковыми  цифрами.",
        "Решение: Разность двух натуральных чисел, оканчивающихся четырьмя одинаковыми цифрами,  делится на 104 = 54·24. Поэтому остаток от деления на 24 полностью определяется четырьмя последними цифрами. Последние цифры степени двойки не могут быть нулями, а числа 2222, 4444, 6666, 8888 на 16 не делятся."
    ],
    "79291": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Доказать, что в десятичной записи чисел 2n + 1974n и 1974n содержится одинаковое количество цифр.",
        "Решение: Предположим, что 1974n < 10k ≤ 2n + 1974n. Тогда k ≥ 3n, поскольку 1974n > 103n. После деления на 2n приходим к неравенству   987n < 2k−n·5k ≤ 987n + 1. Число 2k–n·5k целое, поэтому 2k–n·5k = 987n + 1. Если n ≥ 2, то k − n ≥ 2n > 3, поэтому 2k–n·5k делится на 8. С другой стороны, 987 при делении на 8 даёт остаток 3, поэтому 987n + 1 при делении на 8 даёт остаток 4 или 2. Противоречие."
    ],
    "79313": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Каковы первые четыре цифры числа 11 + 2² + 3³ + ... + 999999 + 10001000?",
        "Решение: Докажем, что прибавление числа n = 11 + 2² + 3³ + ... + 999999 не изменяет первые четыре цифры числа 10001000. Ясно, что    Значит,    поскольку   (1 + 1/999)1000 > 1 + 1000/999 > 2.",
        "Ответ: 1000."
    ],
    "79324": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: Может ли число n! оканчиваться цифрами 19760...0?",
        "Решение: Легко проверить, что если n! оканчивается k ≥ 2 нулями, то n! делится на 24+k, поэтому после  вычёркивания последних k нулей остаётся число, кратное 16. Но число, оканчивающееся на 1976, не делится на 16, поскольку 10000 делится на 16, а 1976 – не делится.",
        "Ответ: Не может."
    ],
    "98708": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 4,5",
        "Условие: Отличник Поликарп составлял максимальное пятизначное число, которое состоит из различных нечётных цифр. Двоечник Колька составлял минимальное пятизначное число, которое состоит из различных чётных цифр. Какие числа должны были составить Поликарп и Колька?",
        "Ответ: 97531 и 20468."
    ],
    "79389": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Дано число, имеющее 13 разрядов. Доказать, что одну из его цифр можно  вычеркнуть так, что в полученном числе количество семёрок на чётных местах  будет равно количеству семёрок на нечётных местах.",
        "Решение: См. задачу 79395."
    ],
    "79412": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Числа 1, 2, 3, ..., 1982 возводятся в квадрат и записываются подряд в   некотором порядке.   Может ли полученное многозначное число быть полным квадратом?",
        "Решение: При делении на 3 квадрат целого числа даёт остаток 0 или 1. Квадраты данных чисел при делении на 3 дают остатки 1, 1, 0, ..., 1, 1. Сумма этих остатков равна 2·1983 : 3 ≡ 2 (mod 3). Такой же остаток при делении на 3 даёт и число, которое получается при возведении данных чисел в квадрат и записывании их в произвольном порядке.",
        "Ответ: Не может."
    ],
    "79432": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Может ли квадрат какого-либо натурального числа начинаться с 1983 девяток?",
        "Решение: Одним из таких чисел является N = 999...995 (1983 девятки). Действительно, N² = (101984 − 5)² = 103968 − 101985 + 25 = 99...9900...025   (1983 девятки и 1983 нуля).",
        "Ответ: Может."
    ],
    "86559": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Докажите, что число состоящее из 243 единиц делится на 243.",
        "Решение: Число, данное в условии можно записать так:"
    ],
    "87992": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Одно трехзначное число состоит изразличных цифр, следующих впорядке возрастания, авего названии все слова начинаются содной итойже буквы. Другое трехзначное число, наоборот, состоит изодинаковых цифр, новего названии все слова начинаются сразных букв. Какие это числа?",
        "Подсказка: Заметьте, числа равны ичисла начинаются содной итойже буквы— это два совершенно разных утверждения.",
        "Решение: Эти числа, соответственно, 147 и111. Задача решается простым перебором вариантов, которых нетак уж много.",
        "Ответ: 147 и111."
    ],
    "102806": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Числа по кругу.",
        "Решение: 14, 178, 27, 57, 590, 2345, 36, 467."
    ],
    "102834": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: Из числа 1234567...5657585960 вычеркнуть 100 цифр так, чтобы оставшееся число было: а) наименьшим; б) наибольшим.",
        "Решение: а) Так как надо найти наименьшее число, то вычеркиваем 100 наибольших цифр, чтобы число начиналось с нулей. Первоначальное число содержит 111 цифр, то есть останется 11 цифр: 00000123450 = 123450.     б) Наибольшее число начинается с наибольшего числа девяток (их может не больше пяти), это из первых пяти десятков, шестая цифра должна быть наибольщей из тех, сзади которых остаётся еще пять цифр. Такой является цифра 7.",
        "Ответ: а) 00000123450; б) 99999785960."
    ],
    "105216": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Найти все несократимые дроби а/b, представимые в виде b,а (запятая разделяет десятичные записи натуральных чисел b и а).",
        "Решение: Пусть натуральные числа a и b взаимно просты, а десятичная запись числа a имеет n знаков. Тогда условие задачи для них записывается в виде уравнения  a : b = b + a·10–n ⇔ 10n(a – b²) = ab, из которого следует, в частности, что a > b. В силу взаимной простоты чисел a и b, число a – b² не имеет общих делителей ни с a, ни с b, следовательно, уравнение превращается в систему из двух уравнений a – b² = 1, 10n = ab.     В силу все той же взаимной простоты чисел a и b (с учётом неравенства a > b), последнему уравнению удовлетворяют  только пары (10n, 1) и (5n, 2n). Первая пара при подстановке даёт для числа n уравнение 10n = 2, которое, очевидно, не имеет решений.    Вторая пара даёт уравнение 5n – 4n = 1 ⇔ (5/4)n = 1 + (¼)n. Так как его левая часть представляет собой возрастающую функцию от n, а правая – убывающую, то оно имеет не более одного корня, который легко угадывается: n = 1.",
        "Ответ: 5/2."
    ],
    "108741": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Число 42X4Y делится на 72. Найти его цифры X и Y.",
        "Решение: Так как 72 делится на 4, то по признаку делимости на 4 получаем, что Y тоже делится на 4. Так как 72 делится ещё и на 9, то по признаку делимости на 9,  X + Y + 10 делится на 9, что возможно только лишь при X + Y = 8 или X + Y = 17. Объединяя полученные результаты и пользуясь тем, что X, Y – цифры, получаем возможные варианты: (X, Y) = (8, 0), (4, 4), (0, 8), (9, 8). Подставляя все эти пары в первоначальное число, убедимся, что только две из них:   (0, 8) и (8, 0) – подходят.",
        "Ответ: X = 0, Y = 8 или X = 8, Y = 0."
    ],
    "109182": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Найти такое трёхзначное число A², являющееся точным квадратом, что произведение его цифр равно A – 1.",
        "Решение: Пусть A² = 100x + 10y + z. Поскольку 100 ≤ A² < 1000, то 10 ≤ A < 31. Кроме того, xyz = A – 1. Если z чётно, то A² и A – 1 чётны, чего быть не может. Значит, z нечётно.     Нечётный квадрат может оканчиваться лишь цифрами 1, 5, 9.     1) z = 5. Тогда A – 1 и A² делятся на 5, что невозможно.    2) z = 9. Тогда A – 1 делится на 9. Единственный вариант A = 19. Но при этом A² оканчивается на 1, а не на 9.     3) z = 1. Тогда A оканчивается на 1 или 9. В первом случае xyz делится на 10.  Поскольку y чётно (см. задачу 31234), но не равно 0, то x = 5. Но   21² < 500, а 29² > 599.     Во втором случае проверяем квадраты чисел 19 и 29; подходит только 19.",
        "Ответ: 361."
    ],
    "115478": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 6,7,8,9",
        "Условие: Шестизначное табло в автомобиле показывает, сколько километров автомобиль проехал с момента покупки. Сейчас на нем высвечивается число, в котором есть четыре семёрки. Может ли оказаться так, что еще через",
        "Решение: Для того чтобы в результате осталась всего одна семерка, нужно избавиться от трех остальных. Заметим, что при добавлении к шестизначному числу числа",
        "Ответ: нет, не может."
    ],
    "102835": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Сколько нулей, единиц, троек?",
        "Решение: Запишем решение в таблицу (записываем число цифр в соответствующей десятке).",
        "Ответ: а)11; б)21; в)20."
    ],
    "116878": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: В десятичной записи некоторого числа цифры расположены слева направо в порядке убывания. Может ли это число быть кратным числу 111?",
        "Решение: Предположим, что числа, указанные в условии и кратные 111, существуют. Пусть А – наименьшее среди них. Возможны два случая.   1) Число А оканчивается нулем. Стерев его, мы получим меньшее число с цифрами в порядке убывания, также кратное 111. Противоречие.   2) А оканчивается на ненулевую цифру. Тогда число А – 111 также кратно 111 и цифры в его записи расположены в порядке убывания. Снова противоречие.",
        "Ответ: Не может."
    ],
    "30641": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Может ли сумма нескольких первых натуральных чисел  оканчиваться на 1989?",
        "Решение: Нет.  Рассмотрите остатки по модулю 5."
    ],
    "30835": [
        "Системы счисления",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На доске сохранилась полустертая запись",
        "Решение: 23451+15642=42423. 7-ричная система счисления."
    ],
    "78607": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Чему равна максимальная разность между соседними числами из числа тех, сумма цифр которых делится на 7?",
        "Решение: Докажем сначала, что эта разность не может быть больше13. Действительно,  среди13 подряд идущих натуральных чисел хотя бы у одного сумма цифр делится  на7, поскольку среди13 подряд идущих натуральных чисел хотя бы7  лежат в одном десятке. Но тогда суммы цифр этих семи чисел—  последовательные натуральные числа, а значит, среди них есть число, делящееся  на семь. Итак, искомое число не больше13. Но между числами 993 и 1006  нет других чисел, сумма цифр которых делится на семь, а",
        "Ответ: 13.00"
    ],
    "102836": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 7",
        "Условие: Трехзначное число.",
        "Решение: Запишем уравнение",
        "Ответ: 432"
    ],
    "78677": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: На бумажной ленте напечатаны автобусные билеты с номерами от 000000 до 999999. Затем синей краской пометили те билеты, у которых сумма цифр, стоящих на чётных местах, равна сумме цифр, стоящих на нечётных местах. Какая будет наибольшая разность между номерами двух соседних синих билетов?",
        "Решение: Покажем сначала, что синие билеты сномерами908919 и909909— соседние.  Допустим, что нашёлся синий билет сномером",
        "Ответ: 990.00"
    ],
    "78778": [
        "Двоичная система счисления",
        "Сложность: 3+",
        "Классы: 10",
        "Условие: Доказать, что среди чисел [2",
        "Решение: Покажем, что среди таких чисел бесконечно много чётных."
    ],
    "109000": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Найти два двузначных числа, обладающих свойствами: если к большему искомому числу приписать справа нуль и меньшее число, а к меньшему приписать большее число и затем нуль, то из образовавшихся чисел первое, будучи разделено на второе, даст в остатке 590, в частном 2. Кроме того, известно, что сумма, составленная из удвоенного большего числа и утроенного меньшего, равна 72.",
        "Решение: Пусть меньшее число",
        "Ответ: 10, 21."
    ],
    "30841": [
        "Системы счисления",
        "Сложность: 4",
        "Классы: 7,8",
        "Условие: Кащей Бессмертный загадывает три двузначных числа:",
        "Решение: Царевич должен назвать числа 1, 100, 100"
    ],
    "78672": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Двухсотзначное число",
        "Решение: Ответ:",
        "Ответ: x"
    ],
    "102973": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6",
        "Условие: Попробуйте найти все натуральные числа, которые больше своей последней цифры в 5 раз.",
        "Подсказка: Чему может быть равна последняя цифра искомого числа.",
        "Решение: Число кратно 5, значит, его последняя цифра – 0 или 5. Если бы последняя цифра была 0, то все число было бы 0, а мы ищем натуральные числа. Значит, последняя цифра была 5, а все число 25.",
        "Ответ: 5."
    ],
    "79515": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Даны 7 различных цифр. Доказать, что для любого натурального числа",
        "Решение: Пусть"
    ],
    "32090": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Докажите, что существует число, сумма цифр  квадрата которого более, чем в 1000 раз превышает сумму цифр  самого числа.",
        "Решение: Таким числом будет"
    ],
    "34958": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 7,8,9,10",
        "Условие: Найдите какое-нибудь такое натуральное число A, что если приписать его к самому себе справа, то полученное число будет полным квадратом.",
        "Подсказка: Если в числе A n знаков, то число, полученное приписыванием к числу A справа себя же, равно (10n + 1)A.  Поскольку A меньше 10n, то (10n + 1) должно делиться на квадрат некоторого простого числа.",
        "Решение: Заметим, что 1011 + 1 = (10 + 1)(1010 – 109 + 108 – ... – 10  + 1) делится на 11². Действительно, второй множитель представляет собой сумму 11 слагаемых, каждый из которых сравним с 1 по модулю 11. Поэтому подходит число   A = (1011 + 1)·16/121 = 13223140496.",
        "Ответ: Например, 13223140496."
    ],
    "60817": [
        "Системы счисления (прочее)",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: а) Опишите все системы счисления, в которых число делится на 2 тогда и только тогда, когда сумма его цифр делится на 2.",
        "Решение: Сравнение anqn + ... + a1q + a0 ≡ an + ... + a1 + a0 (mod m) равносильно сравнению an(qn – 1) + ... + a1(q – 1) ≡ 0 (mod m), которое имеет место независимо от ai тогда и только тогда, когда q – 1 ≡ 0 (mod m). В частности, для m = 2 годится система  счисления с любым нечётным основанием.",
        "Ответ: а) Системы с нечётным основанием;  б) q = 1 + mk (k ≥ 1)."
    ],
    "60818": [
        "Системы счисления (прочее)",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Найдите наименьшее основание системы счисления, в которой одновременно имеют место следующие признаки делимости:     1) число делится на 5 тогда и только тогда, когда сумма его цифр  делится на 5;     2) число делится на 7 тогда и только тогда, когда число, составленное из двух его последних цифр, делится на 7.",
        "Ответ: 21."
    ],
    "102980": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6",
        "Условие: Одно трехзначное число состоит из различных цифр, следующих в порядке возрастания, а в его названии все слова начинаются с одной и той же буквы. Другое трехзначное число, наоборот, состоит из одинаковых цифр, но в его названии все слова начинаются с разных букв. Какие это числа?",
        "Подсказка: Заметьте, «числа равны» и «числа начинаются с одной и той же буквы» — это два совершенно разных утверждения.",
        "Решение: Эти числа, соответственно, 147 и 111. Задача решается простым перебором вариантов, которых не так уж много."
    ],
    "66008": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Назовём натуральное число убывающим, если каждая цифра в его десятичной записи, кроме первой, меньше или равна предыдущей. Существует ли такое натуральное n, что число 16n – убывающее?",
        "Решение: Заметим, что десятичная запись числа 16n оканчивается на 6. Кроме того, это число делится на все степени двойки с показателями от 1 до 4n. Следовательно, число составленное из k последних цифр в записи 16n должно делиться на 2k.     Рассмотрим число, составленное из двух последних цифр в десятичной записи числа 16n. Если число 16n – убывающее, то это 66, 76, 86 или 96. Но числа вида ...66 или ...86 не делятся на 4, а число вида 99...96 (других цифр впереди быть не может) делится на 3, а 16n на 3 не делится. Следовательно, число составленное из двух последних цифр, это 76.     Рассуждая аналогично для чисел, составленных из трёх, четырёх, пяти и шести последних цифр, получим, что число 16n должно оканчиваться на 987776. Это число не делится на 16² = 256, поэтому не может быть степенью 16, а число 9987776 не делится на 27 = 128.     Значит, чисел, удовлетворяющих условию задачи, не существует.",
        "Ответ: Не существует."
    ],
    "73579": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Для любого натурального",
        "Решение: Пусть в числе"
    ],
    "73584": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: На карточках написаны все числа от 11111 до 99999 включительно. Затем эти карточки выложили в цепочку в произвольном порядке.   Докажите, что полученное 444445-значное число не является степенью двойки.",
        "Решение: Легко доказать, что это число делится на 11111, пользуясь тем, что числа  105A и A при любом целом A дают одинаковые остатки при делении на 11111, а сумма 11111 + 11112 + ... + 99998 + 99999 делится на 11111. Но если число делится на 11111, то оно, конечно, не может быть степенью двойки. (Это сразу следует, например, из теоремы о единственности разложения на простые множители.)"
    ],
    "78171": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Можно ли расположить все трёхзначные числа, не оканчивающиеся нулями, в последовательности так, чтобы последняя цифра каждого числа была равна первой цифре следующего за ним?",
        "Решение: Рассмотрим полный граф с девятью вершинами, занумерованных цифрами от 1 до 9. Каждому трёхзначному числу вида abc (где a ≠ c), не оканчивающемуся на ноль, сопоставим ребро, соединяющее вершины с номерами a и c. Согласно задаче 30806 в графе существует эйлеров цикл. Пройдя этот цикл десять раз (для b = 0, 1, ..., 9) в одном направлении и десять раз – в другом, получим искомую последовательность без чисел вида aba. Но вставить эти числа в последовательность уже нетрудно.",
        "Ответ: Можно."
    ],
    "78189": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Доказать, что в любом шестизначном числе можно переставить цифры так, чтобы сумма первых трёх отличалась от суммы вторых трёх меньше, чем на 10.",
        "Решение: Переставим цифры в следующем порядке:"
    ],
    "78219": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: В десятичной записи целого числа A все цифры, кроме первой и последней, нули, первая и последняя – не нули, число цифр – не меньше трёх.  Доказать, что A не является точным квадратом.",
        "Решение: Предположим, что A  точный квадрат. Тогда его последняя цифра будет 1, 4, 5, 6 или9. Но точный квадрат неможет оканчиваться  ни на 05, ни на 06. Следовательно, число A оканчивается на одну  из цифр 1, 4, 9. Обозначим через x квадратный корень из последней цифры  числа A. Пусть k – число нулей в числе A – x². (Можно считать, что k > 2.) Так как число x не делится на 5, то ровно одно из чисел  – x,  + x делится на 5, а значит, и на 5k. Следовательно, одно из этих чисел не меньше 5k, а другое не меньше 5k – 6, а значит, произведение этих чисел не меньше, чем 5k(5k – 6) > 5k·9·2k = 9·10k, что противоречит (k+1)-значности числа A. Итак, число A не может быть точным квадратом."
    ],
    "78608": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Имеется 120-значное число. Его первые 12 цифр переставляются всеми возможными способами. Из полученных таким образом 120-значных чисел наугад выбирают 120 чисел. Доказать, что их сумма делится на 120.",
        "Решение: По условию задачи каждое слагаемое имеет вид Ai = 10108ai + X, где ai – 12-значное число, а X – 108-значное, причём число X одно и то же для всех слагаемых.  Ai = 120X + 10108ai,  то есть достаточно доказать, что число 10108ai делится на 120. Но 120 = 3·40, а число 10108 делится на 40. Следовательно, достаточно доказать, что ai делится на 3. Поскольку числа ai отличаются только перестановкой цифр, а остаток от деления числа на 3 равен остатку от деления на 3 его суммы цифр, остатки от деления на 3 у всех слагаемых одинаковы. Но сумма кратного 3 числа слагаемых, дающих одинаковый остаток при делении на 3, делится на 3."
    ],
    "78616": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Доказать, что существует число",
        "Решение: Докажем индукцией по"
    ],
    "78737": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Дано 999-значное число. Известно, что если взять из него любые 50 последовательных цифр и вычеркнуть все остальные, то полученное число будет делиться на 250. (Оно может начинаться с нулей или просто быть нулём.)  Доказать, что исходное число делится на 2999.",
        "Решение: Пусть данное число n равно a1a2...a999. По условию числа a1...a50 и a2...a51 делятся на 250. Значит, и число 10·a1...a50 – a2...a51 = 1050a1 – a51 делится   на 250. Следовательно, a51 = 0. Аналогично докажем, что a51 = ... = a999 = 0. Поэтому n = 10949·a1...a50 делится на 2949+50 = 2999."
    ],
    "78789": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Дано 29-значное число X = a1...a29 (0 ≤ ak ≤ 9, a1 ≠ 0). Известно, что для всякого k цифра ak встречается в записи данного числа a30–k раз (например, если a10 = 7, то цифра a20 встречается семь раз). Найти сумму цифр числа X.",
        "Решение: Разобьём все числа на пары (",
        "Ответ: 201."
    ],
    "79547": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Найдите все натуральные числа x, удовлетворяющие условиям: произведение цифр числа x равно 44x – 86868, а сумма цифр является кубом натурального числа.",
        "Решение: Пусть an...a0 – десятичная запись числа a. Тогда  a ≥ an·10n ≥ anan−1·9n ≥ anan−1...a0. Отсюда следует, что x ≥ 44x − 86868, откуда x ≤ 2020. С другой стороны, произведение цифр любого числа неотрицательно, а значит, 44x ≥ 86868, откуда x ≥ 1975. Для чисел от 2000 до 2020 произведение цифр равно нулю, что не может быть равно 44x − 86868 (так как 86868 не делится на 44). Следовательно, 1975 ≤ x ≤ 1999, а значит, сумма цифр числа x не меньше 1 + 9 = 10 и не больше 1 + 9 + 9 + 9 = 28. В этом промежутке есть только один точный куб, следовательно, сумма цифр числа x равна 27, а значит, либо x = 1989, либо x = 1998. В обоих случаях произведение цифр равно 1·9·9·8 = 648. Следовательно, 44x = 86868 + 648 = 87516, откуда  x = 1989."
    ],
    "79612": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Каких нечётных натуральных чисел n < 10000 больше: тех, для которых число, образованное четырьмя последними цифрами числа n9, больше n, или тех, для которых оно меньше n?",
        "Решение: Пусть N – число, образованное последними четырьмя цифрами числа n9, где n – нечётное число, меньшее 10000. Заметим, что число, образованное последними четырьмя цифрами числа    совпадает с числом 10000 − N. Кроме того, N > n тогда и только тогда, когда 10000 − N < 10000 − n. Следовательно, число n принадлежит первому множеству тогда и только тогда, когда число 10000 − n принадлежит второму множеству. Значит, чисел в этих множествах поровну.",
        "Ответ: Поровну."
    ],
    "103004": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Припишите к числу 10 справа и слева одну и ту же цифру так, чтобы полученное четырёхзначное число делилось на 12.",
        "Решение: Пусть приписана цифра а. Тогда полученное число запишется в виде а10а. Поскольку это число делится на 12, то оно должно делиться и на 4, и на 3. Это в свою очередь означает, что а делится на 4, а 2а + 1 делится на 3. Это возможно лишь при а = 4.",
        "Ответ: 4104."
    ],
    "116793": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 5,6",
        "Условие: Коля утверждает, что можно выяснить, делится ли на 101 сумма всех четырёхзначных чисел, в записи которых нет ни цифры 0, ни цифры 9, не вычисляя самой суммы. Прав ли Коля?",
        "Решение: Парным к числу, составленному из цифр a, b, c, d, назовём число, составленное из цифр 9 – a, 9 – b, 9 – c, 9 – d, поставленных в том же порядке. Так все четырёхзначные числа, удовлетворяющие указанным условиям, разбиваются на пары, сумма чисел в которых равна 9999. Значит, сумма всех таких чисел будет кратна 9999 = 99·101.",
        "Ответ: Прав."
    ],
    "78188": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: На какое целое число надо умножить",
        "Решение: Запишем число 999999999 в виде"
    ],
    "30645": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Найдите все трехзначные числа, каждая натуральная  степень которых оканчивается на три цифры, составляющие  первоначальное число.",
        "Решение: 625 и 376."
    ],
    "30647": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Докажите, что все числа ряда",
        "Решение: Домножьте число на 1111 и докажите, что результат \t\t\t\tделится на число вида 1000 ...001."
    ],
    "30834": [
        "Системы счисления",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Сформулируйте (и докажите) условие, позволяющее определить четность числа по его записи",
        "Решение: Число четно тогда и только тогда, когда а) в его троичной записи четное число единиц (сумма цифр четна). б) его"
    ],
    "30839": [
        "Системы счисления",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Какое наименьшее число гирь необходимо для того,  чтобы иметь возможность взвесить любое число граммов от 1 до 100  на чашечных весах, если гири можно класть только на одну чашку  весов?",
        "Решение: Любое число можно записать в двоичной системе счисления.  Поэтому для взвешивания любого числа граммов от 1 до 100 достаточно иметь семь гирь с весами: 1, 2, 4, 8, 16, 32, 64. Шестью гирями обойтись нельзя, так как с их помощью можно взвесить не более 2"
    ],
    "35374": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Дано натуральное число M. Докажите, что существует число,    кратное M, сумма цифр которого (в десятичной записи)    нечетна.",
        "Подсказка: Удобно рассуждать от противного. Исследуйте, как меняется сумма    цифр в суммировании двух чисел столбиком при переносе через разряд.",
        "Решение: Допустим противное, пусть число M и все кратные числу M имеют  четную сумму    цифр. Если десятичная запись M оканчивается нулями, все их    можно  отбросить,  отбросив столько же нулей и у всех кратных M.    Это на сумму цифр не влияет. Итак, пусть M не оканчивается    нулями.    Рассмотрим сначала случай, когда предпоследняя цифра M - не    девятка. Пусть запись числа M содержит n знаков.    Можно найти число из n+1 цифры, делящееся на M, десятичная запись    которого начинается с данной цифры b.    В самом деле, среди 10"
    ],
    "103015": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6",
        "Условие: Отличник Поликарп составил огромное число, выписав натуральные числа от 1 до 500: 123…1011…499500. Двоечник Колька стер у этого числа первые 500 цифр. Как Вы думаете, с какой цифры начинается оставшееся число?",
        "Подсказка: Колька стирал цифры, а Поликарп записывал числа — однозначные, двузначные, трехзначные.",
        "Решение: Из 500 цифр, стертых Колькой, на однозначные числа уйдет 9 цифр, значит, на остальные останется 491 цифра. На двузначные числа уйдет 90×2=180 цифр, значит, на остальные останется 311 цифр. Из этого количества цифр получится 103 трехзначных числа и еще две цифры от 104-го. Это значит, что интересующая нас цифра — 3-я цифра 104-го трехзначного числа. Это число 203, значит искомая цифра 3."
    ],
    "103018": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6",
        "Условие: Попробуйте найти два числа, идущих подряд; у первого из которых сумма цифр равна 8, а второе делится на 8.",
        "Подсказка: Подумайте, что можно сказать о сумме цифр числа, если сумма цифр предыдущего равна 8.",
        "Решение: У второго числа сумма цифр будет равна 9 (перехода через девятку быть не может, так как в первом числе нет цифры 9). Наименьшее число, кратное как 9 (сумма цифр равна 9), так и 8 (по условию), это 72. У предыдущего числа 71 сумма цифр равна 8.",
        "Ответ: 71 и 72."
    ],
    "76507": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Найти трёхзначное число, всякая целая степень которого оканчивается на три цифры, составляющие исходное число (в том же порядке).",
        "Решение: Ответ:",
        "Ответ: N"
    ],
    "78258": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Доказать, что среди любых 39 последовательных натуральных чисел обязательно найдётся такое, у которого сумма цифр делится на 11.",
        "Решение: Предположим, что утверждение задачи не верно. Обозначим сумму цифр числа"
    ],
    "78623": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Число Y получается из натурального числа X некоторой перестановкой его цифр. Известно, что X + Y = 10200. Доказать, что X делится на 50.",
        "Решение: Лемма. Пусть число Y получается из числа X некоторой перестановкой его цифр и X + Y = 10k. Тогда оба числа X и Y кратны 5.    Доказательство. Если X оканчивается нулем, то все очевидно. Пусть последняя цифра числа X не 0, тогда и последняя цифра числа Y – не 0. Набор цифр числа Y – 1 отличается от  набора цифр числа Y (а значит, и числа X) только в последней  цифре a (Y – 1 оканчивается на a, а Y – на a + 1), а сумма  X + (Y – 1) = 9...9. Заметим, что для каждого k = 0, 1, ..., 9 количество цифр k в числе X  равно количеству цифр 9 – k в числе Y – 1 (каждой цифре k числа X можно поставить в соответствие цифру числа Y – 1, стоящую в том же разряде. В частности, количество цифр 9 – a в числе X равно количеству цифр a в числе Y – 1, а значит, на единицу больше количества цифр a в числе X. С другой стороны, количество цифр a в числе X равно количеству цифр 9 – a в числе Y – 1. Таким образом, количество цифр 9 – a в числе X на единицу больше количества этих цифр в числе Y – 1, а значит, 9 – a = a + 1, откуда a = 4, то есть последняя цифра числа X – это 5."
    ],
    "79325": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Доказать, что существует такое натуральное число n, большее 1000, что сумма цифр числа 2n больше суммы цифр числа 2n+1.",
        "Решение: Заметим, что     1) остатки чисел 1, 2, 2², 2³, ... при делении на 9 образуют периодическую последовательность 1, 2, 4, 8, 7, 5, 1, 2, ...;     2) количество цифр в числе 2n не превосходит   lg 2n + 1 = n lg 2 + 1 ≤ n/3 + 1.     Обозначим через S(a) сумму цифр числа a. Предположим, что S(2n) ≤ S(2n+1) для всех n, не меньших некоторого N, то есть что для всех n ≥ N последовательность S(2n) не убывает. Тогда согласно 1) для n ≥ N при переходе от 2n к 2n+6 (за один период) сумма цифр увеличивается не меньше, чем на 1 + 2 + 4 + 8 + 7 + 5 = 27. Действительно, если a даёт при делении на 9 остаток 8, b – остаток 7 и a < b, то разность b − a не меньше 8, а сумма цифр числа имеет тот же остаток при делении на 9, что и само число. Итак, S(2n+6) ≥ S(2n) + 27. Значит, при  n = N + 6k S(2n) = S(2N+6k) ≥ S(2N) + 27k = 9/2 n − 9/2 N + S(2N).    Поскольку все цифры не больше 9, согласно 2), S(2n) ≤ 9(n/3 + 1). Таким образом, при всех n = N + 6k выполнено неравенство 9/2 n − A ≤ S(2n) ≤ 3n + 9 (где A – число, не зависящее от n). Но поскольку 9/2 > 3, это, очевидно, неверно. Противоречие."
    ],
    "79454": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Является ли чётным число всех 64-значных натуральных чисел, не содержащих в  записи нулей и делящихся на 101?",
        "Решение: Рассмотрим число A = 0. Оно делится на 1111 = 11·101, поэтому A делится на 101. Сопоставим каждому 64-значному числу n = a1a2...a64, не содержащему в записи нулей и делящемуся на 101, число A – n = (10 – a1)(10 – a2)...(10 – a64). Это число тоже не содержит в записи нулей и делится на 101. Равенство n = A – n возможно лишь в том случае, когда &nbspn = . Остальные рассматриваемые числа разбиваются на пары. Поэтому общее количество всех таких чисел нечётно.",
        "Ответ: Не является."
    ],
    "86122": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: К некоторому натуральному числу справа последовательно приписали два двузначных числа. Полученное число оказалось равным кубу суммы трёх исходных чисел. Найдите все возможные тройки исходных чисел.",
        "Решение: Обозначим через  a  первое натуральное число, а через  b и c записанные за ним двузначные числа. Пусть x = a + b + c. По условию   104a + 100b + c = x³.     Если x ≥ 100, то x³ ≥  104x = 104(a + b + c) > 104a + 100b + c, то есть уравнение не имеет решений.     Следовательно, x – двузначное число, a – либо однозначное, либо двузначное число, а x³ – пяти- либо шестизначное число. Кроме того, x ≥ 22   (21³ = 9261 – четырёхзначное число).     Заметим, что число x³ − x = 9999a + 99b делится на 99. Так как x³ − x = x(x − 1) (x + 1), то среди чисел x − 1, x, x + 1 какое-то делится на 9 и какое-то на 11. Поскольку 22 ≤ x ≤ 99, возможны следующие случаи:    1) x = 44 (x + 1 = 45), 44³ = 85184, 8 + 51 + 84 > 44;    2) x = 45 (x − 1 = 44), 45³ = 91125, a = 9, b = 11, c = 25;     3) x = 54 (x + 1 = 45), 54³ = 157464, 15 + 74 + 64 > 54;    4) x = 55, (x − 1 = 54), 55³ = 166375, 16 + 63 + 75 > 55;    5) x = 89, (x − 1 = 88, x + 1 = 90), 89³ = 704969, 70 + 49 + 69 > 89;    6) x = 98, (x + 1 = 99), 98³ = 941192, 94 + 11 + 92 > 98;    7) x = 99, x³ = 970299, 2 – не двузначное число.",
        "Ответ: 9, 11, 25."
    ],
    "88081": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Напишите встрочку первые 10 простых чисел. Как вычеркнуть 6цифр, чтобы получилось наибольшее возможное число?",
        "Подсказка: Заметьте, первые 10простых чисел составят 16-значное  число.",
        "Решение: Вот первые десять простых чисел, записанных подряд:   2357111317192329",
        "Ответ: Получится число 7317192329."
    ],
    "104075": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Цифры трёхзначного числа A записали в обратном порядке и получили число B. Может ли число, равное сумме A и B, записываться только нечётными цифрами?",
        "Решение: Пусть, например, A = 219. Тогда B = 912, A + B = 1131.",
        "Ответ: Да, может."
    ],
    "88297": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Кащей Бессмертный загадывает три натуральных числа:",
        "Решение: Первые числа Иван Царевич может задать"
    ],
    "104079": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: У двузначного числа первая цифра вдвое больше второй. Если к этому числу прибавить квадрат его первой цифры, то получится квадрат некоторого целого числа. Найдите исходное двузначное число.",
        "Решение: Первая цифра в два раза больше второй только у следующих двузначных чисел: 21, 42, 63 и 84. Проверкой убеждаемся, что условию задачи удовлетворяет только число 21.",
        "Ответ: 21.00"
    ],
    "30278": [
        "Двоичная система счисления",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Как разложить по семи кошелькам 127 рублевых  бумажек так, чтобы любую сумму от 1 до 127 рублей можно было бы  выдать, не открывая кошельков?",
        "Решение: 127 бумажек надо разложить так: 1 + 2 + 4 + 8 + 16 + 32 + 64."
    ],
    "30621": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: К числу 15 припишите слева и справа по одной цифре так, чтобы полученное число делилось на 15.",
        "Ответ: 1155, 4155, 7155, 3150, 6150 или 9150."
    ],
    "30622": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Сколько имеется четырёхзначных чисел, которые делятся на 45, а две средние цифры у них – 97?",
        "Ответ: Два числа: 6975 и 2970."
    ],
    "35248": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 8,9,10",
        "Условие: Докажите, что произведение цифр любого натурального числа,    большего 9, меньше самого числа.",
        "Подсказка: Оцените произведение цифр, заменив каждую цифру, кроме первой,   десяткой.",
        "Решение: Пусть число N записывается в десятичной записи цифрами   a"
    ],
    "65953": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Сколько существует восьмизначных чисел, в записи которых цифры идут в порядке убывания?",
        "Решение: См. задачу 60402.",
        "Ответ: 45 чисел."
    ],
    "78698": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 10",
        "Условие: Найти все натуральные числа x, обладающие следующим свойством: из каждой  цифры числа x можно вычесть одну и ту же цифру a ≠ 0 (все цифры его не меньше a) и при этом получится (x − a)².",
        "Решение: Заметим, что из числа x вычитается не менее чем a. Следовательно, x − a ≥ (x − a)², откуда x − a = 0 или x − a = 1. Таким образом, описанным в условии задачи свойством обладают только числа от 1 до 9.",
        "Ответ: 1, 2, 3, 4, 5, 6, 7, 8, 9."
    ],
    "86490": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Вася задумал три различные цифры, отличные от нуля. Петя записал все возможные двузначные числа, в десятичной записи которых использовались только эти цифры. Сумма записанных чисел равна 231. Найдите цифры, задуманные Васей.",
        "Решение: Пусть а,",
        "Ответ: Вася задумал цифры 1; 2 и 4."
    ],
    "86510": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Дано число: 123456789101112... . Какая цифра стоит на 2000-м месте?",
        "Решение: Найдем, с какого момента в десятичную запись данного числа начнут входить трехзначные числа:",
        "Ответ: Искомая цифра — 0."
    ],
    "88142": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Найдите наибольшее шестизначное число, укоторого каждая цифра, начиная стретьей, равна сумме двух предыдущихцифр.",
        "Подсказка: Заметьте, когда вдвух числах количество цифр совпадает, тобольше будет то,укоторого больше первая цифра.",
        "Решение: Если первая буква была",
        "Ответ: 303369."
    ],
    "88002": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Незнайка взял у Пилюлькина книжку и сосчитал, сколько понадобилось цифр, чтобы пронумеровать все страницы, начиная с первой. У него получилось 100 цифр. Могло ли так быть, или Незнайка ошибся? Если могло, скажите, сколько было страниц.",
        "Подсказка: Заметьте, номер последней страницы – двузначное число.",
        "Решение: При этих условиях номер последней страницы – двузначное число (количество  цифр во всех двузначных и однозначных числах равно 9 + 90×2 > 100). Но все однозначные страницы дадут 9 цифр, то есть нечётное число, а добавление любого количества страниц с двузначным номером прибавит чётное число цифр, то есть оставит количество цифр нечётным.",
        "Ответ: Незнайка ошибся."
    ],
    "88062": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Изкниги выпала часть. Первая извыпавших страниц имеет номер 387, аномер последней состоит изтехже цифр, нозаписанных вдругом порядке. Сколько листов выпало изкниги?",
        "Подсказка: Заметьте, когда изкниги выпадает часть, топервая извыпавших страниц имеет нечётный номер, апоследняя— чётный.",
        "Решение: Когда изкниги выпадает часть, первая извыпавших страниц имеет нечётный номер, апоследняя— чётный (каждая страница нумеруется сдвух сторон, инаеё нумерацию требуются два числа). Значит, последняя цифра последнего номера страницы— 8, т.е. номер страницы либо 378, либо 738; но378 неможет быть, поскольку 378 < 387 (последняя страница неможет иметь номер меньше, чем первая). Следовательно, остаётся единственная возможность— номер последней страницы 738. Это значит, что изкниги выпало",
        "Ответ: 176листов."
    ],
    "88270": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 5,6,7",
        "Условие: Найдите двузначное число, которое вдвое больше произведения своих цифр.",
        "Решение: Обозначим искомое число через 10a + b, тогда 10a + b = 2ab.     Это равенство может выполняться только при чётном b > 0. Заменив b на 2c, получим 5a + c = 2ac, или 5a = (2a – 1)c.     Поскольку b < 10, то c < 5. Значит, 2a – 1 делится на 5, а c делится на a. Поэтому a < 5, то есть a = 3, откуда c = 3, b = 6.",
        "Ответ: 36."
    ],
    "88276": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Существуетли трехзначное число, равное произведению своихцифр?",
        "Подсказка: Вспомните задачу238.",
        "Решение: Нет, несуществует. Для доказательства представим искомое число ввиде",
        "Ответ: Нет. Все трехзначные числа больше произведения своих цифр."
    ],
    "88315": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Докажите, что в десятичной записи  чисел 19902003 и 19902003 + 22003 одинаковое число цифр.",
        "Решение: Число 19902003 оканчивается на 2003 нуля, а 22003 < 102003, то есть в числе 22003 менее 2003 цифр."
    ],
    "89946": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Найти числа, равные удвоенной сумме своих цифр.",
        "Решение: 10х + у = 2(х + у). Или 8х = у. Поскольку y – цифра, то единственный ответ – 18.",
        "Ответ: 18."
    ],
    "102840": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Сумма пяти чисел равна 200. Докажите, что их произведение не может оканчиваться на 1999.",
        "Решение: Сумма пяти нечётных слагаемых нечётна. Значит, по крайней мере, одно число чётно. Поэтому произведение чисел чётно и не может оканчиваться на 9."
    ],
    "102843": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 6,7",
        "Условие: Существуют ли такие двузначные числа ab, cd, что ab·cd = abcd.",
        "Решение: Допустим, что равенство верно, и преобразуем его:  ab·cd = abcd = ab·100 + cd > ab·cd + cd. Противоречие.",
        "Ответ: Не существуют."
    ],
    "88143": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Найдите наибольшее число, укоторого каждая цифра, начиная стретьей, равна сумме двух предыдущихцифр.",
        "Подсказка: Заметьте, издвух чисел больше то,вкотором большецифр.",
        "Решение: Казалосьбы, эта задача очень похожа напредыдущую, однако решение совсем другое. Число будет тем больше, чем больше внём цифр. Авсего цифр будет тем больше, чем меньше первые две цифры. Проверим. Если первые цифры1 и0, тополучаем 10112358. Если первые цифры будут1 и1, тополучим 112358, если2 и0, тополучим 202246. Итак, искомое число 10112358.",
        "Ответ: 10112358."
    ],
    "116779": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 5,6",
        "Условие: В каком году установлен памятник Юрию Долгорукому, если в записи этого числа последняя цифра на единицу меньше предыдущей и при зачеркивании первой и последней цифры получается наибольшее двузначное число с суммой цифр 14?",
        "Ответ: В 1954 г."
    ],
    "76503": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Двузначное число в сумме с числом, записанным теми же цифрами, но в обратном порядке, даёт полный квадрат. Найти все такие числа.",
        "Решение: Ответ:",
        "Ответ: a"
    ],
    "78169": [
        "Двоичная система счисления",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Пусть",
        "Решение: Рассмотрим двоичную запись числа"
    ],
    "86486": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Назовем натуральное число замечательным, если оно самое маленькое среди натуральных чисел с такой же, как у него, суммой цифр. Чему равна сумма цифр две тысячи первого замечательного числа?",
        "Решение: Так как все замечательные числа в десятичной записи имеют различные суммы цифр, то две тысячи первое замечательное число имеет сумму цифр 2001.",
        "Ответ: 2001"
    ],
    "86513": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Назовём натуральное число замечательным, если оно – самое маленькое среди всех натуральных чисел с такой же, как у него, суммой цифр.   Сколько существует трёхзначных замечательных чисел?",
        "Решение: Замечательные числа с суммой цифр от 1 до 18 – однозначные или двузначные. Поэтому замечательные трёхзначные числа имеют сумму цифр от 19 до 27. Каждой такой сумме соответствует одно замечательное число. Следовательно, трёхзначных замечательных чисел – девять.",
        "Ответ: 9 чисел."
    ],
    "88303": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 6,7",
        "Условие: Все натуральные числа, начиная с единицы, записаны в порядке возрастания 1234567891011121314…… . Какая цифра стоит на сотом месте, а какая на тысячном?",
        "Решение: В начале идет 9 однозначных чисел, затем 90 — двузначных чисел (180 цифр)."
    ],
    "88229": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Найдите двузначное число, которое в5раз больше суммы своих цифр.",
        "Подсказка: Обратите внимание: искомое число должно делиться на5.",
        "Решение: Число, которое в5раз больше суммы своих цифр, должно делиться на5. Значит, оно оканчивается на0 или на5. Однако на0 оно оканчиваться неможет, ибо вэтом случае будет в10раз больше суммы своих цифр. Итак, искомое число можно записать ввиде 10",
        "Ответ: 45."
    ],
    "109480": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 5,6,7,8",
        "Условие: Четырехзначное число начинается с цифры 6. Эту цифру переставили в конец числа.  Полученное число оказалось на 1152 меньше исходного. Найдите исходное число.",
        "Решение: Запишем условие задачи в виде ребуса, например:",
        "Ответ: 6538.00"
    ],
    "30833": [
        "Системы счисления",
        "Сложность: 3",
        "Классы: 8",
        "Условие: Существует ли система счисления, в которой одновременно",
        "Решение: а) Да (7-ричная система счисления). \t\t\t\tб) Нет.  Второе равенство могло бы выполняться только в 5-ричной \t\t\t\t   системе счисления."
    ],
    "88263": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 5,6,7",
        "Условие: Написано 1992-значное число. Каждое двузначное число, образованное соседними цифрами, делится на17 или на23. Последняя цифра числа 1. Какова первая?",
        "Подсказка: Попробуйте рассмотреть все двузначные числа, делящиеся на17 или 23. Вспомните задачу41.",
        "Решение: Выпишем все двузначные числа, делящиеся на17 или23. Это17, 34, 51, 68, 85, 23, 46, 69, 92. Увсех этих чисел последние цифры различны, значит, искомое число мы сможем восстановить однозначно.  Последняя цифра 1, значит, соответствующее двузначное чисто 51, т.е. предыдущая цифра вчисле 5. Эта цифра 5 соответствует двузначному числу 85, следовательно, перед ней стоит цифра 8. Рассуждая аналогично, получим ряд издевяти последних цифр числа: 692346851. Набор 92346 будет теперь всё время повторяться. Всегоже цифр 1992, втом числе: 3 последние, наши 5цифр изпериода, встречающиеся 397раз, иещё 4цифры— последние 4цифры периода, ониже— первые 4цифры числа. Таким образом, первая цифра искомого числа2.",
        "Ответ: Цифра2."
    ],
    "89939": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: И сказал Кощей Ивану-Царевичу: «Жить тебе до завтра. Утром явишься пред мои очи, задумаю я три цифры —",
        "Подсказка: Заметьте, Кощей задумал не числа, а цифры.",
        "Решение: Поскольку Кощей задумал цифры, Иван-Царевич может назвать, например, числа 100, 10 и 1."
    ],
    "109462": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Из натурального числа вычли сумму его цифр и получили 2007. Каким могло быть исходное число?",
        "Решение: Несложно убедиться, что искомое число должно быть четырехзначным. Пусть оно равно",
        "Ответ: любое натуральное число от 2010 до 2019."
    ],
    "30612": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Сформулируйте и докажите признаки делимости на 2n и 5n.",
        "Ответ: Число делится на 2"
    ],
    "30613": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Последняя цифра квадрата натурального числа равна 6. Докажите, что его предпоследняя цифра нечётна.",
        "Решение: Так как последняя цифра 6, то возводимое в квадрат число чётно. Раз оно является квадратом, то оно делится и на 4. Следовательно, число, составленное из двух его последних цифр, должно делиться на 4. Все требуемые двузначные числа легко выписать: 16, 36, 56, 76, 96."
    ],
    "31232": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Число x оканчивается на 5. Доказать, что x² оканчивается на 25."
    ],
    "30620": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Докажите, что если записать в обратном порядке цифры\tлюбого натурального числа, то разность исходного и нового числа будет делиться на 9.",
        "Решение: Эти числа имеют одинаковые суммы цифр и, значит, одинаковые остатки по модулю 9."
    ],
    "30623": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Найдите наименьшее натуральное число, делящееся на 36, в записи которого встречаются все 10 цифр.",
        "Ответ: 1023457896."
    ],
    "88288": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Кащей Бессмертный загадывает три двузначных числа:",
        "Решение: Иван Царевич может назвать числа"
    ],
    "103744": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 6",
        "Условие: Найдите числа, равные удвоенной сумме своих цифр.",
        "Подсказка: Если первая цифра двузначного числа равна",
        "Решение: Легко заметить, что однозначных чисел, больших нуля, с требуемым свойством нет. Попробуем найти решение среди двузначных чисел.  Если первая цифра двузначного числа равна",
        "Ответ: 0; 18."
    ],
    "116478": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Назовём натуральное семизначное число удачным, если оно делится на произведение всех своих цифр. Существуют ли четыре последовательных удачных числа?",
        "Решение: Предположим, что n, n + 1, n + 2 и n + 3 –  удачные числа. В записи этих чисел не может быть цифры 0 (на 0 делить нельзя), поэтому, эти числа отличаются только последней цифрой, следовательно, одно из них оканчивается либо на 4, либо на 8. Далее можно рассуждать по-разному.",
        "Ответ: Не существуют."
    ],
    "30601": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: а) Может ли квадрат натурального числа оканчиваться на 2?",
        "Подсказка: б) Квадрат может оканчиваться только на цифры 0, 1, 4, 5, 6, 9.",
        "Ответ: а), б) Не может."
    ],
    "30614": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Предпоследняя цифра квадрата натурального числа – нечётная. Докажите, что его последняя цифра – 6.",
        "Решение: Пусть n = ...ab. Тогда n² ≡ (10a + b)² ≡ 20ab + b² (mod 10). Из условия следует, что цифра десятков числа b² нечётна. Прямой перебор показывает, что тогда цифра единиц равна 6."
    ],
    "30617": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Докажите, что любое натуральное число сравнимо с суммой своих цифр по модулю     а) 3;  б) 9.",
        "Решение: Рассмотрим число a1a2...an = 10n–1a1 + 10n–2a2 + ... + 101an–1 + an. Ясно, что 10 ≡ 1 (mod 9). Поэтому 10k ≡ 1 (mod 9). для любого натурального k. Таким образом, 10n–1a1 + 10n–2a2 + ... + 10an–1 + an ≡ a1 + a2 + ... + an–1 + an (mod 9).    \tРассуждения для числа 3 совершенно аналогичны."
    ],
    "30635": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Сумма двух цифр a и b делится на 7. Докажите, что число aba также делится на 7.",
        "Решение: aba = 101a + 10b = 7(14a + b) + 3(a + b)."
    ],
    "30639": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Существует ли такое трехзначное число",
        "Решение: Нет, не существует."
    ],
    "30640": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Найдите наименьшее число, записываемое одними  единицами, делящееся на",
        "Решение: Запись этого числа состоит из 300 единиц."
    ],
    "30611": [
        "Десятичная система счисления",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Докажите, что a1a2...an–1an ≡ an–1an (mod 4).",
        "Подсказка: Все степени числа 10, начиная с 10², делятся на 4."
    ],
    "30642": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Найдите все натуральные числа, которые  увеличиваются в 9 раз, если между цифрой единиц и цифрой десятков  вставить ноль.",
        "Решение: Запишем наше число в виде"
    ],
    "30836": [
        "Системы счисления",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Один школьный учитель заявил, что у него в классе 100  детей, из них 24 мальчика и 32 девочки.  Какой системой  счисления он пользовался?",
        "Решение: Пусть",
        "Ответ: 6"
    ],
    "35101": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Докажите, что все числа вида 1156, 111556, 11115556,...  являются точными квадратами.",
        "Подсказка: Посчитав корни из нескольких первых чисел данного ряда,  можно усмотреть закономерность.",
        "Решение: Пусть количество цифр в числе n=11...15..56 равно 2k.  Тогда n=1111...1+44...4+1, где в первом слагаемом количество  единиц равно 2k, во втором слагаемом количество четверок равно k.  Число, которое записывается с помощью m единиц, равно  (10"
    ],
    "35780": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Существуют ли два последовательных натуральных числа, сумма цифр каждого из которых делится на 7?",
        "Подсказка: Если при переходе от числа n к числу n + 1 переносится k разрядов, то сумма цифр при этом меняется на 1 – 9k.",
        "Решение: Например, числа 69999 и 70000.",
        "Ответ: Существуют."
    ],
    "64508": [
        "Троичная система счисления",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: В сумме + 1 + 3 + 9 + 27 + 81 + 243 + 729 можно вычеркивать любые слагаемые и изменять некоторые знаки перед оставшимися числами с + на –. Маша хочет таким способом сначала получить выражение, значение которого равно 1, затем, начав сначала, получить выражение, значение которого равно 2, затем (снова начав сначала) получить 3, и так далее. До какого наибольшего целого числа ей удастся это сделать без пропусков?",
        "Решение: Каждое целое число можно записать в виде суммы степеней тройки с коэффициентами 0, 1 и –1 вместо обычных 0, 1 и 2 (см. задачу 30840). Следовательно, Маша сумеет получить все целые числа от 1 до 1 + 3 + 9 + 27 + 81 + 243 + 729 = 1093.",
        "Ответ: До числа 1093 (включительно)."
    ],
    "64679": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Петя записал на компьютере число 1. Каждую секунду компьютер прибавляет к числу на экране сумму его цифр.   Может ли через какое-то время на экране появиться число 123456789?",
        "Решение: См. задачу 97863.",
        "Ответ: Не может."
    ],
    "64890": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Существует ли такая цифра а, что aaa(a–1) = (а – 1)а–2.",
        "Решение: При a = 7 получим верное равенство 7776 = 65.",
        "Ответ: Существует."
    ]
}