{
    "88242": [
        "Простые числа и их свойства",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Докажите, что любое простое число, большее 3, можно записать в одном из двух видов: 6n + 1 либо 6n – 1, гдеn – натуральное число.",
        "Подсказка: Какие остатки при делении на 6 может давать простое число, большее 3?",
        "Решение: Простое число, большее 3, при делении на 6 не может давать остатки 0, 2, 3, 4 – в любом из этих случаев оно будет составным. Возможны только остатки 1 и 5."
    ],
    "34835": [
        "Простые числа и их свойства",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Является ли число 49 + 610 + 320 простым?",
        "Подсказка: Это число – полный квадрат.",
        "Решение: 49 + 610 + 320 = (29)2 + 2·29·310 + (310)2 = (29 + 310)2.",
        "Ответ: Не является."
    ],
    "36910": [
        "Сумма углов треугольника. Теорема о внешнем угле.",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: Существует ли треугольник, градусная мера каждого угла которого выражается простым числом?",
        "Решение: Так как сумма углов треугольника равна 180°, то градусные меры всех углов треугольника не могут выражаться нечётными числами. Следовательно, градусная мера одного из углов равна 2°. Остается подобрать два простых числа, сумма которых равна 178.    Вот все возможные примеры: 5 + 173, 11 + 167, 29 + 149, 41 + 137, 47 + 131, 71 + 107, 89 + 89.",
        "Ответ: Существует."
    ],
    "88069": [
        "Делимость чисел. Общие свойства",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Известно, что p > 3 и p – простое число. Как вы думаете:     а) будут ли чётными числа p + 1 и p – 1;     б) будет ли хотя бы одно из них делиться на 3?",
        "Решение: а) Поскольку p – простое, то оно нечётно, а среди трёх последовательных чисел p – 1, p, p + 1, одно обязательно делится на 2, но это не p. Значит, ответ положительный.",
        "Ответ: а) Будут; б) будет."
    ],
    "88079": [
        "Четность и нечетность",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Найдите два таких простых числа, что и их сумма, и их разность – тоже простые числа.",
        "Решение: Если оба числа нечётны, то и сумма их, и разность будут чётны, а чётное простое число всего одно. Это значит, что среди искомых простых чисел обязательно одно чётное, то есть равно 2. Поэтому разность, второе число и сумма являются последовательными нечётными числами. Среди таких чисел одно обязательно делится на 3. Значит, одно из них равно 3. Итак, одно из чисел равно 2, разность (или сумма) равна 3. Единственная возможность – искомые числа 2 и 5.",
        "Ответ: 2 и5."
    ],
    "88274": [
        "Деление с остатком",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Может ли сумма трёх последовательных натуральных чисел быть простым числом?",
        "Решение: Сумма трех последовательных натуральных чисел кратна 3 и больше 3. Действительно, n + (n + 1) + (n + 2) = 3(n + 1).",
        "Ответ: Не может."
    ],
    "116144": [
        "Разложение на множители",
        "Сложность: 2",
        "Классы: 7,8,9",
        "Условие: Найдите все пары простых чисел, разность квадратов которых является простым числом.",
        "Решение: Пусть p и q – простые числа и p² – q² = (p – q)(p + q) – простое число. Тогда p – q = 1. Следовательно, одно из наших чисел чётно, то есть q = 2, p = 3.",
        "Ответ: (3, 2)."
    ],
    "30300": [
        "Четность и нечетность",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Можно ли составить магический квадрат из первых 36 простых чисел? Магический квадрат – это квадратная таблица, заполненная числами, в которой суммы чисел во всех строках и столбцах равны.",
        "Решение: См. решение задачи 104082.",
        "Ответ: Нельзя."
    ],
    "31259": [
        "Делимость чисел. Общие свойства",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: В государстве имеют хождение монеты в один золотой и  в  один грош, причём один золотой составляет 1001 грошей.   Можно ли,  имея 1986 золотых,  купить  без  сдачи  несколько  предметов  по  1987 грошей?",
        "Решение: 1987 – простое число, поэтому 1001n не делится на 1987 при n ≤ 1986.",
        "Ответ: Нельзя."
    ],
    "31268": [
        "Арифметика остатков (прочее)",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: p и q – простые числа, большие 3. Доказать, что p² – q² делится на 24.",
        "Решение: См. задачу 30378 б)."
    ],
    "60454": [
        "Простые числа и их свойства",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Найдите все простые числа, которые отличаются на 17.",
        "Подсказка: Такие числа имеют разную чётность.",
        "Ответ: 2 и 19."
    ],
    "35288": [
        "Делимость чисел. Общие свойства",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Доказать, что произведение n первых простых чисел не является полным квадратом.",
        "Подсказка: Среди первых простых чисел только одно чётное число 2.",
        "Решение: Произведение n первых простых чисел делится на 2 и не делится на 4, следовательно, не может быть полным квадратом."
    ],
    "78028": [
        "Разные задачи на разрезания",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Найти все прямоугольники, которые можно разрезать на 13 равных квадратов.",
        "Решение: Квадраты, на которые разрезан прямоугольник, по условию равны. Поэтому каждая  сторона прямоугольника разбита на равные части: одна сторона на m частей, а  другая на n. Общее число квадратов равно mn, поэтому mn = 13. Но число 13 простое, поэтому одно из чисел m и n равно 1, а другое равно 13.",
        "Ответ: Прямоугольники с отношением сторон 13 : 1."
    ],
    "116467": [
        "Математическая логика (прочее)",
        "Сложность: 2+",
        "Классы: 5,6",
        "Условие: Четверо ребят обсуждали ответ к задаче.    Коля сказал: Это число 9.    Роман: Это простое число.    Катя: Это четное число.    А Наташа сказала, что это число делится на 15.  Один мальчик и одна девочка ответили верно, а двое остальных ошиблись. Какой ответ в задаче на самом деле?",
        "Решение: Если Коля ответил верно, то обе девочки ошиблись, так как число 9 нечётное и не делится на 15. Значит, верный ответ дал Роман. Но простое число не делится на 15, а единственное чётное простое число – это 2.",
        "Ответ: 2."
    ],
    "31302": [
        "Уравнения в целых числах",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Решить в простых числах уравнение pqr = 7(p + q + r).",
        "Решение: Так как правая часть делится на 7, то одно из чисел равно 7. С точностью до перестановки можно считать, что это r. Задача свелась к решению уравнения p + q + 7 = pq, которое можно записать в виде (p – 1)(q – 1) = 8.    Поскольку ни один из множителей не может равняться 8 (тогда соответствующее простое число равнялось бы 9), то p – 1 = 2, q – 1 = 4 (или наоборот).",
        "Ответ: {3, 5, 7}."
    ],
    "60668": [
        "Треугольник Паскаля и бином Ньютона",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Докажите, что если p – простое число и 1 ≤ k ≤ p – 1, то  делится на p.",
        "Решение: Если 0 < k < p, то (k!(p – k)!, p) = 1, поэтому число p в числителе сократиться не  может."
    ],
    "60718": [
        "Арифметика остатков (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: p – простое число. Для каких чисел a решением сравнения ax ≡ 1 (mod p) будет само число a?",
        "Решение: a² ≡ 1 (mod p) ⇔ (a – 1)(a + 1) ≡ 0 (mod p) ⇔  a – 1 делится на p или a + 1 делится на p.",
        "Ответ: a ≡ ±1 (mod p)."
    ],
    "98653": [
        "Делимость чисел. Общие свойства",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: В семье шестеро детей. Пятеро из них соответственно на 2, 6, 8, 12 и 14 лет старше младшего, причём возраст каждого ребенка – простое число.   Сколько лет младшему?",
        "Подсказка: Может ли возраст младшего ребенка быть чётным числом?",
        "Решение: Возраст младшего ребенка не может быть чётным числом, так как иначе возрасты старших детей не будут простыми числами. Он не может оканчиваться на 1, 3, 7, 9 – иначе возраст одного из старших детей будет делиться на 5. Единственное простое число, удовлетворяющее этим условиям, – 5. Проверка показывает, что если возраст младшего ребенка будет равен 5 годам, возрасты всех старших будут выражаться простыми числами.",
        "Ответ: 5 лет."
    ],
    "102812": [
        "Уравнения в целых числах",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Найти все такие тройки простых чисел x, y, z, что 19x − yz = 1995.",
        "Решение: yz = 19x − 1995 = 19(x − 105).   Поскольку числа y и z – простые, то одно из них (пусть y) равно 19. Тогда z = x − 105. Следовательно, x или z – разной чётности, поэтому z = 2, x = 107.",
        "Ответ: (107, 19, 2), (107, 2, 19)."
    ],
    "60458": [
        "Простые числа и их свойства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что если число n! + 1 делится на n + 1, то n + 1 – простое число.",
        "Решение: Пусть n + 1 – составное число. Если p – некоторый его простой делитель, то p ≤ n. Значит, n! делится на p, а n! + 1 не делится. Противоречие."
    ],
    "107740": [
        "Квадратные уравнения. Теорема Виета",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Известно, что корни уравнения x² + px + q = 0 – целые числа, а p и q – простые числа. Найдите p и q.",
        "Решение: Пусть x1 и x2 – корни нашего квадратного трёхчлена. По условию p и q – положительные числа, поэтому оба корня отрицательны. Так как корни целые, a q – простое, то один из корней (пусть x1) равен –1. Отсюда x2 = – q, –1 – q = – p, то есть p – q = 1. Значит, p и q – два простых числа, отличающиеся на 1. Такая пара чисел всего одна: p = 3, q = 2 (единственное чётное простое число).",
        "Ответ: р = 3, q = 2."
    ],
    "108743": [
        "Деление с остатком",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Доказать, что остаток от деления простого числа на 30 – простое число или единица.",
        "Решение: Представим простое число p в виде p = 30k + r, где r может быть одним из чисел от 1 до 29. Видно, что остаток r не может быть кратен 2, 3 или 5, так как тогда p делилось бы на 2, 3 или 5. После исключения этих чисел во множестве остатков от деления на число 30 остаются лишь простые числа (7, 11, 13, 17, 19, 23, 29) и единица."
    ],
    "30605": [
        "Деление с остатком",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Обозначим через k произведение нескольких (больше одного) первых простых чисел.   Докажите, что число  а) k – 1;  б) k + 1 не является точным квадратом.",
        "Решение: а) k делится на 3, значит, k – 1 = 3n + 2, а квадраты могут давать лишь остатки 0 или 1 при делении на 3."
    ],
    "31256": [
        "Арифметика остатков (прочее)",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: Доказать, что n-е простое число больше 3n при n > 12.",
        "Решение: См. задачу 60474."
    ],
    "31293": [
        "Уравнения в целых числах",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: Решить в целых числах: 1/a + 1/b = 1/c, b и c – простые.",
        "Решение: Согласно задаче 30667 с = b – 1, a = b(b – 1). Поскольку b и с – простые числа, то с = 2, b = 3.",
        "Ответ: (6, 3, 2)."
    ],
    "35611": [
        "Геометрическая прогрессия",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Имеются 100 бесконечных геометрических прогрессий, каждая из которых состоит из натуральных чисел.   Всегда ли можно указать натуральное число, которое не содержится ни в одной из этих прогрессий?",
        "Подсказка: Покажите, что каждая из прогрессий содержит не более одного простого числа.",
        "Решение: Пусть q – знаменатель прогрессии a1,    a2, ..., где все ai – натуральные числа. Тогда q = a2/a1 – число рациональное. Пусть q – нецелое, то есть q = k/m, где числа k и m – взаимно просты и m > 1. Тогда можно найти такую степень t, что a1 не   делится на mt. При этом число at+1 = a1ktm–t не является целым. Это противоречие показывает, что q – натуральное число.      Теперь понятно, что в каждой геометрической прогрессии никакой член, на исключением первого, не может быть простым числом. Таким образом, 100 геометрических прогрессий могут покрыть не более 100 простых чисел из натурального ряда. Поскольку простых чисел бесконечно много, какое-то простое число не принадлежит ни одной из прогрессий.",
        "Ответ: Всегда."
    ],
    "60465": [
        "Делимость чисел. Общие свойства",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: Докажите, что для любого натурального n найдутся n подряд идущих натуральных чисел, среди которых ровно одно простое.",
        "Решение: Согласно задаче 34990 найдутся n подряд идущих составных чисел. Рассмотрим наименьшее простое число p, большее всех этих чисел (такое существует согласно задаче 30410). Тогда числа p – n + 1, p – n + 2, ..., p – 1, p – искомые."
    ],
    "60546": [
        "Количество и сумма делителей числа",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: Число n называется совершенным, если σ(n) = 2n.   Докажите, что если 2k – 1 = p – некоторое простое число Мерсенна, то n = 2k–1(2k – 1) – совершенное число.",
        "Подсказка: Воспользуйтесь формулой для σ(n) из задачи60537."
    ],
    "60671": [
        "Треугольник Паскаля и бином Ньютона",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что если p – простое число, то   (a + b)p – ap – bp делится на p при любых целых a и b.",
        "Подсказка: Воспользуйтесь результатом задачи 60668."
    ],
    "60473": [
        "Простые числа и их свойства",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Верно ли, что многочлен P(n) = n² + n + 41 при всех n принимает только простые значения?",
        "Подсказка: Подставьте n = 40 или n = 41.",
        "Ответ: Неверно."
    ],
    "60746": [
        "Малая теорема Ферма",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Будет ли простым число 2571092 + 1092?",
        "Подсказка: 1093 – простое число.",
        "Решение: По малой теореме Ферма 2571092 + 1092 ≡ 1 – 1 = 0 (mod 1093).",
        "Ответ: Не будет."
    ],
    "65217": [
        "Деление с остатком",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Известно, что остаток от деления некоторого простого числа на 60 равен составному числу. Какому?",
        "Решение: Так как 60 = 2²·3·5, то остаток не может быть кратен числам 2, 3 или 5 (иначе исходное число обладало бы тем же свойством и не могло бы оказаться простым). Так как остаток меньше чем 60 и является произведением хотя бы двух простых множителей, то он равен 7·7. Другие варианты невозможны, поскольку уже следующее произведение двух простых чисел (7·11) больше 60.",
        "Ответ: 49."
    ],
    "65616": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Изначально на экране компьютера – какое-то простое число. Каждую секунду число на экране заменяется на число, полученное из предыдущего прибавлением его последней цифры, увеличенной на 1. Через какое наибольшее время на экране возникнет составное число?",
        "Решение: Пусть изначально на экране – число 2, тогда получим следующую цепочку: 2 – 5 – 11 – 13 – 17 – 25.    Шестое число – составное, значит, в этом случае пройдёт 5 секунд. Докажем, что в остальных случаях потребуется не больше чем 5 секунд.     Действительно, если на экране было нечётное простое число, не оканчивающееся на 9, то его последняя цифра будет изменяться по циклу:   1 – 3 – 7 – 5 – 1. Значит, не позже чем через 4 секунды появится число, оканчивающееся на 5. Так как оно не равно пяти, то является составным.     Если же на экране было простое число, оканчивающееся на 9, то каждую секунду будет прибавляться по 10. Так как 10 при делении на 3 даёт остаток 1, то   прибавив 10 один или два раза, мы обязательно получим число, кратное 3. В этом случае для появления составного числа на экране потребуется не более 2 секунд.",
        "Ответ: Через 5 секунд."
    ],
    "73678": [
        "Делимость чисел. Общие свойства",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Найдите наименьшее натуральное число n, для которого выполнено следующее условие: если число p – простое и n делится на p – 1, то n делится на p.",
        "Решение: Пусть n удовлетворяет этому условию. Поскольку n делится на 1 = 2 – 1, оно должно делиться на 2, но тогда оно делится на 3 = 2 + 1, на   7 = 2·3 + 1 и на 43 = 2·3·7 + 1. Поэтому n должно делиться на 1806 = 2·3·7·43.  Следовательно, минимальное n (если оно существует) не меньше 1806.     С другой стороны, для 1806 условие задачи выполнено. Вот все делители числа 1806: 1, 2, 3. 6, 7, 14, 21, 42, 43, 86, 129, 301, 1806. Увеличив теперь каждый из них на единицу, получим: 2, 3, 4. 7, 8, 15, 22, 43, 44, 87, 130, 302, 1807.     Остаётся отобрать все простые числа из второго набора и убедиться,  что они входят в первый набор (1807 – не простое, оно делится  на 13).",
        "Ответ: n = 1806."
    ],
    "78652": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Доказать, что для любых трёх чисел, меньших 1000000, найдётся число, меньшее 100 (но большее 1), взаимно простое с каждым из них.",
        "Решение: Составим сначала список простых чисел, меньших 100: 2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 78, 83, 89, 97. Предположим, что на каждое из этих чисел делится хотя бы одно из трёх данных чисел a, b, c. Тогда abc ≥ 2·3·5·...·97 > 1018. Но a, b, c ≤ 106, поэтому abc ≤ 1018. Противоречие."
    ],
    "88195": [
        "Простые числа и их свойства",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Найдите десять последовательных натуральных чисел, среди которых:     а) нет ни одного простого числа;     б) одно простое число;     в) два простых числа;     г) три простых числа;     д) четыре простых числа;     е) сколько вообще простых чисел может быть среди десяти последовательных натуральных чисел?",
        "Подсказка: Среди десяти последовательных натуральных чисел (больших 5) обязательно пять чётных, а из нечётных одно кратно 5.",
        "Ответ: а) 2312, ..., 2321; б) 2325, ..., 2334; в) 30, ..., 39; г) 22, ..., 31; д) 10, ..., 19; е) не более пяти."
    ],
    "79517": [
        "Примеры и контрпримеры. Конструкции",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Найти такие 50 натуральных чисел, что ни одно из них не делится на другое, а  произведение каждых двух из них делится на любое из оставшихся чисел.",
        "Решение: См. задачу 98383."
    ],
    "79534": [
        "Арифметика остатков (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что при простых pi ≥ 5, i = 1, 2, ..., 24, число  делится нацело на 24.",
        "Решение: Согласно задаче 30378 а)  Следовательно,"
    ],
    "79576": [
        "Уравнения в целых числах",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: Найдите все простые числа р, q, r, удовлетворяющие равенству pq + qp = r.",
        "Решение: Заметим, что r > 2 и, следовательно, нечётно. Значит, числа p и q разной чётности.      Пусть p = 2, тогда 2q + q² = r.     Поскольку q нечётно, 2q даёт остаток 2 при делении на 3. Если q ≠ 3, то q не делится на три, а значит, q² ≡ 1 (mod 3). Поэтому r кратно 3, что невозможно, так как r > q > 3.     Таким образом, остаётся только вариант p = 2, q = 3, r = 2³ + 3² = 17.",
        "Ответ: (2, 3, 17), (3, 2, 17)."
    ],
    "35143": [
        "Целочисленные и целозначные многочлены",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Докажите, что не существует многочлена (степени больше нуля) с целыми коэффициентами, принимающего при каждом натуральном значении аргумента значение, равное некоторому простому числу.",
        "Подсказка: Если число a – целое, а P(x) – некоторый многочлен с целыми коэффициентами, то числа P(a) и P(a + p) имеют одинаковые остатки от деления на p.",
        "Решение: Предположим, что такой многочлен P(x) существует. В частности, p = P(1) – простое число. Тогда P(1 + p) = (P(1 + p) – P(1)) + P(1) также делится на p (см. решение задачи 35562). Поскольку число P(1 + p) – простое, то P(1 + p) = p. Аналогично, P(1 + 2p) = P(1 + 3p) = ... = p. Таким образом, многочлен   P(x) – p принимает нулевое значение в точках 1, 1 + p, 1 + 2p, ... . Однако, степень этого многочлена больше нуля, поэтому он не может иметь бесконечное число корней. Противоречие."
    ],
    "60547": [
        "Количество и сумма делителей числа",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Докажите, что если n – чётное совершенное число, то оно имеет  вид n = 2k–1(2k – 1), и p = 2k – 1 – простое число Мерсенна.",
        "Решение: Представим n в виде n = 2k–1b, где b – нечётное число, k ≥ 2. Тогда 2kb = 2n = σ(n) = σ(2k–1)σ(b) = (2k – 1)σ(b).     Отсюда b = (2k – 1)c, σ(b) = 2kc = b + c.     Если c ≠ 1, то у числа b существует по  крайней мере три положительных делителя: b, c и 1. В этом  случае σ(b) ≥ 1 + b + c, что противоречит равенству σ(b) = b + c.     Поэтому c = 1, σ(b) = b + 1, то есть b = 2k – 1 – простое число. Согласно задаче 60481 это возможно только при простых значениях показателя k. Таким образом, n имеет вид 2p–1(2p – 1), где p и b = 2p – 1 – простые числа."
    ],
    "105117": [
        "Целочисленные и целозначные многочлены",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Докажите, что не существует многочлена степени не ниже двух с целыми неотрицательными коэффициентами, значение которого при любом простом p является простым числом.",
        "Решение: Предположим, что такой многочлен Q(x) = anxn + an–1xn–1 + ... + a1x + a0 существует.      Если a0 = 0, то Q(x) = x(anxn–1 + an–1xn–2 + ... + a1), следовательно, при простом p число Q(p) делится на p и больше p (поскольку степень Q больше 1), поэтому Q(p) – число составное.    Допустим, a0 ≥ 2. Обозначим через p некоторый простой делитель a0. Тогда Q(p) делится на p и больше p, значит, Q(p) – число составное. Таким образом, имеется единственная возможность: a0 = 1.     Если для любого простого p число Q(p) простое, то и   число Q(Q(p)) является простым при любом простом p. Значит, свободный член многочлена Q(Q(x)) должен равняться 1. Однако, Q(Q(0)) = Q(1) = an + an–1 + ... + a1 + 1 > 1. Противоречие."
    ],
    "60669": [
        "Треугольник Паскаля и бином Ньютона",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Докажите утверждение обратное тому, что было  в задаче60668:      если  делится на n при всех 1 ≤ k ≤ n – 1, то n – простое число.",
        "Решение: Пусть n – составное число и p – один из его  простых делителей.    В числителе нет множителей,   кратных p, а в знаменателе – есть. Следовательно, это число – не целое, то есть     не делится на n."
    ],
    "60670": [
        "Треугольник Паскаля и бином Ньютона",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: а) Докажите, что если p — простое число и 2 ≤ k ≤ p – 2, то  делится на p.",
        "Решение: а) При k > p – k + 1 (2k > p + 1) оба биномиальных коэффициента равны нулю, а при 2k = p + 1 – единице. Поэтому далее считаем, что 2k ≤ p.",
        "Ответ: б) Верно."
    ],
    "64615": [
        "Последовательности (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Все натуральные числа выписали в ряд в некотором порядке (каждое число по одному разу). Обязательно ли найдутся несколько (больше одного) чисел, выписанных подряд (начиная с какого-то места), сумма которых будет простым числом?",
        "Решение: Покажем как записать натуральные числа в бесконечную последовательность, где таких простых сумм нет.     Возьмём a1 = 1, a2 = 3. Пусть конечная последовательность a1, a2, ..., an (n > 1) без простых сумм уже построена, и m – наименьшее натуральное число, которое не является ее членом. Положим S = a1 + a2 + ... + an + m, an+1 = S!, an+2 = m. Полученная последовательность a1, ..., an+2 также не содержит простых сумм. Действительно, любая сумма, содержащая слагаемое an+1, равна S! + k, где 1 < k ≤ S, и не является простым числом, поскольку делится на k.     Продолжая такое построение по индукции, мы получим бесконечную последовательность. Из построения очевидно, что каждое натуральное число попадает в эту последовательность ровно один раз."
    ],
    "78783": [
        "Выигрышные и проигрышные позиции",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Лежит кучка в 10 миллионов спичек. Двое играют в следующую игру. Ходят по  очереди. За один ход играющий может взять из кучки спички в количестве pn, где p – простое число, n = 0, 1, 2, 3, ... (например, первый берёт 25 спичек, второй – 8, первый – 1, второй – 5, первый – 49 и т.д.). Выигрывает тот, кто берёт последнюю спичку. Кто выиграет при правильной игре?",
        "Решение: Докажем, что если число спичек не кратно 6 (в частности, таково, как в условии), то первый выигрывает.     Поскольку 1, 2, 3, 4, 5 являются степенями простых, то в случае числа спичек равного 6k + r, где 1 ≤ r ≤ 5, первый играющий может добиться того, чтобы после его хода осталось 6k спичек.     Теперь заметим, что степень простого числа не делится на 6, поэтому после следующего хода оставшееся число не кратно 6, в том числе не может стать нулевым.  Значит, первый игрок каждым своим ходом может оставлять число спичек, кратное 6. Таким образом, второй игрок выиграть никогда не сможет, следовательно, выиграет первый.",
        "Ответ: Первый игрок."
    ],
    "35582": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Какое наименьшее натуральное число не является делителем 50!?",
        "Подсказка: n! не делится ни на какое простое число, большее n.",
        "Решение: Простое число 53 не входит в разложение на простые множители числа 50!, поэтому 50! не делится на 53. С другой стороны ясно, что 50! делится на   3·17 = 51 и на 4·13 = 52.",
        "Ответ: 53."
    ],
    "78796": [
        "Примеры и контрпримеры. Конструкции",
        "Сложность: 5",
        "Классы: 8,9,10",
        "Условие: Можно ли каждую сторону квадрата так разделить на 100 частей, чтобы из   полученных 400 отрезков нельзя было бы составить контура никакого прямоугольника, отличного от исходного квадрата?",
        "Решение: Пусть p1, p2, p3, p4 – попарно различные нечётные простые числа. На стороне AB отметим точки на расстояниях    от точки A.  Аналогично с помощью p2 строим разбиение BC, с помощью p3 – CD, с помощью p4 – DA. Тогда сторона AB разделена на отрезки длиной       Допустим, что существует прямоугольник A'B'C'D', со сторонами, полученными перестановкой получившихся отрезков. Докажем, что если сторона  этого прямоугольника (для определённости A'B') содержит какой-то отрезок, то она содержит и все те отрезки, которые лежали с ним на одной стороне квадрата (для определённости AB).     Предположим, что это не так, тогда рассмотрим разность A'B' – C'D'. Она должна равняться нулю, поскольку противоположные  стороны прямоугольника равны. Пусть p > 2 – простое число. Рассмотрим отрезки длины    M1, M2 – различные подмножества множества этих отрезков, непересекающиеся и не совпадающие со всем множеством. Тогда разность сумм длин отрезков из M1 и M2 меньше единицы и  есть рациональное число, знаменатель которого есть ненулевая степень числа  p. Домножим длины всех отрезков на pk, тогда получаем длины 1, p – 1, (p – 1)p, ..., (p – 1)pk–1, причём каждое последующее число больше предыдущего не менее чем в два раза. А значит, суммы различных подмножеств различны, то есть сумма M1 не равна сумме M2.     Разность A'B' − C'D' есть сумма нескольких  дробей, знаменатели которых есть степени p1, p2, p3, p4. Но сумма таких дробей может быть равна нулю только если все они – целые числа, то есть в нашем случае равны нулю (иначе можно домножить на p2, p3, p4 в достаточно больших степенях и получить нецелое число, равное нулю). Но это не так. Противоречие.",
        "Ответ: Можно."
    ],
    "60754": [
        "Уравнения в целых числах",
        "Сложность: 5",
        "Классы: 10,11",
        "Условие: Докажите, что для простого  числа p вида 4k + 1 числа x = ± (2k)! являются решениями сравнения x² + 1 ≡ 0 (mod p).",
        "Решение: ((2k)!)² = (2k)!·1·2·...·(2k) ≡ (2k)!·(–1)2k·4k(4k – 1)...(2k + 1) = (4k)! ≡ – 1 (mod p) по теореме Вильсона (см. задачу 60719)."
    ],
    "103769": [
        "Уравнения в целых числах",
        "Сложность: 3",
        "Классы: 7",
        "Условие: Зная, что число 1993 простое, выясните, существуют ли такие натуральные числа x и y, что     а) x² – y² = 1993;     б) x³ – y³ = 1993;     в) x4 – y4 = 1993?",
        "Подсказка: Разложите левую часть на множители.",
        "Решение: а) (x – y)(x + y) = 1993. Учитывая, что число 1993 простое, получаем x – y = 1, x + y = 1993. Отсюда x = 997, y = 996.",
        "Ответ: а) Существуют; б)-в) не существуют."
    ],
    "104082": [
        "Числовые таблицы и их свойства",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: В магическом квадрате суммы чисел в каждой строке, в каждом столбце и на обеих диагоналях равны.   Можно ли составить магический квадрат 3×3 из первых девяти простых чисел?",
        "Решение: Пусть первые девять простых чисел как-то расставлены в клетках квадрата. Среди них есть ровно одно чётное число − 2. Сумма чисел в строке, содержащей двойку, чётна (сумма двух нечётных и одного чётного чисел). В строках, не содержащих двойку, сумма чисел нечётна, следовательно, суммы чисел в каких-то двух строках разные, и получить магический квадрат нельзя.",
        "Ответ: Нельзя."
    ],
    "32081": [
        "Делимость чисел. Общие свойства",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Пусть a и b – целые числа. Докажите, что если a² + 9ab + b² делится на 11, то и a² – b² делится на 11.",
        "Решение: a² + 9ab + b² = (a – b)² + 11ab. Отсюда следует, что на 11 делится (a – b)². Поскольку 11 – число простое, то на 11 делится и a² – b² = (a – b)(a + b)."
    ],
    "60467": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Существуют ли арифметическая прогрессия, состоящая лишь из простых чисел?",
        "Решение: Пусть a1 = p – простое число. Тогда все числа akp+1 = p + kpd делятся на p, то есть являются составными.",
        "Ответ: Не существует."
    ],
    "34920": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Дано n попарно взаимно простых чисел, больших 1 и меньших (2n – 1)². Докажите, что среди них обязательно есть простое число.",
        "Подсказка: Предположите противное и рассмотрите наименьшие простые делители данных чисел.",
        "Решение: Пусть a1, a2, ..., an – попарно взаимно простые составные числа. Обозначим через pi наименьший простой делитель числа ai. Тогда ai = piqi, причём pi ≤ qi. Поскольку ai < (2n – 1)², то pi < 2n – 1. Кроме того, числа p1, p2, ..., pn различны, так как числа a1, a2, ..., an попарно взаимно просты. Однако существует не более n – 1 простых чисел, больших 1 и меньших 2n – 1: все такие числа содержатся среди чисел 2, 3, 5, 7, ..., 2n – 3. Противоречие."
    ],
    "78516": [
        "Произведения и факториалы",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Найти все такие натуральные числа n, что число (n – 1)! не делится на n².",
        "Решение: Ясно, что n = p и n = 2p при простом p удовлетворяют условию, так как (n – 1)! не делится на p².     Легко видеть также, что 7! и 8! не могут делиться на 8² и 9² соответственно.     Докажем, что для остальных n число (n – 1)! делится на n². Пусть n имеет хотя бы два различных простых делителя. Среди чисел 1, ..., n – 1 есть хотя бы n/p – 1 число, кратное p. Если некоторое простое число p входит в разложения числа n в степени k, то n/p – 1 ≥ 2pk–1 – 1 ≥ 2k – 1 ≥ 2k – 1. Если n не имеет вид 2p, то хотя бы одно из написанных неравенств – строгое. Значит, n/p – 1 ≥ 2k и (n – 1)! делится на p2k. Поскольку это верно при всех p, то (n – 1)! делится на n².     Пусть теперь n = pk. Тогда n/p – 1 = pk–1 – 1. При p ≥ 5, либо p = 3 и k ≥ 3, либо p = 2 и k ≥ 5, это число не меньше 2k. Значит, (n – 1)! делится на n².     Случай n = 16 разбирается непосредственно.",
        "Ответ: 8, 9, а также числа вида p и 2p, где p – простое."
    ],
    "60469": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что 3, 5 и 7 являются единственной тройкой простых чисел-близнецов.",
        "Подсказка: Рассмотрите остатки от деления на 3."
    ],
    "35451": [
        "Арифметическая прогрессия",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: 15 простых натуральных чисел образуют возрастающую арифметическую прогрессию.   Докажите, что разность этой прогрессии больше 30000.",
        "Подсказка: Докажите, что разность прогрессии должна делиться на небольшие простые числа.",
        "Решение: Пусть d – разность нашей прогрессии. Очевидно, a9 > 7. Согласно задаче 78037 разность d прогрессии a9, a10, ..., a15 делится на 7. Поэтому a3 > 13. Согласно той же задаче d делится на 2, 3, 5, 11 и 13, то есть на 2·3·5·7·11·13 = 30030 > 30000."
    ],
    "60470": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Найдите все простые числа, которые равны сумме двух простых чисел и разности двух простых чисел.",
        "Решение: Указанное простое число p нечётно, поэтому в сумме и разности участвуют числа разной чётности. Итак, p = q + 2 = r – 2. Отсюда видно, что числа дают разные остатки при делении на 3, значит, одно из них кратно 3, а так как оно простое, то равно 3.",
        "Ответ: 5."
    ],
    "65223": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Верно ли, что изменив одну цифру в десятичной записи любого натурального числа, можно получить простое число?",
        "Решение: Приведём три контрпримера.    1. Рассмотрим число 10! = 3628800. Оно делится на 10, поэтому если изменить любую цифру, кроме последней, то делимость на 10 сохранится. Если последнюю цифру заменить на любую из цифр от 2 до 9, то полученное число 10! + k. будет делиться на k. А если последнюю цифру заменить на 1, то получится число 3628801, кратное 11.     2. Рассмотрим число (10!)3. Изменение любой цифры, кроме последней, а также замена последней цифры на любую цифру от 2 до 9 не дает простого числа по соображениям, изложенным выше. А если последнюю цифру заменить на 1, то получится число   (10!)³ + 1 = (10! + 1)((10!)² – 10! + 1).     3. Рассмотрим число 19! + 10. Бесполезность изменения любой его цифры, кроме последней, объяснена выше, а замена последней цифры на 1, 2, ..., 9 приведёт к тому, что полученные числа будут делиться на 11, 12, ..., 19 соответственно.",
        "Ответ: Неверно."
    ],
    "31273": [
        "Простые числа и их свойства",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Найти все такие натуральные числа p, что p и 5p + 1 – простые.",
        "Подсказка: Если p нечётно, то 5p + 1 чётно.",
        "Ответ: p = 2."
    ],
    "79296": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Натуральные числа a, b, c таковы, что числа p = bc + a, q = ab + c, r = ca + b простые. Доказать, что два из чисел p, q, r равны между собой.",
        "Решение: Два из чисел a, b, c одной чётности. Пусть для определённости это a и b. Тогда простое число p = bc + a чётно. Следовательно, p = 2, a = b = 1,  а q = 1 + c = r."
    ],
    "30392": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: а) p, p + 10, p + 14 – простые числа.  Найдите p.",
        "Подсказка: Рассмотрите остатки от деления на 3. Одно из этих чисел делится на 3.",
        "Ответ: p = 3."
    ],
    "30394": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: p и p² + 2 – простые числа. Докажите, что p² + 2 – также простое число.",
        "Подсказка: Рассмотрите остатки от деления на 3.",
        "Решение: Если число p делится на 3 и больше 3, то оно не простое.    Пусть p не делится на 3 и больше 1. Тогда p² даёт остаток 1 от деления на 3, то есть p² + 2 делится на 3. Поскольку p² + 2 > 3, то это число – составное.     Остаётся единственная возможность p = 3. При этом p³ + 2 = 29."
    ],
    "31285": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Найти все такие натуральные числа p, что p и 2p² + 1 – простые.",
        "Подсказка: Если p не делится на 3, то 2p² + 1 делится на 3.",
        "Ответ: p = 3."
    ],
    "32114": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 6,7,8,9",
        "Условие: Найдите все простые числа, которые нельзя записать в виде суммы двух составных.",
        "Решение: Докажем, что любое простое число p > 11 представляется в виде суммы двух составных. Поскольку любое такое число нечётно, то число p – 9 чётно и, следовательно, составное. Поэтому p = (p – 9) + 9 – искомое представление.     С другой стороны, непосредственно проверяется, что числа 2, 3, 5, 7 и 11 не представимы в виде суммы двух составных."
    ],
    "60466": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Существуют ли а) 5, б) 6 простых чисел, образующих арифметическую прогрессию?",
        "Решение: а) 5, 11, 17, 23, 29; б) 7, 37, 67, 97, 127, 157.",
        "Ответ: Существуют."
    ],
    "60471": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Докажите, что при n > 2 числа 2n – 1 и 2n + 1 не могут быть простыми одновременно.",
        "Решение: Первый способ. При нечётном n 2n + 1 делится на 2 + 1 = 3, а при чётном n = 2m 2n – 1 = 4m – 1 делится на 4 – 1 = 3."
    ],
    "60476": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Верно ли, что все числа вида p1p2...pn + 1 являются простыми? (pk – k-е простое число.)",
        "Решение: 2·3·5·7·11·13 + 1 = 30031 = 59·509.",
        "Ответ: Неверно."
    ],
    "31284": [
        "Простые числа и их свойства",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Найти все такие натуральные числа p, что p и 3p² + 1 – простые.",
        "Подсказка: Если p нечётно, то 3p² + 1 чётно.",
        "Ответ: p = 2."
    ],
    "60477": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Евклидово доказательство бесконечности множества простых чисел наводит на мысль определить  рекуррентно числа Евклида:  e1 = 2, en = e1e2...en–1 + 1 (n ≥ 2). Все ли числа en являются простыми?",
        "Решение: e5 = 1807 = 13·139.",
        "Ответ: Не все."
    ],
    "60481": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Пусть a и n – натуральные числа, большие 1. Докажите, что если число an – 1 простое, то a = 2 и n – простое.   (Числа вида q = 2n – 1 называются числами Мерсенна.)",
        "Решение: Если a > 2, то an – 1 делится на a – 1 > 1. Если a = 2, а n = km – составное, то an – 1 делится на 2m – 1."
    ],
    "60694": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Найдите конечную арифметическую прогрессию с разностью 6 максимальной длины, состоящую из простых чисел.",
        "Подсказка: Среди любых пяти последовательных членов такой арифметической прогрессии один обязательно делится на 5. Если это не 5, то простых чисел, идущих подряд, будет не более четырёх.",
        "Ответ: 5, 11, 17, 23, 29."
    ],
    "60714": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 9,10,11",
        "Условие: Докажите, что pp+2 + (p + 2)p ≡ 0 (mod 2p + 2), где p > 2 – простое число.",
        "Решение: p + 2 ≡ – p (mod 2p + 2), поэтому    pp+2 + (p + 2)p ≡ pp+2 – pp = pp(p – 1)(p + 1) ≡ 0 (mod 2p + 2), поскольку число p – 1 чётно."
    ],
    "64559": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Может ли разность квадратов двух простых чисел быть квадратом натурального числа?",
        "Решение: Например, 5² – 3² = 4² или 13² – 5² = 12².",
        "Ответ: Может."
    ],
    "65172": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 9,10,11",
        "Условие: Три трёхзначных простых числа, составляющие арифметическую прогрессию, записаны подряд.   Может ли полученное девятизначное число быть простым?",
        "Решение: Докажем, что полученное число кратно 3.",
        "Ответ: Не может."
    ],
    "65655": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Может ли разность четвёртых степеней простых чисел быть простым числом?",
        "Решение: Пусть p и q – простые числа, причём p > q. Тогда p4 – q4 = (p² – q²)(p² + q²) = (p  – q)(p + q)(p² + q²). Каждый из полученных множителей – натуральное число, причём p + q > 1 и p² + q² > 1. Следовательно, рассматриваемая разность является произведением хотя бы двух натуральных чисел, больших единицы, то есть является составным числом.",
        "Ответ: Не может."
    ],
    "76493": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Доказать, что квадрат любого простого числа p > 3 при делении на 12 даёт в остатке 1.",
        "Решение: p = 6n ± 1 (см. задачу 88242). Значит, p² = 36n² ± 12n + 1."
    ],
    "78663": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Докажите, что если p и q – два простых числа, причём q = p + 2, то pq + qp делится на p + q.",
        "Решение: pq + qp = (pp+2 – pp) + (pp + qp) = pp(p – 1)(p + 1) + (pp + qp). Первое слагаемое делится на p + q = 2(p + 1), так как число p – 1 чётно, а второе слагаемое делится на p + q, так как число p нечётно."
    ],
    "86477": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Пусть p – простое число, отличное от 2 и 5. Доказать, что p4 − 1 делится на 10.",
        "Решение: См. решение задачи 79525."
    ],
    "88070": [
        "Простые числа и их свойства",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Известно, что p > 3 и p – простое число.     а) Как вы думаете, будет ли хотя бы одно из чисел p + 1  и p – 1 делиться на 4?     б) А на 5?",
        "Решение: а) Рассмотрим числа p – 1, p, p + 1,  p + 2. Из четырёх последовательных чисел одно обязательно делится на 4, но это не p и не p + 2 (оба эти числа нечётны). Значит, одно из чисел p + 1 или p – 1 будет делиться на 4.",
        "Ответ: а) Будет; б) не обязательно."
    ],
    "116153": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Существуют ли пять таких двузначных составных чисел, что каждые два из них взаимно просты?",
        "Решение: Каждое из составных чисел является произведением, по крайней мере, двух простых чисел. В каждом из таких произведений не может быть больше одного двузначного сомножителя, иначе это произведение будет, как минимум, трёхзначным. Значит, в разложении на простые множители каждого из искомых двузначных чисел должно присутствовать однозначное простое число. Но простых однозначных чисел всего четыре: 2, 3, 5 и 7. Следовательно, среди любых пяти составных двузначных чисел найдутся два, у которых будет общий делитель, отличный от 1.",
        "Ответ: Не существуют."
    ],
    "30393": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: p и 8p2 + 1 – простые числа.  Найдите p.",
        "Подсказка: Если p ≠ 3, то 8p2 + 1 делится на 3.",
        "Ответ: p = 3."
    ],
    "30398": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: p, 4p² + 1 и 6p² + 1 – простые числа. Найдите p.",
        "Подсказка: Рассмотрите остатки при деления на 5.",
        "Ответ: p = 5."
    ],
    "31283": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: Найти все такие натуральные числа p, что p и p6 + 6 – простые.",
        "Решение: Если p не делится на 7, то по малой теореме Ферма p6 + 6 ≡ 0 (mod 7), а 76 + 6 ≡ 26 + 1 = 65 ≡ 0 (mod 5).",
        "Ответ: Нет решений."
    ],
    "35122": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Докажите, что простых чисел, дающих остаток 2 при делении на 3, бесконечно много.",
        "Подсказка: Если имеются простые числа p1, p2, ..., pn, то все простые делители чисел p1p2...pn + 1 и p1p2...pn – 1 отличны от чисел p1, p2, ..., pn.",
        "Решение: Предположим, что напротив, найдётся лишь конечное число таких простых чисел, обозначим эти числа p1, p2, ... , pn. Число A = 3p1p2...pn – 1 не делится на простые числа p1, p2, ..., pn и даёт остаток 2 при делении на 3. Значит, среди его простых делителей должно быть число вида 3k + 2. Противоречие."
    ],
    "60456": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Пусть n > 2. Докажите, что между n и n! есть по крайней мере одно простое число.",
        "Решение: Таким будет любой простой делитель числа n! – 1."
    ],
    "60459": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Докажите, что множество простых чисел вида p = 4k + 3  бесконечно.",
        "Решение: Пусть p1 = 3, p2 = 7, ..., pn – все такие простые числа. Рассмотрим число N = 4p2...pn + 3. Оно не делится ни на одно из чисел p1, p2, ..., pn, но содержит простой делитель вида 4k + 3. Противоречие."
    ],
    "60460": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Докажите, что множество простых чисел вида p = 6k + 5 бесконечно.",
        "Решение: Доказательство повторяет рассуждения задачи 60459 с заменой числа N на N = 6p1...pn + 5."
    ],
    "60474": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Пусть {pn} – последовательность простых чисел (p1 = 2, p2 = 3, p3 = 5, ...).     а) Докажите, что pn > 2n при n ≥ 5.     б) При каких n будет выполняться неравенство pn > 3n?",
        "Решение: а) Поскольку все простые числа, кроме 2, нечётны, то pn ≥ p5 + 2(n – 5) = 2n + 1 при n ≥ 5.",
        "Ответ: б) При n ≥ 12."
    ],
    "60475": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите неравенство pn+1 < p1p2...pn (pk – k-е простое число).",
        "Подсказка: Рассмотрите число p1p2...pn – 1."
    ],
    "60480": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что числа Ферма fn = 22n + 1 при n > 1 не представимы в виде суммы двух простых чисел.",
        "Решение: Число Ферма нечётно, поэтому единственное возможное представление – это  22n + 1 = (22n – 1) + 2. Но число 22n – 1 – не простое (например, оно кратно 3)."
    ],
    "60482": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Пусть P(x) – многочлен ненулевой степени с целыми коэффициентами.  Могут ли все числа P(0), P(1), P(2), ... быть простыми?",
        "Решение: Пусть такой многочлен нашёлся. Тогда его свободный член p = P(0) – простое число. Подставляя в формулу многочлена P(x) числа xj = pj (j = 1, 2, ...), получаем, что P(xj) делится на p. Следовательно, P(xj) = p, и многочлен P(x) принимает одно и то же значение в бесконечном числе точек. Противоречие."
    ],
    "60509": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что pn+1 ≤ 22n + 1, где pn – n-е простое число.",
        "Решение: Согласно задаче 10508 число 22n – 1 имеет n различных простых делителей, причём все они отличны от 2. Поэтому pn+1 ≤ 22n – 1 при n > 0."
    ],
    "60753": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: При помощи задачи 60752 докажите, что существует бесконечно много простых чисел вида p = 4k + 1.",
        "Решение: Пусть таких чисел всего n: p1, ..., pn. Рассмотрим число (2p1...pn)² + 1. Согласно задаче 60752 у него есть простой множитель вида p = 4k + 1. С другой стороны, это число не делится ни на одно из чисел p1, ..., pn. Противоречие."
    ],
    "30378": [
        "Простые числа и их свойства",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: а) Докажите, что p² – 1 делится на 24, если p – простое число и p > 3.   б) Докажите, что p² – q² делится на 24, если p и q – простые числа, большие 3.",
        "Подсказка: См. задачу 30377.",
        "Решение: а) Согласно задаче 30777 число p³ – p = p(p² – 1) делится на 24. Но простое число p ни на 2, ни на 3 не делится. Поэтому p² – 1 делится на 24."
    ],
    "65947": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Найдите наименьшее простое число, которое можно представить в виде суммы пяти различных простых чисел.",
        "Решение: Так как слагаемых должно быть нечётное количество, то каждое из них должно быть нечётным. Сумма пяти наименьших простых нечётных чисел   3 + 5 + 7 + 11 + 13 = 39 – составное число, поэтому одно из слагаемых надо попробовать заменить на следующее простое число 17. Новая сумма будет наименьшей, если на 17 заменить наибольшее из слагаемых: 3 + 5 + 7 + 11 + 17 = 43 – простое число.",
        "Ответ: 43."
    ],
    "78580": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Найдите все простые числа вида PP + 1 (P – натуральное), содержащие не более 19 цифр.",
        "Решение: Если P = mq, где q нечётно, то PP + 1 делится на  Pm + 1. Осталось перебрать случаи когда P – степень двойки.     11 + 1 = 2, 2² + 1 = 5, 44 + 1 = 257. 88 + 1 = 224 + 1 делится на 28 + 1. 1616 = 264 > 10·260 = 10·10246 > 1019, то есть содержит больше 19 цифр.",
        "Ответ: 1, 2, 4."
    ],
    "79525": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите, что при простых p > 7 число p4 − 1 делится на 240.",
        "Решение: p4 − 1 = (p² − 1)(p² + 1). В задаче 30378 а) доказано, что p² − 1 делится на 24. Кроме того, p² + 1 чётно,   а (p² − 1)(p2 + 1) ≡ (p² − 1)(p² – 4) = (p − 2)(p – 1)(p + 1)(p + 2) (mod 5). Из пяти последовательных чисел p − 2, p – 1, ..., p + 2 одно делится на 5, и это – не p. Поэтому p4 − 1 делится на 5·2·24 = 240."
    ],
    "104099": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Найдите все простые числа р, для каждого из которых существует такое натуральное число m, что  – также натуральное число.",
        "Решение: Пусть p нечётно, то есть р = 2n + 1, где n – натуральное число. Тогда условие задачи выполняется для m = n2.     Осталось рассмотреть случай p = 2. Пусть    – натуральное число. Тогда число    а значит, и  – целое. Но (2m + 1)² < 4(m² + 2m) < (2m + 2)², то есть    Противоречие.",
        "Ответ: р – любое нечётное простое число."
    ],
    "108747": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Доказать, что наибольший общий делитель чисел вида p4 – 1, где p – простое число, большее 5, равен 240.",
        "Решение: Все числа такого вида делятся на 240 (см. задачу 79525). Чтобы убедиться, что это – наибольший общий делитель всех таких чисел, достаточно привести пару чисел такого вида, не имеющих большего общего делителя, например 74 – 1 = 48·50 = 240·10 и 114 – 1 = 120·122 = 240·61."
    ],
    "30382": [
        "Простые числа и их свойства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Три простых числа p, q и r, большие 3, образуют арифметическую прогрессию: q = p + d, r = p + 2d. Докажите, что d делится на 6.",
        "Решение: Если d нечётно, то среди чисел p и q есть чётное, что невозможно. Если d не делится на 3, то среди чисел p, q и r есть кратное 3, что тоже невозможно."
    ],
    "60700": [
        "Простые числа и их свойства",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: В задаче 60477 были определены числа Евклида. Встретится ли каждое простое  число в качестве сомножителя некоторого числа Евклида en?",
        "Подсказка: Рассмотрите числа Евклида по модулю 5.",
        "Решение: Нетрудно проверить по индукции, что en ≡ (–1)n+1·2 (mod 5). Поэтому ни одно из чисел Евклида не делится на 5.",
        "Ответ: Нет."
    ],
    "60719": [
        "Простые числа и их свойства",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Докажите, что для простого p  (p – 1)! ≡ – 1 (mod p).",
        "Решение: Все числа от 2 до p – 2 можно разбить на пары  взаимно обратных по умножению чисел, то есть для каждого a из   этого интервала найдётся такое b (отличное от a по задаче 60718), что ab ≡ 1 (mod p). Поэтому (p – 1)! ≡ p – 1 (mod p)."
    ],
    "60721": [
        "Простые числа и их свойства",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Докажите, что p – простое тогда и только тогда, когда   (p – 2)! ≡ 1 (mod p).",
        "Подсказка: (p – 1)! ≡ – (p – 2)! (mod p).",
        "Решение: Согласно задачам 60719 и 60458 p – простое ⇔ 1 ≡ – (p – 1)! ≡ (p – 2)! (mod p)."
    ],
    "60750": [
        "Простые числа и их свойства",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Докажите, что при любом простом p    делится на p.",
        "Решение: При p = 2 или 5 указанное число делится на 10, так как окачивается нулём.     При p = 3 указанное число делится на 3 как разность двух чисел, кратных 3.     Пусть p > 5. По малой теореме Ферма число    делится на p. Значит,    делится на p, а   .  Кроме того,   10p ≡ 10 (mod p). Следовательно,"
    ],
    "60752": [
        "Простые числа и их свойства",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Докажите, что если x² + 1 (x – целое) делится на нечётное простое p, то p = 4k + 1.",
        "Решение: Ясно, что x не делится на p. По малой теореме Ферма   1 ≡ xp–1 = (x²)(p–1)/2 ≡ (–1)(p–1)/2 (mod p). Следовательно, число p–1/2 чётно, что и требовалось."
    ],
    "31275": [
        "Простые числа и их свойства",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Найти все такие натуральные числа p, что p и p² + 2 – простые.",
        "Решение: См. задачу 30394.",
        "Ответ: p = 3."
    ],
    "60508": [
        "Простые числа и их свойства",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Докажите, что число 22n – 1 имеет по крайней мере n различных простых делителей.",
        "Подсказка: Воспользуйтесь взаимной простотой чисел Ферма (см. задачу 60507)."
    ],
    "60722": [
        "Простые числа и их свойства",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Докажите, что числа p и p + 2 являются простыми числами-близнецами тогда и только тогда, когда 4((p – 1)! + 1) + p ≡ 0 (mod p² + 2p).",
        "Решение: Согласно задачам 60719 и 60458 число   p – простое ⇔ (p – 1)! + 1 ≡ 0 (mod p) ⇔ 4((p – 1)! + 1) + p ≡ 0 (mod p).     Остается доказать, что p + 2 – простое ⇔ 4((p – 1)! + 1) + p ≡ 0 (mod p + 2).    Заметим, что p(p + 1) ≡ – 2(p + 1) ≡ 2 (mod p + 2). Поэтому 2(p + 1)! ≡ 4(p – 1)! (mod p + 2), откуда 2((p + 1)! + 1) + (p + 2) ≡ 4((p – 1)! + 1) + p (mod p + 2).     p + 2 – число простое ⇔ (p + 1)! + 1 ≡ 0 (mod p + 2) ⇔ 2((p + 1)! + 1) + (p + 2) ≡ 0 (mod p + 2) ⇔ 4((p – 1)! + 1) + p ≡ 0 (mod p + 2)."
    ],
    "60740": [
        "Простые числа и их свойства",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Дано простое p и целое a, не делящееся на p. Пусть k – наименьшее натуральное число, при котором ak ≡ 1 (mod p). Докажите, что p – 1 делится на k.",
        "Решение: Пусть p – 1 = qk + r, где 0 ≤ r < k. 1 ≡ ap–1 ≡ ar (mod p). По условию число r – не натуральное, то есть r = 0, что и требовалось."
    ],
    "60756": [
        "Простые числа и их свойства",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Пусть p – простое число и p > 3.     а) Докажите, что если разрешимо сравнение x² + x + 1 ≡ 0 (mod p), то p ≡ 1 (mod 6).     б) Выведите отсюда бесконечность множества простых чисел вида 6k + 1.",
        "Решение: а) Решение x указанного сравнения удовлетворяет условиям xp–1 – 1 ≡ 0 (mod p) и    x³ – 1 ≡ 0 (mod p). Cогласно задаче 60507 а) x(p–1, 3) – 1 ≡ 0 (mod p). Но x не сравнимо с 1 по модулю p, поскольку 3 на p не делится. Следовательно, p – 1 делится на 3, то есть p имеет вид 6k + 1."
    ],
    "60757": [
        "Простые числа и их свойства",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Пусть p – простое число и p > 5. Докажите,  что если разрешимо сравнение x4 + x3 + x2 + x + 1 ≡ 0 (mod p), то   p ≡ 1 (mod 5).  Выведите отсюда бесконечность множества простых чисел вида 5n + 1.",
        "Подсказка: См. решение задачи 60756."
    ],
    "31279": [
        "Простые числа и их свойства",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Найти все натуральные числа p, что p, p² + 4 и p² + 6 – простые числа.",
        "Подсказка: Если p не делится на 5, то либо p² + 4, либо p² + 6 делится на 5.",
        "Ответ: p = 5."
    ],
    "78037": [
        "Простые числа и их свойства",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: p простых чисел a1, a2, ..., ap образуют возрастающую арифметическую прогрессию и a1 > p.   Доказать, что если p – простое число, то разность прогрессии делится на p.",
        "Решение: Рассмотрим остатки от деления чисел a1, ..., ap на p. Эти числа простые и все они строго больше p, поэтому ни одно из них не делится на p. Таким образом, мы получили p различных остатков, отличных от p. Следовательно, если два числа ai и aj, дающие одинаковые остатки при делении на p. Поэтому их разность делится на p. Но ai – aj = (i – j)d, где d – разность прогрессии. Число |i – j| строго меньше p, поэтому на p должно делиться число d."
    ],
    "78213": [
        "Простые числа и их свойства",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Доказать, что существует бесконечно много натуральных чисел, не представимых  в виде p + n2k ни при каких простых p и целых n и k.",
        "Решение: Пусть число а² представимо в указанном виде. Тогда р = а² – n2k = (а – nk)(а + nk). Так как р – простое число, то а – nk = 1,  а р = (а + nk) = а + (а – 1) = 2a – 1. Но для каждого а вида 3m + 2 число 2a – 1 = 6m + 3 не простое, то есть а² не представимо в указанном виде. Таким образом, даже среди чисел, являющихся точными квадратами, бесконечно много чисел обладают требуемым свойством."
    ],
    "105213": [
        "Простые числа и их свойства",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Натуральное число n таково, что 3n + 1 и 10n + 1 являются квадратами натуральных чисел. Докажите, что число 29n + 11 – составное.",
        "Решение: Пусть 3n + 1 = a², 10n + 1 = b², где a, b ∈ N, и пусть p = 29n + 11 – простое число. Далее можно рассуждать по-разному."
    ],
    "73618": [
        "Простые числа и их свойства",
        "Сложность: 5",
        "Классы: 8,9,10,11",
        "Условие: Докажите, что числа 1, 2, ..., n ни при каком n > 1 нельзя разбить на два множества так, чтобы произведение чисел одного из них равнялось произведению чисел другого.",
        "Решение: Согласно постулату Бертрана найдётся такое простое p, что n/2 < p < n. Оно может войти лишь в одну  группу чисел, а уравновесить его нечем, поскольку 2p > n."
    ]
}