{
    "60463": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Разложите на простые множители числа 111, 1111, 11111, 111111, 1111111.",
        "Ответ: 111 = 3·37, 1111 = 11·101, 11111 = 41·271, 111111 = 3·7·11·13·37, 1111111 = 239·4649."
    ],
    "34993": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Докажите, что нечётное число, являющееся произведением n различных простых сомножителей, можно представить в виде разности квадратов двух натуральных чисел ровно 2n–1 различными способами.",
        "Подсказка: 2n–1 – это число способов разбить множество из  n простых сомножителей на два подмножества.",
        "Решение: Пусть m = p1p2...pn, где p1, p2, ..., pn – различные нечётные простые числа. Будем решать уравнение x² – y² = m в натуральных числах. Это уравнение приводится к виду (x – y)(x + y) = p1p2...pn, откуда следует, что сомножитель x – y есть произведение нескольких чисел (возможно ни одного, в этом случае x – y = 1) из набора  p1, p2, ..., pn, а сомножитель x + y есть произведение оставшихся чисел из этого набора. При этом сомножителю x – y  соответствует меньшее произведение. Таким образом, каждому решению (x, y) соответствует разбиение множества из n чисел на два подмножества.    Наоборот, пусть есть некоторое разбиение чисел p1, p2, ..., pn на два подмножества. Обозначим через t и s (t < s) произведения чисел в этих подмножествах (t ≠ s, поскольку числа p1, p2, ..., pn различны). Тогда найдётся единственная пара натуральных чисел    для которой x – y = t и x + y = s (x и y натуральные, так как t и s нечётны).    Итак, число представлений m в виде разности квадратов  двух натуральных чисел равно числу способов разбить множество из n элементов на два подмножества, то есть 2n–1 (в два раза меньше числа 2n всех подмножеств)."
    ],
    "60438": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Сколько существует целых чисел от 1 до 16500, которые     а) не делятся на 5;     б) не делятся ни на 5, ни на 3;     в) не делятся ни на 5, ни на 3, ни на 11?",
        "Решение: а) Разобьём все числа на 16500 : 5 = 3300 пятерок последовательно идущих чисел. В каждой пятерке одно число делится на 5, а 4 – не делятся. Поэтому всего 4·3300 = 13200 чисел не делятся на 5.",
        "Ответ: а) 13200;  б) 8800;  в) 8000 чисел."
    ],
    "60762": [
        "Арифметика остатков (прочее)",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Пусть числа x1, x2, ..., xr образуют приведённую систему вычетов по модулю m.   Для каких a и b числа yj = axj + b (j = 1, ..., r) также образуют приведённую систему вычетов по модулю m?",
        "Ответ: (a, m) = 1 и b делится на все простые числа из  разложения m."
    ],
    "64550": [
        "Числовые таблицы и их свойства",
        "Сложность: 4",
        "Классы: ",
        "Условие: В клетки таблицы размером 9×9 расставили все натуральные числа от 1 до 81. Вычислили произведения чисел в каждой строке таблицы и получили набор из девяти чисел. Затем вычислили произведения чисел в каждом столбце таблицы и также получили набор из девяти чисел.   Могли ли полученные наборы оказаться одинаковыми?",
        "Решение: Каждое из произведений чисел, стоящих в девяти строках таблицы, представим в виде произведения простых множителей. Выпишем все простые числа, большие 40, но меньшие 81: 41, 43, 47, 53, 59, 61, 67, 71, 73, 79. Каждое из этих десяти чисел может встретиться только в одном из этих девяти произведений, поскольку числа, кратные любому из них, превышают 81. Следовательно, найдётся строка x, произведение чисел в которой будет содержать не менее двух из указанных множителей. Эти множители будут располагаться в разных столбцах. Два таких множителя обозначим через m и n.    Рассмотрим теперь произведения чисел, стоящих в столбцах таблицы. Так как числа m и n не могут располагаться в одном столбце, то ни одно из произведений в столбцах не может совпасть с произведением чисел, стоящих в строке x. Следовательно, полученные наборы не могут оказаться одинаковыми.",
        "Ответ: Не могли."
    ],
    "64424": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Перемножили несколько натуральных чисел и получили 224, причём самое маленькое число было ровно вдвое меньше самого большого.   Сколько чисел перемножили?",
        "Решение: 224 = 25·7. Рассмотрим два числа, указанные в условии: самое маленькое и самое большое. Если одно из них делится на 7, то и другое должно   делиться на 7. Но 224 не делится на 7², значит, оба этих числа являются степенями двойки. Из условия также следует, что это – две последовательные степени числа 2. Кроме того, самое большое число должно быть больше, чем 7. Таким образом, оно равно 2³ = 8, а самое маленькое – это 2² = 4. Остался единственный множитель, равный семи, поэтому искомых чисел три: 4, 7 и 8.",
        "Ответ: Три числа."
    ],
    "78619": [
        "Количество и сумма делителей числа",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Обозначим через d(N) число делителей N (числа 1 и N также считаются делителями). Найти все такие N, что число P =  – простое.",
        "Решение: Пусть  – разложение N на простые множители. Без ограничения общности можно считать, что P = p1. Тогда  d(N) = (k1 + 1)(k2 + 1)...(ks + 1) и    Нетрудно проверить, что     если p > 3, k ≥ 2, то  > p, а если p = 3, k = 2, то  = p;     если p = 3, k > 2, то  > p;     еслиp ≥ 2, то  ≥ 1, причём если p > 2 или k > 1, то неравенство строгое;     еслиp = 2, k ≥ 4, то  > p.     Рассмотрим два варианта.     1) N делится на , то есть k1 ≥ 2. В силу приведённых неравенств    не больше p1 только при p1 = 3, k1 = 2 или p1 = 2, k1 = 2 или 3.     В первом случае в произведении уже есть сомножитель, равный p1, значит, все остальные сомножители равны единице. Следовательно, либо N = 9, либо N = 2·9 = 18.     Во втором случае, если k1 = 3, то  = 2, а значит, N = 8. Если k1 = 2, то  = 4/3. В знаменателе появилась тройка. Следовательно, N кратно 3. Число N = 3·2² подходит, и поскольку  > 1,5 при k > 1,  то в большей степени тройка в разложение N входить не может.     Итак, в этом варианте подходят только числа N = 8, 9, 12 и 18.     2)  k1 = 1. Тогда первый множитель равен p1/2. Следовательно, произведение остальных множителей равно 2. Если число N имеет простой делитель, не меньший 5, то соответствующий ему множитель больше 2, что невозможно. Следовательно, N = p·2s³r и при этом r ≤ 1 (иначе  > 2) и s ≤ 3  (иначе  > 2). Перебрав все эти варианты, получаем, что подходят числа N = 24, 8p, 12p, 18p.",
        "Ответ: 8, 9, 12, 18, 24, 8p, 12p, 18p, где p – произвольное простое число, большее 3."
    ],
    "110926": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: На листке бумаги написаны натуральные числа от 1 до N. Игроки по очереди обводят в кружок одно число, соблюдая условие: любые два уже обведённых  числа должны быть взаимно простыми. Два раза число обводить нельзя. Проигрывает тот, у кого нет хода.     а) Кто – начинающий игру или ходящий вторым – победит при   N = 10?     б) А при N = 12?     в) А при N = 15?     г) А при N = 30?",
        "Решение: Число 1 может обвести любой игрок в любой момент. Про остальные числа можно сказать вот что: если мы обводим число, имеющее простые делители p1, p2, ..., pk, то больше ни одно число, делящееся на хотя бы одно из этих простых чисел, обводить нельзя. Фактически игру можно понимать так: выписаны все простые числа, не превосходящие N, и число 1, и можно брать одно или несколько таких чисел (если их произведение не больше N). Так, обводя 3, мы берём  простое число 3, обводя 9, тоже берём 3, а обводя, скажем, 12, берём 2 и 3 одновременно."
    ],
    "64481": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 3",
        "Классы: 9,10,11",
        "Условие: При каких натуральных n число n² – 1 является степенью простого числа?",
        "Решение: n² – 1 = (n + 1)(n – 1), а НОД(n + 1, n – 1) = d ≤ 2.    Если d = 2, то n² – 1 – степень двойки: n + 1 = 2k и n – 1 = 2m, причём значения этих степеней различаются на 2. Значит, k = 2, m = 1, n = 3.    Если же d = 1, то n – 1 = 1, то есть n = 2.",
        "Ответ: При n = 2 и n = 3."
    ],
    "77873": [
        "Уравнения в целых числах",
        "Сложность: 4+",
        "Классы: 8,9,10",
        "Условие: Решите в натуральных числах уравнение xy = yx при x ≠ y.",
        "Решение: Из равенства xy = yx следует, что  простые делители чисел x и y одни и те же, то есть    То же самое равенство показывает, что a1y = b1x, ..., any = bnx. Пусть для определённости x < y. Тогда из записанных равенств следует, что a1 < b1, ..., an < bn, то есть y = kx, где k – целое число. Подставляя равенство y = kx в исходное равенство xy = yx, получаем xkx = (kx)x, то есть xk–1 = k. По предположению k > 1, а значит, x > 1. Ясно, что 22–1 = 2. Легко также проверить, что если x > 2 или k > 2, то xk–1 > k.",
        "Ответ: {2, 4}."
    ],
    "73618": [
        "Простые числа и их свойства",
        "Сложность: 5",
        "Классы: 8,9,10,11",
        "Условие: Докажите, что числа 1, 2, ..., n ни при каком n > 1 нельзя разбить на два множества так, чтобы произведение чисел одного из них равнялось произведению чисел другого.",
        "Решение: Согласно постулату Бертрана найдётся такое простое p, что n/2 < p < n. Оно может войти лишь в одну  группу чисел, а уравновесить его нечем, поскольку 2p > n."
    ],
    "30358": [
        "Количество и сумма делителей числа",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Пусть p и q – различные простые числа. Сколько делителей у числа     а) pq;    б) p²q;     в) p²q²;     г) pmqn?",
        "Решение: г) Каждый делитель также имеет вид pkql, причём показатель k можно выбрать m + 1 способом (от 0 до m), а показатель l – n + 1 способом.",
        "Ответ: а) 4 делителя; б) 6;  в) 9;  г) (m + 1)(n + 1) делителей."
    ],
    "35071": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Сколько существует пар натуральных чисел, у которых наименьшее общее кратное (НОК) равно 2000?",
        "Подсказка: Либо одно из чисел равно 2000, либо в разложении одного из чисел на простые сомножители должен присутствовать множитель 24, а в разложении другого – множитель 53.",
        "Решение: Рассмотрим две возможности.    1) Одно из чисел равно 2000. Тогда другое число может быть  любым делителем числа 2000. Поскольку 2000 = 24·53, оно имеет 20 делителей (см. задачу 30358).    2) Ни одно из двух чисел a, b не равно 2000. Тогда в разложении одного из этих чисел a, b (для определенности, a) на простые сомножители должен присутствовать множитель 24, а в разложении другого – множитель 53. Таким образом, a = 24·5m,  b = 2n·53, где m может принимать 3 значения (0, 1, 2), и независимо от этого n может принимать 4 значения (0, 1, 2, 3). Таким образом, в этом случае имеется 3·4 = 12 возможностей.    Итак, имеется 20 + 12 = 32 пары натуральных чисел, имеющие НОК = 2000.",
        "Ответ: 32 пары."
    ],
    "64788": [
        "Произведения и факториалы",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Число  записали в виде несократимой дроби. Найдите её знаменатель.",
        "Решение: Так как 1050 = 250·550, то надо выяснить, какие из этих ста простых множителей сократятся.",
        "Ответ: 526."
    ],
    "65217": [
        "Деление с остатком",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Известно, что остаток от деления некоторого простого числа на 60 равен составному числу. Какому?",
        "Решение: Так как 60 = 2²·3·5, то остаток не может быть кратен числам 2, 3 или 5 (иначе исходное число обладало бы тем же свойством и не могло бы оказаться простым). Так как остаток меньше чем 60 и является произведением хотя бы двух простых множителей, то он равен 7·7. Другие варианты невозможны, поскольку уже следующее произведение двух простых чисел (7·11) больше 60.",
        "Ответ: 49."
    ],
    "65424": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: На доске записаны числа 20 и 100. Разрешается дописать на доску произведение любых двух имеющихся на ней чисел. Можно ли такими операциями когда-нибудь получить на доске число 50...0 (2015 нулей)?",
        "Решение: Так как 20 = 2²·5, 100 = 2²·5², то изначально на доске записаны числа, в разложении которых простые множители двоек не меньше, чем пятерок. При умножении двух чисел, обладающим этим свойством, получится число с этим же свойством, то есть оно будет выполняться для всех чисел, записанных на доске. В разложении числа 50...0 на простые множители количество пятерок на 1 больше, чем количество двоек, поэтому его получить нельзя.",
        "Ответ: Нельзя."
    ],
    "78544": [
        "Формула включения-исключения",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Имеется бесконечное количество карточек, на каждой из которых написано какое-то  натуральное число. Известно, что для любого натурального числа n существуют  ровно n карточек, на которых написаны делители этого числа. Доказать, что  каждое натуральное число встречается хотя бы на одной карточке.",
        "Решение: Найдём, на скольких карточках написано число  Для этого найдём, на скольких карточках написаны делители числа n, меньшие n. Каждый такой делитель является делителем одного из чисел n/p1, ..., n/pk. Обозначим через Ai множество карточек, на которых написан один из делителей числа n/pi. Заметим, что Ai1 ∩ Ai2 ∩ ... ∩ Ail есть множество карточек, на которых написаны делители числа . Следовательно, по условию   |Ai1 ∩ Ai2 ∩ ... ∩ Ail| = ,  где |A| – количество элементов множества A. По формуле включения-исключения получаем, что число карточек, на которых написаны делители числа n, меньшие n, равно    откуда число карточек, на которых написано число n, равно"
    ],
    "60508": [
        "Простые числа и их свойства",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Докажите, что число 22n – 1 имеет по крайней мере n различных простых делителей.",
        "Подсказка: Воспользуйтесь взаимной простотой чисел Ферма (см. задачу 60507)."
    ],
    "76552": [
        "Делимость чисел. Общие свойства",
        "Сложность: 4+",
        "Классы: 8,9,10",
        "Условие: Из двухсот чисел: 1, 2, 3, ..., 199, 200 выбрали одно число, меньшее 16, и ещё 99 чисел.   Докажите, что среди выбранных чисел найдeтся два таких, одно из которых делится на другое.",
        "Решение: Предположим, что из чисел 1, 2, 3, ..., 199, 200 мы выбрали 100 чисел так, что ни одно из них не делится на другое. Достаточно доказать, что среди  выбранных чисел нет чисел, меньших 16. Рассмотрим наибольшие нечётные делители  всех выбранных чисел. Если наибольшие нечётные делители двух чисел совпадают,  то одно из них делится на другое. Поэтому наибольшие нечётные делители  выбранных чисел – это в точности все числа 1, 3, 5, ..., 199.     В частности, среди выбранных чисел есть числа с наибольшими нечётными делителями 1, 3, 9, 27 и 81. Ни одно из выбранных чисел не делится на другое, поэтому выбранное число с наибольшим нечётным делителем 27 делится на 2, с наибольшим нечётным делителем 9 – на 2², с наибольшим нечётным делителем 3 – на 2³, с наибольшим нечётным делителем 1 – на 24. Следовательно, среди выбранных чисел нет чисел 1, 2, 3, 4, 6, 8, 9 и 12.     Аналогично, рассматривая выбранные числа с наибольшими нечётными делителями 5, 15 и 45, убеждаемся, что среди выбранных чисел нет чисел 5, 10 и 15; рассматривая выбранные числа с наибольшими нечётными делителями 7, 21 и 63, убеждаемся, что нет чисел 7 и 14; рассматривая выбранные числа с наибольшими нечётными делителями 11 и 33, убеждаемся, что нет числа 11; рассматривая выбранные числа с наибольшими нечётными делителями 13 и 39, убеждаемся, что нет числа 13."
    ],
    "79488": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4+",
        "Классы: 8,9,10",
        "Условие: Произведение некоторых 1986 натуральных чисел имеет ровно 1985 различных простых делителей.   Доказать, что либо одно из этих чисел, либо произведение нескольких из них является квадратом натурального числа.",
        "Решение: Рассмотрим наборы исходных чисел, взятых во всех возможных количествах: по  одному, по два, по три и т. д.  Таких наборов 21986 − 1. Числа в каждом таком наборе перемножим и полученное произведение представим в виде произведения наибольшего полного квадрата и нескольких простых сомножителей (например, 216·315·513·179 = (28·37·56174)²·3·5·17, а 216·1310 = (28·135)²). Сопоставим каждому набору исходных чисел тот набор простых чисел, который получается после выделения наибольшего точного квадрата из их произведения (в рассмотренных примерах первому числу сопоставляется набор 3, 5, 17, а второму – пустой набор). Число различных наборов из 1985 простых делителей (включая и пустой набор) равно 21985, что меньше количества 21986 − 1 наборов из исходных чисел. Поэтому каким-то двум наборам A и В из исходных чисел отвечает один и тот же набор p1, ..., pk простых делителей, то есть A = a²p1p2...pk, B = b²p1...pk. Следовательно, произведение AВ есть точный квадрат. С другой стороны, AВ равно произведению чисел в наборе A и чисел в наборе В. Выбросив из наборов A и В их общую часть (произведение выбрасываемых чисел есть точный квадрат), получим, что произведение остальных чисел является точным квадратом."
    ],
    "111813": [
        "Свойства коэффициентов многочлена",
        "Сложность: 4+",
        "Классы: 9,10,11",
        "Условие: Даны положительные рациональные числа a, b. Один из корней трёхчлена x² – ax + b – рациональное число, в несократимой записи имеющее вид m/n. Докажите, что знаменатель хотя бы одного из чисел a и b (в несократимой записи) не меньше n2/3.",
        "Решение: Пусть a = k/c, b = l/d. Пусть некоторое простое p входит в разложение числа n на простые множители в степени α. По условию m²/n² – km/cn + l/d = 0, при этом p входит в разложение знаменателя первой дроби в степени 2α. Если в разложения обоих остальных знаменателей число p входит в меньших степенях, то итоговая дробь не может оказаться целым числом. Значит, либо cn, либо d кратно p2α, то есть либо c кратно pα, либо d кратно p2α. В любом случае, число c²d делится на p2α. Поскольку аналогичный факт верен для каждого простого делителя n, то c²d делится на n². Отсюда  c²d ≥ n², следовательно одно из чисел c, d не меньше n2/3."
    ],
    "79498": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4+",
        "Классы: 8,9,10",
        "Условие: Произведение некоторых 48 натуральных чисел имеет ровно 10 различных простых  делителей.  Докажите, что произведение некоторых четырёх из этих чисел является  квадратом натурального числа.",
        "Решение: Представим произведение произвольной пары чисел (a, b) из данного набора в виде произведения квадрата натурального числа на произведение простых делителей в первых степенях (например, если a = 213·34·19³,  b = 56·77·19, то ab = K²·2·7, где K = 26·3²·5³·7³·19²). Сопоставим паре (a, b)   получившийся набор простых делителей. Всевозможных различных пар (a, b) в наборе из 48 чисел    а количество наборов из 10 простых делителей (включая пустой набор) 210 = 1024. Так как 1128 > 1024, то найдутся две различные пары (a, b) и (c, d) из набора, которым отвечает один и тот же набор (p1, p2,..., pk) простых делителей (0 ≤ k ≤ 10). Следовательно, abcd – точный квадрат.       Если при этом пары (a, b) и (c, d) не имеют общего элемента, то числа a, b, c, d – искомые. Если же общий элемент есть, например b = d, то тогда ac – точный квадрат. Выкинем на время числа a и c из рассмотрения. Тогда мы приходим к набору из 46 чисел, произведение которых имеет не более 10 различных простых делителей. Проведя те же рассуждения, что и выше, и учитывая, что    приходим к выводу о существовании двух различных пар чисел (x, y) и (z, t) из набора, для которых xyzt – точный квадрат. Если общего элемента у этих пар нет, то x, y, z, t – искомые четыре числа; если же общий элемент есть, например x = t, то yz – точный квадрат. В этом случае искомой четвёркой чисел является (a, c, y, z)."
    ],
    "64190": [
        "Задачи с неравенствами. Разбор случаев",
        "Сложность: 3",
        "Классы: 7,8,9,10",
        "Условие: Эстафета длиной 2004 км состоит из нескольких этапов одинаковой длины, выражающейся целым числом километров. Участники команды города Энск бежали несколько дней, пробегая каждый этап ровно за один час. Сколько часов они бежали, если известно, что они уложились в неделю?",
        "Решение: По условию 2004 делится на число часов. С другой стороны, это число не превосходит числа часов в неделе, то есть 168. Все делители числа   2004 = 2·2·3·167, не превосходящие 168, это 1, 2, 3, 4, 6, 12 и 167. Если бегуны бежали не больше 12, часов, то их скорость была не меньше 167 км/ч, что нереально. Значит, они бежали 167 часов (со скоростью 12 км/ч).",
        "Ответ: 167 часов."
    ],
    "78014": [
        "Четность и нечетность",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Дано число H = 2·3·5·7·11·13·17·19·23·29·31·37 (произведение простых чисел). Пусть 1, 2, 3, 5, 6, 7, 10, 11, 13, 14, ..., H – все его делители, выписанные в порядке возрастания. Под рядом делителей выпишем ряд из единиц и минус единиц по следующему правилу: под единицей 1, под числом, которое разлагается на чётное число простых сомножителей, 1, и под числом, которое разлагается на нечётное число простых сомножителей, –1. Доказать, что сумма чисел полученного ряда равна 0.",
        "Решение: Будем называть чётным делитель, который разлагается на чётное число простых сомножителей (1 относится к чётным делителям), а нечётным – делитель, который разлагается на нечётное число простых сомножителей. Докажем индукцией по k, что число Nk = 2·3·5·7·...·pk (произведение первых k простых чисел) имеет 2k–1 чётных делителей и 2k–1 нечётных делителей. (Тогда для числа Nk рассматриваемая сумма равна 2k–1 – 2k–1 = 0.)     База. Для числа N1 = 2 утверждение очевидно.     Шаг индукции. Число Nk+1 имеет 2k–1 чётных делителей и 2k–1 нечётных делителей, не делящихся на pk+1 (все эти делители являются делителями числа Nk). Помимо этих делителей оно имеет делители, делящиеся на pk+1. А именно, 2k–1 чётных делителей, соответствующих нечётным делителям числа Nk, и 2k–1 нечётных делителей, соответствующих чётным делителям числа Nk. В  итоге получаем 2k–1 + 2k– 1 = 2k чётных делителей и 2k нечётных делителей."
    ],
    "78719": [
        "Примеры и контрпримеры. Конструкции",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: В стране Анчурии, где правит президент Мирафлорес, приблизилось время новых  президентских выборов. В стране ровно 20 миллионов избирателей, из которых  только один процент поддерживает Мирафлореса (регулярная армия Анчурии).  Мирафлорес, естественно, хочет быть избранным, но, с другой стороны, он хочет,  чтобы выборы были демократическими. Демократическим голосованием Мирафлорес называет вот что: все избиратели разбиваются на равные группы; каждая из этих групп вновь разбивается на некоторое количество равных групп, причём большие группы могут разбиваться на разное количество меньших групп, затем эти группы снова разбиваются и т.д. В самых мелких группах выбирают представителя группы выборщика для голосования в большей группе: выборщики в этой большей группе выбирают выборщика для голосования в ещё большей группе и т.д. Наконец, представители самых больших групп выбирают президента.  Мирафлорес делит избирателей на группы по своей воле и инструктирует своих сторонников, как им голосовать. Сможет ли он так организовать демократические выборы, чтобы его выбрали? (В каждой группе выборщики выбирают своего представителя простым большинством. При равенстве голосов побеждает оппозиция.)",
        "Решение: Разобьём избирателей на группы по 5 человек. В 66666 таких групп можно поместить по 3 военных. В результате получится 66666 военных выборщиков из 4миллионов.      Разобьём эти 4 миллиона выборщиков на группы по 4 человека, поместив в 22222 из них по 3 военных. В результате получится 22222 военных выборщика из миллиона.     Повторяя эти две операции, мы видим, что уменьшеная число выборщиков в 20 раз, мы уменьшаем число военных выборщиков в 9 раз. Последовательно получаем 2469 военных выборщиков из 50000, 274 – из 2500, 30 – из 125. Далее дважды разделив на группы по 5, получим трёх военных выборщиков из пяти, что позволит президенту выиграть.",
        "Ответ: Сможет."
    ],
    "105179": [
        "Теория игр (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Назовём натуральное число разрешённым, если оно имеет не более 20 различных простых делителей. В начальный момент имеется куча из 2004! камней. Два игрока по очереди забирают из кучи некоторое разрешённое количество камней (возможно, каждый раз новое). Побеждает тот, кто заберёт последние камни. Кто выигрывает при правильной игре?",
        "Решение: Пусть l – произведение первых 21 простых чисел.  Заметим, что l – наименьшее неразрешенное число. Нетрудно проверить, что 21-е простое число – это 71 < 2004. Значит, 2004! делится на l.     Рассмотрим числоm, полученное после первого хода первого игрока. Так как число камней, взятое за один ход, не может делиться на l, число m не делится на l. Рассмотрим остаток r от деления числа m на l. Этот остаток меньше l, поэтому он не может делиться больше чем на 20 простых чисел. Второй игрок сможет взять r камней и снова получить число, кратное l, и т. д.     Итак, если второй будет каждый раз брать остаток от деления числа камней на l, то после каждого хода первого игрока число камней в кучке не делится на l, а после хода второго игрока – делится. Значит, первый игрок не сможет взять последние камни, так что выиграет второй игрок.",
        "Ответ: Второй игрок."
    ],
    "109452": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Определите, на какую наибольшую натуральную степень числа 2007 делится 2007!",
        "Решение: 2007 = 3²·223. В разложении на простые множители числа 2007! показатель степени у числа 3 будет достаточно большим, так как множитель 3 входит в разложение каждого третьего числа. Множитель 223 входит только в разложение чисел вида 223р, где р – натуральное число, не превосходящее 9. Таким образом, в разложение числа 2007! на простые множители число 223 войдёт с показателем 9. Следовательно, число 2007! будет делиться на 20079, но не будет делиться на 200710.",
        "Ответ: На девятую степень."
    ],
    "88059": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Незнайка хвастал своими выдающимися способностями умножать числа в уме. Чтобы его проверить, Знайка предложил ему написать какое-нибудь число, перемножить его цифры и сказать результат. – 1210, – немедленно выпалил Незнайка. – Ты неправ! – сказал, подумав, Знайка. Как он обнаружил ошибку, не зная исходного числа?",
        "Подсказка: Попробуйте найти цифры числа, которое взял Незнайка.",
        "Решение: Если бы Незнайка оказался прав, то в числе были бы две цифры 11, поскольку среди делителей числа 1210 дважды встречается простое число 11."
    ],
    "34846": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В последовательности троек целых чисел (2, 3, 5), (6, 15, 10),... каждая тройка получается из предыдущей таким образом:   первое число умножается на второе, второе – на третье, а третье – на первое, и полученные произведения дают новую тройку. Докажите, что ни одно из чисел, получаемых таким образом, не будет степенью целого числа: квадратом, кубом и т.д.",
        "Подсказка: Каждая тройка имеет вид: (2a3b5c, 2c3a5b,  2b3c5a).",
        "Решение: Легко проверить, что каждая тройка имеет вид:   (2a3b5c,  2c3a5b, 2b3c5a), где a, b, c – некоторые целые числа. Действительно, тройка показателей (a', b', c') для следующей тройки чисел получается из предыдущей тройки показателей (a, b, c) по правилу:  (a', b', c') = (a + c, a + b, b + c).     Некоторое из чисел какой-либо тройки является степенью тогда и только тогда, когда числа из тройки показателей будут делиться на одно и то же простое число p.     Предположим, что такое случилось, и рассмотрим тройку показателей (a', b', c') с наименьшим номером, где все три числа кратны p. Рассмотрим два случая.     1) p = 2. Это – не первая тройка: она равна (1, 0, 0). Значит, в предыдущей тройке все числа одной чётности, то есть все нечётны. Это снова не первая тройка, значит, в предыдущей все числа разной чётности, что невозможно.     2) p – нечётное простое число. В предыдущей тройке (a, b, c) суммы a + b, b + c, c + a кратны p. Сложив эти числа, получим, что 2(a + b + c) и, следовательно, a + b + c  кратно p. Значит, и a = (a + b + c) – (b + c) кратно p. Аналогично b и c кратны p. Противоречие с выбором тройки (a', b', c')."
    ],
    "35588": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что n! не делится на 2n.",
        "Подсказка: С каким показателем входит простой множитель 2 в разложение числа n! на простые множители?",
        "Решение: Из чисел от 1 до n каждое второе делится на 2, то есть добавляет множитель 2 в разложение числа n! на простые множители. Таких чисел [n/2]. Кроме того, каждое четвёртое число делится на 4 = 22, то есть добавляет еще одну двойку в разложение числа n!. Таких чисел [n/4]. Каждое восьмое число добавляет еще одну двойку и т.д. Таким образом, простой множитель 2 входит в разложение числа n! на простые множители с показателем, равным   [n/2] + [n/4] + ... + [n/2k] + ... < n/2 + n/4 + ... + n/2k + ... = n (мы воспользовались формулой для суммы бесконечной геометрической прогрессии). Таким образом, двойка входит в разложение числа n! на простые множители с показателем, меньшим n."
    ],
    "35713": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что число  делится на 2k и не делится на 2k+1.",
        "Подсказка: Покажите, что Nk+1 по сравнению с Nk делится еще на одну степень двойки.",
        "Решение: Докажем утверждение индукцией по k. База (k = 1) очевидна.     Шаг индукции.    Таким образом, число Nk+1 получается из Nk домножением на 2 и на нечётное число, поэтому по предположению индукции оно делится на на 2k+1 и не делится на 2k+2."
    ],
    "60835": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Найдите наименьшее натуральное число, половина которого – квадрат, треть – куб, а пятая часть – пятая степень.",
        "Ответ: 215·310·56."
    ],
    "64998": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: На доске выписаны числа 1, 2, ..., 100. На каждом этапе одновременно стираются все числа, не имеющие среди нестёртых чисел делителей, кроме себя самого. Например, на первом этапе стирается только число 1. Какие числа будут стёрты на последнем этапе?",
        "Решение: На следующем этапе после стирания единицы будут стёрты все простые числа (у них нет делителей, кроме 1 и самого числа). Далее будут стёрты числа, в разложение которых входит ровно два простых множителя (необязательно различных), затем стёрты числа, в разложение которых входит ровно три простых множителя, и так далее. Так как 27 > 100, то среди заданных нет чисел, в разложение которых входит больше шести простых множителей. Следовательно, на последнем шаге будут стёрты числа, в разложение которых входит ровно шесть простых множителей. Так как   32·24 > 100, то таких чисел всего два: 26 = 64 и 3·25 = 96.",
        "Ответ: 64 и 96."
    ],
    "77880": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Показать, что 271958 – 108878 + 101528 делится на 26460.",
        "Решение: Заметим, что 26460 = 2²·3³·5·7². Представим число A = 271958 – 108878 + 101528 в виде 271958 – (108878 – 101528). Это число делится на 5·7². Действительно, 27195 = 3·5·7²·37, а разность 108878 – 101528 делится на 10887 – 10152 = 735 = 3·5·7². С другой стороны,  A = (271958 – 108878) + 101528, откуда видно, что число A делится на 2²·3³. Действительно, 271958 – 108878 делится на   27195 – 10887 = 16308 = 2²·3³·151, а 10152 = 2³·3³·47."
    ],
    "115462": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Произведение двух натуральных чисел, каждое из которых не делится нацело на 10, равно 1000. Найдите их сумму.",
        "Решение: Так как 1000 = 5³·2³, то каждое из чисел в своем разложении на простые множители может содержать только двойки и пятёрки. При этом оба этих множителя не могут присутствовать в разложении одного числа, иначе оно будет делиться на 10.     Следовательно, одно из чисел равно 5³, а другое – 2³, а их сумма равна 5³ + 2³ = 125 + 8 = 133.",
        "Ответ: 133."
    ],
    "79506": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Доказать, что из любых 27 различных натуральных чисел, меньших 100, можно  выбрать два числа, не являющихся взаимно простыми.",
        "Решение: Рассмотрим произвольный набор из 27 различных натуральных чисел, меньших 100.  Для каждого числа из набора отметим либо один из его простых делителей (если  это число не равно единице), либо единицу (если это число равно единице). Так  как простых чисел, меньших ста, всего 25, то какое-то число мы отметили  дважды.  Этим числом не могла быть единица, поскольку единицу мы отмечали  только для единицы. Следовательно, в наборе есть два числа с общим простым  делителем, то есть два числа, не являющихся взаимно простыми."
    ],
    "34902": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Докажите, что сумма всех чисел вида 1/mn, где m и n – натуральные числа, 1 < m < n < 1986, не является целым числом.",
        "Подсказка: Среди чисел m и n найдите числа, делящиеся на максимально   возможную степень тройки.",
        "Решение: Среди чисел от 1 до 1986 имеются ровно два – 729 = 36 и 1458 = 2·36, – делящиеся на 36; наибольшая степень 3, на которые могут делиться остальные числа – 35. Таким образом, всевозможные произведения mn (1 < m < n <1986), за исключением 729·1458 = 2·312, содержат множителем число 3 самое большее в степени 11. Приведя сумму всех дробей 1/mn, кроме 1/729·1458, к общему знаменателю, мы получим дробь вида    где a и b – натуральные числа, причём b не делится на 3. Пусть s – сумма, рассматриваемая в задаче, тогда    или 2·312sb – 6a = b. При целом s левая часть кратна 3, а правая – нет. Поэтому s не может быть целым."
    ],
    "60553": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Число n! разложено в произведение простых чисел:      Докажите равенство",
        "Подсказка: См. задачу 35588."
    ],
    "60554": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Докажите, что число p входит в разложение n! с показателем, не превосходящим",
        "Подсказка: Отбросьте знак целой части в формуле Лежандра (см. задачу   60553) и дополните сумму до  бесконечной геометрической прогрессии."
    ],
    "60557": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: При помощи формулы Лежандра (см. задачу 60553) докажите, что число  целое.",
        "Решение: Заметим, что   а    только когда n + 1  делится на pα. Но в этом случае"
    ],
    "64899": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: В равенстве х5 + 2x + 3 = pk числа х и k – натуральные. Может ли число р быть простым?",
        "Решение: Заметим, что x5 + 2x + 3 = (x + 1)(x4 – x³ + x² – x + 3). При этом оба множителя больше единицы, а второй не меньше первого.",
        "Ответ: Не может."
    ],
    "65904": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4",
        "Классы: 7,8",
        "Условие: Какое наибольшее количество натуральных чисел, не превосходящих 2016, можно отметить так, чтобы произведение любых двух отмеченных чисел было бы точным квадратом?",
        "Решение: Так как 44² < 2016 < 45², то натуральных чисел, квадраты которых не больше чем 2016, всего 44. Произведение двух точных квадратов является точным квадратом, поэтому числа 1 = 1², 4 = 2², ..., 1936 = 44² могут быть отмечены.     Докажем, что большее количество чисел отметить невозможно. Действительно, рассмотрим искомый набор чисел и разделим каждое из чисел этого набора на наибольший точный квадрат, на который оно делится. Получим новый набор чисел, причём в разложение каждого из получившихся чисел на простые множители эти множители входят только в первой степени. Заметим, что каждый простой множитель (если он есть) должен присутствовать во всех разложениях, так как при перемножении любых двух чисел полученного набора он должен оказаться в чётной степени. Это означает, что после деления каждого числа искомого набора на наибольшие квадраты должно получиться одно и то же число q. Если q = 1, то получим набор из 44 чисел, которые сами являются точными квадратами (см. выше), а если q > 1, то получим набор из меньшего количества чисел, поскольку 1936q > 2016.",
        "Ответ: 44 числа."
    ],
    "79246": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: С натуральным числом K производится следующая операция: оно представляется в виде произведения простых сомножителей K = p1p2...pn; затем вычисляется сумма p1 + p2 + ... + pn + 1. С полученным числом производится то же самое, и т.д.   Доказать, что образующаяся последовательность, начиная с некоторого номера, будет периодической.",
        "Решение: Обозначим через f(K) сумму p1 + p2 + ... + pn + 1.   Простым подсчётом проверим, что если K > 9, то последовательность с какого-нибудь момента станет периодической."
    ],
    "79423": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Найти все такие натуральные n, для которых числа 1/n и 1/n+1 выражаются конечными десятичными дробями.",
        "Решение: При n > 1 должны выполняться равенства 2k5l = n и 2s5t = n + 1. Числа n и n + 1 взаимно просты, поэтому есть только два варианта: либо   5l + 1 = 2s, либо 2k + 1 = 5t.     1) 2s = 5l + 1. Тогда число 2s оканчивается на 6, поэтому s = 4m. Значит, 5l = 24m – 1 = (22m – 1)(22m + 1). Но числа 22m – 1 и 22m + 1 не могут одновременно делиться на 5.     2) 2k = 5t – 1. Если t чётно, то 5t – 1 делится на 5² – 1 = 24 и не может быть степенью двойки.   Если t нечётно, то 2k = 5t – 1 = 4(5t–1 + 5t–2 + ... + 1) и второй множитель – сумма нечётного числа нечётных слагаемых, то есть нечётен. Значит, t = 1.    Это соответствует равенству 2² + 1 = 5.",
        "Ответ: 1 и 4."
    ],
    "32030": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Сколько двоек будет в разложении на простые множители числа 1984! ?",
        "Решение: Среди чисел от 1 до 1984 есть 992 чётных. Каждое из них дает по крайней мере одну двойку в разложение на простые множители числа 1984!. Две двойки в это разложение дадут числа, делящиеся на 4 (их всего 496). Далее, по 3, 4, 5, 6, 7, 8, 9 и 10 двоек соответственно дадут 248, 124, 62, 31, 15, 7, 3 и 1 число,   делящиеся на 8, 16, 32, 64, 128, 256, 512 и 1024 соответственно. Сложив результаты, мы и получим искомое количество двоек:   992 + 496 + 248 + 124 + 62 + 31 + 15 + 7 + 3 + 1 = 1979.",
        "Ответ: 1979 двоек."
    ],
    "60555": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Пусть представление числа n в двоичной системе выглядит следующим образом:  n = 2e1 + 2e2 +...+ 2er   (e1 > e2 > ... >  er ≥ 0).   Докажите, что n! делится на 2n–r, но не делится на 2n–r+1.",
        "Решение: Смотри решение задачи 60556."
    ],
    "60558": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Докажите, что число  (m, n ≥ 0) целое.",
        "Решение: Лемма. [a] + [b] + [a + b] ≤ [2a] + [2b].     Доказательство. Рассмотрим два случая.     1) {a} + {b} < 1. Тогда [a + b] = [a] + [b] и [a] + [b] + [a + b] = 2[a] + 2[b] ≤ [2a] + [2b].    2) {a} + {b} ≥ 1. Тогда хотя бы одно из чисел {a}, {b} (например, {b}) не меньше ½. Поэтому [2b] = 2[b] + 1 и   [a] + [b] + [a + b] = [a] + [b] + [a] + [b] + 1 = 2[a] + 2[b] + 1 = [2a] + [2b]."
    ],
    "60559": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Существует ли такое целое число r, что  является целым числом при любом n?",
        "Подсказка: Рассмотрите числа n вида n = 2k – 1 и примените к ним формулу Лежандра  (см. задачу   60553).",
        "Ответ: Не существует."
    ],
    "78613": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Из первых k простых чисел 2, 3, 5, ..., pk (k > 5) составлены всевозможные произведения, в которые каждое из чисел входит не более одного раза (например, 3·5,   3·7·... ·pk, 11 и т. д.). Обозначим сумму всех таких чисел через S. Доказать, что S + 1 разлагается в произведение более 2k простых сомножителей.",
        "Решение: Ясно, что S + 1 = (2 + 1)(3 + 1)...(pk + 1). Сумма в каждой скобке, кроме первой, чётна, поэтому она разлагается по крайней мере на два простых множителя. Несложные вычисления показывают, что при k = 5 число S + 1 разлагается в произведение 11 простых множителей. Поэтому при k > 5 число множителей не меньше чем 11 + 2(k – 5) > 2k."
    ],
    "78682": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Известно, что an – bn делится на n (a, b, n – натуральные числа, a ≠ b). Доказать, что  делится на n.",
        "Решение: Воспользуемся методом математической индукции.     База. Пусть n – простое число. Если число  a – b не делится на n, то всё ясно. Если же a ≡ b (mod n), то   = an–1 + an–2b + ... + abn–2 + bn–1 ≡ nbn–1 ≡ 0 (mod n).     Шаг индукции. Пусть для всех показателей, меньших n, утверждение доказано. Обозначим d = НОД(n, a – b), тогда n = kd.     Если d = 1, то все ясно. Если d = n, то a ≡ b (mod n), и можно повторить вышеприведённое доказательство.      Если же 1 < d < n, то    делится на n, так как первый множитель делится на k, а второй – на d (у последней дроби знаменатель, а тем более числитель делится на d)."
    ],
    "88254": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 2+",
        "Классы: 5,6,7,8",
        "Условие: Существует ли целое число, произведение цифр которого равно а) 1980? б) 1990? в) 2000?",
        "Подсказка: Эту задачу можно сформулировать иначе: Можно ли разложить числа 1980, 1990, 2000 на однозначные сомножители?",
        "Решение: Среди делителей числа 1980 – двузначное простое число 11, а среди делителей числа 1990 – трёхзначное простое число 199, поэтому ни 1980, ни 1990 в такие произведения разложить нельзя. Число 2000 можно разными способами  разложить на однозначные множители, например так: 2000 = 245³. Следовательно, таких чисел, как требуется в условии, достаточно много. Вот, например, два из них – 555422 и 25855.",
        "Ответ: а-б) Не существует; в) существует."
    ],
    "60556": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4+",
        "Классы: 9,10,11",
        "Условие: Пусть p – простое число и представление числа n  в p-ичной системе имеет вид:  n = akpk + ak–1pk–1 + ... + a1p1 + a0.   Найдите формулу, выражающую показатель αp, с которым это число p входит в каноническое разложение n!, через n, p, и  коэффициенты ak.",
        "Решение: По формуле Лежандра  (см. задачу 60553)     αp = (akpk–1 + ... + a1) + (akpk–2 + ... + a2) + ... + ak = ak(pk–1 + ... + p + 1) + ... + a1 ="
    ],
    "30363": [
        "Произведения и факториалы",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Может ли n! оканчиваться ровно на пять нулей?",
        "Решение: 24! оканчивается на четыре нуля. При добавлении множителя 25 добавится еще два нуля (так как число 25 в разложение факториала добавит сразу две пятерки). Поэтому 25! оканчивается уже на шесть нулей.",
        "Ответ: Не может."
    ],
    "30364": [
        "Произведения и факториалы",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: На сколько нулей оканчивается число 100!?",
        "Подсказка: Достаточно найти, сколько пятёрок входит в разложение числа 100! на простые множители.",
        "Решение: Необходимо найти, сколько пар простых чисел 2 и 5 найдётся в разложении числа 100! на простые множители.     В разложении 100! двоек будет больше, чем пятёрок. Поэтому достаточно найти степень, в которой 5 входит в разложение числа 100!.     Среди чисел от 1 до 100 всего 20 чисел дают пятёрки в разложение, причём числа 25, 50, 75 и 100 дают сразу две пятёрки. Поэтому искомая степерь равна 24.",
        "Ответ: На 24 нуля."
    ],
    "32778": [
        "Произведения и факториалы",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Дано число 1·2·3·4·5·...·56·57.     а) Какая последняя цифра этого числа?     б) Каковы десять последних цифр этого числа?",
        "Решение: а) Среди множителей есть число 10. Значит, все произведение делится на 10, следовательно, кончается на 0.",
        "Ответ: а) 0;  б) 10 нулей."
    ],
    "35455": [
        "Произведения и факториалы",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Докажите, что число 100! не является полным квадратом.",
        "Подсказка: Если число – полный квадрат, то каждое простое число входит в разложение этого числа на простые множители в чётной степени.",
        "Решение: Если бы число 100! было  полным квадратом, то каждое простое число входило бы в разложение этого числа на простые множители в чётной степени. Однако в произведении 1·2·...·97·98·99·100 = 100! есть только одно число, делящееся на  простое число 97 (само число 97). Поэтому число 97 входит в разложение числа 100! на простые множители в первой степени."
    ],
    "88149": [
        "Текстовые задачи (прочее)",
        "Сложность: 2+",
        "Классы: 5,6,7",
        "Условие: Группа восьмиклассников решила поехать во время каникул на экскурсию в Углич.  Ежемесячно каждый ученик вносил определённое количество рублей (без копеек), одинаковое для всех, и в течение пяти месяцев было собрано 49685 руб. Сколько было в группе учеников и какую сумму внёс каждый?",
        "Подсказка: Заметьте, за один месяц ребята собрали денег в 5 раз меньше, чем за пять месяцев.",
        "Решение: За один месяц ребята собрали 49685 : 5 = 9937 руб. Эта сумма является произведением числа учеников на ежемесячный взнос каждого из них. Число 9937 может быть представлено в виде произведения двух сомножителей только двумя способами: 9937 = 9937·1 = 19·523. Но учеников не может быть ни 9937, ни 523, ни 1. Следовательно, единственный вариант: 19 ребят ежемесячно вносили по 523 руб.",
        "Ответ: 19 учеников внесли по 2615 руб."
    ],
    "109423": [
        "Ребусы",
        "Сложность: 2+",
        "Классы: 6,7",
        "Условие: В конце четверти Вовочка выписал подряд в строчку свои текущие отметки по пению и поставил между некоторыми из них знак умножения. Произведение получившихся чисел оказалось равным 2007. Какая отметка выходит у Вовочки в четверти по пению? (Колов учительница пения не ставит.)",
        "Решение: 2007 = 3·3·223 = 9·223 = 3·669. Поскольку отметки 9 не бывает, то подходит только первый вариант. Так как троек у Вовочки больше, чем двоек, и последняя отметка, как ни переставляй множители, – тройка, можно надеяться, что тройку в четверти он получит.",
        "Ответ: Тройка."
    ],
    "35582": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Какое наименьшее натуральное число не является делителем 50!?",
        "Подсказка: n! не делится ни на какое простое число, большее n.",
        "Решение: Простое число 53 не входит в разложение на простые множители числа 50!, поэтому 50! не делится на 53. С другой стороны ясно, что 50! делится на   3·17 = 51 и на 4·13 = 52.",
        "Ответ: 53."
    ],
    "116484": [
        "Арифметика остатков (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Незнайка утверждает, что существует восемь таких последовательных натуральных чисел, что в разложение их на простые множители каждый множитель входит в нечётной степени (например, два таких последовательных числа: 23 = 231 и 24 = 2³·31). Прав ли он?",
        "Решение: Восемь последовательных натуральных чисел дают различные остатки при делении на 8. Следовательно, среди них найдётся число, которое при делении на 8 дает остаток 4. Это число делится на 4, но не делится на 8, поэтому в разложение его на простые множители двойка входит во второй степени.",
        "Ответ: Неправ."
    ],
    "34971": [
        "Уравнения в целых числах",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Найдите все целые решения уравнения yk = x² + x, где k – фиксированное натуральное число, большее 1.",
        "Подсказка: Разложите правую часть на множители и используйте взаимную простоту этих множителей.",
        "Решение: yk = x(x + 1). Числа x и x + 1 взаимно просты, поэтому x и x + 1 являются k-ми степенями целых чисел. Ясно, что имеется ровно две пары последовательных целых чисел, являющихся k-ми степенями при k > 1 – (–1, 0) и (0, 1). Таким образом, x может принимать только два значения: 0 и –1. Остается проверить, что оба эти значения подходят и в обоих случаях y = 0.",
        "Ответ: (0, 0) и (–1, 0)."
    ],
    "35309": [
        "Уравнения в целых числах",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: У капитана Смоллетта двое сыновей и несколько дочерей. Если возраст капитана (конечно, ему меньше ста лет) умножить на количество его детей и на длину его шхуны (это целое число футов), то получится 32118. Сколько лет капитану Смоллетту, сколько у него детей и какова длина его корабля?",
        "Подсказка: Разложите 32118 на множители.",
        "Решение: Число детей капитана по условию больше 3; возраст капитана и длина корабля в футах, очевидно, тоже больше 3. Число 32118 раскладывается в произведение простых  множителей как 2·3·53·101. Есть только один способ  способов представления этого числа в виде произведения трёх множителей, каждый из которых больше 3: 6·53·101. Используя разумные ограничения на возраст и количество детей, получаем ответ.",
        "Ответ: 53 года, 6 детей, 101 фут."
    ],
    "60439": [
        "Формула включения-исключения",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Сколько существует целых чисел от 1 до 33000, которые не делятся ни на 3, ни  на 5, но делятся на 11?",
        "Решение: На 11 делятся 3000 чисел (см. задачу 60438 а). Из них еще и на 3 делятся 3000 : 3 = 1000 чисел, а на 5 – 3000 : 5 = 600 чисел. На 3, на 5 и на 11 делятся 600 : 3 = 200 чисел. Итак, 3000 – 1000 – 600 + 200 = 1600 чисел удовлетворяют условию задачи.",
        "Ответ: 1600 чисел."
    ],
    "60532": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Пусть    где p1, ..., ps – простые и α1, ..., αs, β1, ..., βs ≥ 0. Докажите равенства:"
    ],
    "60540": [
        "Количество и сумма делителей числа",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Найдите натуральное число вида n = 2x3y5z, зная, что половина его имеет на 30  делителей меньше, треть – на 35 и пятая часть – на 42 делителя меньше, чем само число.",
        "Подсказка: Согласно формуле из задачи 60537 а) надо решить систему  (x + 1)(y + 1)(z + 1) = x(y + 1)(z + 1) + 30 = (x + 1)y(z + 1) + 35 = (x + 1)(y + 1)z + 42.",
        "Ответ: n = 26·35·54."
    ],
    "64954": [
        "Деление с остатком",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Если разделить 2014 на 105, то в частном получится 19 и в остатке тоже 19.   На какие ещё натуральные числа можно разделить 2014, чтобы частное и остаток совпали?",
        "Решение: Если 2014 разделили на натуральное число N и получили в частном и в остатке натуральное число k, то 2014 = Nk + k = k(N + 1), причём k < N. Следовательно, k – делитель числа 2014.     Помимо 19 у числа 2014 = 2·19·53 есть ещё делители 1, 2 и 38, которые порождают такие примеры на деление: 2014 = 1·2014 = 2013·1 + 1,  2014 = 2·1007 = 1006·2 + 2 и 2014 = 38·53 = 52·38 + 38.    Остальные делители числа 2014 (53, 106, 1007 и 2014) порождают значения N, не удовлетворяющие неравенству k < N.",
        "Ответ: На 52, на 1006 и на 2013."
    ],
    "32059": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Бывают ли натуральные числа, произведение цифр которых равно 1986?",
        "Решение: 1986 = 2·3·331. 331 – простое число. Из теоремы о единственности разложения на простые множители следует, что одна из этих цифр делится на 331. Это, очевидно, невозможно."
    ],
    "116153": [
        "Простые числа и их свойства",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Существуют ли пять таких двузначных составных чисел, что каждые два из них взаимно просты?",
        "Решение: Каждое из составных чисел является произведением, по крайней мере, двух простых чисел. В каждом из таких произведений не может быть больше одного двузначного сомножителя, иначе это произведение будет, как минимум, трёхзначным. Значит, в разложении на простые множители каждого из искомых двузначных чисел должно присутствовать однозначное простое число. Но простых однозначных чисел всего четыре: 2, 3, 5 и 7. Следовательно, среди любых пяти составных двузначных чисел найдутся два, у которых будет общий делитель, отличный от 1.",
        "Ответ: Не существуют."
    ],
    "30732": [
        "Раскладки и разбиения",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Сколькими способами можно представить 1000000 в виде произведения трёх множителей, если произведения, отличающиеся порядком множителей,    а) считаются различными?    б) считаются тождественными?",
        "Решение: а) 106 = 26·56. Каждый множитель однозначно определяется количеством двоек и пятёрок, входящих в его разложение. Поэтому задача сводится к разложению шести белых и шести чёрных шаров по трём различным ящикам. Аналогично задаче 30729 получаем   способа.",
        "Ответ: а)  способами;  б) 139 способами."
    ],
    "60440": [
        "Формула включения-исключения",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Сколько существует целых чисел от 1 до 1000000, которые не являются ни полным  квадратом, ни полным кубом, ни четвёртой степенью?",
        "Решение: 1000000 = 1000² = 100³ = 106. Поэтому в указанном промежутке ровно 1000 квадратов и 100 кубов. 10 чисел из них являются шестыми степенями, то есть квадратами и кубами одновременно. Все четвёртые степени находятся среди квадратов. Следовательно, условию удовлетворяют   1000000 – 1000 – 100 + 10 = 998910 чисел.",
        "Ответ: 998910 чисел."
    ],
    "60533": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите равенства:     а) [a,(a, b)] = a;     б) (a, [a, b]) = a;      в) abc = [a, b, c](ab, ac, bc);     г) abc = (a, b, c)[ab, bc, ac].",
        "Подсказка: При помощи формул задачи 60532, доказательство каждого тождества сводится к доказательству следующих равенств:     а) max(α, min(α, β) = α;     б) min(α, max(α, β) = α;     в) α + β + γ = max(α, β, γ) + min(α + β, α + γ, β + γ);     г) α + β + γ = min(α, β, γ) + max(α + β, α + γ, β + γ)."
    ],
    "60534": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Приведите пример, когда равенство (a, b, c)[a, b, c] = abc не выполнено. Каким неравенством всегда будут связаны числа   (a, b, c)[a, b, c] и abc?",
        "Ответ: (6, 10, 15)[6, 10, 15] = 1·60 < 6·10·15; (a, b, c)[a, b, c] ≤ abc."
    ],
    "60651": [
        "Количество и сумма делителей числа",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите, что число 11...1 (1986 единиц) имеет по крайней мере     а) 8; б) 32 различных делителя.",
        "Решение: а) 8 делителей можно найти среди чисел вида 11...1 (n единиц), выбирая n = 1, 2, 3, 6, 331, 662, 993."
    ],
    "60864": [
        "Рациональные и иррациональные числа",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: При каких натуральных a и b число logab  будет рациональным?",
        "Ответ: Только если a и b являются степенями одного и того же числа, то есть a = dm и b = dn для некоторых натуральных d, m и n."
    ],
    "60530": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Найдите наименьшее натуральное n, для которого 1999! не делится на 34n.",
        "Подсказка: Нужно узнать в какой степени число 17 входит в разложение 1999! на простые множители. Далее см. задачу 35588.",
        "Ответ: 123."
    ],
    "64328": [
        "Числовые неравенства. Сравнения чисел.",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Известно, что а, b и c – различные составные натуральные числа, но каждое из них не делится ни на одно из целых чисел от 2 до 100 включительно. Докажите, что если эти числа – наименьшие из возможных, то их произведение abc является кубом натурального числа.",
        "Решение: По условию ни одно из чисел a, b, c не имеет простых делителей, меньших 100. Поскольку эти числа – составные, то у каждого из них есть не менее двух простых делителей, больших 100.     Первые три простых числа во второй сотне – это 101, 103 и 107. Следовательно, 101² является наименьшим числом, обладающим указанными свойствами, а 101·103 – следующим за ним. Так как 103² = 10609 < 101·107 = 10807, то следующее число – 103².    Таким образом, abc = 101²·101·103·103² = (101·103)³."
    ],
    "64951": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: Сумма десяти натуральных чисел равна 1001. Какое наибольшее значение может принимать НОД (наибольший общий делитель) этих чисел?",
        "Решение: Пример. Рассмотрим девять чисел, равных 91, и число 182. Их сумма равна 1001.",
        "Ответ: 91."
    ],
    "65001": [
        "Числовые последовательности (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: В ряд записаны 20 различных натуральных чисел. Произведение каждых двух из них, стоящих подряд, является квадратом натурального числа. Первое число равно 42. Докажите, что хотя бы одно из чисел больше чем 16000.",
        "Решение: Заметим, что 42 = 2·3·7, то есть все простые множители входят в его разложение в первой степени. Следовательно, чтобы произведение первых двух чисел являлось полным квадратом, второе число должно иметь вид  где k1 – натуральное число.     Так как произведение второго и третьего числа – полный квадрат, то третье число, по тем же причинам, имеет вид  где k2 – натуральное число, и так далее. Таким образом, все записанные числа, кроме первого, имеют вид  где ki – натуральное число, отличное от единицы. Так как все числа различны, то наибольшее из чисел ki не может быть меньше чем 20. Следовательно, одно из записанных чисел не меньше чем   42·20² > 16000."
    ],
    "65517": [
        "Делимость чисел. Общие свойства",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Каково наибольшее количество последовательных натуральных чисел, у каждого из которых ровно четыре натуральных делителя (включая 1 и само число)?",
        "Решение: Предположим, что найдутся четыре подряд идущих числа, удовлетворяющих условию. Заметим, что среди четырёх подряд идущих чисел одно делится на 4. Тогда в разложении этого числа на простые множители есть не менее двух двоек. Если есть еще простой делитель p, отличный от двойки, то делителей у числа не менее шести: 1, 2, 4, p, 2p, 4p. Если в разложении есть только двойки, то для того, чтобы делителей было ровно четыре (1, 2, 4, 8), двоек должно быть ровно три. Итак, существует единственное делящееся на 4 число, у которого ровно четыре делителя – число 8. Его соседи (7 и 9) условию не удовлетворяют, поэтому искомых чисел не более трёх.    Пример трёх подряд идущих чисел, у каждого из которых ровно четыре натуральных делителя: 33, 34, 35.",
        "Ответ: Три числа."
    ],
    "65906": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На доске записаны двузначные числа. Каждое число составное, но любые два числа взаимно просты.   Какое наибольшее количество чисел может быть записано?",
        "Решение: Оценка. Так как любые два записанных числа взаимно просты, то каждое из простых чисел 2, 3, 5 и 7 может войти в разложение на множители не более, чем одного из них. Если на доске пять или более чисел, то все простые множители в разложении какого-то из них должны быть не меньше чем 11. Но это составное число, значит, оно не меньше чем 121. Это противоречит условию. Следовательно, на доске записано не более четырёх чисел.     Пример. 25, 26, 33, 49.",
        "Ответ: 4 числа."
    ]
}