{
    "103945": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Конфеты Сладкая математика продаются по 12 штук в коробке, а конфеты Геометрия с орехами – по 15 штук в коробке.   Какое наименьшее число коробок конфет того и другого сорта необходимо купить, чтобы тех и других конфет было поровну?",
        "Подсказка: НОК(12, 15) = 60.",
        "Ответ: 5 коробок Сладкой математики и 4 коробки Геометрии с орехами."
    ],
    "77934": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Имеется несколько чисел, каждое из которых меньше чем 1951. Общее наименьшее  кратное любых двух из них больше чем 1951.   Доказать, что сумма обратных величин этих чисел меньше 2.",
        "Решение: Пусть a1, ..., an – данные числа. Количество членов ряда 1, 2, 3, ..., 1951, делящихся на ak, равно [1951/ak]. По условию наименьшее общее кратное любых двух из чисел a1, ..., an больше 1951, поэтому среди чисел 1, 2, ..., 1951 нет ни одного числа, делящегося одновременно на два из чисел a1, ..., an. Поэтому число членов  последовательности 1, 2, ..., 1951, делящихся хотя бы на одно из чисел  a1, ..., an, равно   [1951/a1] + [1951/a2] + ... + [1951/an].  Но в последовательности 1, 2, ..., 1951 всего 1951 членов, поэтому [1951/a1] + [1951/a2] + ... + [1951/an] ≤ 1951.     Учитывая, что [1951/ak] > 1951/ak – 1, получаем  (1951/a1 – 1) + (1951/a2 – 1) + ... + (1951/an – 1) < 1951,    то есть  1951/a1 + 1951/a2 + ... + 1951/an < 1951 + n < 2·1951.     Сокращая обе части на 1951, получаем требуемое."
    ],
    "110926": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: На листке бумаги написаны натуральные числа от 1 до N. Игроки по очереди обводят в кружок одно число, соблюдая условие: любые два уже обведённых  числа должны быть взаимно простыми. Два раза число обводить нельзя. Проигрывает тот, у кого нет хода.     а) Кто – начинающий игру или ходящий вторым – победит при   N = 10?     б) А при N = 12?     в) А при N = 15?     г) А при N = 30?",
        "Решение: Число 1 может обвести любой игрок в любой момент. Про остальные числа можно сказать вот что: если мы обводим число, имеющее простые делители p1, p2, ..., pk, то больше ни одно число, делящееся на хотя бы одно из этих простых чисел, обводить нельзя. Фактически игру можно понимать так: выписаны все простые числа, не превосходящие N, и число 1, и можно брать одно или несколько таких чисел (если их произведение не больше N). Так, обводя 3, мы берём  простое число 3, обводя 9, тоже берём 3, а обводя, скажем, 12, берём 2 и 3 одновременно."
    ],
    "32800": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Очень скучно смотреть на черно-белый циферблат, поэтому Клайв ровно в полдень закрасил число 12 красным цветом и решил через каждые 57 часов закрашивать текущий час в красный цвет.     а) Сколько чисел на циферблате окажутся покрашенными?     б) Сколько окажется красных чисел, если Клайв будет красить их каждый 1913-й час?",
        "Решение: а) Поскольку НОД(12, 57) = 3, то красным окажется каждый третий час: 12, 3, 6 и 9 часов.",
        "Ответ: а) 4 числа; б) все 12 чисел."
    ],
    "31281": [
        "Уравнения в целых числах",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Доказать, что число 2 + 4 + 6 + ... + 2n не может быть a) квадратом; б) кубом целого числа.",
        "Решение: а) 2 + 4 + 6 + ... + 2n  = n(n + 1). Так как числа n и n + 1 взаимно просты, то оба они – квадраты. Но соседние натуральные числа квадратами быть не могут."
    ],
    "103949": [
        "Подсчет двумя способами",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Игорь закрасил в квадрате 6×6 несколько клеток. После этого оказалось, что во всех квадратиках 2×2 одинаковое число закрашенных клеток и во всех полосках 1×3 одинаковое число закрашенных клеток. Докажите, что старательный Игорь закрасил все клетки.",
        "Решение: Пусть в каждом квадратике 2×2 закрашено m клеток, а в каждой полоске 1×3 – n клеток. Поскольку квадрат 6×6 разбивается на 9 квадратиков, то всего закрашено 9m клеток. Аналогично получаем, что всего закрашено 12n клеток. Значит, 9m = 12n, то есть    3m = 4n. Но 0 < m ≤ 4, 0 < n ≤ 3, поэтому m = 4, n = 3, что и требовалось."
    ],
    "104015": [
        "Арифметика остатков (прочее)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Олег собрал мешочек монет. Саша пересчитал их, и оказалось, что если разделить все монеты на пять равных кучек, то останется две лишние монеты. А если на четыре равные кучки – останется одна лишняя монета. В то же время монетки можно разделить на три равные кучки. Какое наименьшее число монет могло быть у Олега?",
        "Решение: Если добавить 3 монеты, полученное число монет будет делиться на 3, 4 и 5, то есть на 60.",
        "Ответ: 57 монет."
    ],
    "30368": [
        "Делимость чисел. Общие свойства",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Целые числа a и b таковы, что 56a = 65b. Докажите, что &nbsp a + b – составное число.",
        "Подсказка: Выразите a + b через a.",
        "Решение: 65(a + b) = 65a + 65b = 65a + 56a = 121a. Так как числа 65 и 121 взаимно просты, то a + b делится на 121. Поскольку 121 – составное число, то и a + b – составное."
    ],
    "35071": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Сколько существует пар натуральных чисел, у которых наименьшее общее кратное (НОК) равно 2000?",
        "Подсказка: Либо одно из чисел равно 2000, либо в разложении одного из чисел на простые сомножители должен присутствовать множитель 24, а в разложении другого – множитель 53.",
        "Решение: Рассмотрим две возможности.    1) Одно из чисел равно 2000. Тогда другое число может быть  любым делителем числа 2000. Поскольку 2000 = 24·53, оно имеет 20 делителей (см. задачу 30358).    2) Ни одно из двух чисел a, b не равно 2000. Тогда в разложении одного из этих чисел a, b (для определенности, a) на простые сомножители должен присутствовать множитель 24, а в разложении другого – множитель 53. Таким образом, a = 24·5m,  b = 2n·53, где m может принимать 3 значения (0, 1, 2), и независимо от этого n может принимать 4 значения (0, 1, 2, 3). Таким образом, в этом случае имеется 3·4 = 12 возможностей.    Итак, имеется 20 + 12 = 32 пары натуральных чисел, имеющие НОК = 2000.",
        "Ответ: 32 пары."
    ],
    "30671": [
        "Арифметика остатков (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Пусть ka ≡ kb (mod m), k и m взаимно просты. Тогда a ≡ b (mod m).",
        "Решение: Поскольку ka ≡ kb (mod m), то ka – kb = k(a – b) делится на m. Так как k и m взаимно просты, то a – b делится на m, то есть a ≡ b (mod m)."
    ],
    "104000": [
        "Уравнения в целых числах",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Очень скучно смотреть на черно-белый циферблат, поэтому Клайв ровно в полдень закрасил число 12 красным цветом и решил через каждые 57 часов закрашивать текущий час в красный цвет.     а) Сколько чисел на циферблате окажутся покрашенными?     б) Сколько окажется красных чисел, если Клайв будет красить  их каждый 2005-й час?",
        "Решение: а) Поскольку НОД(12, 57) = 3, то красным окажется каждое третье число: 12, 3, 6 и 9.",
        "Ответ: а) 4 числа; б) все 12 чисел."
    ],
    "30407": [
        "Деление с остатком",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Найдите наименьшее число, дающее следующие остатки: 1 – при делении на 2, 2 – при делении на 3, 3 – при делении на 4, 4 – при делении на 5, 5 – при делении на 6.",
        "Решение: Заметим, что это число, увеличенное на 1, делится на 2, 3, 4, 5, 6.",
        "Ответ: 59 = НОК(2, 3, 4, 5, 6) – 1."
    ],
    "30411": [
        "Алгоритм Евклида",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Найти наибольший общий делитель чисел 2n + 13 и n + 7.",
        "Решение: См. задачу 60502 а).",
        "Ответ: 1."
    ],
    "30412": [
        "Алгоритм Евклида",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что дробь  несократима ни при каком натуральном n.",
        "Решение: НОД(30n + 2, 12n + 1) = НОД(12n + 1, 6n) = НОД(6n, 1) = 1."
    ],
    "35093": [
        "Деление с остатком",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Если от некоторого трёхзначного числа отнять 6, то оно разделится на 7, если   отнять 7, то оно разделится на 8, а если отнять 8, то оно разделится на 9.   Определите это число.",
        "Подсказка: Что будет, если к искомому числу прибавить единицу?",
        "Решение: Если к искомому числу прибавить 1, то оно будет делиться на 7·8·9 = 504. Так как число трёхзначное, то имеется единственная возможность – оно равно   503 = 7·8·9 – 1.",
        "Ответ: 503."
    ],
    "54646": [
        "Элементарные (основные) построения циркулем и линейкой",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Дан угол, равный 19°. Разделите его на 19 равных частей с помощью циркуля и линейки.",
        "Подсказка: 19°·19 = 361&deg = 360° + 1°.",
        "Решение: Первый способ. Разделив пополам угол в 30°, получим угол в 15°. Отнимая его от угла в 19°, получим угол в 4°, который легко разделить на 4 равные части с помощью циркуля и линейки."
    ],
    "60514": [
        "Уравнения в целых числах",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: a, b, c – целые числа, причем (a, b) = 1. Пусть (x0, y0) – некоторое  целочисленное решение уравнения ax + by = c.   Докажите, что все решения этого уравнения в целых числах получаются по формулам  x = x0 + kb, y = y0 – ka, где k – произвольное целое число.",
        "Решение: Для любого решения (x, y) имеем a(x – x0) + b(y – y0) = 0. Отсюда видно, что x – x0 кратно b, то есть x = x0 + kb. Подставляя, получим  kab = – b(y – y0), откуда y = y0 – ka."
    ],
    "64481": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 3",
        "Классы: 9,10,11",
        "Условие: При каких натуральных n число n² – 1 является степенью простого числа?",
        "Решение: n² – 1 = (n + 1)(n – 1), а НОД(n + 1, n – 1) = d ≤ 2.    Если d = 2, то n² – 1 – степень двойки: n + 1 = 2k и n – 1 = 2m, причём значения этих степеней различаются на 2. Значит, k = 2, m = 1, n = 3.    Если же d = 1, то n – 1 = 1, то есть n = 2.",
        "Ответ: При n = 2 и n = 3."
    ],
    "60486": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: С 1 сентября четыре школьника начали посещать кинотеатр. Первый бывал в нём каждый четвёртый день, второй – каждый пятый, третий – каждый шестой и четвёртый – каждый девятый. Когда второй раз все школьники встретятся в  кинотеатре?",
        "Подсказка: НОК(4, 5, 6, 9) = 180.",
        "Ответ: Через 180 дней (28 февраля)."
    ],
    "78068": [
        "Обыкновенные дроби",
        "Сложность: 3",
        "Классы: 9,10,11",
        "Условие: Пусть a, b, c, d, l – целые числа. Докажите, что если дробь    сократима на число k, то ad – bc делится на k.",
        "Решение: ad – bc = k(na – mc). Следовательно,   ad – bc делится на k."
    ],
    "88036": [
        "Уравнения в целых числах",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Фома и Ерёма нашли на дороге по пачке 11-рублевок. В чайной Фома выпил 3 стакана чая, съел 4 калача и 5 бубликов. Ерёма выпил 9 стаканов чая, съел 1 калач и 4 бублика. Стакан чая, калач и бублик стоят по целому числу рублей. Оказалось, что Фома может расплатиться 11-рублевками без сдачи. Покажите, что это может сделать и Ерёма.",
        "Решение: Фома смог за свою покупку расплатиться 11-рублёвыми купюрами. Если к его покупке добавить 33t и 11b (33 стакана чая и 11 бубликов), то за всё в сумме тоже можно будет расплатиться 11-рублевками. Эта покупка составляет  36t + 4k + 16b, то есть ровно в 4 раза больше покупки Еремы. Но числа 4 и 11 взаимно просты, поэтому и за четверть большой покупки (за покупку Еремы) можно расплатиться 11-рублевками без сдачи."
    ],
    "30413": [
        "Алгоритм Евклида",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Найдите НОД(2100 – 1, 2120 – 1).",
        "Решение: См. задачу 60507 а).",
        "Ответ: 220 – 1."
    ],
    "60496": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Докажите, что (5a + 3b, 13a + 8b) = (a, b).",
        "Подсказка: 8(5a + 3b) – 3(13a + 8b) = a,  5(13a + 8b) – 13(5a + 3b) = b."
    ],
    "32074": [
        "Произведения и факториалы",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что произведение ста последовательных натуральных чисел не может быть сотой степенью натурального числа.",
        "Решение: Предположим, что для некоторых натуральных n и k n(n + 1)(n + 2)...(n + 99) = k100.     Тогда n100 < k100 < (n + 99)100, то есть n < k < n + 99. Поэтому число k входит множителем в левую часть исходного равенства. Число k + 1, также входящее множителем в левую часть этого равенства, взаимно просто с k. Поэтому k100 не делится на k + 1. Противоречие"
    ],
    "34928": [
        "Геометрия на клетчатой бумаге",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Дан прямоугольник 100×101, разбитый линиями сетки на единичные  квадратики. Найдите число отрезков, на которое линии сетки разбивают его диагональ.",
        "Подсказка: Каждая горизонтальная и каждая вертикальная линия сетки пересекает диагональ в некоторой точке.",
        "Решение: Каждая из 100 горизонтальных и каждая из 99 вертикальных линий сетки, идущих внутри прямоугольника, пересекает диагональ в некоторой точке. Для удобства введём систему координат так, чтобы начало координат совпадало с одной из вершин прямоугольника. Диагональ соединяет начало координат с точкой (100, 101). Если бы нашлись горизонтальная и вертикальная линии сетки, пересекающие диагональ в одной точке, то эта точка лежала бы на диагонали и имела бы целые координаты (a, b). Но тогда b/a = 101/100, а это невозможно, поскольку 0 < a < 100, 0 < b < 101 и дробь 101/100 несократима.    Следовательно, все точки пересечения горизонтальных и вертикальных линий сетки с диагональю различны, а 199 точек делят диагональ на 200 отрезков.",
        "Ответ: 200 отрезков."
    ],
    "35796": [
        "Произведения и факториалы",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Может ли произведение 2002 последовательных натуральных чисел являться 2002-й степенью натурального числа?",
        "Решение: См. задачу 32074.",
        "Ответ: Не может."
    ],
    "60515": [
        "Уравнения в целых числах",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Как описать все решения в целых числах уравнения ax + by = c при произвольных целых a, b, c?",
        "Подсказка: См. задачи 60489 и 60514.",
        "Ответ: Если c не делится на d = (a, b), то решений нет.   Если c делится на d, то x = x0 + kb/d, y = y0 – ka/d, где (x0, y0) – некоторое целочисленное решение уравнения ax + by = c, k – произвольное целое число."
    ],
    "60827": [
        "Деление с остатком",
        "Сложность: 3+",
        "Классы: 7,8,9,10",
        "Условие: Найдите наименьшее натуральное число, дающее при делении на 2, 3, 5, 7 остатки 1, 2, 4, 6 соответственно.",
        "Ответ: 209 = 2·3·5·7 – 1."
    ],
    "60996": [
        "Многочлены (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Найдите такие многочлены P(x) и Q(x), что (x + 1)P(x) + (x4 + 1)Q(x) = 1.",
        "Решение: 2 = (x4 + 1) – (x4 – 1) = (x4 + 1) – (x – 1)(x + 1)(x² + 1).",
        "Ответ: Q(x) = ½, P(x) = – ½ (x³ + x² + x + 1)."
    ],
    "64425": [
        "Задачи на движение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: По круговой дорожке стадиона длиной 400 метров из одной точки в одном направлении выбегают три спортсмена с постоянными скоростями 12 км/ч,   15 км/ч и 17 км/ч. Через какое наименьшее время спортсмены поравняются?",
        "Решение: За час второй спортсмен обгоняет первого на 3000 м, значит, за минуту – на 50 м. Таким образом, второй спортсмен обгоняет первого на круг (и встречается с ним) каждые 8 минут. Аналогично выясняем, что третий спортсмен обгоняет второго на круг каждые 12 минут. НОД(8, 12) = 24, то есть каждые 24 минуты происходит встреча всех трёх спортсменов.",
        "Ответ: Через 24 минуты."
    ],
    "60499": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Докажите, что для нечётных чисел a, b и c имеет место равенство  (½ (b + c), ½ (a + c), ½ (a + b)) = (a, b, c).",
        "Подсказка: a = ½ (a + c) + ½ (a + b) – ½ (b + c)."
    ],
    "73627": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Петя собирается все 90 дней каникул провести в деревне и при этом каждый второй день (то есть через день) ходить купаться на озеро, каждый третий – ездить в магазин за продуктами, а каждый пятый день – решать задачи по математике. (В первый день Петя сделал и первое, и второе, и третье и очень устал.) Сколько будет у Пети приятных дней, когда нужно будет купаться, но не нужно ни ездить в магазин, ни решать задачи? Сколько скучных, когда совсем не будет никаких дел?",
        "Решение: Занумеруем дни числами от 0 до 89. Петя купается в дни с чётными номерами, ездит в магазин в дни с номерами, кратными 3, и решает задачи в дни, с номерами, кратными 5.     Таким образом, нам следует ответить на два вопроса:      1) сколько существует чётных чисел от 0 до 89, которые не делятся ни на 3, ни на 5;       2) сколько существует нечётных чисел от 0 до 89, которые не делятся ни на 3, ни на 5?     Ответы на эти вопросы одинаковы. Действительно, разобьём наши числа на пары с разностью 45: {0, 45}, {1, 46}, ..., {44, 89}. В каждой паре – два числа разной четности, при этом если одно из чисел пары не делится ни на 3, ни на 5, то и второе тоже.     Поэтому достаточно ответить на вопрос 1).     Заметим, что чётных чисел от 0 до 89 ровно половина, то есть 45. Из них каждое третье кратно 3 (всего 15 чисел), каждое пятое кратно 5 (9 чисел) и каждое пятнадцатое кратно 15 (3 числа). Таким образом, чётных чисел, кратных либо 3, либо 5, ровно 15 + 9 – 3 = 21 (мы вычитаем 3, так как в сумме 15 + 9 числа, кратные 15, сосчитаны дважды). Значит, интересующих нас чисел 45 – 21 = 24.",
        "Ответ: Поэтому достаточно ответить на вопрос 1)."
    ],
    "78063": [
        "Обыкновенные дроби",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Найти все числа, на которые может быть сократима при целом значении l дробь .",
        "Решение: 8(5l + 6) – 5(8l + 7) = 13, поэтому НОД(5l + 6, 8l + 7) равен 13 или 1. При l = 4 мы получаем дробь 26/39, которая действительно сократима на 13.",
        "Ответ: Только на 13."
    ],
    "105115": [
        "Геометрическая прогрессия",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: Дана геометрическая прогрессия. Известно, что её первый, десятый  и тридцатый члены являются натуральными числами.   Верно ли, что её двадцатый член также является натуральным числом?",
        "Решение: Пусть a1, a2, ..., an, ... – данная геометрическая прогрессия, q – её знаменатель. По условию a1, a10 = a1q9 и a30 = a1q29 – натуральные числа. Поэтому q9 и q29 – положительные рациональные числа. Отсюда следует, что q² = q29(q9)–3  – положительное рациональное число и q = q9(q²)–4 также положительное рациональное число.     Пусть q = m/n, где m и n – натуральные взаимно простые числа. Число a30 = a1m29n–29 натуральное, m29 и n29 взаимно просты, следовательно, a1 делится на n29. Отсюда получаем, что   a20 = a1q19 = a1m19n–19 – число натуральное.",
        "Ответ: Верно."
    ],
    "105216": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Найти все несократимые дроби а/b, представимые в виде b,а (запятая разделяет десятичные записи натуральных чисел b и а).",
        "Решение: Пусть натуральные числа a и b взаимно просты, а десятичная запись числа a имеет n знаков. Тогда условие задачи для них записывается в виде уравнения  a : b = b + a·10–n ⇔ 10n(a – b²) = ab, из которого следует, в частности, что a > b. В силу взаимной простоты чисел a и b, число a – b² не имеет общих делителей ни с a, ни с b, следовательно, уравнение превращается в систему из двух уравнений a – b² = 1, 10n = ab.     В силу все той же взаимной простоты чисел a и b (с учётом неравенства a > b), последнему уравнению удовлетворяют  только пары (10n, 1) и (5n, 2n). Первая пара при подстановке даёт для числа n уравнение 10n = 2, которое, очевидно, не имеет решений.    Вторая пара даёт уравнение 5n – 4n = 1 ⇔ (5/4)n = 1 + (¼)n. Так как его левая часть представляет собой возрастающую функцию от n, а правая – убывающую, то оно имеет не более одного корня, который легко угадывается: n = 1.",
        "Ответ: 5/2."
    ],
    "60500": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: По окружности радиуса 40 катится колесо радиуса 18. В колесо вбит гвоздь, который ударяясь об окружность, оставляет на ней отметки. Сколько всего таких отметок оставит гвоздь на окружности? Сколько раз прокатится колесо по всей окружности, прежде чем гвоздь попадёт в уже отмеченную ранее точку?",
        "Решение: Пусть l = 4π. Длина большой окружности равна 20l, а малой – 9l. В отмеченную ранее точку гвоздь попадёт, когда малая окружность прокатится по дуге длины НОД(20, 9)l = 180l, то есть 9 раз прокатится по большой окружности. При этом он оставит 180 : 9 = 20 отметок.",
        "Ответ: 20 отметок, 9 оборотов."
    ],
    "35699": [
        "Группа перестановок",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Шифрпреобразование простой замены в алфавите A = {a1, a2, ..., an}, состоящем из n различных букв, заключается в замене каждой буквы шифруемого текста буквой того же алфавита, причём разные буквы заменяются разными. Ключом шифра простой замены называется таблица, в которой указано, какой буквой надо заменить каждую букву алфавита A. Если слово СРОЧНО зашифровать простой заменой с помощью ключа:",
        "Подсказка: Число различных слов, которые можно получить в указанном процессе шифрования с начальным словом СРОЧНО, совпадает с наименьшим номером цикла шифрования, дающем это начальное слово.",
        "Решение: Поскольку разные буквы заменяются разными, то при зашифровании разных слов получаются разные слова. С другой стороны, одинаковые буквы заменяются на одинаковые, следовательно, из одинаковых слов получаются одинаковые.     Таким образом, число различных слов, которые можно получить в указанном процессе шифрования с начальным словом СРОЧНО, совпадает с наименьшим номером цикла шифрования, дающего это начальное слово. Так как буква С повторяется в каждом цикле шифрования, номер которого кратен 5, а буквы Р, О, Ч, Н  - в каждом цикле,   номера которых кратны 13, 7, 2 и 3 соответственно, то слово СРОЧНО появится впервые в цикле с номером, равным НОК(2, 3, 5, 7, 13) = 2730.",
        "Ответ: 2730 слов."
    ],
    "60507": [
        "Алгоритм Евклида",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Докажите, что при m ≠ n выполняются равенства:     а) (am – 1, an – 1) = a(m, n) – 1 (a > 1);     б) (fn, fm) = 1, где   fk = 22k + 1 – числа Ферма.",
        "Решение: а) Первый способ. Пусть m ≥ n. Тогда (am – 1, an – 1) = (am – an, an – 1) = (am–n – 1, an – 1). Поэтому алгоритм Евклида для чисел am – 1 и an – 1 идёт параллельно алгоритму Евклида для показателей m и n. Последний заканчивается на числе (m, n), значит, первый – на числе a(m, n) – 1."
    ],
    "60520": [
        "Уравнения в целых числах",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Докажите, что если (a1, a2, ..., an) = 1, то уравнение a1x1 + a2x2 + ... + anxn = 1 разрешимо в целых числах.",
        "Подсказка: По индукции нетрудно доказать более сильное утверждение: уравнение a1x1 + a2x2 + ... + anxn = (a1, a2, ..., an) разрешимо в целых числах. При этом надо воспользоваться задачей 60521 б)."
    ],
    "60777": [
        "Функция Эйлера",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Докажите равенства:     а) φ(m) φ(n) = φ((m, n)) φ([m, n]);     б) φ(mn) φ((m, n)) = φ(m) φ(n) (m, n).   Определение функции φ(n) см. в задаче 60758.",
        "Решение: Из мультипликативности функции Эйлера следует, что  формулу достаточно доказать в случае, когда числа m и n суть  степени одного и того же простого числа. Пусть  m = pα, n = pβ (α ≥ β ≥ 0."
    ],
    "60833": [
        "Обыкновенные дроби",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Предположим, что числа m1, ..., mn   попарно взаимно просты. Докажите, что любую правильную дробь вида    можно представить в виде алгебраической  суммы правильных дробей вида ni/mi (i = 1, ..., n).",
        "Решение: Индукция по n.     База (n = 2). Согласно задаче 60489 уравнение m1x + m2y = c имеет решения в целых числах. Тогда         Шаг индукции. Поскольку m1m2...mn–1 и mn взаимно просты, то, как показано выше,   По предположению индукции"
    ],
    "60888": [
        "Периодические и непериодические дроби",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Обозначим через L(m) длину периода дроби   1/m. Докажите, что если (m1, 10) = 1 и (m2, 10) = 1, то справедливо равенство L(m1m2) = [L(m1), L(m2)].  Чему равна длина периода дроби 1/m1 + 1/m2?"
    ],
    "60502": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Докажите, что следующие дроби несократимы при всех натуральных значениях n:     а) ;  б) ;  в) .",
        "Решение: а) 2(n + 7) – (2n + 13) = 1, значит, НОД(2n + 13, n + 7) = 1."
    ],
    "79348": [
        "Уравнения в целых числах",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Найти все пары целых чисел (x, y), удовлетворяющие уравнению  3·2x + 1 = y².",
        "Решение: Уравнение можно переписать в виде 3·2x = (y + 1)(y – 1). Разность чисел y + 1 и y – 1 равна 2, поэтому их наибольший общий делитель d равен 1 или 2. Если d = 1, то x = 0. Если d = 2, то либо одно число равно ±3·2n, а другое равно ±2, либо одно число равно ±3·2, а другое равно ±2n. Первый случай невозможен, а во втором случае x = 3 или 4.",
        "Ответ: (0, ±2), (3, ±5), (4, ±7)."
    ],
    "79423": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Найти все такие натуральные n, для которых числа 1/n и 1/n+1 выражаются конечными десятичными дробями.",
        "Решение: При n > 1 должны выполняться равенства 2k5l = n и 2s5t = n + 1. Числа n и n + 1 взаимно просты, поэтому есть только два варианта: либо   5l + 1 = 2s, либо 2k + 1 = 5t.     1) 2s = 5l + 1. Тогда число 2s оканчивается на 6, поэтому s = 4m. Значит, 5l = 24m – 1 = (22m – 1)(22m + 1). Но числа 22m – 1 и 22m + 1 не могут одновременно делиться на 5.     2) 2k = 5t – 1. Если t чётно, то 5t – 1 делится на 5² – 1 = 24 и не может быть степенью двойки.   Если t нечётно, то 2k = 5t – 1 = 4(5t–1 + 5t–2 + ... + 1) и второй множитель – сумма нечётного числа нечётных слагаемых, то есть нечётен. Значит, t = 1.    Это соответствует равенству 2² + 1 = 5.",
        "Ответ: 1 и 4."
    ],
    "109005": [
        "Суммы числовых последовательностей и ряды разностей",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Может ли число 1·2 + 2·3 + ... + k(k + 1) при k = 6p – 1 быть квадратом?",
        "Решение: Данную сумму можно представить в виде      (1² + 1) + (2² + 2) + ... + (k² + k) = (1 + 2 + 3 + ... + k) + (1² + 2² + ... + k²) = ½ (k(k + 1)) + &frac16; (k(k + 1)(2k + 1)) = &frac13; (k(k + 1)(k + 2)) = 2p(36p² – 1).  Но числа 2p и 36p² – 1 взаимно просты, а второе из них квадратом быть не может.",
        "Ответ: Не может."
    ],
    "109159": [
        "Уравнения в целых числах",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Найти целые решения уравнения x²y = 10000x + y.",
        "Решение: 10000x = y(x² – 1). Так как  x и x² – 1 взаимно просты, то 10000 делится на x² – 1.     Если x нечётно, то x² – 1 = (x – 1)(x + 1) делится на 8 как произведение двух последовательных чётных чисел. Если же x чётно, то x² – 1 нечётно, и, следовательно, должно равняться степени пятёрки с некоторым знаком. x – 1 и x + 1 одновременно не могут делиться на 5, следовательно, x – 1 = ±1 или x + 1 = ±1. Проверяя эти варианты, находим решение x = 0. Тогда и y = 0.     Осталось рассмотреть все делители 10000, делящиеся на 8, и проверить,  какие из них можно представить в виде x² – 1. Всего таких делителей 10: 2³, 24, 5·2³, 5·24, 5²·2³, 52·24, 5³·2³, 53·24, 54·23, 54·24. Среди них подходят только 8 и 80. Это даёт ещё четыре решения: (±3, ±3750) и (±9, ±1125).",
        "Ответ: (–9, –1125), (–3, –3750), (0, 0), (3, 3750), (9, 1125)."
    ],
    "60506": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: На какие натуральные числа можно сократить дробь , если известно, что она сократима и что числа m и n взаимно просты.",
        "Решение: Если 3m – n и 5n + 2m делятся на d, то и числа 17m = 5(3m – n) + 5n + 2m и 17n = 3(5n + 2m) – 2(3m – n) делятся на d. Но НОК(17m, 17n) = 17. Значит, d = 17. Это возможно, например, при m = 1, n = 3 (или при m = 6, n = 1).",
        "Ответ: На 17."
    ],
    "60508": [
        "Простые числа и их свойства",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Докажите, что число 22n – 1 имеет по крайней мере n различных простых делителей.",
        "Подсказка: Воспользуйтесь взаимной простотой чисел Ферма (см. задачу 60507)."
    ],
    "60525": [
        "Уравнения в целых числах",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Пусть a и b – натуральные взаимно простые числа. Рассмотрим точки плоскости с целыми координатами (x, y), лежащие в полосе 0 ≤ x ≤ b – 1. Каждой такой точке припишем целое число N(x, y) = ax + by.     а) Докажите, что для каждого натурального c существует ровно одна точка (x, y) (0 ≤ x ≤ b – 1), для которой N(x, y) = c.     б) Теорема Сильвестра. Докажите, что наибольшее c, для которого уравнение ax + by = c не имеет решений в целых неотрицательных числах, имеет вид  c = ab – a – b.",
        "Решение: а) Из задачи 60489 следует, что уравнение ax + by = c   (*)  имеет решение (x0, y0) в целых числах. Тогда все решения уравнения (*) имеют вид (x0 + kb, y0 – ka) (см. задачу 60514). Расстояние между соседними числами вида x0 + kb равно b, поэтому ровно одно из них попадает в заданный отрезок, состоящий из b целых чисел."
    ],
    "60594": [
        "Рекуррентные соотношения (прочее)",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Пусть a1, a2, ... – такая последовательность ненулевых чисел, что (am, an) = a(m, n) (m, n ≥ 1).",
        "Подсказка: Докажите, что  допускает представление в виде линейной комбинации с целыми коэффициентами чисел  и",
        "Решение: Число (ak, an–k) = a(k, n–k) = a(k,n) = (ak, an) является делителем числа an. Поэтому уравнение xak + yan–k = an имеет решение в целых числах (см. задачу 60489).     Если (un,k, vn,k) – одно из этих решений, то      Поскольку числа  и  – целые, отсюда следует, что и все числа  – целые."
    ],
    "60993": [
        "Рекуррентные соотношения (прочее)",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Последовательность a0, a1, a2, ... задана условиями a0 = 0, an+1 = P(an) (n ≥ 0), где P(x) – многочлен с целыми коэффициентами,  P(x) > 0 при x ≥ 0.   Докажите, что для любых натуральных m и k (am, ak) = a(m, k).",
        "Решение: Пусть Q – многочлен с целыми коэффициентами, a – целое число. Тогда (Q(a), a) = (Q(0), a).     Пусть m > k. Положим  Тогда   (am, ak) = (Q(ak), ak) = (Q(0), ak) = (am-k, ak).     Применяя алгоритм Евклида, получаем отсюда, что (am, ak) = a(m, k)."
    ],
    "78829": [
        "Обыкновенные дроби",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Пусть K(x) равно числу таких несократимых дробей a/b, что a < x и b < x (a и b – натуральные числа). Например, K(5/2) = 3 (дроби 1, 2, ½).   Вычислить сумму K(100) + K(100/2) + K(100/3) + ... + K(100/99) + K(100/100).",
        "Решение: Несократимая дробь a/b посчитана в нашей сумме несколько раз. Действительно, она сосчитана по разу во всех K(100/l), где la < 100 и lb < 100. Тем самым получаем, что искомая сумма равна количеству всех дробей a/b (в том числе и сократимых) или, что то же самое, пар (a, b), удовлетворяющих условию 0 < a < 100, 0 < b < 100. Всего таких пар 99². Итак, K(100) + K(100/2) + K(100/3) + ... + K(100/99) + K(100/100) = 99² = 9801.",
        "Ответ: 9801."
    ],
    "60510": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Докажите, что равенство (a, mn) = 1 равносильно выполнению двух условий (a, m) = 1 и (a, n) = 1.",
        "Подсказка: Воспользуйтесь результатом задачи 60490."
    ],
    "79464": [
        "Последовательности (прочее)",
        "Сложность: 4",
        "Классы: 11",
        "Условие: В некотором царстве, в некотором государстве было выпущено неограниченное  количество монет достоинством в n1, n2, n3, ... копеек, где  n1 < n < 2 < n3 < ... – бесконечная последовательность, состоящая из натуральных чисел. Докажите, что эту последовательность можно оборвать, то есть найдётся такое число N, что любую сумму, которую можно уплатить без сдачи выпущенными монетами, на самом деле можно уплатить только монетами достоинством в n1, n2, ..., nN копеек.",
        "Решение: Обозначим через d наибольший общий делитель всех данных чисел и через ds – наибольший общий делитель чисел n1, n2, ..., ns. Поскольку  d1 ≥ d2 ≥ d3 ≥ ..., то dk = dk+1 = ... = d для некоторого k ≥ 2. Возьмём числа n1, ..., nk и рассмотрим все суммы, которые можно уплатить этими монетами. Эти суммы, расположенные в порядке возрастания, с какого-то места образуют арифметическую прогрессию с разностью &nbspdk = d; эту же арифметическую прогрессию образуют и суммы, полученные из первоначального бесконечного набора монет {ni}, 1 ≤ i < ∞. Поэтому, добавив к монетам n1, ..., nk необходимое количество монет nk+1, ..., nN, не попадающих в  указанную арифметическую прогрессию, получаем искомый конечный набор монет  n1, n2, ..., nN, которыми можно уплатить все возможные суммы, образованные из исходного набора монет n1, n2, n3, ... ."
    ],
    "30371": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Докажите, что для любых натуральных чисел a и b верно равенство НОД(a, b)НОК(a, b) = ab.",
        "Решение: Из определения НОД следует, что a = a' НОД(a, b),   b = b' НОД(a, b), где НОД(a', b') = 1. Из определения НОК следует, что НОК(a, b) = a'b' НОД(a, b). Поэтому НОД(a, b)НОК(a, b) = a'b' НОД(a, b)НОД(a, b) = ab."
    ],
    "60511": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Докажите, что если (a, b) = 1, то (2a + b, a(a + b)) = 1.",
        "Подсказка: Воспользуйтесь результатом задачи 60510."
    ],
    "78628": [
        "Числовые таблицы и их свойства",
        "Сложность: 4+",
        "Классы: 9,10,11",
        "Условие: Дана таблица n×n клеток и такие натуральные числа k и m > k, что m и n – k взаимно просты. Таблица заполняется следующим образом: пусть в некоторой строчке записаны числа a1, ..., ak, ak+1, ..., am, am+1, ..., an. Тогда в следующей строчке записываются те же числа, но в таком порядке: am+1, ..., an, ak+1, ..., am, a1, ..., ak. В первую строчку записываются (по порядку) числа 1, 2, ..., n. Доказать, что после заполнения таблицы в каждом столбце будут написаны все числа от 1 до n.",
        "Решение: Очевидно достаточно доказать, что ни одно из чисел не вернётся на свое место во 2-й, 3-й, ... , n-й строках. Проследим за судьбой какого-нибудь числа a. При переходе в следующую строку оно сдвигается вправо на одно из (положительных или отрицательных) чисел s = n – k, s – m = n – m – k, – m. Пусть после нескольких шагов оно x раз побывало в первой группе (на одном из мест от 1 до k), y раз – во второй, z раз – в третьей и при этом впервые вернулось на исходное место. Тогда sx + (s – m)y – mz = 0, 0 ≤ x ≤ k, 0 ≤ y ≤ m – k, 0 ≤  z ≤ n – m.    Обозначим s = n – k. Наше уравнение можно переписать в виде  s(x + y) = m(y  + z).  Так как m и s взаимно просты по условию, то x + y делится на m и y + z делится на s. Но 0 ≤ x + y ≤ m и 0 ≤ y + z ≤ s, откуда либо x = y = z = 0, либо x = n – s, y = m + s – n, z = n – m. Первый случай нас не интересует, а во втором случае x + y + z = n, то есть число a возвращается на свое место в (n+1)-й строке, то есть уже за пределами таблицы."
    ],
    "60512": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Докажите, что если (a, b) = 1, то наибольший общий делитель чисел a + b и a² + b² равен 1 или 2.",
        "Решение: Пусть d = (a² + b², a + b). Согласно задаче 60510 числа a + b и ab взаимно просты. Значит, (a + b, 2ab) = 1 или 2. Число 2ab = (a + b)² – (a² + b²) делится на d. Следовательно, (a + b, 2ab) делится на d."
    ],
    "88183": [
        "Задачи на проценты и отношения",
        "Сложность: 3",
        "Классы: 5,6,7",
        "Условие: В классе учится меньше 50 школьников. За контрольную работу седьмая часть учеников получила пятёрки, третья – четвёрки, половина – тройки. Остальные работы были оценены как неудовлетворительные. Сколько было таких работ?",
        "Подсказка: Обратите внимание: число школьников, получивших ту или иную оценку всегда целое.",
        "Решение: Нам надо найти целое число, меньшее50, одновременно делящееся на 7, 3, 2. НОК(2, 3, 7) = 42. Это значит, что всего в классе 42 ученика; 6 из них получили пятёрки; 14 – четвёрки; 21 – тройки. Следовательно, двойку получил один ученик.",
        "Ответ: Одна работа."
    ],
    "116478": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Назовём натуральное семизначное число удачным, если оно делится на произведение всех своих цифр. Существуют ли четыре последовательных удачных числа?",
        "Решение: Предположим, что n, n + 1, n + 2 и n + 3 –  удачные числа. В записи этих чисел не может быть цифры 0 (на 0 делить нельзя), поэтому, эти числа отличаются только последней цифрой, следовательно, одно из них оканчивается либо на 4, либо на 8. Далее можно рассуждать по-разному.",
        "Ответ: Не существуют."
    ],
    "32801": [
        "Задачи на движение",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Когда Клайв поступил в математическую школу, ему подарили новые часы, на которых была ещё секундная стрелка.   Сколько раз за сутки все три стрелки на таких часах совпадут?",
        "Решение: За 12 часов часовая стрелка делает один оборот, а минутная – 12, то есть минутная обгоняет часовую на 11 оборотов. Значит, минутная и часовая стрелки совпадают каждые 12/11 часа (за это время минутная обгоняет часовую на 1 оборот). Аналогично, минутная и секундная стрелки совпадают каждые 12/59 часа.     Назовём мигом 1/59·11 часа. Все три стрелки совпадают через число мигов, кратное как 12·59, так и 11, то есть через 12·59·11 мигов, что равно 12 часам.",
        "Ответ: Дважды: в полдень и в полночь."
    ],
    "65899": [
        "Десятичная система счисления",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Последняя цифра в записи натурального числа в 2016 раз меньше самого числа. Найдите все такие числа.",
        "Решение: Пусть x – последняя цифра числа. Далее можно рассуждать по-разному.",
        "Ответ: 4032, 8064, 12096, 16128."
    ],
    "76480": [
        "Деление с остатком",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Дописать к 523... три цифры так, чтобы полученное шестизначное число  делилось на 7, 8 и 9.",
        "Решение: Полученное число должно делиться на 7·8·9 = 504. 523000 = 1037·504 + 352. Поскольку 504 – 352 = 152, на 504 делятся числа 523152 и   523152 + 504 = 523656.",
        "Ответ: 523152 или 523656."
    ],
    "30668": [
        "Уравнения в целых числах",
        "Сложность: 3+",
        "Классы: 6,7",
        "Условие: Решите уравнение в целых числах: x³ + 3 = 4y(y + 1).",
        "Решение: Запишем уравнение в виде x³ = (2y + 1)² – 4 = (2y – 1)(2y + 3). Нечётные числа 2y – 1 и 2y + 3 взаимно просты, так как из разность равна 4. Значит, оба они – точные кубы. Но разность двух кубов не может равняться 4.",
        "Ответ: Нет решений."
    ],
    "61013": [
        "Целочисленные и целозначные многочлены",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что если (p, q) = 1 и p/q – рациональный корень многочлена P(x) = anxn + ... + a1x + a0 с целыми коэффициентами, то     а) a0 делится на p;     б) an делится на q.",
        "Решение: Условие f(p/q) = 0 можно записать в виде a0qn + a1pqn–1 + ... + anpn = 0. Все слагаемые в левой части, кроме первого, кратны p, значит, и a0qn делится на p. Но p и q взаимно просты, следовательно, a0 делится на p. Аналогично доказывается, что an кратно q."
    ],
    "60513": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Пусть a и b – натуральные числа. Докажите, что  среди чисел a, 2a, 3a, ..., ba ровно (a, b) чисел делится на b.",
        "Подсказка: Пусть b = с(a, b). Число ka делится на b ⇔ k делится на c."
    ],
    "76543": [
        "Деление с остатком",
        "Сложность: 3+",
        "Классы: 7,8,9,10",
        "Условие: Докажите, что каково бы ни было целое число n, среди чисел n, n + 1, n + 2, ..., n + 9 есть хотя бы одно, взаимно простое с остальными девятью.",
        "Решение: Среди данных чисел есть пять нечётных. Рассмотрим остатки от деления этих  пяти чисел на 3, 5 и 7. Среди остатков от деления на 3 нет трёх одинаковых, а среди остатков от деления на 5 и на 7 нет двух одинаковых. Поэтому среди указанных пяти чисел можно выбрать три числа, не кратных 3, а среди них выбрать число, не кратное ни 5, ни 7. Это число взаимно просто с остальными девятью числами."
    ],
    "78042": [
        "Уравнения в целых числах",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Решить в целых числах уравнение x³ – 2y³ – 4z³ = 0.",
        "Решение: Пусть уравнение имеет ненулевое решение. Тогда есть и решение, где x, y, z взаимно просты в совокупности. Ясно, что x чётно. Значит, 2y³ = x³ – 4z³ делится на 4, поэтому и y чётно. Следовательно, 4z³ = x³ – 2y³ делится на 8, то есть и z чётно. Противоречие.",
        "Ответ: (0, 0, 0)."
    ],
    "78267": [
        "Арифметика остатков (прочее)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: a, b, p – любые целые числа. Доказать, что найдутся такие взаимно простые k, l, что ak + bl делится на p.",
        "Решение: Поскольку можно поменять знак у чисел k и l, можно  считать, что a ≥ 0 и b ≥ 0.     Докажем утверждение индукцией по a + b. Случай, когда a = 0 либо b = 0, очевиден.     Шаг индукции. Пусть 0 < b ≤ a. В силу предположения индукции найдутся такие взаимно простые числа m и n, что (a – b)m + bn делится на p, а значит,  am + b(n – m) делится на p. Поскольку m и n взаимно просты, то и m и n – m взаимно просты."
    ],
    "79651": [
        "Деление с остатком",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Доказать, что найдётся число вида     а) 1989...19890...0 (несколько раз повторено число 1989, а затем стоит несколько нулей), делящееся на 1988;     б) 1988...1988, делящееся на 1989.",
        "Решение: а) Рассмотрим числа 1989, 19891989, ..., 19891989...1989 (в последнем числе 1989 повторено 1989 раз). Рассмотрим остатки от деления этого числа на 1988, так как остатков меньше, чем написанных чисел, то обязательно найдутся два числа с равными остатками (принцип Дирихле) и, следовательно, их разность будет делится на 1988. Если первое число содержит в своей записи n чисел 1989, а второе – m чисел 1989, то их разность будет записана с помощью n – m чисел 1989 и 4m нулей."
    ],
    "108747": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Доказать, что наибольший общий делитель чисел вида p4 – 1, где p – простое число, большее 5, равен 240.",
        "Решение: Все числа такого вида делятся на 240 (см. задачу 79525). Чтобы убедиться, что это – наибольший общий делитель всех таких чисел, достаточно привести пару чисел такого вида, не имеющих большего общего делителя, например 74 – 1 = 48·50 = 240·10 и 114 – 1 = 120·122 = 240·61."
    ],
    "79506": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Доказать, что из любых 27 различных натуральных чисел, меньших 100, можно  выбрать два числа, не являющихся взаимно простыми.",
        "Решение: Рассмотрим произвольный набор из 27 различных натуральных чисел, меньших 100.  Для каждого числа из набора отметим либо один из его простых делителей (если  это число не равно единице), либо единицу (если это число равно единице). Так  как простых чисел, меньших ста, всего 25, то какое-то число мы отметили  дважды.  Этим числом не могла быть единица, поскольку единицу мы отмечали  только для единицы. Следовательно, в наборе есть два числа с общим простым  делителем, то есть два числа, не являющихся взаимно простыми."
    ],
    "30669": [
        "Уравнения в целых числах",
        "Сложность: 4",
        "Классы: 6,7",
        "Условие: Решите в натуральных числах уравнение x² + y² = z².",
        "Решение: Сначала разберём случай, когда числа x и y взаимно просты. Оба эти числа не могут быть чётными в силу предположения о взаимной простоте. Они не могут быть и нечётными: сумма квадратов двух нечётных чисел даёт остаток 2 при делении на 4 и поэтому не может быть квадратом.     Далее будем считать, что x нечётно, а y чётно. Тогда z нечётно.     Запишем уравнение в виде x² = (z – y)(z + y). Числа u = z – y и v = z + y нечётны и взаимно просты. Действительно, если они имеют общий делитель d > 1, то на d делятся и числа u + v = 2z и u – v = 2y. Поскольку d нечётно, z и y также делятся на d. Поэтому и x² делится на d, что противоречит взаимной простоте чисел x и y.     Следовательно, u и v – полные квадраты: u = m², v = n², где m и n – нечётные взаимно простые числа. Отсюда x = mn, y = ½ (m² – n²), z = ½ (m² + n²).",
        "Ответ: {x, y} = {mnk, ½ k(m² – n²)}, z = ½ k(m² + n²), где m, n – взаимно простые нечётные натуральные числа, m > n, k – произвольное натуральное число."
    ],
    "60521": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Докажите равенства     а) [1, 2,..., 2n] = [n + 1, n + 2, ..., 2n];     б) (a1, a2, ..., an) = (a1, (a2, ..., an));     в) [a1, a2, ..., an] = [a1, [a2, ..., an]].",
        "Решение: а) Пусть 1 ≤ k ≤ n. Найдётся такое натуральное m, что n < 2mk ≤ 2n. Значит, [n + 1, ..., 2n] делится на k, поскольку делится на 2mk."
    ],
    "78604": [
        "Уравнения в целых числах",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Остап Бендер организовал в городе Фуксе раздачу слонов населению. На раздачу  явились 28 членов профсоюза и 37 не членов, причём Остап раздавал слонов  поровну всем членам профсоюза и поровну – не членам. Оказалось, что  существует лишь один способ такой раздачи (так, чтобы раздать всех слонов). Какое наибольшее число слонов могло быть у О. Бендера? (Предполагается, что каждому из пришедших достался хотя бы один слон.)",
        "Решение: Пусть Бендер как-то распределил слонов между двумя указанными группами. Чтобы осуществить другой способ раздачи, ему придётся отнять у каждого члена одной группы по равному числу слонов и раздать их поровну членам другой группы. Поэтому общее число слонов, переданных из одной группы в другую, кратно как 37, так и 28. Эти числа взаимно просты, поэтому указанное число слонов кратно 28·37 = 1036.    Если общее число слонов больше 2·1036 = 2072, то хотя бы у одной группы слонов больше 1036, и можно, отобрав их, раздать членам другой группы. Если же общее число слонов равно 2072, то, раздав каждой группе по 1036 слонов (при этом члены профсоюза получат по 37, а не члены – по 28 слонов), мы осуществим единственную возможную раздачу: ни у одной из групп нельзя отнять всех слонов.",
        "Ответ: 2072 слона."
    ],
    "60532": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Пусть    где p1, ..., ps – простые и α1, ..., αs, β1, ..., βs ≥ 0. Докажите равенства:"
    ],
    "78839": [
        "Ряд Фарея",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Рассмотрим все рациональные числа между нулём и единицей, знаменатели которых  не превосходят n, расположенные в порядке возрастания (ряд Фарея). Пусть a/b и c/d – какие-то два соседних числа (дроби несократимы). Доказать, что |bc – ad| = 1.",
        "Решение: Можно считать, что a/b < c/d. Неравенство a/b < a/b–1 ≤ a+1/b, которое выполняется при a + 1 ≤ b, показывает, что b ≠ d, то есть знаменатели двух соседних дробей не могут быть одинаковыми.     Докажем требуемое утверждение индукцией по n.     База. При n = 3 получаем числа &frac13;, ½, &frac23;; для них утверждение легко проверяется.     Шаг индукции. При переходе от n − 1 к n к старому набору чисел добавляются некоторые числа вида k/n. Согласно сделанному выше замечанию два новых числа не могут быть соседними, поэтому a/b < k/n < c/d, где a/b и c/d – соседние числа из старого списка. Нужно доказать, что оба числа  A = kb − an и B = cn − kd равны 1 (ясно, что эти числа положительны).     Предположим, что одно из них больше 1. Тогда b + d < bB + dA = (bc − ad)n = n (bc − ad = 1 по предположению индукции). Неравенство  a/b < a+c/b+d < c/d показывает, что числа a/b и c/d не могут быть соседними. Противоречие."
    ],
    "97970": [
        "Рекуррентные соотношения (прочее)",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Рассматривается последовательность слов из букв A и B. Первое слово –  A, второе – B. k-е слово получается приписыванием к (k–2)-му слову справа (k–1)-го (так что начало последовательности имеет вид: A, B, AB, BAB, ABBAB, ...). Может ли в последовательности встретиться периодическое слово, то есть слово, состоящее из нескольких (по меньшей мере двух) одинаковых кусков, идущих друг за другом, и только из них?",
        "Решение: Легко видеть, что в k-е слово входят ровно Fk–2 букв А и ровно Fk–1 букв В (k ≥ 3, Fk – числа Фибоначчи). Если бы это слово было периодическим, то и Fk–1, и Fk–2 делились бы на число вхождений периода. Но соседние числа Фибоначчи взаимно просты (см. зад. 60573).",
        "Ответ: Не может."
    ],
    "105213": [
        "Простые числа и их свойства",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Натуральное число n таково, что 3n + 1 и 10n + 1 являются квадратами натуральных чисел. Докажите, что число 29n + 11 – составное.",
        "Решение: Пусть 3n + 1 = a², 10n + 1 = b², где a, b ∈ N, и пусть p = 29n + 11 – простое число. Далее можно рассуждать по-разному."
    ],
    "35406": [
        "Деление с остатком",
        "Сложность: 4+",
        "Классы: 8,9,10",
        "Условие: Дано n целых чисел, каждое из которых взаимно просто с n. Также дано неотрицательное целое число r < n.   Докажите, что среди данных n чисел можно выбрать несколько чисел, сумма которых дает остаток r при делении на n.",
        "Подсказка: Доказывайте следующее более общее утверждение: если дано k (0 < k < n + 1) чисел, взаимно простых с n, то среди сумм некоторых из этих k чисел встретится не менее k остатков от деления на n.",
        "Решение: Утверждение задачи следует из более общего утверждения: если дано k (0 < k ≥ n) чисел, взаимно простых с n, то среди сумм некоторых из этих k чисел встретится не менее k остатков от деления на n. Последнее утверждение докажем индукцией по k. База (k = 1) очевидна.     Шаг индукции. Пусть даны числа a0, a1, a2, ..., ak (k + 1 ≤ n), взаимно простые с n. По предположению индукции среди сумм некоторых из чисел a1, a2, ..., ak встретится не менее k различных остатков от деления на n; пусть R – множество этих остатков. Если R в более k элементов, то все уже доказано. Пусть в R ровно k элементов и среди сумм некоторых из чисел a0, a1, a2, ..., ak встречаются только остатки из множества R. Рассмотрим сумму S некоторых из чисел a1, a2, ..., ak, дающую остаток r ∈ R от деления на n. Тогда сумма S + a0 снова даёт некоторый остаток r' ∈ R. Отсюда следует, что для любого остатка r ∈ R остаток числа r + a0 также принадлежит R. Значит, остатки всех чисел r, r + a0, r + 2a0, ..., r + (n – 1)a0 принадлежат множеству R, состоящему из k < n остатков. Однако, выписанные числа дают различные остатки от деления на n. Действительно, разность (r + ka0) – (r + ma0) = (k – m)a0 не делится на n, так как 0 < |k – m| < n, а (a0, n) = 1. Противоречие."
    ],
    "73597": [
        "Деление с остатком",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что для любого нечётного натурального числа a существует такое натуральное число b, что 2b – 1 делится на a.",
        "Решение: Рассмотрим числа 20 – 1, 21 – 1, ..., 2a – 1. Этих чисел a + 1. Какие-то два из них дают одинаковые остатки при делении на a, потому что различных таких остатков существует всего a. Пусть, скажем, числа 2k – 1 и 2m – 1 дают одинаковые остатки при делении на a и k < m. Тогда число (2m – 1) – (2k – 1) = 2k(2m–k – 1) делится на a и, поскольку a нечётно, 2m–k – 1 делится на a."
    ],
    "32086": [
        "Средние величины",
        "Сложность: 4",
        "Классы: 6,7,8,9",
        "Условие: Компьютер может производить одну операцию: брать среднее арифметическое двух целых чисел. Даны три числа: m, n и 0, причём m и n не имеют общих делителей и  m < n. Докажите, что с помощью компьютера из них можно получить     а) единицу;     б) любое целое число от 1 до n.",
        "Решение: Заметим, что среднее арифметическое двух целых чисел является целым тогда и только тогда, когда они одной чётности (то есть оба чётные или оба нечётные). Поскольку компьютер может оперировать лишь с целыми числами, то можно считать, что разрешается брать среднее арифметическое чисел одной чётности.     Будем называть множество целых чисел стабильным, если для каждых двух его элементов одной чётности, их среднее арифметическое также принадлежит этому множеству (другими словами, если с помощью данного компьютера его нельзя расширить).     Упорядочим стабильное множество по возрастанию. Тогда чётные и нечётные числа в нём чередуются. Действительно, если в нём имеются два соседних числа  одной чётности, то их среднее арифметическое является целым, лежащим между ними, что противоречит определению стабильного множества.     Рассмотрим произвольный (не крайний) элемент этого множества. Так как он имеет разную чётность с обоими своими соседями, то эти два элемента имеют одну чётность. Их среднее арифметическое, тем самым, равно рассматриваемому числу. Так как каждый элемент множества является средним арифметическим соседних, то это – арифметическая прогрессия. (Мы рассматриваем как бесконечные – в одну или обе стороны – прогрессии, так и конечные.)   Мы имеем три числа 0, m и n. По крайней мере два из них имеют одинаковую чётность. Будем производить операцию взятия среднего арифметического каких-либо двух чисел и добавлять полученное число к имеющимся до тех пор, пока не получим стабильное множество. Поскольку все получаемые числа лежат в интервале от 0 до n, мы, как показано выше, получим арифметическую прогрессию с первым членом 0, последним n и содержащую m. Поскольку m и n делятся на разность прогрессии, а по условию они взаимно просты, разность прогрессии равна 1. Значит, мы получим все числа от 0 до n."
    ],
    "60601": [
        "Цепные (непрерывные) дроби",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Пусть a0 – целое, a1, ..., an – натуральные числа. Определим две последовательности P–1 = 1, P0 = a0, Pk = akPk–1 + Pk–2 (1 ≤ k ≤ n);  Q–1 = 0, Q0 = 1, Qk = akQk–1 + Qk–2 (1 ≤ k ≤ n).     Дроби Pk/Qk называются подходящими дробями к числу [a0; a1, a2, ..., an].     Докажите, что построенные последовательности для k = 0, 1, ..., n обладают следующими свойствами:      а) Pk/Qk = [a0; a1, a2,..., ak];      б) PkQk–1 – Pk–1Qk = (–1)k+1;      в)  (Pk, Qk) = 1.",
        "Решение: а) Индукция. База. При k = 0, 1 равенство проверяется непосредственно.     Шаг индукции. Подходящая дробь с номером k + 1 получается из k-й дроби заменой ak на   ak + : [a0; a1, ..., ak, ak+1] = [a0; a1, ..., ak + ].     Делая такую замену в равенстве    приходим к соотношению   [a0; a1, ..., ak, ak+1] =  = ."
    ],
    "60756": [
        "Простые числа и их свойства",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Пусть p – простое число и p > 3.     а) Докажите, что если разрешимо сравнение x² + x + 1 ≡ 0 (mod p), то p ≡ 1 (mod 6).     б) Выведите отсюда бесконечность множества простых чисел вида 6k + 1.",
        "Решение: а) Решение x указанного сравнения удовлетворяет условиям xp–1 – 1 ≡ 0 (mod p) и    x³ – 1 ≡ 0 (mod p). Cогласно задаче 60507 а) x(p–1, 3) – 1 ≡ 0 (mod p). Но x не сравнимо с 1 по модулю p, поскольку 3 на p не делится. Следовательно, p – 1 делится на 3, то есть p имеет вид 6k + 1."
    ],
    "60757": [
        "Простые числа и их свойства",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Пусть p – простое число и p > 5. Докажите,  что если разрешимо сравнение x4 + x3 + x2 + x + 1 ≡ 0 (mod p), то   p ≡ 1 (mod 5).  Выведите отсюда бесконечность множества простых чисел вида 5n + 1.",
        "Подсказка: См. решение задачи 60756."
    ],
    "57089": [
        "Правильные многоугольники",
        "Сложность: 5+",
        "Классы: 9",
        "Условие: Докажите, что если число n не является степенью простого числа, то существует выпуклый n-угольник со сторонами длиной 1, 2,..., n, все углы которого равны.",
        "Решение: Пусть e0, ..., en–1 – векторы сторон правильного n-угольника. Достаточно доказать, что, переупорядочив эти векторы, можно получить такой набор векторов {a1, ..., an}, что kak = 0.     Число n по условию можно представить в виде n = pq, где p и q взаимно просты. Докажем, что набор   {e0, ep, ..., e(q–1)p; eq, eq+p, ..., eq+(q–1)p, ...; e(p–1)q+p, ..., e(p–1)q+(q–1)p}, где все номера берутся по модулю n, – искомый.     Заметим сначала, что если xq + yp ≡ x'q + y'p (mod pq), то x ≡ x' (mod p) и y ≡ y' (mod q), поэтому в рассматриваемом наборе каждый из векторов e0, ..., en–1 встречается ровно один раз.     Концы векторов eq, eq+p, ..., eq+(q–1)p с общим началом образуют правильный q-угольник, поэтому их сумма равна нулю. Кроме того, векторы e0, ep, ..., e(q–1)p переходят в eq, eq+p, ..., eq+(q–1)p, при повороте на угол φ = 2π/p. Поэтому если e0 + 2ep + ... + qe(q–1)p = b, то   (q + 1)eq + (q + 2)eq+n + ... + 2qeq+(q–1)p = q(eq + ... + eq+(q–1)p) + eq + 2eq+p + ... + qeq+(q–1)p = Rφb, где Rφb – вектор, полученный из вектора b поворотом на угол φ.     Аналогичные рассуждения показывают, что для рассматриваемого набора векторов kak = b + Rφb + ... + R(p–-1)φb = 0."
    ],
    "76434": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Доказать формулы     а) [a, b](a, b) = ab.     б) [a, b, c](a, b)(b, c)(c, a) = (a, b, c)abc.",
        "Решение: а) Первый способ. См. задачу 30371.     Второй способ. Пусть    Тогда      Поэтому доказательство можно провести для каждого простого множителя отдельно. Если a = pα, b = pβ, причём α ≤ β, то (a, b) = pα,   [a, b] = pβ и [a, b](a, b) = pαpβ = ab."
    ],
    "78521": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: Доказать, что произведение двух последовательных натуральных чисел не является  степенью никакого целого числа.",
        "Решение: Предположим, что n(n + 1) = am, где m ≥ 2 (a, m и n – натуральные  числа). Числа n и n + 1 не имеют общих делителей, поэтому n = bm и n + 1 = cm. Но этого не может быть, потому что разность между двумя последовательными m-ми степенями больше 1."
    ],
    "78577": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: В прямоугольном бильярде размером p×2q, где p и q – нечётные числа, сделаны лузы в каждом углу и в середине каждой стороны длины 2q. Из угла выпущен шарик под углом 45° к стороне. Доказать, что шарик обязательно попадёт в одну из средних луз.",
        "Решение: Разобьём плоскость на прямоугольники p×q, то есть рассмотрим сетку с шагом q по горизонтали и p – по вертикали. Бильярд занимает два соседних прямоугольника этой сетки. Распрямим путь шара, симметрично отражая его относительно стенок. Тогда шар будет двигаться по прямой y = x (точнее, по лучу этой прямой, выходящему из начала координат), а лузы будут расположены в узлах сетки. Этот луч впервые пройдёт через узел сетки в точке с координатами (m, m), где m = НОК(p, q). Поскольку m нечётно, эта точка соответствует средней лузе."
    ],
    "35289": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Доказать, что дробь    несократима.",
        "Решение: 5(12n + 1) – 2(30n + 1) = 3, поэтому НОД(12n + 1, 30n + 1) равен 3 или 1. Но 12n + 1 на 3 не делится."
    ],
    "79643": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: Существуют ли шесть таких последовательных натуральных чисел, что наименьшее  общее кратное первых трёх из них больше, чем наименьшее общее кратное трёх  следующих?",
        "Решение: Например, тройки 17, 18, 19 и 20, 21, 22. Действительно, НОК(17, 18, 19) = 17·18·19 = 5814, а НОК(20, 21, 22) = 10·21·22 = 4620.",
        "Ответ: Существуют."
    ],
    "88073": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 5,6,7",
        "Условие: Коля, Серёжа и Ваня регулярно ходили в кинотеатр. Коля бывал в нём каждый  третий день, Серёжа – каждый седьмой, Ваня – каждый пятый. Сегодня все ребята были в кино. Когда все трое встретятся в кинотеатре в следующий раз?",
        "Подсказка: НОД(3, 5, 7) = 105.",
        "Ответ: Через 105 дней."
    ],
    "104016": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: На юбилей 57-й школы Московский Монетный Двор выпустил юбилейные монеты достоинством в 57 копеек. А на юбилей 239-й школы монеты достоинством в 239 копеек выпустил Санкт-Петербургский Монетный Двор. Чтобы никому не было обидно, количество денег, выпущенных оба раза, было одинаково. Смогут ли Олег и 36 его друзей разделить все выпущенные монеты так, чтобы каждому досталось одинаковое количество монет?",
        "Решение: Числа 57 и 239 взаимно просты, поэтому количество монет по 57 коп. равно 239n, а монет по 239 коп. – 57n, где n – какое-то натуральное число. Таким образом, всего выпущено (239 + 57)n = 296n монет, а 296 делится на 37.",
        "Ответ: Смогут."
    ],
    "116868": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: Расставьте в кружках, расположенных в вершинах квадрата и в его центре, пять натуральных чисел так, чтобы каждые два числа, соединенные отрезком, имели общий делитель, больший 1, а любые два числа, не соединенные отрезком, были бы взаимно просты.",
        "Решение: Возьмём четыре попарно взаимно простых числа a, b, c, d и запишем в двух противоположных вершинах квадрата числа ab и cd, в других вершинах – числа ad и bc, а в центре – abcd (см. рис.).",
        "Ответ: Например:"
    ],
    "32111": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Каков наибольший возможный общий делитель чисел 9m + 7n и 3m + 2n, если числа m и n не имеют общих делителей, кроме единицы?",
        "Решение: Любой общий делитель чисел 9m + 7n и 3m + 2n должен быть также делителем чисел (9m + 7n) – 3(3m + 2n) = n и 7(3m + 2n) – 2(9m + 7n) = 3m. Поскольку числа m и n взаимно просты, то любой общий делитель чисел n и 3m должен быть делителем числа 3, то есть не может быть больше 3.     Это значение возможно: при m = 1, n = 3  НОД(9m + 7n, 3m + 2n) = НОД(30, 9) = 3.",
        "Ответ: 3."
    ],
    "60497": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Может ли наибольший общий делитель двух натуральных чисел быть больше их разности?",
        "Ответ: Только если эти числа равны."
    ],
    "34920": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Дано n попарно взаимно простых чисел, больших 1 и меньших (2n – 1)². Докажите, что среди них обязательно есть простое число.",
        "Подсказка: Предположите противное и рассмотрите наименьшие простые делители данных чисел.",
        "Решение: Пусть a1, a2, ..., an – попарно взаимно простые составные числа. Обозначим через pi наименьший простой делитель числа ai. Тогда ai = piqi, причём pi ≤ qi. Поскольку ai < (2n – 1)², то pi < 2n – 1. Кроме того, числа p1, p2, ..., pn различны, так как числа a1, a2, ..., an попарно взаимно просты. Однако существует не более n – 1 простых чисел, больших 1 и меньших 2n – 1: все такие числа содержатся среди чисел 2, 3, 5, 7, ..., 2n – 3. Противоречие."
    ],
    "34927": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Может ли произведение трёх последовательных натуральных чисел быть степенью натурального числа (квадратом, кубом и т.д.)?",
        "Подсказка: Докажите, что среднее число само является степенью.",
        "Решение: Пусть произведение чисел n – 1, n, n + 1 является точной m-й степенью. Поскольку число n взаимно просто с числами n – 1 и n + 1, то любой простой делитель числа n входит в разложение числа (n – 1)n(n + 1) с таким же показателем, с каким он входит в разложение числа n, то есть он  входит в разложение числа n в степени, кратной m. Поэтому n (а следовательно, и n²) является точной m-й степенью. Но и (n – 1)(n + 1) = n² – 1 также является m-й степенью натурального числа, как частное от деления чисел (n – 1)n(n + 1) и n, являющихся  m-ми степенями. Таким образом, нами найдены два последовательных натуральных числа (n² и n² – 1), являющихся m-ми степенями. Ясно, что это невозможно. Противоречие.",
        "Ответ: Не может."
    ],
    "35134": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В строку выписано m натуральных чисел. За один ход можно прибавить по единице к некоторым n из этих чисел.   Всегда ли можно сделать все числа равными?",
        "Подсказка: Если числа",
        "Решение: Пусть числа m и n имеют общий делитель d > 1, а сумма выписанных вначале чисел на d не делится. При прибавлении по единице к некоторым n из этих чисел сумма всех чисел увеличивается на n. Поскольку n делится на d, сумма выписанных чисел всегда будет иметь один и тот же остаток от деления на d, следовательно, сумма всех чисел никогда не будет делиться на d. Если же в некоторый момент все m чисел станут равными, то сумма всех чисел разделится на m и, следовательно, на d.",
        "Ответ: Не всегда."
    ],
    "60483": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что если в наборе целых чисел a1, ..., an хотя бы одно отлично от 0, то они имеют наибольший  общий делитель."
    ],
    "60484": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: В прямоугольнике с целыми сторонами m и n, нарисованном на клетчатой бумаге, проведена диагональ.     а) Через какое число узлов она проходит?     б) На сколько частей эта диагональ делится линиями сетки?",
        "Подсказка: См. задачу 34928.",
        "Ответ: а) (m, n) + 1;  б) m + n – (m, n)."
    ],
    "60487": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: В задаче 60274 доказана возможность деления с остатком произвольного целого числа a на натуральное число b.   Докажите, что из равенства a = bq + r следует соотношение (a, b) = (b, r).",
        "Решение: У пар (a, b) и (b, r) совпадают множества общих делителей. Значит, совпадают и наибольшие элементы в этих  множествах."
    ],
    "60488": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: а) Пусть m0 и m1 – целые числа, &nbsp0 < m1 ≤ m0.   Докажите, что при некотором k > 1 существуют такие целые числа a0, a1, ..., ak и m2, ..., mk, что  m1 > m2 > m3 > ... > mk > 0, ak > 1,     m0 = m1a0 + m2,     m1 = m2a1 + m3,     m2 = m3a2 + m4,      ...     mk–2 = mk–1ak–1 + mk,     mk–1 = mkak,    и (m0, m1) = mk.",
        "Решение: а) Числа a0 и m2 получаются как частное и остаток при делении m0 на m1 числа a1 и m2 – как частное и остаток при делении m1 на m2, и так далее. Поскольку числа все время уменьшаются, процесс когда-нибудь закончится, то есть на каком-то шаге остаток будет равен нулю."
    ],
    "60490": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Пусть (a, b) = 1 и a | bc. Докажите, что  a | c.",
        "Решение: Согласно задаче"
    ],
    "60492": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Какое наибольшее значение может принимать наибольший общий делитель чисел a и b, если известно, что ab = 600?",
        "Подсказка: Произведение двух чисел делится на квадрат их наибольшего общего делителя.",
        "Ответ: 10."
    ],
    "60498": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 2+",
        "Классы: 8,9,10",
        "Условие: Докажите, что (bc, ac, ab) делится на (a, b, c)².",
        "Подсказка: Каждое из чисел bc, ac, ab делится на (a, b, c)²."
    ],
    "60493": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Натуральные числа a1, a2, ..., a49 удовлетворяют равенству a1 + a2 + ... + a49 = 540.   Какое наибольшее значение может принимать их наибольший общий делитель?",
        "Подсказка: d ≤ 540/9.",
        "Ответ: 10."
    ],
    "60495": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Числа от 1 до 1000 выписаны подряд по кругу. Начиная с первого, вычёркивается каждое 15-е число: 1, 16, 31, ..., причём при повторных оборотах зачёркнутые числа считаются снова. Число оборотов не ограничено. Сколько чисел останутся незачёркнутыми?",
        "Подсказка: Можно считать, что выписаны числа от 0 до 999. Тогда будут вычеркнуты все числа, кратные НОД(1000, 15) = 5.",
        "Ответ: 800."
    ],
    "60533": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите равенства:     а) [a,(a, b)] = a;     б) (a, [a, b]) = a;      в) abc = [a, b, c](ab, ac, bc);     г) abc = (a, b, c)[ab, bc, ac].",
        "Подсказка: При помощи формул задачи 60532, доказательство каждого тождества сводится к доказательству следующих равенств:     а) max(α, min(α, β) = α;     б) min(α, max(α, β) = α;     в) α + β + γ = max(α, β, γ) + min(α + β, α + γ, β + γ);     г) α + β + γ = min(α, β, γ) + max(α + β, α + γ, β + γ)."
    ],
    "60534": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Приведите пример, когда равенство (a, b, c)[a, b, c] = abc не выполнено. Каким неравенством всегда будут связаны числа   (a, b, c)[a, b, c] и abc?",
        "Ответ: (6, 10, 15)[6, 10, 15] = 1·60 < 6·10·15; (a, b, c)[a, b, c] ≤ abc."
    ],
    "60998": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Найдите такие линейные функции P(x) и Q(x), чтобы выполнялось равенство  P(x)(2x³ – 7x² + 7x – 2) + Q(x)(2x³ + x² + x – 1) = 2x – 1.",
        "Решение: Заметим, что 2x³ – 7x² + 7x – 2 = (x – 1)(x – 2)(2x – 1), 2x³ + x² + x – 1 = (2x – 1)(x² + x + 1). Поэтому достаточно найти такие функции P(x) и Q(x), чтобы выполнялось равенство P(x)(x² – 3x + 2) + Q(x)(x² + x + 1) = 1. Их можно искать, например, методом неопределенных коэффициентов, записав последнее равенство в виде (ax + b)(x² – 3x + 2) – (ax + c)(x² + x + 1) = 1.",
        "Ответ: P(x) = 1/21 (4x + 5), Q(x) = – 1/21 (4x – 11)."
    ],
    "64951": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: Сумма десяти натуральных чисел равна 1001. Какое наибольшее значение может принимать НОД (наибольший общий делитель) этих чисел?",
        "Решение: Пример. Рассмотрим девять чисел, равных 91, и число 182. Их сумма равна 1001.",
        "Ответ: 91."
    ],
    "65906": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На доске записаны двузначные числа. Каждое число составное, но любые два числа взаимно просты.   Какое наибольшее количество чисел может быть записано?",
        "Решение: Оценка. Так как любые два записанных числа взаимно просты, то каждое из простых чисел 2, 3, 5 и 7 может войти в разложение на множители не более, чем одного из них. Если на доске пять или более чисел, то все простые множители в разложении какого-то из них должны быть не меньше чем 11. Но это составное число, значит, оно не меньше чем 121. Это противоречит условию. Следовательно, на доске записано не более четырёх чисел.     Пример. 25, 26, 33, 49.",
        "Ответ: 4 числа."
    ],
    "86480": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Доказать, что числа 27x + 4 и 18x + 3 взаимно просты при любом натуральном x.",
        "Подсказка: 3(18x + 3) − 2(27x + 4) = 1."
    ],
    "65996": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Какие значения может принимать наибольший общий делитель натуральных чисел m и n, если известно, что при увеличении числа m на 6 он увеличивается в 9 раз?",
        "Решение: Пусть НОД(m, n) = d, тогда m = xd, n = yd, где x и y – натуральные числа. По условию xd + 6 делится на 9d, то есть xd + 6 = 9zd. Значит,  d(9z – x) = 6, то есть d – делитель числа 6. Кроме того, каждое из чисел m + 6 и n делится на 9, поэтому m кратно 3. Следовательно, и d кратно 3. Таким образом, достаточно проверить d = 3 и d = 6.     Покажем, что оба случая возможны.     НОД(21, 27) = 3, НОД(27, 27) = 27.     НОД(48, 54) = 6, НОД(54, 54) = 54.",
        "Ответ: 3 или 6."
    ],
    "76538": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите, что каково бы ни было целое число n, среди чисел n,  n + 1, n + 2, n + 3, n + 4 есть хотя бы одно число взаимно простое с остальными четырьмя из этих чисел.",
        "Решение: Если |k – l| ≤ 4 и k ≠ l, то наибольший общий делитель чисел k и l не превосходит 4. Поэтому наибольший общий делитель любой пары выбранных чисел не превосходит 4. Из пяти последовательных чисел можно выбрать пару последовательных нечётных чисел. Из двух последовательных нечётных чисел по крайней мере одно не делится на 3. Это число взаимно просто с остальными четырьмя числами."
    ],
    "77978": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Доказать, что наибольший общий делитель суммы двух чисел и их наименьшего  общего кратного равен наибольшему общему делителю самих чисел.",
        "Решение: В наименьшее общее кратное чисел a и b входят только те простые делители, которые входят в a и b. Только они и могут входить в наибольший общий делитель суммы и наименьшего общего кратного. Поэтому достаточно проследить за степенью каждого простого множителя отдельно. Пусть a = pα... и  b = pβ..., причём α ≤ β. Тогда сумма чисел a и b имеет вид pα..., а их наименьшее общее кратное имеет вид pβ... . Поэтому рассматриваемый наибольший общий делитель имеет вид pα... . Наибольший общий делитель самих чисел a и b имеет такой же вид."
    ],
    "78586": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Найти все такие двузначные числа , что при умножении на некоторое целое число  получается число, предпоследняя цифра которого – 5.",
        "Решение: Заметим сначала, что числа, кратные 20, не подходят. Действительно,  после умножения на любое целое число мы получим число, кратное 20. Следовательно, последняя цифра этого числа будет нулём, а предпоследняя чётна.     Докажем, что для любого числа N, не кратного 20, существует число, при умножении N на которое получается число, предпоследняя  цифра которого равна 5.",
        "Ответ: Все числа, не кратные 20."
    ],
    "78652": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Доказать, что для любых трёх чисел, меньших 1000000, найдётся число, меньшее 100 (но большее 1), взаимно простое с каждым из них.",
        "Решение: Составим сначала список простых чисел, меньших 100: 2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 78, 83, 89, 97. Предположим, что на каждое из этих чисел делится хотя бы одно из трёх данных чисел a, b, c. Тогда abc ≥ 2·3·5·...·97 > 1018. Но a, b, c ≤ 106, поэтому abc ≤ 1018. Противоречие."
    ],
    "79394": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 9",
        "Условие: Дано 10 натуральных чисел: a1 < a2 < a3 < ... < a10. Доказать, что их  наименьшее общее кратное не меньше 10a1.",
        "Решение: Пусть [a1, ..., a10] = A. Тогда A = a1k1 = ... = a10k10, где k1, ..., k10 – натуральные числа. Из условия следует, что k1 > k2 > ... > k10, поэтому k1 ≥ 10. Следовательно, A = a1k1 ≥ 10a1."
    ],
    "88287": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 2+",
        "Классы: 6,7",
        "Условие: Существуют ли такие натуральные числа a и b, что дроби a/b, a+1/b, a+1/b+1 несократимы?",
        "Решение: Например: 2/7, 3/7, &frac38;.",
        "Ответ: Существуют."
    ],
    "109167": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Вершины тысячеугольника занумерованы числами от 1 до 1000. Начиная с первой, отмечается каждая пятнадцатая вершина (1, 16, 31 и т.д.). Вершины отмечаются до тех пор, пока не окажется, что все отмечаемые вершины уже найдены. Сколько вершин останутся неотмеченными?",
        "Решение: См. задачу 60495.",
        "Ответ: 800 вершин."
    ],
    "109551": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Даны такие натуральные числа",
        "Решение: Пусть d = НОД(a, b). Так как ab делится на d², то a² + b² + a + b делится на d². Число a² + b² также делится на d². Поэтому a + b делится на d² и  ≥ d."
    ],
    "88250": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 5,6,7",
        "Условие: Бак был полон воды. Эту воду поровну перелили в три бидона. Оказалось, что в первом бидоне вода заняла половину его объёма, во втором бидоне вода заняла &frac23;, а в третьем бидоне – ¾ его объёма. Бак и все три бидона вмещают по целому числу литров. При каком наименьшем объёме бака возможна такая ситуация?",
        "Решение: В каждый бидон перелито по &frac13; объёма бака. Значит, объём первого бидона равен 2·&frac13; = &frac23; бака, объём второго – 3/2·&frac13; = ½ бака, а объём третьего – 4/3·&frac13; = 4/9 бака. Все эти количества – целые числа, поэтому объём бака делится на 3, 2 и 9. НОК(2, 3, 9) = 18. Значит, минимальная  вместимость бака – 18 л.",
        "Ответ: 18 л."
    ],
    "35226": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Можно ли расставить во всех точках плоскости с целыми координатами   натуральные числа так, чтобы каждое натуральное число стояло в какой-нибудь   точке, и чтобы на каждой прямой, проходящей через две точки с целыми координатами, но не проходящей через начало координат, расстановка чисел была периодической?",
        "Подсказка: Поставьте в точке с координатами (x, y) число НОД(x, y).    Другой подход: перебирайте прямые и делайте последовательно на каждой из них периодическую расстановку.",
        "Решение: Поставим в точке с координатами (x, y) число НОД(x, y). При этом каждое число стоит в какой-нибудь точке    (например, число n стоит в точке (n, n)).       Пусть ax + by = c – уравнение прямой, не проходящей через начало координат и содержащей хотя бы две целые точки (x1, y1) и (x2, y2). Можно считать, что c = 1. Тогда числа a и b рациональны, как решения системы уравнений ax1 + by1 = 1, ax2 + by2 = 1. Домножая теперь числа a, b, 1 на подходящее натуральное число, добиваемся того, что   в уравнении ax + by = с коэффициенты a, b, c – целые числа.     Пусть (x, y) – некоторая целая точка, лежащая на этой прямой. Тогда, очевидно, НОД(x, y) – делитель c. Точка (x – bc, y + ac) тоже лежит на нашей прямой, и НОД(x – bc, y + ac) = НОД(x, y) (действительно, если d делит x и y, и, следовательно, c, то d делит также x – bc и y + ac; наоборот – если d делит x – bc и y + ac, то d делит  a(x – bc) + b(y + ac) = ax + by = c, и, следовательно, делит x и y). Это значит, что расположение чисел на прямой повторяется при сдвиге на – bc по оси Ox и на ac по оси Oy, то есть расположение чисел периодично.",
        "Ответ: Можно."
    ],
    "60485": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Натуральные числа p и q взаимно просты. Отрезок [0, 1] разбит на p + q одинаковых отрезков.   Докажите, что в каждом из этих отрезков, кроме двух крайних лежит ровно одно из p + q – 2 чисел 1/p, 2/p, ..., p–1/p, 1/q, 2/q, ..., q–1/q.",
        "Решение: В силу взаимной простоты p и q указанные p + q – 2 числа попарно различны (кроме того, они отличаются и от чисел вида k/p+q). Поэтому они делят отрезок   [0, 1] на p + q – 1 отрезок. Достаточно доказать что внутри каждого из этих отрезков есть точка вида k/p+q.     На отрезке вида [m/p, m+1/p] такая точка, очевидно, есть, поскольку его длина больше 1/p+q. Расмотрим отрезок вида [m/p, n/q]. Он содержит точку m+n/p+q, поскольку неравенства m/p < m+n/p+q < n/q эквивалентны неравенству mq < np, то есть неравенству m/p < n/q. Аналогично рассматриваются отрезки вида [a/q, b/p]."
    ],
    "60674": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Докажите, что среди любых десяти последовательных натуральных чисел найдётся число, взаимно простое с остальными.",
        "Решение: Наибольший общий делитель двух из десяти последовательных чисел не превосходит 9. Покажем, что среди 10 последовательных чисел найдётся такое, которое не делится на числа 2, 3, 5, 7. Оно и будет удовлетворять условию задачи. Действительно, среди этих чисел пять делятся на 2. Среди оставшихся чисел не более  двух делятся на 3, и не более одного – на 5 и 7. Таким образом исключается не более 9 чисел."
    ],
    "104056": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 4",
        "Классы: 7,8,9,10",
        "Условие: Хозяйка сделала расстегай и хочет заранее разрезать его на такие (не обязательно равные) части, чтобы пирог можно было разделить поровну и на пятерых, и на семерых. Каким минимальным числом кусков она сможет обойтись?",
        "Решение: Эта задача – частный случай задачи 98057.",
        "Ответ: 11 кусками."
    ],
    "60489": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: a, b, c – целые числа; a и b отличны от нуля.  Докажите, что уравнение ax + by = c имеет решения в целых числах тогда и только тогда, когда c делится на d = НОД(a, b).",
        "Решение: Необходимость. Любое число вида ax + by делится на d."
    ],
    "60503": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: При каких целых n сократимы дроби     а)  ;  б) ?",
        "Решение: а) Так как (n² + 2n + 4, n2 + n + 3) = (n + 1, 3), то дробь будет сократима, когда (n + 1, 3) = 3.",
        "Ответ: а) При n = 3k – 1;  б) при n = 3k и n = 3k + 1."
    ],
    "60522": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На доске написано n натуральных чисел. За одну операцию вместо двух чисел, не делящих друг друга, можно написать их наибольший общий делитель и их наименьшее общее кратное.     а) Докажите, что можно провести только конечное число операций.     б) Финальный результат независимо от порядка действий будет одним  и тем же. Например:      (4, 6, 9) → (2, 12, 9) → (2, 3, 36) → (1, 6, 36),        (4, 6, 9) → (4, 3, 18) → (1, 12, 18) → (1, 6, 36).",
        "Решение: а) Назовём пару чисел правильной, если одно из них делится на другое. заметим, что при каждой операции число правильных пар увеличивается. Когда все пары станут правильными, процесс прекратится."
    ]
}