{
    "104122": [
        "https://www.problems.ru/view_problem_details_new.php?id=104122",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 2-",
        "Классы: 7,8",
        "Условие: \nЖеня не успел влезть в лифт на первом этаже дома и решил пойти по лестнице. На третий этаж он поднимается за 2 минуты. Сколько времени у него займет подъем до девятого этажа?\n      ",
        "Ответ: \n8 минут.\n      "
    ],
    "88219": [
        "https://www.problems.ru/view_problem_details_new.php?id=88219",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 2",
        "Классы: 5,6,7,8",
        "Условие: \n По кругу\nзаписано больше трех натуральных чисел, сумма которых равна 37.\nИзвестно, что суммы любых трех последовательных чисел равны между собой.\nКакие числа написаны по кругу?\n\n      ",
        "Подсказка: \n      Попробуйте рассмотреть два случая: а) количество\nзаписанных чисел не кратно 3; б) количество записанных чисел кратно 3.\n\n      ",
        "Решение: \n      Поскольку суммы любых трех, последовательно записанных\nпо кругу чисел равны между собой, то каждые третьи числа равны\nмежду собой. Рассмотрим два случая: а) количество записанных чисел\nне кратно 3; б) количество записанных чисел кратно 3.\n\nВ первом случае все числа будут равны между собой, а во втором  — сумма\nих будет кратна 3. Второй случай невозможен, так как 37 на 3 не делится.\nВ первом случае единственная возможность  — записать по кругу\n37 единиц.\n\n      ",
        "Ответ: \n       Единицы.\n      "
    ],
    "104059": [
        "https://www.problems.ru/view_problem_details_new.php?id=104059",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Саша пригласил Петю в гости, сказав, что живёт в 10-м подъезде в квартире №333, а этаж сказать забыл. Подойдя к дому, Петя обнаружил, что дом девятиэтажный. На какой этаж ему следует подняться? (На каждом этаже число квартир одинаково, номера квартир в доме начинаются с единицы.) ",
        "Решение: Если на этаже не более трёх квартир, то в десяти подъездах их не более чем  10·9·3 = 270,  то есть в 10-м подъезде квартиры № 333 не будет. Если на этаже не менее пяти квартир, то уже в девяти подъездах будет не менее чем  9·9·5 = 405  квартир, то есть Сашина квартира будет не в 10-м подъезде. Значит, квартир на этаже 4, в первых девяти подъездах  9·9·4 = 324  квартиры. Тогда в 10-м подъезде квартиры начинаются с 325-й. На втором этаже они начнутся с 329-й, на третьем – с 333-й. Таким образом, Пете нужно подняться на третий этаж. ",
        "Ответ: На 3-й этаж. \n"
    ],
    "109481": [
        "https://www.problems.ru/view_problem_details_new.php?id=109481",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 2",
        "Классы: 5,6,7,8",
        "Условие: Коля и его сестра Маша пошли в гости. Пройдя четверть пути, Коля вспомнил, что они забыли дома подарок и повернул обратно, а Маша пошла дальше. Маша пришла в гости через 20 минут после выхода из дома. На сколько минут позже пришёл в гости Коля, если известно, что они все время шли с одинаковыми скоростями? \n",
        "Решение: Коля прошел \"лишнюю\" половину пути. Значит, время опоздания равно половине времени, потраченного на весь путь, то есть 10 минутам. \n",
        "Ответ: На 10 минут. \n"
    ],
    "30266": [
        "https://www.problems.ru/view_problem_details_new.php?id=30266",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: Сколько клеток пересекает диагональ в клетчатом прямоугольнике размерами 199 × 991?\n",
        "Решение: Диагональ пересекает 199 + 991 - 1 = 1189 клеток.\n"
    ],
    "32779": [
        "https://www.problems.ru/view_problem_details_new.php?id=32779",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Рейс 608 \"Аэрофлота\" вылетает из Москвы в 12:00, а прилетает в Бишкек в 18:00 (по местному времени). Обратный рейс 607 вылетает в 8:00, а прилетает в 10:00.\r\nСколько времени длится полет?",
        "Решение: Самолёт отсутствует в Москве 22 часа, из которых 14 часов находится в Бишкеке. Значит, в воздухе он находится  22 – 14 = 8  часов, что составляет два полёта. ",
        "Ответ: 4 часа. "
    ],
    "64785": [
        "https://www.problems.ru/view_problem_details_new.php?id=64785",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Тетрадь, ручка и карандаш стоят 120 рублей. А 5 тетрадей, 2 ручки и 3 карандаша стоят 350 рублей. Что дороже: две тетради или одна ручка? \n",
        "Решение: 3 тетради, 3 ручки и 3 карандаша стоят 360 рублей – дороже чем 5 тетрадей, 2 ручки и 3 карандаша. Следовательно, одна ручка дороже чем две тетради.\n",
        "Ответ: Ручка стоит дороже.\n"
    ],
    "87974": [
        "https://www.problems.ru/view_problem_details_new.php?id=87974",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: В токарном цехе вытачиваются детали из стальных заготовок, из одной заготовки – деталь. Стружки, оставшиеся после обработки трёх заготовок, можно переплавить и получить ровно одну заготовку. Сколько всего деталей можно сделать из девяти заготовок? А из четырнадцати? Сколько нужно взять заготовок, чтобы получить 40 деталей?",
        "Решение:    Из девяти заготовок можно на первом этапе получить девять деталей, а из оставшихся стружек сделать три заготовки, из них (на втором этапе) –\r\nтри детали, а из оставшихся стружек сделать одну заготовку и затем одну деталь. Итого 13 деталей. \n   С 14 заготовками проще поступить так. Отложим временно две заготовки и сначала получим 12 деталей и стружки на четыре заготовки. Добавив к этим четырём заготовкам две отложенные, получим ещё шесть деталей и стружки на две заготовки. Наконец сделаем ещё две детали. Итого 20 деталей.\n   Если 20 деталей мы получили из 14 заготовок, то 40 деталей мы заведомо можем получить из 28 заготовок. \r\n   Попробуем уменьшить это число. Возьмём 27 заготовок. Сначала мы получим 27 деталей и стружки на девять заготовок. Из этих девяти заготовок, как мы видели выше, можно получить 13 деталей. Итого, 40 деталей.\r\n  26 заготовок, как нетрудно проверить, недостаточно. ",
        "Ответ: \n       13 деталей; 20 деталей; 27 заготовок.\n      ",
        "Замечания:  Всякий раз, когда мы из трёх заготовок вытачиваем три детали, а из стружек выплавляем одну новую заготовку, у нас число заготовок уменьшается на 2, а число деталей увеличивается на 3, то есть две заготовки как бы превращаются в три детали. Такое превращение возможно до тех пор, пока не останется только одна или две заготовки. Значит, если заготовок чётное число, то мы все их, кроме двух последних, постепенно превратим в детали. А из последних двух выточим ещё две детали. Итак, из  2n + 2  заготовок выйдет  3n + 2  детали. Если же число заготовок нечётно  (2n + 1),  то аналогично получим из них  3n + 1  деталь. Отсюда, между прочим, следует, что, сколько бы мы ни взяли заготовок, максимальное число полученных из них деталей не может быть кратно 3.\n"
    ],
    "103954": [
        "https://www.problems.ru/view_problem_details_new.php?id=103954",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Несколько гномов, навьючив свою поклажу на пони, отправились в дальний путь. Их заметили тролли, которые насчитали в караване 36 ног и 15 голов. Сколько было гномов, и сколько пони? \n",
        "Решение: Всего в караване было 15 существ. Если бы все они были гномами, то у них было бы  15·2 = 30  ног; но на самом деле ног на 6 больше, а значит, в караване были  6 : (4 – 2) = 3  пони и  15 – 3 = 12  гномов. \n",
        "Ответ: 12 гномов и 3 пони. \n"
    ],
    "108729": [
        "https://www.problems.ru/view_problem_details_new.php?id=108729",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: На прямой через равные промежутки поставили десять точек, и они заняли отрезок\r\nдлины a. На другой прямой через такие же промежутки поставили 100 точек, и они заняли отрезок длины b. Во сколько раз b больше a? \n",
        "Решение: На отрезке длины a укладывается 9 промежутков, а на отрезке длины b – 99. Следовательно,  b = 11a. \n",
        "Ответ: В 11 раз. \n"
    ],
    "109473": [
        "https://www.problems.ru/view_problem_details_new.php?id=109473",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Дима пишет подряд натуральные числа: 123456789101112... .\r\nНа каких местах, считая от начала, в первый раз будут стоять три цифры 5 подряд? \n",
        "Решение:    До того, как было записано число 50, цифра 5 встречалась только в разряде единиц, поэтому даже двух пятёрок подряд быть не могло. \r\n   Три цифры 5 подряд в первый раз встретятся в сочетании ...54-55-56... . От 1 до 9 в ряду стоят 9 цифр, а от 10 до 54 – 45 двузначных чисел, то есть всего до первой нужной цифры 5 стоят 99 цифр. Таким образом, три цифры 5 стоят на 100-м, 101-м и 102-м местах. ",
        "Ответ: На 100-м, 101-м и 102-м местах. \n",
        "Замечания:  6 баллов \n"
    ],
    "115385": [
        "https://www.problems.ru/view_problem_details_new.php?id=115385",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: У Вани было некоторое количество печенья; он сколько-то съел, а потом к нему в гости пришла Таня, и оставшееся печенье они разделили поровну. Оказалось, что Ваня съел в пять раз больше печений, чем Таня. Какую долю от всего печенья Ваня съел к моменту Таниного прихода? \n",
        "Решение: До прихода Тани Ваня съел в четыре раза больше печений, чем Таня, то есть в два раза больше, чем оба съели после прихода Тани. \n",
        "Ответ: &frac23;. \n"
    ],
    "35485": [
        "https://www.problems.ru/view_problem_details_new.php?id=35485",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Известно, что 9 стаканов чая стоят дешевле 10 рублей, а 10  \n стаканов чая - дороже 11 рублей.  \n Сколько стоит стакан чая?  \n   \n \n\n\n\t\t\t",
        "Подсказка: Запишите условие в виде неравенств и используйте то, что  \n стоимость стакана чая выражается целым числом копеек.\n\t\t\t",
        "Решение: Пусть стоимость стакана чая, выраженная в копейках, равна x.  \n Тогда по условию 9x<1000 и 10х>1100.  \n Следовательно, 9х не превосходит  \n 999, и х не превосходит 111.  \n х=111 подходит - в этом случае 10х=1110>1100.  \n Если же х<111, то х не превосходит 110, и в этом случае  \n 10х не превосходит 1100.  \n Таким образом, имеется единственная возможность: х=111.  \n \n\t\t\t"
    ],
    "107722": [
        "https://www.problems.ru/view_problem_details_new.php?id=107722",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: \nНа протяжении некоторого года (от 1 января до 31 декабря включительно) количество вторников было равно количеству четвергов. Следует ли из этого, что и количество сред было такое же? Рассмотрите два случая:\nа) в году было 365 дней,\nб} в году было 366 дней.\n",
        "Решение: \nа) В году 365 дней, то есть 52 полные недели плюс один день. Если год начинается со среды (например, 2003-й год), то сред будет на одну больше, чем вторников и четвергов.\nб) 366 дней  —  это 52 недели и ещё 2 дня. Они не могут быть вторником и четвергом, так как эти дни идут не подряд. Не один из этих дней не среда, потому что иначе другой день был бы вторником или четвергом, и при этом нарушается условие равенства вторников и четвергов. Значит, сред в году не больше и не меньше.\n",
        "Ответ: \nа) Не следует. б) Следует.\n"
    ],
    "102959": [
        "https://www.problems.ru/view_problem_details_new.php?id=102959",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 3-",
        "Классы: 5,6,7,8",
        "Условие: Имеются двое песочных часов — на 7 минут и на 11 минут. Яйцо варится 15 минут. Как отмерить это время при помощи имеющихся часов?",
        "Подсказка: Заметьте, с помощью двух разных песочных часов можно отмерить не только время, равное их «сумме», но и время, равное их «разности».",
        "Решение: «Включим» одновременно двое часов. Когда 7-минутные часы пересыпятся, перевернем их и дадим сыпаться 4 минуты, до окончания пересыпания 11-минутных часов. Если теперь перевернуть 7-минутные часы, они будут сыпаться ровно 4 минуты, а всего часы «сыпались» 15 минут, что и требовалось."
    ],
    "35109": [
        "https://www.problems.ru/view_problem_details_new.php?id=35109",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 3-",
        "Классы: 6,7,8",
        "Условие: Из десятизначного числа 2946835107 вычеркнули 5 цифр. \n Какое наибольшее число могло в результате этого получиться?\n\n\n\t\t\t",
        "Подсказка: Выгоднее, чтобы в начале числа оставались большие цифры.\n\t\t\t",
        "Решение: В результате вычеркивания остается некоторое пятизначное число. \n Если в числе 2946835107 не вычеркивать первую цифру, то полученное \n пятизначное число будет начинаться с двойки и, следовательно, \n будет меньше, чем 98517. \n Таким образом, первую цифру надо вычеркивать. \n Цифру 9 нужно оставлять, иначе в пятизначном числе \n первая цифра будет меньше, чем 9. \n Подобным образом продолжаем анализ: чтобы вторая цифра \n пятизначного числа была максимально возможной, \n нужно вычеркнуть цифры 4 и 6, а цифру 8 - оставить. \n Далее, нужно вычеркнуть цифру 3 (если ее оставить, пятизначное \n число будет иметь вид 983.., т.е. будет меньше, чем 98517). \n Остается вычеркнуть еще одну цифру, и легкая проверка показывает, \n что выгоднее всего вычеркнуть ноль.\n\t\t\t",
        "Ответ: 98517.00"
    ],
    "111237": [
        "https://www.problems.ru/view_problem_details_new.php?id=111237",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 3-",
        "Классы: 6,7,8",
        "Условие: В понедельник в полдень (12:00) часы показывали верное время, а уже через 4 часа они отставали на 1 час. \r\nВ какой день и час эти часы впервые покажут время, на час большее, чем на самом деле? \n",
        "Решение: Впервые часы покажут на час больше, когда они отстанут на 23 часа. Так как за каждые 4 часа они отстают на 1 час, то это произойдёт через \r\n23·4 = 92  часа. Поскольку  92 = 24·3 + 20,  то пройдёт трое суток и еще 20 часов. \r\n",
        "Ответ: В ближайшую пятницу в 8:00. \n"
    ],
    "35020": [
        "https://www.problems.ru/view_problem_details_new.php?id=35020",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: 10 человек собрали вместе 46 грибов, причём известно, что нет двух человек, собравших одинаковое число грибов.\r\nСколько грибов собрал каждый?\n",
        "Решение: Упорядочим людей по возрастанию количества собранных грибов:  a0 < a1 < a2 < ... < a9.  Ясно, что  a0 ≥ 0,  a1 ≥ 1,  ...,  a9 ≥ 9.  Оставим у каждого число грибов, равное его номеру, отложив лишние в сторону. Тогда у грибников останется  0 + 1 + ... + 9 = 45  грибов. Значит, в сторону был отложен ровно один гриб. Он мог быть взят только у грибника №9 (иначе у каких-то двух грибов было бы поровну).",
        "Ответ: 0, 1, 2, 3, 4, 5, 6, 7, 8, 10 грибов.\n"
    ],
    "65415": [
        "https://www.problems.ru/view_problem_details_new.php?id=65415",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Автор: Френкин Б.Р.\nСреди чисел  a + b,  a – b,  ab, a/b  два положительных и два отрицательных. Является ли число b положительным или отрицательным?",
        "Решение: Числа ab и a/b одного знака. Следовательно,  a + b  и  a – b  имеют другой знак. Поскольку a находится между ними, то a тоже имеет этот знак. Таким образом, ab и a/b отличаются знаком от a. Это означает, что b отрицательно.",
        "Ответ: Отрицательным. "
    ],
    "78104": [
        "https://www.problems.ru/view_problem_details_new.php?id=78104",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Школьник едет на олимпиаду на метро, платит рубль и получает сдачу. Доказать,\r\nчто если он обратно поедет на трамвае, то он сможет уплатить за проезд\r\nбез сдачи. (Проезд в метро стоил 50 коп., в трамвае – 30 коп. В обращении находились монеты достоинством в 1, 2, 3, 5, 10, 15 и 20 коп.) ",
        "Решение: "
    ],
    "115450": [
        "https://www.problems.ru/view_problem_details_new.php?id=115450",
        "Арифметика. Устный счет и т.п.",
        "Сложность: 3",
        "Классы: 7,8,9,10",
        "Условие: Из ряда натуральных чисел вычеркнули все числа, которые являются квадратами или кубами целых чисел. \r\nКакое из оставшихся чисел стоит на сотом месте? \r\n",
        "Решение: Рассмотрим первую сотню натуральных чисел. Среди этих чисел десять квадратов (от 1 до  10² = 100)  и четыре куба (от 1 до  4³ = 64).  Учтем, что два из этих чисел, а именно, 1 и 64 являются одновременно квадратами и кубами. Таким образом, из первой сотни вычеркнули 12 чисел. Среди следующих двенадцати чисел нет ни квадратов, ни кубов  (11² = 121,  5³ = 125),  следовательно, среди оставшихся чисел на сотом месте стоит число 112. \r\n",
        "Ответ: 112. "
    ],
    "88136": [
        "https://www.problems.ru/view_problem_details_new.php?id=88136",
        "Задачи с неравенствами. Разбор случаев",
        "Сложность: 2",
        "Классы: 5,6,7,8",
        "Условие: Одним пакетиком чая можно заварить два или три стакана чая. Мила и Таня разделили коробку чайных пакетиков поровну. Мила заварила 57 стаканов чая, а Таня – 83 стакана. Сколько пакетиков могло быть в коробке?\n",
        "Подсказка: Обратите внимание: для того, чтобы заварить 57 стаканов, необходимо иметь не меньше чем  57 : 3  и не больше чем  57 : 2  пакетиков.\n",
        "Решение: Мила заварила 57 стаканов, значит, у неё было не больше чем  57 : 2 = 28,5  пакетиков. Таня заварила 83 стакана, поэтому у неё было не меньше чем \r\n83 : 3 = 27&frac23;  пакетика. Поскольку пакетиков было одинаковое количество (причём целое), единственная возможность – у каждой девочки было по 28 пакетиков.\n",
        "Ответ: 56 пакетиков. \n"
    ],
    "86510": [
        "https://www.problems.ru/view_problem_details_new.php?id=86510",
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: \nДано число: 123456789101112... . Какая цифра стоит на 2000-м\nместе?\n\n      ",
        "Решение: Найдем, с какого момента в десятичную запись данного числа начнут входить трехзначные числа: \r\n2000 - 9 . 1 - 90 . 2 = 1811. \r\n1811 : 3 = 603 (остаток 2), то есть на 2000-м месте стоит вторая цифра 604-го по счету трехзначного числа. Это число — 703, поэтому искомая цифра — 0.    ",
        "Ответ: Искомая цифра — 0. "
    ],
    "104877": [
        "https://www.problems.ru/view_problem_details_new.php?id=104877",
        "Делимость чисел. Общие свойства",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: 109 яблок разложены по пакетам. В некоторых пакетах лежит по x яблок, в других – по три яблока. \r\nНайдите все возможные значения x, если всего пакетов – 20. \n",
        "Решение: Если бы в каждом пакете было по 3 яблока, то всего яблок было бы 60. Но яблок на 49 больше, значит, \"лишние\" яблоки надо распределить поровну по некоторым пакетам. Так как  49 = 7·7 = 49·1  и всего пакетов – 20, то либо в 7 пакетах содержится по 7 \"лишних\" яблок, либо в одном – 49 \"лишних\". В первом случае  x = 10,  во втором –  x = 52.\n",
        "Ответ: \n  10 или 52.\n"
    ],
    "115471": [
        "https://www.problems.ru/view_problem_details_new.php?id=115471",
        "Задачи на проценты и отношения",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Карлсону подарили пакет с конфетами: шоколадными и карамельками. За первые 10 минут Карлсон съел 20% всех конфет, причем 25% из них составляли карамельки. После этого Карлсон съел еще три шоколадные конфеты, и доля карамелек среди съеденных Карлсоном конфет понизилась до 20%. Сколько конфет было в подаренном Карлсону пакете? \n",
        "Решение: В первой порции съеденных конфет шоколадных было в 3 раза больше, чем карамелек, а потом их стало в 4 раза больше. Значит, число дополнительно съеденных шоколадных конфет равно числу карамелек. Таким образом, в начале Карлсон съел 3 карамельки и 9 шоколадных конфет, и эти 12 конфет составляют 20% всех конфет. Следовательно, всего в пакете было 60 конфет. \n",
        "Ответ:  60  конфет."
    ],
    "88288": [
        "https://www.problems.ru/view_problem_details_new.php?id=88288",
        "Десятичная система счисления",
        "Сложность: 3-",
        "Классы: 7,8",
        "Условие: Кащей Бессмертный загадывает три двузначных числа: a, b, c. Иван Царевич должен назвать ему три числа: X, Y, Z, после чего Кащей сообщает ему сумму   aX + bY + cZ. Царевич должен отгадать задуманные числа, иначе ему отрубят голову. Какие числа он должен загадать, чтобы остаться в живых?",
        "Решение: Иван Царевич может назвать числа X = 1, Y = 100, Z = 10000, тогда Кащей сообщит Ивану Царевичу шестизначное число, две первые цифры которого есть число c, следующие две цифры число b и последние две цифры число a."
    ],
    "116411": [
        "https://www.problems.ru/view_problem_details_new.php?id=116411",
        "Арифметика остатков (прочее)",
        "Сложность: 3-",
        "Классы: 9,10,11",
        "Условие: Авторы: Мурашкин М.В., Шаповалов А.В.\nИз Южной Америки в Россию 2010 кораблей везут бананы, лимоны и ананасы. Число бананов на каждом корабле равно числу лимонов на остальных кораблях вместе взятых, а число лимонов на каждом корабле равно числу ананасов на остальных кораблях вместе взятых. Докажите, что общее число фруктов делится на 31. ",
        "Решение: Общее число бананов в 2009 раз больше числа лимонов, которое в 2009 раз больше числа ананасов, следовательно, общее число фруктов в \r\n2009² + 2009 + 1  раз больше числа ананасов.  2009² + 2009 + 1 ≡ (–6)² – 6 + 1 ≡ 0 (mod 31).",
        "Замечания:  1. 3 балла \n2. Ср. с задачей 116406.\n"
    ],
    "60415": [
        "https://www.problems.ru/view_problem_details_new.php?id=60415",
        "Комбинаторная геометрия (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: 120 одинаковых шаров плотно уложены в виде правильной треугольной пирамиды. Сколько шаров лежит в основании? ",
        "Решение: В верхнем слое – 1 шар, во втором – на два больше, то есть 3, в третьем – на 3 больше (6), и т. д.\r\nБудем складывать полученные числа, пока не получим 120:   1 + 3 + 6 + 10 + 15 + 21 + 28 + 36 = 120.",
        "Ответ: 36 шаров. "
    ],
    "88297": [
        "https://www.problems.ru/view_problem_details_new.php?id=88297",
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Кащей Бессмертный загадывает три натуральных числа: a, b, c. Иван Царевич должен назвать ему три числа: X, Y, Z, после чего Кащей сообщает ему сумму aX + bY + cZ, затем  Иван Царевич говорит еще один набор чисел x, y, z  и Кащей сообщает ему сумму  ax + by + cz. Царевич должен отгадать задуманные числа, иначе ему отрубят голову. Какие числа  он должен загадать, чтобы остаться в живых?",
        "Решение: Первые числа Иван Царевич может задать X = Y = Z = 1, тогда он узнает сумму a + b + c и будет знать число цифр этой сумму, например k цифр, тогда каждое из чисел a, b, c  имеет не более k цифр. Второй раз Иван Царевич называет числа x = 1, y = 10k, z = 102k, тогда последние k мест занимает число x, перед ним  k мест занимает число b, а остальные цифры относятся к c."
    ],
    "86483": [
        "https://www.problems.ru/view_problem_details_new.php?id=86483",
        "Задачи на работу",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: На дне озера бьют ключи. Стадо из 183 слонов могло бы выпить озеро за 1 день, а стадо из 37 слонов – за 5 дней. \r\nЗа сколько дней выпьет озеро один слон? ",
        "Решение: 37 слонов за пять дней выпивают столько же, сколько  37·5 = 185  слонов за один день. Разница в два слона объясняется тем, что за четыре лишних дня из ключей \"натекает\" столько воды, сколько два слона выпивают за день. Таким образом, ключи восполняют за день половину дневной порции слона. А в озере (без ключей) 182,5 дневных порций слона. Один слон половину дня пьет воду \"из озера\", а половину – \"из ключей\". Поэтому ему понадобится  182,5·2 = 365  дней. \n",
        "Ответ: За 365 дней. ",
        "Замечания:  Выпитое полностью озеро заполнится вновь за два года. \n"
    ]
}