{
    "88170": [
        "Куб",
        "Сложность: 2",
        "Классы: 5,6,7,8",
        "Условие: Переложите пирамиду из10кубиков (см.рисунок) так, чтобы её форма осталась прежней, нокаждый кубик соприкасался только сновыми кубиками.",
        "Подсказка: Подумайте, какие кубики можно поставить вцентр пирамиды, какие— ввершины.",
        "Решение: Заметим следующее: кубик, стоящий вцентре, соприкасается сшестью кубиками; кубики, стоящие ввершинах,— сдвумя; акубики, стоящие насторонах треугольника,— счетырьмя. Отсюда сразу можно заключить, что при новой перекладке кубик изцентра может попасть только ввершину, авцентр, наоборот,— только извершины.  Для определённости, пусть вцентр попадёт кубик1, акубик5— вверхнюю вершину. Тогда наместо кубиков2 и3 могут лечь только кубики7 и10, поскольку остальные кубики уже соприкасались скубиком5 (рис.1). Внижние вершины должны лечь кубики2 и3. Расположение остальных кубиков определим перебором. Окончательный вариант показан нарис.2.",
        "Ответ: См.рисунок справа."
    ],
    "66004": [
        "Куб",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Дан куб АBCDA'B'C'D' c ребром 1. На его рёбрах АВ, ВС, C'D' и D'A' отмечены точки K, L, M и N соответственно так, что KLMN – квадрат.   Найдите его площадь.",
        "Решение: Проекция квадрата на плоскость грани ABCD является параллелограммом, а по теореме о трёх перпендикулярах – это даже прямоугольник KLM'N' (рис. слева).",
        "Ответ: 1,125."
    ],
    "86926": [
        "Параллелепипеды",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Может ли в сечении параллелепипеда плоскостью получиться правильный пятиугольник?",
        "Решение: Поскольку у параллелепипеда 6 граней, указанная плоскость должна пересечь пару противоположных, а значит, параллельных граней. По теореме о пересечении двух параллельных плоскостей третьей прямые пересечения в этом случае будут параллельны, а   у правильного пятиугольника нет параллельных сторон.",
        "Ответ: Нет."
    ],
    "104023": [
        "Куб",
        "Сложность: 4",
        "Классы: 7,8,9,10",
        "Условие: На столе лежит кубик, на его верхней стороне нарисована картинка. Кубик несколько раз перекатывали по столу через  ребро, после чего он вновь оказался на прежнем месте. Могло ли оказаться, что картинка повернута а)на 180 градусов по сравнению с исходным положением; б) на 90 градусов?",
        "Решение: а) Могло. Для этого надо прокатить кубик так, как показано на рисунке."
    ],
    "109295": [
        "Куб",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Через центр единичного куба проведена плоскость, не проходящая через ребро куба и делящая куб на два многогранника. Докажите, что в  каждом из получившихся многогранников найдётся диагональ, длина  которой не меньше",
        "Решение: Пусть"
    ],
    "110246": [
        "Параллелепипеды (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Точки",
        "Ответ: 4:11, 10:19."
    ],
    "110247": [
        "Параллелепипеды (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Точки",
        "Ответ: 1:5, 4:7."
    ],
    "110248": [
        "Параллелепипеды (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Точка",
        "Ответ: 2:1, 1:1."
    ],
    "110249": [
        "Параллелепипеды (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Точка",
        "Ответ: 1:2, 2:3."
    ],
    "110250": [
        "Параллелепипеды (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Точка",
        "Решение: Через прямую",
        "Ответ: 1:11."
    ],
    "110251": [
        "Параллелепипеды (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Точка",
        "Ответ: 1:11."
    ],
    "110252": [
        "Параллелепипеды (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Точка",
        "Ответ: 1:8."
    ],
    "87047": [
        "Прямоугольные параллелепипеды",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Даны три попарно перпендикулярные прямые. Четвёртая прямая образует с данными углы"
    ],
    "116318": [
        "Прямоугольные параллелепипеды",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Точка",
        "Решение: Обозначим",
        "Ответ: 3."
    ],
    "116319": [
        "Прямоугольные параллелепипеды",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Точка",
        "Решение: Обозначим",
        "Ответ: 4."
    ],
    "116320": [
        "Прямоугольные параллелепипеды",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Точка",
        "Ответ: 6."
    ],
    "116321": [
        "Прямоугольные параллелепипеды",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Точка",
        "Ответ: 6."
    ],
    "97980": [
        "Раскраски",
        "Сложность: 2+",
        "Классы: 7,8,9,10",
        "Условие: Каждую грань кубика разбили на четыре равных квадрата и раскрасили эти  квадраты в три цвета так, чтобы квадраты, имеющие общую сторону, были покрашены  в разные цвета. Докажите, что в каждый цвет покрашено по 8 квадратиков.",
        "Решение: Три квадрата, сходящиеся в вершине куба, окрашены разными красками.  Следовательно, каждый цвет использован 8 раз."
    ],
    "104021": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: а) В каждой вершине куба написано число 1 или число 0. На каждой грани куба написана сумма четырёх чисел, написанных в вершинах этой грани. Может ли оказаться, что все числа, написанные на гранях, различны?   б) Тот же вопрос, если в вершинах написаны числа 1 или –1.",
        "Решение: а) На каждой грани написано одно из пяти чисел: 0, 1, 2, 3 или 4. Но граней всего шесть, и значит, на некоторых двух гранях будут написаны совпадающие числа."
    ],
    "104116": [
        "Наглядная геометрия в пространстве",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Представьте, что куб стоит на столе на одной своей вершине (так, что верхняя вершина расположена точно над нижней) и освещён прямо сверху. Какая в этом случае получается тень от куба?",
        "Ответ: Правильный шестиугольник."
    ],
    "35357": [
        "Комбинаторная геометрия (прочее)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Какое максимальное количество        фигурок 2*2*1  можно уложить в куб 3*3*3?",
        "Подсказка: Постарайтесь укладывать фигурки. оставляя пустой     центральную клетку.",
        "Решение: Ответ: 6 фигурок.",
        "Ответ: Объем одной фигурки 2*2*1 равен 4, а объем куба 3*3*3 - 27. Отсюда  следует, что  7 фигурок уложить нельзя, так как 7*4>27."
    ],
    "32036": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Петя написал на гранях кубика натуральные числа от 1 до  6. Вася кубика не видел, но утверждает, что",
        "Решение: В наборе натуральных чисел от 1 до 6 можно найти пять \t\t\t\tпар соседних чисел: 1 и 2, 2 и 3, 3 и 4, 4 и 5, 5 и 6. Каждая \t\t\t\tтакая пара может быть написана либо на двух соседних гранях \t\t\t\tкубика, либо на двух противоположных. Но пар противоположных \t\t\t\tграней у кубика всего три. Поэтому их могут занимать не более \t\t\t\tтрех пар соседних чисел. Значит, по крайней мере две такие пары \t\t\t\tзанимают соседние грани. Следовательно, можно утверждать, что \t\t\t\tВася прав в обоих случаях."
    ],
    "107623": [
        "Правильные многогранники. Двойственность и взаимосвязи",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Существует ли выпуклый многогранник, имеющий 12 рёбер, которые соответственно равны и параллельны 12 диагоналям граней куба?",
        "Решение: Пример. Построим куб, у которого рёбра в два раза больше, чем у исходного, и отметим середины его граней. Ясно, что можно построить октаэдр с вершинами в отмеченных точках, причём все его рёбра будут равны половинкам диагоналей граней построенного куба. Таким образом, этот октаэдр и является искомым.",
        "Ответ: Существует."
    ],
    "34996": [
        "Площадь и ортогональная проекция",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Докажите, что площадь проекции куба с ребром 1 на любую плоскость численно равна длине его проекции на прямую, перпендикулярную этой плоскости.",
        "Подсказка: Площадь проекции грани единичного куба на плоскость равна длине проекции перпендикулярного этой грани ребра на прямую, перпендикулярную плоскости.",
        "Решение: Будем считать, что плоскость из условия горизонтальна. Обозначим через O самую нижнюю вершину куба, а через A, B, C – соседние с ней вершины. Проекция куба на ось Oz – это проекция на эту ось его большой диагонали, то есть вектора  Она равна cos α + cos β + cos γ, где α, β, γ – углы, которые стороны OA, OB, OC составляют с осью Oz.     Площадь же проекции куба на плоскость xOy равна сумме проекций трёх его нижних граней. Площадь каждой грани, равная 1, при проектировании умножается на соответствующий косинус (угол между плоскостями AOB и xOy равен γ и т. п.)."
    ],
    "35591": [
        "Шахматная раскраска",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Кусок сыра имеет форму кубика 3×3×3, из которого вырезан центральный кубик. Мышь начинает грызть этот кусок сыра. Сначала она съедает некоторый кубик 1×1×1.  После того, как мышь съедает очередной кубик 1×1×1, она приступает к съедению одного из соседних (по грани) кубиков с только что съеденным. Сможет ли мышь съесть весь кусок сыра?",
        "Подсказка: Раскрасьте кубики 1*1 в шахматном порядке. После черного кубика     мышь может съесть только белый кубик, и наоборот.",
        "Решение: Покрасим кубики 1*1 в шахматном порядке.     Заметим, что кубиков одного цвета будет на два больше, чем кубиков     другого цвета (одного цвета - 12, другого - 14).     Но после черного кубика     мышь может съесть только белый кубик, и наоборот, т.е. цвета     поедаемых кубиков строго чередуются. Таким образом, в каждый     момент времени число съеденных белых кубиков отличается от числа     съеденных черных кубиков не больше, чем на 1.     Отсюда следует невозможность съедения всего куска сыра.",
        "Ответ: нет."
    ],
    "77991": [
        "Разные задачи на разрезания",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Разрезать куб на три равные пирамиды.",
        "Решение: В качестве вершины пирамид можно взять одну из вершин куба, а в качестве их оснований — три грани куба, не содержащие эту вершину."
    ],
    "78151": [
        "Примеры и контрпримеры. Конструкции",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Каждая грань куба заклеивается двумя равными прямоугольными треугольниками с общей гипотенузой, один из которых белый, другой — чёрный. Можно ли эти треугольники расположить так, чтобы при каждой вершине куба сумма белых углов была равна сумме чёрных углов?",
        "Решение: Можно."
    ],
    "86941": [
        "Свойства сечений",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Через середины",
        "Решение: Продолжим среднюю линию",
        "Ответ: 3:7, считая от вершины"
    ],
    "86975": [
        "Расстояние между скрещивающимися прямыми",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Дан куб",
        "Решение: Поскольку прямая",
        "Ответ: Ю)"
    ],
    "87102": [
        "Длины и периметры (геометрические неравенства)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Дан куб с ребром 1. Докажите, что сумма расстояний от произвольной точки до его вершин не меньше",
        "Решение: Пусть"
    ],
    "87103": [
        "Длины и периметры (геометрические неравенства)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Пусть",
        "Решение: Из очевидных неравенств"
    ],
    "87118": [
        "Площадь и объем (задачи на экстремум)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Рассматриваются всевозможные прямоугольные параллелепипеды, основания которых являются квадратами, а каждая из боковых граней имеет периметр 6. Найдите среди них параллелепипед с наибольшим объёмом и вычислите этот объём.",
        "Решение: Обозначим через",
        "Ответ: 4.00"
    ],
    "87218": [
        "Задачи на максимум и минимум (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Рассматриваются всевозможные прямоугольные параллелепипеды, объём каждого из которых равен 4, а основания являются квадратами. Найдите среди них параллелепипед с наименьшим периметром боковой грани и вычислите этот периметр.",
        "Решение: Обозначим через",
        "Ответ: Параллелепипед, сторона основания которого равна 2, боковое ребро равно 1; искомый периметр равен 6."
    ],
    "87219": [
        "Площадь и объем (задачи на экстремум)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Рассматриваются всевозможные прямоугольные параллелепипеды, у которых одна из боковых граней является квадратом, а периметр нижнего основания равен 12. Найдите среди них параллелепипед с наибольшим объёмом и вычислите этот объём.",
        "Ответ: Параллелепипед, стороны основания которого равны 4 и 2, объём – 32."
    ],
    "87220": [
        "Площадь и объем (задачи на экстремум)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Рассматриваются всевозможные прямоугольные параллелепипеды, объём каждого из которых равен",
        "Ответ: Параллелепипед, стороны основания  которого  равны 1 и"
    ],
    "87244": [
        "Перпендикулярные прямые в пространстве",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Верно ли, что в пространстве углы с соответственно перпендикулярными сторонами равны или составляют в сумме",
        "Решение: Рассмотрим куб",
        "Ответ: Нет."
    ],
    "87590": [
        "Перпендикулярные плоскости",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Обязательно ли будут параллельными две плоскости, перпендикулярные одной и той же плоскости?",
        "Решение: Рассмотрим куб",
        "Ответ: Нет."
    ],
    "87612": [
        "Ортогональная проекция (прочее)",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Нарисуйте изображение куба, полученное в результате ортогонального проектирования куба на плоскость, перпендикулярную: а) одному из рёбер; б) диагонали одной из граней.",
        "Ответ: а) Квадрат.  б) Прямоугольник, две стороны которого равны и параллельны ребру куба, а две другие – диагонали грани куба."
    ],
    "109344": [
        "Параллельное проектирование",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: В параллелепипеде",
        "Решение: При параллельном проектировании параллелепипеда",
        "Ответ: 2:3, считая от точки"
    ],
    "109346": [
        "Проектирование помогает решить задачу",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: В параллелепипеде",
        "Решение: При параллельном проектировании параллелепипеда",
        "Ответ: 1:3."
    ],
    "77939": [
        "Частные случаи параллелепипедов (прочее)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Если все 6 граней параллелепипеда — равные между собой параллелограммы, то они суть ромбы. Докажите.",
        "Решение: Пусть из вершины параллелепипеда выходят рёбра длиной"
    ],
    "110320": [
        "Объем тела равен сумме объемов его частей",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Каркас куба изготовлен из деревянных брусьев, сечением которых  является квадрат со стороной 1. Ребро куба равно 8. Найдите объём  каркаса.",
        "Ответ: 80.00"
    ],
    "111137": [
        "Параллельное проектирование",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Пусть проекция вершины",
        "Решение: Пусть"
    ],
    "34917": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: На какое наименьшее число тетраэдров можно разбить куб?",
        "Подсказка: Оценивайте объемы тетраэдров.",
        "Решение: Пример. Куб ABCDA'B'C'D' можно разбить на пять тетраэдров: AA'B'D', AB'BC, ACDD', B'C'D'C и ACB'D'.     Оценка. Пусть куб разбит на несколько тетраэдров. Основания хотя бы двух из них лежат на грани ABCD. Также имеются другие два тетраэдра с основаниями на грани A'B'C'D' (у одного тетраэдра нет двух параллельных граней). Если ребро куба равно 1, то суммарный объем первых (вторых) двух тетраэдров не больше &frac13;. Поскольку суммарный объем этих четырёх тетраэдров меньше 1, то в разбиении куба кроме них участвует ещё хотя бы один тетраэдр.",
        "Ответ: На 5 тетраэдров."
    ],
    "64555": [
        "Правильная пирамида",
        "Сложность: 3+",
        "Классы: ",
        "Условие: Дана правильная треугольная пирамида SABC, ребро основания которой равно 1. Из вершин A и B основания ABC проведены медианы боковых граней, не имеющие общих точек. Известно, что на прямых, содержащих эти медианы, лежат рёбра некоторого куба. Найдите длину бокового ребра пирамиды.",
        "Решение: Указанные медианы AD и BE боковых граней ASB и BSC лежат на скрещивающихся прямых, а скрещивающиеся рёбра куба взаимно перпендикулярны. Таким образом, требуется найти длину b бокового ребра пирамиды, у которой угол между скрещивающимися медианами боковых граней равен 90°.",
        "Ответ: ."
    ],
    "79276": [
        "Обходы многогранников",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: На кубе отмечены вершины и центры граней, а также проведены диагонали всех граней. Можно ли по отрезкам этих диагоналей обойти все отмеченные точки, побывав в каждой из них ровно по одному разу?",
        "Решение: Ответ:",
        "Ответ: Источники и прецеденты использования"
    ],
    "104101": [
        "Площадь и ортогональная проекция",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: В кубе АВСDА1В1С1D1 площадь ортогональной проекции грани АА1В1В на плоскость, перпендикулярную диагонали АС1, равна 1.   Найдите площадь ортогональной проекции куба на эту плоскость.",
        "Решение: Первый способ. Выберем плоскость проекции так, чтобы она проходила через центр куба. Сечением куба этой плоскостью является правильный шестиугольник MNKLPQ (рис. слева). Проекцией куба на эту плоскость является шестиугольник A'1B1B'C'D'D'1 (рис. в центре), вершины которого являются центрами правильных треугольников, построенных на сторонах шестиугольника MNKLPQ, поэтому полученный шестиугольник также является правильным, причём вершины A и C1 куба проектируются в его центр. Проекцией грани АА1В1В является параллелограмм A'A'1B'1B'. Его площадь в три раза меньше площади проекции куба.",
        "Ответ: 3."
    ],
    "107636": [
        "Формула включения-исключения",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Куб со стороной 10 разбит на 1000 кубиков с ребром 1. В каждом кубике записано число, при этом сумма чисел в каждом столбике из 10 кубиков (в любом из трёх направлений) равна 0. В одном из кубиков (обозначим его через A) записана единица. Через кубик A проходит три слоя, параллельных граням куба (толщина каждого слоя равна 1). Найдите сумму всех чисел в кубиках, не лежащих в этих слоях.",
        "Решение: Через заданный кубик A проходят один горизонтальный слой Г и два вертикальных слоя. Сумма всех чисел в 81 вертикальном столбике, не входящем в последние два слоя, равна 0. Из полученной суммы надо вычесть сумму S чисел, лежащих в кубиках, на пересечении этих столбиков с Г (таких кубиков 81). Эти кубики полностью покрываются девятью столбиками, лежащими в Г. Сумма всех чисел в этих столбиках (она равна 0) превышает S на сумму девяти чисел, лежащих в перпендикулярном им столбике, содержащем A. Последняя сумма очевидно равна – 1. Отсюда S = 1. Окончательно имеем: 0 – 1 = –1.",
        "Ответ: –1."
    ],
    "107702": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Поверхность кубика Рубика 3 x 3 x 3 состоит из 54 клеток. Какое наибольшее количество клеток можно отметить так, чтобы отмеченные клетки не имели общих вершин?",
        "Решение: На рис. 1 показано, как отметить 7 клеток на трёх смежных гранях куба. На трёх невидимых гранях нужно отметить семь клеток, симметричных этим.",
        "Ответ: 14 клеток."
    ],
    "35228": [
        "Арифметическая прогрессия",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Дано 16 кубов с длинами рёбер соответственно 1, 2, ..., 16. Разделите их на две группы так, чтобы в обеих группах были равны суммарные объёмы, суммы площадей боковых поверхностей, суммы длин рёбер и количество кубов.",
        "Подсказка: Любые 2n чисел, образующие арифметическую прогрессию, можно разделить на две группы так, чтобы в обеих группах были равны количества чисел, суммы чисел, суммы квадратов, ..., суммы (n–1)-х степеней.",
        "Решение: Разделим кубы на две группы следующим образом. В первую группу включим кубы со сторонами 1, 4, 6, 7, 10, 11, 13, 16, во вторую – оставшиеся кубы. Можно убедиться, что условие задачи выполнено."
    ],
    "77962": [
        "Цилиндр",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Поместить в полый куб с ребром",
        "Решение: Если основания цилиндра лежат на гранях куба, то направление оси цилиндра будет неизменным при всех его перемещениях внутри куба. Поместим теперь в куб два цилиндра так, чтобы их оси были параллельны двум перпендикулярным рёбрам куба. Радиусы цилиндров равны"
    ],
    "86983": [
        "Свойства сечений",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Ребро куба",
        "Решение: Пусть прямая",
        "Ответ: 156.00"
    ],
    "87018": [
        "Свойства сечений",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Точки",
        "Решение: Рассмотрим случай, когда ни одна из точек"
    ],
    "87097": [
        "Углы между прямыми и плоскостями",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Высота правильной треугольной призмы ABCA'B'C' равна h. Точка D расположена на ребре AB. Прямая C'D образует угол 30° с плоскостью AA'C и угол arcsin ¾ с плоскостью ABC. Найдите:     а) сторону основания призмы;     б) радиус шара с центром на отрезке C'D, касающегося плоскостей ABC и AA'C'C.",
        "Ответ: а) ;  б) ."
    ],
    "87098": [
        "Углы между прямыми и плоскостями",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Ребро куба",
        "Ответ: Ю)"
    ],
    "87374": [
        "Касательные к сферам",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Ребро куба",
        "Ответ: 1.00"
    ],
    "87613": [
        "Ортогональная проекция (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Нарисуйте изображение куба, полученное в результате ортогонального проектирования куба на плоскость, перпендикулярную диагонали куба.",
        "Решение: Рассмотрим ортогональную проекцию куба",
        "Ответ: Правильный шестиугольник со стороной"
    ],
    "109439": [
        "Задачи на максимум и минимум (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Основанием прямоугольного параллелепипеда АВСDA1B1C1D1 является квадрат АВСD.   Найдите наибольшую возможную величину угла между прямой BD1 и  плоскостью ВDС1.",
        "Решение: Рассмотрим сечение ВDС1 данного параллелепипеда (см. рис. слева). Пусть О – точка пересечения диагоналей квадрата АВСD. Так как треугольник DC1B – равнобедренный, то C1О – его высота. Пусть Р – точка пересечения диагоналей параллелепипеда, РQ – перпендикуляр к плоскости ВDС1. Ясно, что точка Р равноудалена от вершин треугольника DC1B, поэтому Q – центр описанной около него окружности. Так как этот треугольник – остроугольный и равнобедренный, точка Q лежит на отрезке C1О. Углом между прямой BD1 и плоскостью ВDС1 является острый угол α между (BD1) и её ортогональной проекцией на (ВDС1), то есть угол РВQ.",
        "Ответ: arcsin &frac13;."
    ],
    "110299": [
        "Кратчайший путь по поверхности",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: В прямоугольном параллелепипеде",
        "Решение: Предположим, что путь пересекает рёбра",
        "Ответ: 40.00"
    ],
    "111181": [
        "Задачи на максимум и минимум (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Основание прямоугольного параллелепипеда",
        "Решение: Докажем сначала, что сумма квадратов расстояний от произвольной точки  пространства до двух противоположных вершин прямоугольника равна сумме  квадратов расстояний от этой точки до двух других его вершин.  Действительно, пусть",
        "Ответ: 200.00"
    ],
    "111727": [
        "Свойства сечений",
        "Сложность: 4+",
        "Классы: 10,11",
        "Условие: а) Все вершины пирамиды лежат на гранях куба, но не на его ребрах, причем на каждой грани лежит хотя бы одна вершина. Какое наибольшее количество вершин может иметь пирамида?  б) Все вершины пирамиды лежат в плоскостях граней куба, но не на прямых, содержащих его ребра, причем в плоскости каждой грани лежит хотя бы одна вершина. Какое наибольшее количество вершин может иметь пирамида?",
        "Решение: а) Сечение куба плоскостью основания пирамиды пересекает все его  грани и, значит, является выпуклым шестиугольником. Вершины основания лежат на сторонах этого шестиугольника, но не в его вершинах. Нетрудно видеть, что, если на какой-то стороне лежит больше двух вершин основания, то соединить их  несамопересекающейся ломаной, лежащей внутри шестиугольника, невозможно. Поэтому основание имеет не более 12 вершин, а пирамида— не более 13. Существование  пирамиды с 13 вершинами очевидно.  б) В этом случае вершины основания могут лежат на прямых, содержащих стороны шестиугольника, и их количество может быть произвольно большим.",
        "Ответ: а)13. б) Произвольно большое."
    ],
    "108997": [
        "Максимальное/минимальное расстояние",
        "Сложность: 5",
        "Классы: 10,11",
        "Условие: На диагонали",
        "Решение: Отрезок",
        "Ответ: при"
    ],
    "77877": [
        "Максимальное/минимальное расстояние",
        "Сложность: 6+",
        "Классы: 10,11",
        "Условие: Поместить в куб окружность наибольшего возможного радиуса.",
        "Решение: Пусть"
    ],
    "35471": [
        "Наглядная геометрия в пространстве",
        "Сложность: 2+",
        "Классы: 7,8,9,10",
        "Условие: Кубик 3*3*3 нетрудно распилить на 27 кубиков шестью      распилами.     Можно ли уменьшить число распилов, если разрешается распиливать      несколько кусков сразу и перекладывать части?",
        "Подсказка: Нужно обпилить со всех сторон средний кубик.",
        "Решение: Рассмотрим центральный кубик 1*1*1 (единственный кубик, который не виден     снаружи).     Чтобы в конце получилось 27 кубиков,     нужно выпилить центральный кубик, т.е.      произвести по крайней мере по одному распилу     вдоль каждой из шести граней центрального кубика.     Ясно, одним распилом нельзя пилить вдоль двух граней.     Отсюда следует, что нужно сделать по крайней мере     шесть распилов.",
        "Ответ: нет."
    ],
    "30432": [
        "Обход графов",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: а) Дан кусок проволоки длиной 120 см.  Можно ли, не ломая проволоки, изготовить каркас куба с ребром 10 см? \t  б) Какое наименьшее число раз придется ломать проволоку, чтобы всё же изготовить требуемый каркас?",
        "Решение: а) Если бы это удалось, то проволока шла бы по рёбрам куба без наложения, то есть мы как бы нарисовали каркас куба, не отрывая карандаша от бумаги. Но это невозможно, так как у куба восемь нечётных вершин.",
        "Ответ: а) Нельзя; б) три раза."
    ],
    "31097": [
        "Обход графов",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: а) Из какого минимального числа кусков проволоки можно спаять каркас куба?    б) Какой максимальной длины кусок проволоки можно вырезать из этого каркаса? (Длина ребра куба равна 1 см.)",
        "Решение: а) См. задачу 30432 б).",
        "Ответ: а) Из четырёх кусков; б) 9 см."
    ],
    "32006": [
        "Подсчет двумя способами",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: а) Можно ли занумеровать рёбра куба натуральными числами от 1 до 12 так, чтобы для каждой вершины куба сумма номеров рёбер, которые в ней сходятся, была одинаковой?",
        "Решение: а) Предположим, что это возможно, и сумма номеров рёбер, сходящихся в каждой из восьми вершин, равна x. Сложив эти суммы для всех вершин, получим 8x. С другой стороны, эта сумма равна удвоенной сумме номеров всех рёбер, так как номер каждого ребра входит в неё дважды. Вычислим эту сумму: 2·(1 + 2 + ... + 12) = 156. Отсюда следует, что 8x = 156, то есть x – не целое. Противоречие.",
        "Ответ: а) Нельзя; б) можно."
    ],
    "109343": [
        "Ортогональная проекция (прочее)",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Две противоположные вершины единичного куба совпадают с  центрами оснований цилиндра, а остальные вершины расположены на  боковой поверхности цилиндра. Найдите высоту и радиус основания  цилиндра.",
        "Решение: Пусть противоположные вершины"
    ],
    "87354": [
        "Куб",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: В кубе",
        "Ответ: 2.00"
    ],
    "111131": [
        "Построения на проекционном чертеже",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Постройте изображение параллелепипеда",
        "Решение: Будем считать, что точки"
    ],
    "111132": [
        "Построения на проекционном чертеже",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Постройте изображение параллелепипеда",
        "Решение: Будем считать, что точки"
    ],
    "111133": [
        "Построения на проекционном чертеже",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Постройте изображение параллелепипеда",
        "Решение: Будем считать, что точки"
    ],
    "116524": [
        "Углы между прямыми и плоскостями",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: В прямоугольном параллелепипеде   ABCDA1B1C1D1 четыре числа   – длины рёбер и диагонали AC1 – образуют арифметическую прогрессию с   положительной разностью d, причём AA1 < AB < BC.   Две внешне касающиеся друг друга сферы одинакового неизвестного радиуса R расположены   так, что их центры лежат внутри параллелепипеда, причём первая сфера касается граней   ABB1A1, ADD1A1,   ABCD, а вторая – граней BCC1B1,   CDD1C1,   A1B1C1D1.   Найдите: а) длины рёбер параллелепипеда; б) угол между прямыми   CD1 и AC1; в) радиус R.",
        "Решение: P>а) Пусть",
        "Ответ: а) ,   ,   ;"
    ],
    "32039": [
        "Обходы многогранников",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: У куба отмечены вершины и центры граней, а также проведены диагонали всех граней.   Можно ли по отрезкам этих диагоналей обойти все отмеченные точки, побывав в каждой из них ровно один раз?",
        "Решение: Мы имеем отмеченные точки двух типов: вершины и центры граней. Отрезки диагоналей граней соединяют попарно точки разных типов. Поэтому, проходя по этим отрезкам, мы будем встречать отмеченные точки в порядке чередования их типов, т.е. если мы в некоторый момент встретим вершину, то в следующий момент встретим центр грани, и наоборот. Из этого следует, что в любой момент либо количества пройденных точек обоих типов равны, либо точек одного типа на одну больше, чем другого. Мы же имеем 8 вершин и 6 центров граней — точек одного типа на 2 больше, чем точек другого типа. Поэтому требуемый обход осуществить невозможно.",
        "Ответ: Нельзя."
    ],
    "104020": [
        "Куб",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: В музее Гугенхайм в Нью-Йорке есть скульптура, имеющая форму куба. Жук, севший на одну из вершин, хочет как можно быстрее осмотреть скульптуру, чтобы перейти к другим экспонатам (для этого достаточно попасть в противоположную вершину куба). Какой путь ему выбрать?",
        "Решение: Сделаем развертку куба. Две противоположные вершины куба попадут в   противоположные вершины прямоугольника 2 × 1, образованного  двумя соседними гранями куба. Кратчайший соединяющий их путь - это   диагональ прямоугольника, она пересекает общее ребро этих граней в его середине.  Таким образом, жуку следует двигаться по прямой к середине ребра, не выходящего  из его вершины, а затем по прямой к вершине, в которую нужно попасть."
    ],
    "35716": [
        "Параллельность прямых и плоскостей",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Можно ли через вершины куба провести 8 параллельных плоскостей так,   чтобы расстояния между соседними плоскостями были равны?",
        "Подсказка: Удобно использовать координаты или же пространственное   воображение.",
        "Решение: Введем прямоугольные координаты так, чтобы 8 вершин куба имели   координаты (0,0,0), (1,0,0), (0,1,0), (1,1,0), (0,0,1), (1,0,1), (0,1,1),   (1,1,1).   Эти вершины лежат соответственно на параллельных плоскостях,   которые задаются уравнениями x+2y+4z=0, x+2y+4z=1, x+2y+4z=2, ... ,   x+2y+4z=7. Нетрудно убедиться, что расстояния между соседними   плоскостями одно и то же.   Чтобы понять, как эти плоскости выглядят в пространстве,   обратитесь к картинке (здесь одноцветные сечения   центрально-симметричны, ребра вдоль оси y разделены пополам,   ребра вдоль оси z разделены на четыре равные части).",
        "Ответ: можно."
    ],
    "87408": [
        "Куб",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Найдите расстояние между серединами двух скрещивающихся рёбер куба, полная поверхность которого равна 36.",
        "Решение: Пусть",
        "Ответ: 3.00"
    ],
    "87420": [
        "Частные случаи параллелепипедов (прочее)",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Основанием прямого параллелепипеда служит параллелограмм, один из углов которого равен",
        "Решение: Пусть",
        "Ответ: 12.00"
    ],
    "87428": [
        "Прямоугольные параллелепипеды",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: В основании прямоугольного параллелепипеда лежит квадрат со стороной",
        "Решение: Пусть диагональ",
        "Ответ: 72.00"
    ],
    "87458": [
        "Параллелепипеды (прочее)",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Основанием наклонного параллелепипеда служит ромб, сторона которого равна 60. Плоскость диагонального сечения, проходящая через большую диагональ основания, перпендикулярна плоскости основания. Площадь этого сечения равна 7200. Найдите меньшую диагональ основания, если боковое ребро равно 80 и образует с плоскостью основания угол",
        "Решение: Пусть плоскость диагонального сечения",
        "Ответ: 60.00"
    ],
    "109079": [
        "Параллелепипеды (прочее)",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Докажите, что если сечение параллелепипеда плоскостью является многоугольником с числом сторон, большим трёх, то у  этого многоугольника есть параллельные стороны.",
        "Решение: У параллелепипеда 3 пары параллельных граней. Если плоскость пересекает более трёх граней, то по крайней мере две стороны многоугольника сечения лежат в противоположных гранях параллелепипеда. По теореме о пересечении двух параллельных плоскостей третьей эти две стороны параллельны."
    ],
    "109102": [
        "Куб",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Докажите, что в кубе",
        "Решение: Прямая"
    ],
    "88289": [
        "Куб",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Можно ли расставить на ребрах куба числа от 1 до 12 так, чтобы все суммы чисел на гранях были одинаковыми?",
        "Решение: На кубе",
        "Ответ: Можно."
    ],
    "104119": [
        "Куб",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: На прозрачном столе стоит куб 3×3×3, составленный из 27 одинаковых кубиков. Со всех шести сторон (спереди, сзади, слева, справа, сверху, снизу) мы видим квадрат 3×3. Какое наибольшее число кубиков можно убрать так, чтобы со всех сторон был виден квадрат 3×3 и при этом оставшаяся система кубиков не разваливалась?",
        "Ответ: 12.00"
    ],
    "110319": [
        "Прямоугольные параллелепипеды",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Найдите объём прямоугольного параллелепипеда, площади  диагональных сечений которого равны",
        "Решение: Пусть",
        "Ответ: 6.00"
    ],
    "110321": [
        "Куб",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Внутри куба с ребром, равным 10, рассматриваются следующие  множества точек:   а) точки, удалённые на расстояние, не превышающее 1, ровно от трёх  граней куба;   б) точки, удалённые на расстояние, не превышающее 1, ровно от двух  граней куба;   в) точки, удаленные на расстояние, не превышающее 1, ровно от одной  граней куба.   Найдите объём тел, состоящих из этих точек.",
        "Ответ: Ю) 8; А) 96; Б) 384."
    ],
    "110486": [
        "Куб",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Сфера радиуса",
        "Решение: Пусть",
        "Ответ: 384.00"
    ],
    "111107": [
        "Куб",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Через каждую вершину единичного куба проведены плоскости, перпендикулярные одной и той же диагонали куба. На какие части делится диагональ этими плоскостями.",
        "Решение: Рассмотрим плоскость, проходящую через вершины",
        "Ответ: На три равные части."
    ],
    "35505": [
        "Куб",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Может ли некоторое сечение куба быть правильным пятиугольником?",
        "Подсказка: У любого пятиугольного сечения куба должны быть хотя бы две параллельные стороны.",
        "Решение: Если сечение представляет собой пятиугольник, то плоскость П, содержащая сечение, пересекает по отрезку пять граней куба. Среди этих пяти граней найдутся две параллельных грани. Плоскость П пересекает эти две грани по параллельным отрезкам, таким образом, у пятиугольника, получающегося в сечении, должна быть хотя бы одна пара (а на самом деле даже две пары) параллельных сторон.",
        "Ответ: Не может."
    ],
    "111126": [
        "Куб",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Рассмотрим две треугольные пирамиды, вершинами которых служат  вершины данного параллелепипеда (каждая вершина параллелепипеда  является вершиной одной пирамиды). Возможно ли, чтобы каждая  вершина одной из пирамид принадлежала плоскости грани другой  пирамиды, и наоборот?",
        "Решение: Рассмотрим параллелепипед",
        "Ответ: Да."
    ],
    "111129": [
        "Прямоугольные параллелепипеды",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Диагональ прямоугольного параллелепипеда образует с его  рёбрами углы",
        "Решение: Пусть диагональ"
    ],
    "104022": [
        "Куб",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Через каждую грань куба провели плоскость. На сколько частей разделят пространство данные плоскости?",
        "Решение: Проведенные плоскости разделят пространство на 27 частей."
    ],
    "35636": [
        "Куб",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Куб разбит двумя способами на тетраэдры с вершинами в вершинах данного куба.  Верно ли, что в обоих случаях количество тетраэдров одно и то же?",
        "Подсказка: Укажите разбиения на 5 и на 6 тетраэдров.",
        "Решение: Имеются разбиения на 5 и на 6 тетраэдров.        Первый способ. Отрежем от куба ABCDA'B'C'D' четыре тетраэдра A'ABD, C'CBD, BB'A'C', DD'A'C'. После этого останется ещё один тетраэдр ACB'D'.        Второй способ. Разобьём вначале куб на три четырёхугольных пирамиды с вершиной D', основанием каждой из которых является одна из трёх граней куба, содержащих точку B. Затем каждую их этих четырёхугольных пирамид разобьём на два тетраэдра. Всего получится 6 тетраэдров.",
        "Ответ: Неверно."
    ],
    "110483": [
        "Прямоугольные параллелепипеды",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: В сферу радиуса  вписан параллелепипед, объём которого  равен 8. Найдите площадь полной поверхности параллелепипеда.",
        "Решение: Поскольку около параллелепипеда описана сфера, этот параллелепипед – прямоугольный. Обозначим его рёбра, исходящие из одной вершины,   через a, b и c. Диагонали параллелепипеда равны диаметру описанной сферы, а объём равен abc. Из условия задачи следует, что   a² + b² + c² = 12, abc = 8.     Согласно неравенству Коши    Поскольку равенство достигается, только когда a² = b² = c², то  a = b = c = 2. Следовательно, площадь поверхности равна 6a² = 24.",
        "Ответ: 24."
    ],
    "110484": [
        "Прямоугольные параллелепипеды",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: В сферу радиуса 1 вписан параллелепипед, объём которого равен . Найдите площадь полной поверхности   параллелепипеда.",
        "Решение: Задача аналогична задаче 110483.",
        "Ответ: 8."
    ],
    "78086": [
        "Куб",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: В кубе, ребро которого равно 13, выбрано 1956 точек. Можно ли в этот куб поместить кубик с ребром 1 так, чтобы внутри него не было ни одной выбранной точки?",
        "Решение: Ответ:",
        "Ответ: 3"
    ],
    "115446": [
        "Куб",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Укажите точки на поверхности куба, из которых диагональ куба видна под наименьшим углом.",
        "Решение: Рассмотрим одну из диагоналей куба",
        "Ответ: все вершины куба, кроме концов этой диагонали."
    ],
    "65174": [
        "Прямоугольные параллелепипеды",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: В прямоугольном параллелепипеде АВСDA'B'C'D' АВ = ВС = а, AA' = b. Его ортогонально спроектировали на некоторую плоскость, содержащую ребро CD. Найдите наибольшее значение площади проекции.",
        "Решение: Пусть плоскость проекции α расположена так, как показано на рисунке. Тогда проекция параллелепипеда совпадает с проекцией его диагонального сечения АВС'D'. Так как площадь ортогональной проекции многоугольника не превосходит площади многоугольника, то площадь проекции будет наибольшей, если α параллельна этому сечению. В этом случае Sпр = SABC'D' = AB·AD' = .",
        "Ответ: ."
    ]
}