{
    "55374": [
        "Пятиугольники",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: В выпуклом  пятиугольнике ABCDE с  единичными  сторонами середины P, Q сторон AB, CD и  середины S, T сторон BC, DE соединены отрезками PQ и ST. Пусть M и N – середины отрезков PQ  и ST. Найдите длину отрезка MN.",
        "Решение: См. задачу",
        "Ответ: 1/4."
    ],
    "57082": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Докажите, что сумма расстояний от произвольной точки X до вершин правильного n-угольника будет наименьшей, если X – центр n-угольника.",
        "Решение: Пусть Xk – образ точки X при повороте  относительно центра O данного n-угольника A1...An, переводящем Ak   в A1. При этом повороте отрезок AkX переходит в A1Xk.  Следовательно, A1X + ... + AnX = A1X1 + ... + A1Xn. А так какn-угольник X1...Xn правильный, то  + ... +  = n (см. задачу57077),  а значит, A1X1 + ... + A1Xn ≥ n."
    ],
    "57084": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Найдите сумму квадратов расстояний от вершин правильного n-угольника, вписанного в окружность радиуса R, до произвольной прямой, проходящей через центр многоугольника.",
        "Решение: Пусть e1, ..., en – векторы, идущие из центра данного n-угольника в его вершины;   x – единичный вектор, перпендикулярный прямой l. Искомая сумма равна  (ei, x)² = ½ nR² (см. задачу57083)."
    ],
    "57085": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Расстояние от точки X до центра правильного n-угольника равно d, r – радиус вписанной окружности n-угольника.   Докажите, что сумма квадратов расстояний от точки X до прямых, содержащих стороны n-угольника, равна n(r² + ½ d²).",
        "Решение: Пусть e1, ..., en — единичные векторы, направленные из центра O правильного n-угольника в середины его сторон; x = . Тогда расстояние от точки X до i-й стороны равно |(x, ei) – r|. Поэтому искомая сумма равна  ((x, ei)² – 2r(x, ei) + r²) =  (x, ei)² + nr². Согласно задаче 57083  (x, ei)² = ½ nd²."
    ],
    "57086": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Докажите, что сумма квадратов длин проекций сторон правильного n-угольника на любую прямую равна ½ na², где a – сторона n-угольника.",
        "Решение: Пусть x – единичный вектор, параллельный прямой l, ei = . Тогда квадрат длины проекции стороны AiAi+1 на прямую l равен (x, ei)². Согласно задаче 57083 (x, ei)² = ½ na²."
    ],
    "57087": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Правильный n-угольник A1...An вписан в окружность радиуса R; X – точка этой окружности. Докажите, что",
        "Решение: Пусть a = , ei = . Тогда XAi4 = |a + ei|4 = (|a|² + 2(a, ei) + |ei|²)² = 4(R² + (a, ei))² = 4(R4 + 2R²(a, ei) + (a, ei)²).  (a, ei) = (a, ei) = 0. Согласно задаче 57083 (a, ei)² = ½ nR4, поэтому искомая сумма равна nR4 + 2nR4 = 6nR4."
    ],
    "57088": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 9",
        "Условие: а) Правильный n-угольник A1...An  вписан в окружность радиуса 1 с центром O; ei = , u –  произвольный вектор.  Докажите, что  (u, ei)ei = ½ nu.",
        "Решение: а) Пусть  Опустим из точки M перпендикуляры MBi на прямые OAi.     Точки B1, ..., Bn лежат на окружности с диаметром OM и являются вершинами правильного n-угольника при n нечётном и вершинами правильного n/2-угольника, взятыми по два раза, при n чётном (см. задачу 56549). Поэтому утверждение следует из задачи 55373 б)."
    ],
    "57095": [
        "Вписанные и описанные многоугольники",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Точка, лежащая внутри описанного",
        "Решение: Пусть"
    ],
    "76517": [
        "Сумма внутренних и внешних углов многоугольника",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Какое наибольшее число острых углов может встретиться в выпуклом многоугольнике?",
        "Решение: Сумма всех внешних углов выпуклого многоугольника равна"
    ],
    "78798": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Доказать, что можно расставить в вершинах правильного n-угольника  действительные числа x1, x2, ..., xn, все отличные от 0, так, чтобы для любого правильного k-угольника, все вершины которого являются вершинами исходного n-угольника, сумма чисел, стоящих в его вершинах, равнялась 0.",
        "Решение: Проведём через центр O правильного многоугольника   A1...An прямую l, не проходящую через его вершины. Пусть xi равно проекции вектора    на прямую, перпендикулярную l. Тогда все xi отличны от нуля. Сумма чисел xi, стоящих в вершинах правильного k-угольника, равна нулю, поскольку равна нулю соответствующая сумма векторов  (см.задачу 55373 а).."
    ],
    "115451": [
        "Сумма внутренних и внешних углов многоугольника",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Пусть",
        "Решение: Рассмотрим, например, четверку чисел:",
        "Ответ: нет, не всегда."
    ],
    "57071": [
        "Правильные многоугольники",
        "Сложность: 4+",
        "Классы: 9",
        "Условие: Правильный (4k+2)-угольник вписан в окружность радиуса R с центром O.   Докажите, что сумма длин отрезков, высекаемых углом    AkOAk+1 на прямых   A1A2k, A2A2k–1, ..., AkAk+1, равна R.",
        "Решение: Для k = 3 решение задачи ясно из рисунка."
    ],
    "32007": [
        "Сумма внутренних и внешних углов многоугольника",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Существует ли выпуклый 1978-угольник, у которого все углы выражаются целым числом градусов?",
        "Решение: Сумма внешних углов 1978-угольника равна 360°. Поэтому у него должен быть угол, меньший 1°.",
        "Ответ: Не существует."
    ],
    "58451": [
        "Теорема Паскаля",
        "Сложность: 5",
        "Классы: 9,10,11",
        "Условие: В окружность S вписан шестиугольник ABCDEF. Докажите, что  точки пересечения прямых AB и DE, BC и EF, CD и FA  лежат на одной прямой.",
        "Решение: Рассмотрим проективное преобразование, переводящее окружностьS в окружность, а точки пересечения прямых AB и DE, BC и EF – в бесконечно удаленные точки (см. задачу58425). Наша задача свелась к задаче 56552."
    ],
    "32091": [
        "Пятиугольники",
        "Сложность: 5",
        "Классы: 9,10,11",
        "Условие: Дан выпуклый пятиугольник. Каждая диагональ  отсекает от него треугольник. Докажите, что сумма площадей  треугольников больше площади пятиугольника.",
        "Решение: Будем двигать вершину A данного пятиугольника ABCDE  \t\t\t\tпараллельно диагонали BE. При этом площадь треугольника BEA и,  \t\t\t\tтем самым, пятиугольника ABCDE не меняется. Действительно,  \t\t\t\tоснованиями всех получаемых при движении треугольников будет  \t\t\t\tотрезок BE, а высоты равны между собой. Из всех рассматриваемых  \t\t\t\tтреугольников при таком движении площадь будет меняться лишь у  \t\t\t\tDEA и EAB. Как меняются эти площади? Рассмотрим один из них.  \t\t\t\tПусть при сдвиге на  \t\t\t\tвеличину x точка A перейдет в точку A′ (рис.a).  \t\t\t\tОбозначим через h и h′ соответственно высоты, опущенные на  \t\t\t\tсторону DE из точек A и A′ соответственно, а через"
    ],
    "57056": [
        "Пятиугольники",
        "Сложность: 5",
        "Классы: 8,9,10",
        "Условие: В равностороннем (неправильном) пятиугольнике",
        "Решение: Так как"
    ],
    "57057": [
        "Пятиугольники",
        "Сложность: 5",
        "Классы: 9",
        "Условие: а) Диагонали",
        "Решение: а) Пусть"
    ],
    "57059": [
        "Пятиугольники",
        "Сложность: 5",
        "Классы: 8,9,10",
        "Условие: Правильный пятиугольник",
        "Решение: Пусть точки"
    ],
    "57060": [
        "Шестиугольники",
        "Сложность: 5",
        "Классы: 9",
        "Условие: Противоположные стороны выпуклого шестиугольника",
        "Решение: Проведем через точки"
    ],
    "57061": [
        "Шестиугольники",
        "Сложность: 5",
        "Классы: 9",
        "Условие: Все углы выпуклого шестиугольника",
        "Решение: Построим треугольник"
    ],
    "57062": [
        "Шестиугольники",
        "Сложность: 5",
        "Классы: 9",
        "Условие: Суммы углов при вершинах",
        "Решение: Сумма углов при вершинах"
    ],
    "57076": [
        "Правильные многоугольники",
        "Сложность: 5",
        "Классы: 9",
        "Условие: Докажите, что при n ≥ 6 правильный (n–1)-угольник нельзя так вписать в правильный n-угольник, чтобы на всех сторонах n-угольника, кроме одной, лежало ровно по одной вершине (n–1)-угольника.",
        "Решение: Пусть правильный (n–1)-угольник B1...Bn–1 вписан в правильный n-угольник A1...An. Можно  считать, что A1 и B1 – наименее удаленные друг от друга вершины этих многоугольников и точки B2, B3, B4 и B5 лежат на сторонах A2A3, A3A4, A4A5 и A5A6. Пусть αi = ∠Ai+1BiBi+1 и βi = ∠BiBi+1Ai+1, где i = 1, 2, 3, 4. По теореме синусов A2B2 : B1B2 = sin α1 : sin φ и B2A3 : B2B3 = sin β2 : sin φ, где φ – угол при вершине правильного n-угольника. Следовательно,    где an и an–1 – стороны данных многоугольников.     Из аналогичных вычислений следует, что sin α1 + sin β2 = sin α2 + sin β3 = sin α3 + sin β4. Заметим, что"
    ],
    "57090": [
        "Вписанные и описанные многоугольники",
        "Сложность: 5",
        "Классы: 9",
        "Условие: На сторонах треугольника внешним образом построены три квадрата. Какими должны быть углы треугольника, чтобы шесть вершин этих квадратов, отличных от вершин треугольника, лежали на одной окружности?",
        "Решение: Предположим, что на сторонах треугольника"
    ],
    "57091": [
        "Вписанные и описанные многоугольники",
        "Сложность: 5",
        "Классы: 9",
        "Условие: В окружность вписан2",
        "Решение: В любом треугольнике выполнено соотношение"
    ],
    "57092": [
        "Вписанные и описанные многоугольники",
        "Сложность: 5",
        "Классы: 9",
        "Условие: Вписанный многоугольник разбит непересекающимися диагоналями на треугольники. Докажите, что сумма радиусов всех вписанных в эти треугольники окружностей не зависит от разбиения.",
        "Решение: Пусть"
    ],
    "57093": [
        "Вписанные и описанные многоугольники",
        "Сложность: 5",
        "Классы: 9",
        "Условие: Два",
        "Решение: Пусть многоугольник"
    ],
    "57096": [
        "Вписанные и описанные многоугольники",
        "Сложность: 5",
        "Классы: 9",
        "Условие: В2",
        "Решение: Пусть"
    ],
    "57097": [
        "Вписанные и описанные многоугольники",
        "Сложность: 5",
        "Классы: 9",
        "Условие: Окружность радиуса",
        "Решение: Пусть"
    ],
    "57089": [
        "Правильные многоугольники",
        "Сложность: 5+",
        "Классы: 9",
        "Условие: Докажите, что если число n не является степенью простого числа, то существует выпуклый n-угольник со сторонами длиной 1, 2,..., n, все углы которого равны.",
        "Решение: Пусть e0, ..., en–1 – векторы сторон правильного n-угольника. Достаточно доказать, что, переупорядочив эти векторы, можно получить такой набор векторов {a1, ..., an}, что kak = 0.     Число n по условию можно представить в виде n = pq, где p и q взаимно просты. Докажем, что набор   {e0, ep, ..., e(q–1)p; eq, eq+p, ..., eq+(q–1)p, ...; e(p–1)q+p, ..., e(p–1)q+(q–1)p}, где все номера берутся по модулю n, – искомый.     Заметим сначала, что если xq + yp ≡ x'q + y'p (mod pq), то x ≡ x' (mod p) и y ≡ y' (mod q), поэтому в рассматриваемом наборе каждый из векторов e0, ..., en–1 встречается ровно один раз.     Концы векторов eq, eq+p, ..., eq+(q–1)p с общим началом образуют правильный q-угольник, поэтому их сумма равна нулю. Кроме того, векторы e0, ep, ..., e(q–1)p переходят в eq, eq+p, ..., eq+(q–1)p, при повороте на угол φ = 2π/p. Поэтому если e0 + 2ep + ... + qe(q–1)p = b, то   (q + 1)eq + (q + 2)eq+n + ... + 2qeq+(q–1)p = q(eq + ... + eq+(q–1)p) + eq + 2eq+p + ... + qeq+(q–1)p = Rφb, где Rφb – вектор, полученный из вектора b поворотом на угол φ.     Аналогичные рассуждения показывают, что для рассматриваемого набора векторов kak = b + Rφb + ... + R(p–-1)φb = 0."
    ],
    "57098": [
        "Вписанные и описанные многоугольники",
        "Сложность: 5+",
        "Классы: 9",
        "Условие: Около окружности описан",
        "Решение: Согласно задаче"
    ],
    "57099": [
        "Вписанные и описанные многоугольники",
        "Сложность: 5+",
        "Классы: 9",
        "Условие: Некоторые стороны выпуклого многоугольника красные, остальные синие. Сумма длин красных сторон меньше половины периметра, и нет ни одной пары соседних синих сторон. Докажите, что в этот многоугольник нельзя вписать окружность.",
        "Решение: Пусть"
    ],
    "34900": [
        "Шестиугольники",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Каждая из сторон выпуклого шестиугольника имеет длину больше 1.    Всегда ли в нем найдется диагональ длины больше 2?",
        "Подсказка: Постройте треугольники на сторонах правильного треугольника со   стороной 2 во внешнюю сторону.",
        "Решение: Возьмем правильный треугольник со стороной 2.   Из середин его сторон восставим во внешнюю сторону перпендикуляры,   отложим на них отрезки очень малой длины (скажем, длины 0,01)    и соединим полученные точки с вершинами треугольника. Легко видеть,    что стороны так построенного выпуклого шестиугольника больше 1,   но все его диагонали не больше 2.",
        "Ответ: не всегда."
    ],
    "57063": [
        "Шестиугольники",
        "Сложность: 6",
        "Классы: 9",
        "Условие: Докажите, что если в выпуклом шестиугольнике каждая из трех диагоналей, соединяющих противоположные вершины, делит площадь пополам, то эти диагонали пересекаются в одной точке.",
        "Решение: Предположим, что диагонали шестиугольника образуют треугольник"
    ],
    "57064": [
        "Шестиугольники",
        "Сложность: 6",
        "Классы: 9",
        "Условие: Докажите, что если в выпуклом шестиугольнике каждый из трех отрезков, соединяющих середины противоположных сторон, делит площадь пополам, то эти отрезки пересекаются в одной точке.",
        "Решение: Обозначим середины сторон выпуклого шестиугольника"
    ],
    "57073": [
        "Правильные многоугольники",
        "Сложность: 6",
        "Классы: 9",
        "Условие: Докажите, что в правильном тридцатиугольнике A1...A30 следующие тройки диагоналей:    а) A1A7, A2A9, A4A23;     б) A1A7, A2A15, A4A29;     в) A1A13, A2A15, A10A29    пересекаются в одной точке.",
        "Решение: Во всех случаях проверка условия теоремы Чевы (см. зад. 35216) для соответствующего шестиугольника (A1A2A4A7A9A23, A1A2A4A7A15A29, A1A2A10A13A15A29) сводится к проверке равенства sin 6° sin 18° sin 84° = sin 12° sin 12° sin 48°.     2 sin 6° sin 84° = 2 sin 6° cos 6° =  sin 12°, sin 18° = cos 72°, 2 sin 12° sin 48° = cos 36° – cos 60°, поэтому все сводится к известному (см. зад. 61163) равенству cos 36° – cos 72° = ½."
    ],
    "57094": [
        "Вписанные и описанные многоугольники",
        "Сложность: 6",
        "Классы: 9",
        "Условие: Положительные числа",
        "Решение: Без ограничения общности можно считать, что"
    ],
    "57105": [
        "Теорема Паскаля",
        "Сложность: 6",
        "Классы: 8,9,10",
        "Условие: Докажите, что точки пересечения противоположных сторон (если эти стороны не параллельны) вписанного шестиугольника лежат на одной прямой (Паскаль).",
        "Решение: Пусть прямые"
    ],
    "57106": [
        "Теорема Паскаля",
        "Сложность: 6+",
        "Классы: 9",
        "Условие: Точка",
        "Решение: Пусть"
    ],
    "57107": [
        "Теорема Паскаля",
        "Сложность: 6+",
        "Классы: 9",
        "Условие: Даны треугольник",
        "Решение: Поскольку углы"
    ],
    "57108": [
        "Теорема Паскаля",
        "Сложность: 6+",
        "Классы: 9",
        "Условие: В треугольнике",
        "Решение: Точки"
    ],
    "57109": [
        "Теорема Паскаля",
        "Сложность: 6+",
        "Классы: 9",
        "Условие: Четырехугольник",
        "Решение: Пусть"
    ],
    "35569": [
        "Шестиугольники",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: Стороны правильного шестиугольника раскрашены через одну в красный и синий     цвета. Докажите, что сумма расстояний от точки, лежащей внутри     шестиугольника, до прямых, содержащих красные стороны, равна сумме расстояний     от этой точки до прямых, содержащих синие стороны.",
        "Подсказка: Правильный шестиугольник - это пересечение двух правильных    треугольников; используйте, что сумма расстояний от любой точки,    лежащей внутри правильного треугольника, до его сторон, постоянна.",
        "Решение: Будем для краткости под сторонами шестиугольника подразумевать  прямые, содержащие эти стороны. Пусть O - данная точка, а O' - ее образ при повортое  на 60"
    ],
    "57110": [
        "Теорема Паскаля",
        "Сложность: 6+",
        "Классы: 9",
        "Условие: Четырехугольник",
        "Решение: Пусть точки"
    ],
    "57111": [
        "Теорема Паскаля",
        "Сложность: 6+",
        "Классы: 9",
        "Условие: Точки",
        "Решение: Пусть лучи"
    ],
    "57112": [
        "Теорема Паскаля",
        "Сложность: 6+",
        "Классы: 9",
        "Условие: Две окружности касаются описанной окружности треугольника",
        "Решение: Пусть"
    ],
    "57113": [
        "Теорема Паскаля",
        "Сложность: 6+",
        "Классы: 9",
        "Условие: Даны пять точек некоторой окружности. С помощью одной линейки постройте шестую точку этой окружности.",
        "Решение: Пусть данные точки"
    ],
    "57114": [
        "Теорема Паскаля",
        "Сложность: 7",
        "Классы: 9",
        "Условие: Точки",
        "Решение: Пусть"
    ],
    "30290": [
        "Четность и нечетность",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: а) Дан осесимметричный выпуклый 101-угольник. Докажите, что ось симметрии проходит через одну из его вершин.   б) Что можно сказать в случае десятиугольника?",
        "Решение: а) Вершины многоугольника симметричны относительно его оси симметрии. Значит, все вершины, не лежащие на оси, разбиваются на пары, то есть их чётное число. А 101 – число нечётное."
    ],
    "34894": [
        "Правильные многоугольники",
        "Сложность: 2+",
        "Классы: 8,9,10",
        "Условие: Докажите, что сумма расстояний от любой точки, расположенной внутри правильного n-угольника, до его сторон не зависит от выбора точки.",
        "Подсказка: Используйте площадь.",
        "Решение: Пусть точка O расположена внутри правильного n-угольника A1A2...An со стороной a и площадью S. Обозначим через h1, h2, ..., hn расстояния от O до сторон A1A2, A2A3, ..., AnA1. Площадь n-угольника равна сумме площадей треугольников OA1A2, OA2A3, ..., OAnA1, то есть 2S = ah1 + ah2 + ... + ahn. Отсюда  h1 + h2 + ... + hn = 2S/a."
    ],
    "35501": [
        "Ориентированные графы",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: На сторонах некоторого многоугольника расставлены стрелки.   Докажите, что число вершин, в которые входят две стрелки, равно числу вершин, из которых выходят две стрелки.",
        "Подсказка: Число выходящих стрелок равно числу вершин многоугольника.",
        "Решение: Пусть n – число сторон данного многоугольника, а k – число вершин, в которые входит по две стрелки. Всего стрелок – n, из них 2k стрелок входят в данные k вершин, остальные n – 2k стрелок входят еще в n – 2k вершин (в каждую – по одной). Остаётся n – k – (n – 2k) = k вершин, в которые не входит ни одной стрелки, то есть из которых выходит по две стрелки."
    ],
    "53566": [
        "Вписанные четырехугольники (прочее)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Найдите углы четырёхугольника ABCD, вершины которого расположены  на окружности, если ∠ABD = 74°, ∠DBC = 38°, ∠BDC = 65°.",
        "Ответ: ∠ABC = 112°, ∠BCD = 77°,   ∠CDA = 68°, ∠DAB = 103°."
    ],
    "56538": [
        "Вписанный угол (прочее)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что все углы, образованные сторонами и диагоналями правильного n-угольника, кратны 180°/n.",
        "Подсказка: На какие дуги делят вершины правильного многоугольника описанную окружность?"
    ],
    "53563": [
        "Сумма внутренних и внешних углов многоугольника",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Найдите сумму внешних углов выпуклого n-угольника, взятых по одному при каждой вершине.",
        "Подсказка: Сумма внутренних углов выпуклого n-угольника равна   180°(n – 2).",
        "Решение: Сумма развернутых углов при всех вершинах n-угольника равна 180°n. Сумма внутренних углов выпуклого n-угольника равна   180°(n – 2). Сумма внешних углов этого n-угольника равна разности найденных сумм, то есть 360°.",
        "Ответ: 360°."
    ],
    "65170": [
        "Четырехугольники (прочее)",
        "Сложность: 2+",
        "Классы: 8,9,10,11",
        "Условие: Существует ли выпуклый четырёхугольник, каждая диагональ которого делит его на два остроугольных треугольника?",
        "Решение: Из условия следует, что каждый угол такого четырёхугольника острый. Но тогда их сумма меньше, чем 360°.",
        "Ответ: Не существует."
    ],
    "32136": [
        "Подсчет двумя способами",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: На сторонах шестиугольника было записано шесть чисел, а в каждой вершине – число, равное сумме двух чисел на смежных с ней сторонах. Затем все числа на сторонах и одно число в вершине стерли. Можно ли восстановить число, стоявшее в вершине?",
        "Решение: Пусть ABCDEF – данный шестиугольник, и нам нужно восстановить   число в вершине A. Заметим, что сумма чисел в вершинах A, C и E равна сумме чисел в вершинах B, D и F: обе эти суммы равны сумме чисел, стоявших исходно на всех сторонах шестиугольника. Поэтому, чтобы восстановить число в вершине A нужно из суммы чисел в вершинах B, D и F вычесть числа в вершинах C и E.",
        "Ответ: Можно."
    ],
    "35179": [
        "Вписанные четырехугольники (прочее)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Биллиард имеет форму выпуклого четырехугольника   ABCD. Из точки K стороны AB выпустили биллиардный шар,   который отразился в точках L, M, N от сторон BC, CD, DA,    возвратился в точку K и вновь вышел на траекторию   KLMN. Докажите, что четырехугольник ABCD можно    вписать в окружность.",
        "Подсказка: Воспользуйтесь теоремой о сумме углов треугольника и законом   угол падения равен углу отражения.",
        "Решение: По условию четырехугольник KLMN, вписанный в четырехугольник    ABCD, является замкнутой биллиардной траекторией.   Пользуясь тем, что угол падения равен углу отражения,    можно ввести следующие обозначения:   углы AKN и BKL обозначим за x,   углы BLK и CLM обозначим за y,   углы CML и DMN обозначим за z,   углы DMN и ANK обозначим за t.   Пользуясь тем, что сумма углов в треугольнике равна 180"
    ],
    "35803": [
        "Поворот (прочее)",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: Если повернуть многоугольник вокруг некоторой точки на 70 градусов, то он совместится сам с собой.  Какое наименьшее число вершин может быть у такого многоугольника?",
        "Подсказка: Многоугольник совместится сам с собой при поворотах на углы в 70, 2*70, 3*70,... градусов.",
        "Решение: Ясно, что правильный 36-угольник переходит в себя при повороте на угол 10",
        "Ответ: 36.00"
    ],
    "35139": [
        "Подсчет двумя способами",
        "Сложность: 3",
        "Классы: 9,10,11",
        "Условие: Какое наибольшее количество непересекающихся диагоналей можно провести в выпуклом n-угольнике (допускаются диагонали, имеющие общую вершину)?",
        "Решение: Каждая проведённая диагональ увеличивает число многоугольников-частей на 1. Поэтому проведя k непересекающихся диагоналей, мы разрежем n-угольник на k + 1 многоугольников. Оценим их количество.",
        "Ответ: n – 3 диагонали."
    ],
    "35144": [
        "Вписанные и описанные многоугольники",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: Вокруг окружности описан пятиугольник, длины сторон которого – целые числа, а первая и третья стороны равны 1.   На какие отрезки делит вторую сторону точка касания?",
        "Подсказка: Докажите, что удвоенные длины отрезков касательных от вершин пятиугольника до точек касания с окружностью являются целыми числами.",
        "Решение: Пусть данный пятиугольник - ABCDE, причём AB = CD = 1, BC = k, DE = m, EA = n. Обозначим через a, b, c, d, e длины отрезков касательных, проведённых соответственно из вершин пятиугольника A, B, C, D, E до точек касания с окружностью. Тогда a + b = 1, b + c = k, c + d = 1, d + e = m,   e + a = n. Значит, 2b = (a + b) + (b + c) + (d + e) – (c + d) – (e + a) – целое число. Поскольку a + b = 1, то b < 1, то есть b = ½. Аналогично c = ½.",
        "Ответ: На два отрезка длины ½."
    ],
    "53564": [
        "Сумма внутренних и внешних углов многоугольника",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что у выпуклого многоугольника может быть не более трёх острых углов.",
        "Подсказка: Найдите сумму внешних углов выпуклого n-угольника.",
        "Решение: Если у выпуклого многоугольника более трёх острых внутренних углов, то среди его внешних углов более трёх тупых, что невозможно, поскольку сумма всех его внешних углов равна 360°."
    ],
    "35463": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Можно ли какой-нибудь выпуклый многоугольник разрезать на конечное    число невыпуклых четырехугольников?",
        "Подсказка: Оцените сумму углов, больших 180",
        "Решение: Предположим противное - некоторый выпуклый многоугольник разбит на     n невыпуклых четырехугольников. В каждом четырехугольнике есть     угол, больший 180",
        "Ответ: нельзя."
    ],
    "35505": [
        "Куб",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Может ли некоторое сечение куба быть правильным пятиугольником?",
        "Подсказка: У любого пятиугольного сечения куба должны быть хотя бы две параллельные стороны.",
        "Решение: Если сечение представляет собой пятиугольник, то плоскость П, содержащая сечение, пересекает по отрезку пять граней куба. Среди этих пяти граней найдутся две параллельных грани. Плоскость П пересекает эти две грани по параллельным отрезкам, таким образом, у пятиугольника, получающегося в сечении, должна быть хотя бы одна пара (а на самом деле даже две пары) параллельных сторон.",
        "Ответ: Не может."
    ],
    "53380": [
        "Сумма углов треугольника. Теорема о внешнем угле.",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Найдите  сумму   углов   при   вершинах   самопересекающейся пятиконечной звезды.",
        "Подсказка: Примените теорему о внешнем угле треугольника.",
        "Решение: Обозначим вершины звезды последовательно: A1, A2, A3, A4, A5. Пусть M – точка пересечения отрезков A1A4 и A2A5, а N –  отрезков A1A3 и A2A5. Тогда угол A1MN – внешний  угол  треугольника MA2A4, а угол A1NM –  треугольника NA3A5. Поэтому ∠A1MN = ∠A2 + ∠A4, ∠A1NM = ∠A3 + ∠A5. Следовательно,   ∠A1 + ∠A2 + ∠A3 + ∠A4 + ∠A5 = ∠A1 + ∠A1MN + ∠A1NM = 180°.",
        "Ответ: 180°."
    ],
    "55631": [
        "Центральная симметрия",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Выпуклый многоугольник имеет центр симметрии. Докажите, что сумма его углов делится на 360°.",
        "Подсказка: У многоугольника, имеющего центр симметрии, чётное число вершин.",
        "Решение: Поскольку у многоугольника, имеющего центр симметрии, чётное число вершин 2n, то сумма его внутренних углов равна 180°·(2n – 2) = 360°·(n – 1)."
    ],
    "56549": [
        "Углы, опирающиеся на равные дуги и равные хорды",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Окружность разделена на равные дуги n диаметрами. Докажите, что основания перпендикуляров, опущенных из произвольной точки M, лежащей внутри окружности, на эти диаметры, являются вершинами правильного многоугольника.",
        "Решение: Основания перпендикуляров, опущенных из точки M на диаметры, лежат на окружности S с диаметром OM (O — центр исходной окружности). Точки пересечения данных диаметров с окружностью S, отличные от точки O, делят ее на n дуг. Так как на все дуги, не содержащие точкуO, опираются углы 180°/n, то угловые величины этих дуг равны 360°/n. Поэтому угловая величина дуги, на которой лежит точка O, также равна 360°/n. Следовательно, основания перпендикуляров делят окружностьS на n равных дуг."
    ],
    "58160": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Может ли прямая пересекать (во внутренних точках) все стороны невыпуклого:     а) (2n+1)-угольника; б) 2n-угольника?",
        "Решение: а) Первый способ. Будем двигаться вдоль прямой в одном направлении. При каждом пересечении границы многоугольника мы переходит снаружи многоугольника внутрь или изнутри наружу. Поскольку оба конца прямой находятся снаружи многоугольника, мы пересечём границу чётное число раз. Значит, мы не можем пересечь все стороны (их нечётное число, а дважды одну сторону пересечь нельзя).     Второй способ. См. задачу 30285.",
        "Ответ: а) Не может; б) может."
    ],
    "65609": [
        "Пятиугольники",
        "Сложность: 3",
        "Классы: 9,10,11",
        "Условие: В выпуклом пятиугольнике равны все стороны, а также равны четыре из пяти диагоналей.   Следует ли из этого условия, что пятиугольник – правильный?",
        "Решение: Пусть пятиугольник АВСDE удовлетворяет условию задачи (равны между собой все диагонали, кроме АС, см. рис.). Тогда треугольники АЕD и BCD равны (по трём сторонам), значит, ∠АЕD = ∠BCD. Кроме того, треугольник CDE – равнобедренный, поэтому ∠СЕD = ∠ECD. Значит,   ∠АЕC = ∠BCE.    Следовательно, равны треугольники АСЕ и ВЕC (по двум сторонам и углу между ними), значит, АС = ВЕ. Таким образом,   в пятиугольнике равны все диагонали и все стороны, поэтому равны и все углы, то есть пятиугольник – правильный.",
        "Ответ: Следует."
    ],
    "77976": [
        "Перегруппировка площадей",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: A – вершина правильного звёздчатого пятиугольника. Ломаная  AA'BB'CC'DD'EE' является его внешним контуром. Прямые AB и DE  продолжены до пересечения в точке F. Докажите, что многоугольник  ABB'CC'DED' равновелик четырёхугольнику AD'EF.",
        "Решение: Ясно, что AB || EC и AC || EF. Поэтому ACEF – параллелограмм. В частности, SEFA = SACE. Поскольку треугольники AED', ABB' и EDC' равны, имеем SAA'BB'CC'DED' = SACE – SAED' + SABB' + SEDC' = SEFA + SAED' = SAD'EF."
    ],
    "57005": [
        "Многоугольники (прочее)",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Докажите, что выпуклый четырехугольник"
    ],
    "55579": [
        "Правильные многоугольники",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что для любого натурального n существует выпуклый  многоугольник, имеющий ровно n осей симметрии.",
        "Решение: Примерами таких многоугольников служат:   для n = 1 – равнобедренный (но не равносторонний) треугольник;   для n = 2 – ромб, не являющийся квадратом;  для n ≥ 3 – правильный n-угольник."
    ],
    "78015": [
        "Свойства симметрий и осей симметрии",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Сколько осей симметрии может иметь семиугольник?",
        "Решение: Ответ:",
        "Ответ: Источники и прецеденты использования"
    ],
    "78077": [
        "Правильные многоугольники",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Точки A1, A2, A3, A4, A5, A6 делят окружность радиуса 1 на шесть равных частей. Из A1 провёден луч l1 в направлении A2, из A2 – луч l2 в направлении A3, ..., из A6 – луч l6 в направлении A1. Из точки B1, взятой на луче l1, опускается  перпендикуляр на луч l6, из основания этого перпендикуляра опускается перпендикуляр на l5 и т. д. Основание шестого перпендикуляра совпало с B1. Найти отрезок B1A1.",
        "Решение: Пусть B2, B3, ..., B7 – основания перпендикуляров, опущенных на l6, l5, ..., l1. Длина каждого отрезка в последовательности A1B1, A6B2, A5B3, ..., A1B7 равна половине длины предыдущего плюс 1. Поэтому, если A1B1 > 2, длины отрезков в этой последовательности возрастают, а если A1B1 < 2, – убывают. По условию A1B1 = A1B7, поэтому A1B1 = 2.",
        "Ответ: B1A1 = 2."
    ],
    "78154": [
        "Неравенство треугольника (прочее)",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: Из бумаги вырезан многоугольник. Две точки его границы соединяются отрезком, по которому многоугольник складывается. Доказать, что периметр многоугольника, получающегося после складывания, меньше периметра исходного многоугольника.",
        "Решение: Выделим в полученном многоугольнике части, по которым произошла склейка. Все стороны, не принадлежащие заштрихованным многоугольникам, входят в периметр исходного и полученного многоугольников. Что же касается заштрихованных многоугольников, то их стороны, лежащие на прямой сгиба, входят в периметр полученного многоугольника, а все остальные — в периметр исходного многоугольника. Так как у любого многоугольника сумма его сторон, лежащих на некоторой прямой, меньше суммы остальных сторон, то периметр исходного многоугольника всегда больше, чем периметр полученного."
    ],
    "78287": [
        "Симметрия помогает решить задачу",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: У края биллиарда, имеющего форму правильного 2n-угольника, стоит шар. Как надо пустить шар от борта, чтобы он, отразившись последовательно от всех бортов, вернулся в ту же точку? (При отражении углы падения и отражения равны.) Доказать, что при этом длина пути шара не зависит от выбора начальной точки.",
        "Решение: Шар нужно пустить параллельно ближайшей к точке малой диагонали 2n-угольника (см. рис.).  Ясно, что в этом случае траектория шара замкнется (она представляет собой полуправильный 2n-угольник). Из подобия легко следует, что независимо от начальной точки сумма длин двух последовательных сторон полученного многоугольника равна малой диагонали исходного. Значит, и длина всего пути не зависит от начальной точки.",
        "Ответ: Шар нужно пустить под углом π/2n к борту."
    ],
    "78701": [
        "Выпуклая оболочка и опорные прямые (плоскости)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: В государстве царя Додона расположено 500 городов, каждый из которых имеет  форму правильной 37-угольной звезды, в вершинах которой находятся башни. Додон  решил обнести их выпуклой стеной так, чтобы каждый отрезок стены соединял две  башни. Доказать, что  стена будет состоять не менее чем из 37 отрезков. (Если несколько отрезков лежат на одной прямой, то они считаются за один.)",
        "Решение: Звезды можно заменить на правильные 37-угольники с теми же вершинами – при этом форма стены (выпуклая оболочка) не изменится. Далее см. решение задачи 78693."
    ],
    "108607": [
        "Перегруппировка площадей",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В выпуклом шестиугольнике ABCDEF отрезки AB и CF, CD и BE, EF и AD попарно параллельны.   Докажите, что площади треугольников ACE и BFD равны.",
        "Подсказка: Треугольники ABF и ABC, BCD и CED, DEF и AFE попарно равновелики.",
        "Решение: SBDF = SABCDEF – SABF – SBCD – SDEF = SABCDEF – SABC – SCDE – SAEF = SACE."
    ],
    "108693": [
        "Признаки и свойства равнобедренного треугольника.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Медианой пятиугольника ABCDE назовём отрезок, соединяющий вершину с серединой противолежащей стороны (A – с серединой CD, B – с серединой DE и т.д.). Докажите, что если четыре медианы выпуклого пятиугольника перпендикулярны сторонам, к которым они проведены, то таким же свойством обладает и пятая медиана.",
        "Решение: Заметим, что медиана пятиугольника перпендикулярна противолежащей   стороне тогда и только тогда, когда диагонали, проведённые из этой вершины, равны. Поэтому, если медианы, проведённые из вершин A, B, C и D перпендикулярны противолежащим сторонам, то AC = AD, BE = BD, CA = CE,  DB = DA.     Значит, CE = BE. Следовательно, медиана, проведённая из вершины E, также перпендикулярна противолежащей стороне."
    ],
    "57066": [
        "Правильные многоугольники",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Число сторон многоугольника A1...An нечётно. Докажите, что:     а) если этот многоугольник вписанный и все его углы равны, то он  правильный;     б) если этот многоугольник описанный и все его стороны равны, то он правильный.",
        "Решение: а) Пусть O – центр описанной окружности. Так  как ∠AkOAk+2 = 360° – 2∠AkAk+1Ak+2 = φ  – постоянная величина, то при повороте с центром O на угол φ точка Ak переходит в Ak+2. Для нечётного n из этого следует, что все стороны многоугольника A1...An равны."
    ],
    "111631": [
        "Перегруппировка площадей",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что площадь правильного восьмиугольника равна произведению длин наибольшей и наименьшей диагоналей.",
        "Решение: Отрежем от правильного восьмиугольника треугольники и переставим их так, как показано на рисунке 1. Получим прямоугольник, стороны которого равны наибольшей и наименьшей диагоналям восьмиугольника."
    ],
    "111632": [
        "Перегруппировка площадей",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Четыре вершины правильного двенадцатиугольника расположены в серединах сторон квадрата (см. рис.).",
        "Решение: Пусть сторона квадрата равна 2. Тогда его площадь равна 4. А площадь двенадцатиугольника равна 3 (см. зад. 111633). Значит, площадь оставшейся части (а она состоит из четырех фигур, равных заштрихованной) равна 1. Следовательно, площадь заштрихованной фигуры равна ¼, что и составляет 1/12 площади двенадцатиугольника."
    ],
    "116573": [
        "Вписанные и описанные многоугольники",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Каково максимальное число попарно непараллельных отрезков с концами в вершинах правильного n-угольника?",
        "Решение: Пусть A1...An – данный n-угольник. Положим An+k = An для любого k. Заметим, что отрезок AiAj параллелен отрезку Ai–kAj+k   (между этими отрезками заключены равные дуги). Отсюда следует, что в нечётноугольнике каждая диагональ параллельна одной из сторон,   а в чётноугольнике каждая диагональ параллельна либо одной из сторон, либо одной из малых диагоналей (соединяющих вершины через одну). В каждом из этих случаев получается ровно n различных классов параллельности.",
        "Ответ: n отрезков."
    ],
    "32080": [
        "Выпуклая оболочка и опорные прямые (плоскости)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На плоскости даны четыре точки, не лежащие на одной прямой. Докажите, что существует неостроугольный треугольник с вершинами в этих точках.",
        "Решение: Рассмотрим различные случаи расположения четырёх данных точек на плоскости.     1) Четыре данные точки являются вершинами выпуклого четырёхугольника. Сумма углов этого четырёхугольника равна 360°. Поэтому хотя бы один из его углов не острый. Обозначим вершину, угол при которой не острый, через A. Тогда треугольник с вершинами в точке A и двух соседних с ней вершинах  четырёхугольника будет неостроугольным (рис. слева).     2) Одна из точек (обозначим ее A) лежит внутри треугольника BCD, образованного остальными тремя точками (рис. в центре). Сумма углов BAC, CAD и DAB равна 360°. Поэтому по крайней мере один из них имеет величину не меньше 120°. Неостроугольный треугольник найден и в этом случае.     3) Три точки лежат на одной прямой. Обозначим эти точки A, B и C в порядке их следования на прямой, четвёртую точку обозначим D (рис. справа). Тогда сумма углов DBA и DBC равна 180°. Значит, один из этих углов не меньше 90°. В этом случае требуемый треугольник тоже найден."
    ],
    "53895": [
        "Шестиугольники",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На диагоналях AC и CE правильного шестиугольника ABCDEF взяты точки M и N соответственно, причём AM/AC = CN/CE = λ. Известно, что точки B, M и N лежат на одной прямой. Найдите λ.",
        "Решение: Пусть AC = 1, L – точка пересечения диагоналей BF и AC (см. рис.).     В трапеции ABCF BL : LF = AB : CF = 1 : 2. Следовательно, BL = &frac13;. Аналогично AL = &frac13;. По условию CN = AM = λ, а LM = λ – &frac13;. Диагонали BF и CE параллельны, поэтому треугольники BLM и NCM подобны и &frac13;/λ = λ–&frac13;/1–λ. Отсюда λ² = &frac13;.",
        "Ответ: ."
    ],
    "57070": [
        "Правильные многоугольники",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Существует ли правильный многоугольник, длина одной диагонали которого равна сумме длин двух других диагоналей?",
        "Решение: Рассмотрим правильный двенадцатиугольник A1...A12, вписанный в окружность радиуса R. Ясно, что    A1A7 = 2R, A1A3 = A1A11 = R.",
        "Ответ: Существует."
    ],
    "55574": [
        "Свойства симметрий и осей симметрии",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите, что ось симметрии а) треугольника, б) (2k+1)-угольника проходит через его вершину.",
        "Подсказка: Воспользуйтесь нечётностью числа вершин.",
        "Решение: Предположим, что ось симметрии (2k+1)-угольника не проходит через вершину. Пусть по одну сторону от оси лежит m вершин. Тогда по другую – также m вершин. Следовательно, 2m = 2k + 1, что невозможно."
    ],
    "64835": [
        "Пятиугольники",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На доске был изображен пятиугольник, вписанный в окружность. Маша измерила его углы и у нее получилось, что они равны 80°, 90°, 100°, 130° и 140° (именно в таком порядке). Не ошиблась ли Маша?",
        "Решение: Пусть АВСDE – данный пятиугольник, в котором углы А, В, С, D и Е соответственно равны 80°, 90°, 100°, 130° и 140° (см. рис.). Далее можно рассуждать по-разному.",
        "Ответ: Ошиблась."
    ],
    "79413": [
        "Две пары подобных треугольников",
        "Сложность: 3+",
        "Классы: 9",
        "Условие: Каждая диагональ выпуклого пятиугольника параллельна одной из его сторон.   Доказать, что отношение каждой диагонали к соответствующей стороне равно",
        "Решение: Из условия следует, что EOCD' и DCBC' – параллелограммы (см. рис.)."
    ],
    "57079": [
        "Правильные многоугольники",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Точка A лежит внутри правильного десятиугольника X1...X10, а точка B — вне его. Пусть a =  + ... +  и b =  + ... + .   Может ли оказаться, что |a| > |b| ?",
        "Решение: Согласно задаче 55373   a = 10 и b = 10 – центр многоугольника X1...X10. Ясно, что если точка A расположена очень близко к вершине многоугольника, а точка B – очень близко к середине стороны, то AO > BO.",
        "Ответ: Может."
    ],
    "79441": [
        "Геометрические интерпретации в алгебре",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: На доске после занятия осталась запись:     Вычислить t(0) − t(π/5) + t(2π/5) − t(3π/5) + ... + t(8π/5) − t(9π/5), где t(x) = cos5x + *cos4x + *cos3x + *cos2x + *cosx + *.  Увидев её, студент мехмата сказал товарищу, что он может вычислить эту сумму, даже не зная значений стёртых с доски коэффициентов (вместо них в нашей записи *). Не ошибается ли он?",
        "Решение: Пусть tk(x) = cos kx для   k = 0, 1, 2, 3, 4. Если рассмотреть аналогичную сумму для t5 вместо t, то в результате получим 10. Проверим, что для всех остальных tk суммы равны 0. Для k = 0 это очевидно. А для k = 1, 2, 3, 4 приходим к одному и тому же равенству   cos 0 + cos(2π/5) + cos(4π/5) cos(6π/5) + cos(8π/5) = cos(π/5) + cos(3π/5) + cos(5π/5) + cos(7π/5) + cos(9π/5).  Выражение как в правой части, так и в левой части равно 0. Это следует из того, что сумма векторов, идущих из центра правильного пятиугольника в его вершины, равна 0 (см. задачу 55373 а или задачу 85241).",
        "Ответ: Не ошибается; сумма равна 10."
    ],
    "115317": [
        "Вспомогательные равные треугольники",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В выпуклом шестиугольнике ABCDEF диагонали AD, BE и CF равны. Пусть P – точка пересечения диагналей AD и CF, R – точка пересечения диагоналей BE и CF, Q – точка пересечения диагоналей AD и BE. Известно, что AP = PF, BR = CR и DQ = EQ. Докажите, что точки   A, B, C, D, E и F лежат на одной окружности.",
        "Решение: Рассмотрим случай, изображенный на рисунке. Пусть"
    ],
    "116572": [
        "Вписанные и описанные многоугольники",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Докажите, что диагонали AD, BE, CF вписанного шестиугольника ABCDEF пересекаются в одной точке в каждом из следующих случаев:    а) AB = BC, CD = DE, EF = FA;     б) AB = BC, CD = FA, EF = DE;     в) AB = DE, CD = FA, EF = BC.",
        "Решение: а) Прямые AD, BE, CF являются биссектрисами углов треугольника ACE.     б) Это следует из симметрии картинки относительно прямой BE.     в) Легко видеть, что AC || DF, AE || BD и CE || BF.  Поэтому наше утверждение – частный случай теоремы Дезарга (для треугольников ACE и DFB) (см. задачу 56907)."
    ],
    "57080": [
        "Правильные многоугольники",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Правильный многоугольник A1...An вписан в окружность радиуса R с центром O, X — произвольная точка.   Докажите, что  A1X² + ... + AnX² = n(R² + d²), где d = OX.",
        "Решение: Так как    то      (см. задачу 57077)."
    ],
    "79393": [
        "Пятиугольники",
        "Сложность: 3+",
        "Классы: 9",
        "Условие: В пятиугольнике проведены все диагонали. Какие семь углов между двумя диагоналями или между диагоналями и сторонами надо отметить, чтобы из равенства этих углов друг другу следовало, что пятиугольник – правильный?",
        "Решение: Отметим углы ABE, AСB, ADB, AEB, BAC, CAD и DBE. Если отмеченные углы равны α, то сумма углов треугольника ABD равна 5α, поэтому α = 36°. Построим правильный пятиугольник ABC'D'E' так, чтобы точки D' и D лежали по одну сторону от прямой AB. Тогда точки D' и D совпадают. Далее, треугольник ABC равнобедренный с углом 36° при основании AC. Поэтому точки C' и C тоже совпадают. Аналогично точки E' и E совпадают."
    ],
    "57641": [
        "Взаимоотношения между сторонами и углами треугольников (прочее)",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: В равнобедренном треугольнике ABC с основанием BC  угол при вершине A равен 80°. Внутри треугольника ABC  взята точка M так, что ∠MBC = 30° и ∠MCB = 10°. Найдите величину угла AMC.",
        "Решение: Построим на стороне AC равносторонний треугольник ANC (см. рис.).",
        "Ответ: 70°."
    ],
    "115339": [
        "Вспомогательные равные треугольники",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Пятиугольник ABCDE описан около окружности Ω. Сторона BC касается окружности s в точке K. Известно, что AB = BC = CD.   Докажите, что ∠EKB = 90°.",
        "Решение: Пусть стороны AB, CD, DE и AE касаются окружности   Ω в точках P, L, M и N соответственно. Тогда AN = AP, BP = BK, CK = CL, DL = DM,   EM = EN, а так как AB = BC = CD, то AN = AP = CK = CL.    Отрезки касательных, проведённых к окружности из точек A и C, равны, поэтому ∠EAB = ∠BCD, значит, треугольники ABN и CDK равны по двум сторонам и углу между ними. Следовательно, BN = KD и ∠ABN = ∠CDK. Аналогично ∠ABC = ∠CDE. Поэтому   ∠NBK = ∠ABC – ∠ABN = ∠CDE – ∠CDK = ∠KDM, значит, треугольники NBK и KDM также равны по двум сторонам и углу между ними. Поэтому треугольники ENK и EMK равны по трём сторонам. Следовательно, ∠AEK = ∠DEK. Таким образом, три угла четырёхугольника EABK соответственно равны трём углам четырёхугольника EDCK, значит, четвёртые углы также равны, то есть ∠BKE = ∠CKE, а так как они смежные, то каждый из них равен 90°."
    ],
    "78536": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Внутри равностороннего (не обязательно правильного) семиугольника",
        "Решение: Пусть без ограничения общности сторона семиугольника равна 1.  Пусть"
    ],
    "78768": [
        "Принцип Дирихле (углы и длины)",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Известно, что в кадр фотоаппарата, расположенного в точке",
        "Решение: Предположим, что на каждом снимке сфотографированы все остальные фотоаппараты  (за исключением того, которым сделан снимок). Тогда точки, в которых  расположены фотоаппараты, являются вершинами выпуклого 1000-угольника,  поскольку иначе найдётся фотоаппарат, из которого видны не все остальные.  Сумма всех углов 1000-угольника равна"
    ],
    "64594": [
        "Шестиугольники",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В выпуклом шестиугольнике ABCDEF противоположные стороны попарно параллельны (AB || DE, BC || EF, CD || FA), а также AB = DE.  Докажите, что BC = EF и CD = FA.",
        "Решение: Ясно, что ABDE – параллелограмм. ∠CBD = ∠FEA, а ∠BDC = ∠EAF как углы с соответственно параллельными сторонами. Следовательно, треугольники BCD и EFA равны по стороне и двум углам."
    ],
    "57058": [
        "Пятиугольники",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Докажите, что в правильный пятиугольник можно так вписать квадрат, что его вершины будут лежать на четырёх сторонах пятиугольника.",
        "Решение: Пусть перпендикуляры, восставленные к прямой AB в вершинах A и B пятиугольника ABCDE, пересекают стороны DE и CD в точках P и Q. Каждая точка отрезка CQ является вершиной прямоугольника (со сторонами, параллельными AB и AP), вписанного в наш пятиугольник, причём при перемещении этой точки от Q к C отношение длин сторон прямоугольников изменяется от AP/AB до 0. Так как угол AEP тупой, то AP > AE = AB. Поэтому для некоторой точки отрезка QC отношение длин сторон прямоугольника равно 1."
    ],
    "58167": [
        "Четность и нечетность",
        "Сложность: 4",
        "Классы: 7,8",
        "Условие: Вершины правильного 2n-угольника A1...A2n разбиты на n пар.   Докажите, что если n = 4m + 2 или n = 4m + 3, то две пары вершин являются концами равных отрезков.",
        "Решение: Предположим, что все пары вершин задают отрезки разной длины. Отрезку ApAq поставим всоответствие наименьшее из чисел |p – q| и 2n – |p – q|. В результате для данных n пар вершин получим числа 1, 2, ..., n. Заметим, что среди этих чисел чётных ровно k = 2m + 1, а нечётных – n – k. Нечётным числам соответствуют отрезки ApAq, где числа p и q разной чётности. Поэтому среди вершин остальных отрезков будет n – (n – k) = k вершин с чётными номерами. Поскольку эти отрезки соединяют вершины с номерами одной чётности, то k чётно. Противоречие."
    ],
    "58317": [
        "Классическая комбинаторика (прочее)",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Докажите, что число неравных треугольников с вершинами в вершинах правильного",
        "Решение: Пусть всего имеется N неравных треугольников с вершинами в вершинах правильного n-угольника, причём из них N1 правильных, N2 неправильных равнобедренных и N3 разносторонних. Каждый правильный треугольник равен одному треугольнику с фиксированной вершиной A, неправильный равнобедренный – трём треугольникам с вершиной A, а разносторонний – шести. Так как всего имеется ½ (n – 1)(n – 2) треугольников с вершиной A, то ½ (n – 1)(n – 2) = N1 + 3N2 + 6N3.    Ясно, что число неравных правильных треугольников равно 0 или 1, а число неравных равнобедренных равно n–1/2 или n/2 – 1, то есть N1 = 1 – c, N1 + N2 = ½ (n – 2 + d), где c и d равны 0 или 1. Поэтому      12N = 12(N1 + N2 + N3) = 2(N1 + 3N2 + 6N3) + 6(N1 + N2) + 4N1 = (n – 1)(n – 2) + 3(n – 2 + d) + 4(1 – c) = n² + 3d – 4c.    Так как |3d – 4c| < 6, то N совпадает с ближайшим к n²/12 целым числом."
    ],
    "76539": [
        "Разрезания (прочее)",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Дан выпуклый пятиугольник",
        "Решение: Проведём диагонали данного пятиугольника. Они разбивают его на 11 областей: один пятиугольник, 5 внутренних треугольников (сторонами которых служат диагонали) и 5 внешних треугольников (одной из сторон каждого из которых служит сторона пятиугольника). Если точка"
    ],
    "78165": [
        "Геометрические неравенства (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: В многоугольнике существуют такие точки",
        "Решение: Пусть сначала отрезок"
    ],
    "78531": [
        "Ромбы. Признаки и свойства",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Через противоположные вершины",
        "Решение: Пусть"
    ],
    "79429": [
        "Пятиугольники",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Существует ли пятиугольник со сторонами 3, 4, 9, 11 и 13 см, в который можно вписать окружность?",
        "Решение: Ответ:",
        "Ответ: ABCDE"
    ],
    "111626": [
        "Углы, опирающиеся на равные дуги и равные хорды",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Семиугольник, три угла которого равны по",
        "Решение: Пусть в данном семиугольнике есть два соседних угла по",
        "Ответ: Нет."
    ],
    "56500": [
        "Шестиугольники",
        "Сложность: 4+",
        "Классы: 8,9",
        "Условие: Шестиугольник ABCDEF вписан в окружность радиуса R с центром O, причём AB = CD = EF = R. Докажите, что точки попарного пересечения описанных окружностей треугольников BOC, DOE и FOA, отличные от точкиO, являются вершинами правильного треугольника со стороной R.",
        "Решение: Пусть K, L, M – точки пересечения описанных окружностей треугольников FOA и BOC, BOC и DOE, DOE   и FOA; 2α, 2β и 2γ – углы при вершинах равнобедренных треугольников BOC, DOE и FOA (см. рис.). Точка K лежит на дуге OB описанной окружности равнобедренного треугольника BOC, поэтому ∠OKB = 180° – ∠OCB = 90° + α. Аналогично ∠OKA = 90° + γ. Так как α + β + γ = 90°, то ∠AKB = 90° + β. Внутри правильного треугольника AOB существует единственная точка K, из которой его стороны видны под данными углами. Аналогичные рассуждения для точки L, лежащей внутри треугольника COD, показывают, что треугольники OKB и CLO равны.    ∠COL = ∠KBO, поэтому ∠KOB + ∠COL = 180° – ∠OKB = 90° – α, а значит, ∠KOL = 2α + (90° – α) = 90° + α = ∠OKB. Следовательно, треугольники KOL и OKB тоже равны, и KL = OB = R. Аналогично LM = MK = R."
    ],
    "61158": [
        "Правильные многоугольники",
        "Сложность: 4+",
        "Классы: 10,11",
        "Условие: Правильный n-угольник вписан в единичную окружность. Докажите, что    а) сумма квадратов длин всех сторон и всех диагоналей равна n²;   б) сумма длин всех сторон и всех диагоналей равна n ctg π/2n;   в) произведение длин всех сторон и всех диагоналей равно nn/2.",
        "Подсказка: а) Воспользуйтесь задачей 57080.     б) Воспользуйтесь задачей 61123 б).     в) Воспользуйтесь задачей 61202 а)-б).",
        "Решение: а) Согласно задаче 57080 сумма квадратов расстояний от каждой вершины n-угольника до всех остальных вершин равна 2n. Поскольку квадрат каждой из сторон и диагоналей входит ровно в две из n таких сумм, искомая сумма равна n²."
    ],
    "109040": [
        "Вписанные и описанные многоугольники",
        "Сложность: 4+",
        "Классы: 8,9",
        "Условие: Доказать, что если у шестиугольника противоположные стороны параллельны и  диагонали, соединяющие противоположные вершины, равны, то вокруг него можно  описать окружность.",
        "Решение: Первое решение:"
    ],
    "58085": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 4+",
        "Классы: 8,9,10",
        "Условие: Вквадрате со стороной1 находится51 точка. Докажите, что какие-то три из них можно накрыть кругом радиуса 1/7.",
        "Решение: Разрежем данный квадрат на25 одинаковых квадратиков со стороной 0, 2. Водин из них попадает не меньше трех точек. Радиус описанной окружности квадрата со стороной 0, 2 равен"
    ],
    "76553": [
        "Выпуклые многоугольники",
        "Сложность: 4+",
        "Классы: 10,11",
        "Условие: Внутри квадрата",
        "Решение: Предположим, что требуемого выпуклого пятиугольника нет. Проведём из точки"
    ],
    "78547": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 5",
        "Классы: 10,11",
        "Условие: Пирог имеет форму правильного n-угольника, вписанного в окружность радиуса 1. Из середин сторон проведены прямолинейные надрезы длины 1. Доказать, что при этом от пирога будет отрезан какой-нибудь кусок.",
        "Решение: Пусть O – центр пирога. Легко видеть, что окружность, построенная на BO как на диаметре, проходит через середины K и L сторон сторон AB и BC (см. рис.)."
    ],
    "111642": [
        "Прямые и кривые, делящие фигуры на равновеликие части",
        "Сложность: 5",
        "Классы: 8,9,10,11",
        "Условие: Нарисуйте многоугольник и точку на его границе так, что любая прямая, проходящая через эту точку, делит площадь этого многоугольника пополам.",
        "Решение: Пусть нужная нам точка на границе многоугольника —"
    ],
    "57006": [
        "Многоугольники (прочее)",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Докажите, что в выпуклый четырехугольник"
    ],
    "79300": [
        "Вписанные и описанные многоугольники",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: В окружность вписан выпуклый 7-угольник. Известно, что какие-то три его угла равны",
        "Решение: Если точки"
    ],
    "55464": [
        "Теорема Птолемея",
        "Сложность: 5",
        "Классы: 8,9",
        "Условие: Пусть A1A2...An – правильный многоугольник с нечётным числом сторон, M – произвольная точка на дуге A1An окружности, описанной около многоугольника. Докажите, что сумма расстояний от точки M до вершин с нечётными номерами равна сумме расстояний от M до вершин с чётными номерами.",
        "Подсказка: Примените теорему Птолемея для n четырёхугольников MA1A2A3, MA2A3A4 и т.д.",
        "Решение: Рассмотрим сначала случай n = 5. Обозначим   A1A2 = a, A1A3 = A2A4 = A3A5 = A5A2 = A1A4 = b, MAi = di.   Применив теорему Птолемея к пяти вписанным четырёхугольникам MA1A2A3, MA2A3A4, MA3A4A5, A4A5MA1 и A5MA1A2, получим следующие равенства:   ad1 + ad3 = bd2,   bd3 = ad2 + ad4,  ad3 + ad5 = bd4,  ad1 + bd5 = ad4,  bd1 + ad5 = ad2.  Сложив их почленно, получим, что (2a + b)(d1 + d2 + d3) = (2a + b)(d2 + d4).  Следовательно, d1 + d3 + d5 = d2 + d4.   Доказательство для любого правильного n-угольника с нечётным числом сторон практически аналогично."
    ],
    "111051": [
        "Сумма внутренних и внешних углов многоугольника",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Найдите число",
        "Решение: Сумма внутренних углов выпуклого",
        "Ответ: 10.00"
    ],
    "111052": [
        "Сумма внутренних и внешних углов многоугольника",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Найдите число",
        "Ответ: 13.00"
    ],
    "111633": [
        "Правильные многоугольники",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что площадь правильного двенадцатиугольника, вписанного в окружность радиуса 1, равна 3.",
        "Решение: Разрежем двенадцатиугольник тремя большими диагоналями на шесть равных четырёхугольников. Одна из диагоналей такого четырёхугольника – радиус окружности, а вторая – хорда, соответствующая центральному углу в 60°. Поэтому диагонали перпендикулярны и равны, значит, площадь четырёхугольника равна ½."
    ],
    "111706": [
        "Правильные многоугольники",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Существует ли правильный многоугольник, в котором ровно половина диагоналей параллельна сторонам?",
        "Решение: Диагональ параллельна стороне, если между концами стороны и концами диагонали находится по равному числу сторон. Значит, диагональ параллельна какой-то стороне, если один из отсекаемых ею многоугольников имеет чётное число сторон. Поэтому если число сторон правильного многоугольника нечётно, то каждая его диагональ параллельна какой-то стороне. Если же число сторон чётно (равно 2k), то из каждой вершины выходит 2k – 3 диагонали, из которых только каждая чётная по порядку, считая от стороны, параллельна какой-то стороне, то есть диагоналей, параллельных сторонам, меньше половины.",
        "Ответ: Не существует."
    ],
    "32071": [
        "Шестиугольники",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: a1, a2, a3, a4, a5, a6 – последовательные стороны шестиугольника, все углы которого равны. Докажите, что a1 – a4 = a3 – a6 = a5 – a2.",
        "Решение: Продолжим стороны данного шестиугольника ABCDEF до пересечения друг с другом. Шестиугольник оказался представленным в виде пересечения двух равносторонних треугольников KMO и LNP (см. рис.) со сторонами b и c соответственно. Объединение этих треугольников представляет собой шестиконечную звезду, лучи которой ABK, BCL, CDM, DEN, EFO и FAP являются равносторонними треугольниками. Следовательно,  b – c = KM – LN = (KB + BC + CM) – (LC + CD + DN) = KB + (BC – LC) + (CM – CD) – DN = a1 + 0 + 0 – a4 = a1 – a4."
    ],
    "57007": [
        "Многоугольники (прочее)",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: а) Докажите, что оси симметрии правильного многоугольника пересекаются в одной точке."
    ],
    "53469": [
        "Сумма внутренних и внешних углов многоугольника",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Найдите сумму внутренних углов:     а) четырёхугольника;     б) выпуклого пятиугольника;     в) выпуклого n-угольника.",
        "Подсказка: Все n – 3 диагонали выпуклого n-угольника, проведённые из произвольной вершины, разбивают его на n – 2 треугольника.",
        "Ответ: а) 360°; б) 540°;  в) 180°(n – 2)."
    ],
    "57068": [
        "Правильные многоугольники",
        "Сложность: 3+",
        "Классы: 9",
        "Условие: Бумажная лента постоянной ширины завязана простым узлом и затем стянута так, чтобы узел стал плоским (см. рис.).   Докажите, что узел имеет форму правильного пятиугольника.",
        "Решение: Обозначим вершины пятиугольника так, как показано на рисунке. Если в треугольнике две высоты равны, то равны и стороны, на которые опущены эти высоты. Рассматривая треугольники EAB, ABC и BCD, получаем EA = AB, AB = BC и BC = CD. Поэтому трапеции EABC и ABCD равнобедренные, то есть ∠A = ∠B = ∠C. Рассматривая треугольники ABD и BCE, получаем AD = BD и BE = CE. Так как треугольники EAB, ABC, BCD равны, то  BE = AC = BD. Поэтому AD = BE и BD = CE, то есть трапеции ABDE и CDEB равнобедренные.  Следовательно, ED = AB = BC = CD = AE и   ∠E = ∠A = ∠B = ∠C = ∠D, то есть ABCDE — правильный пятиугольник."
    ],
    "57074": [
        "Правильные многоугольники",
        "Сложность: 3+",
        "Классы: 9",
        "Условие: В правильном n-угольнике (n ≥ 3) отмечены середины  всех сторон и диагоналей.   Какое наибольшее число отмеченных точек лежит на одной окружности?",
        "Решение: Рассмотрим два случая.    1) n = 2m. Диагонали и стороны правильного 2m-угольника имеют m различных длин. Поэтому отмеченные точки лежат на m – 1 концентрических окружностях (по n точек на каждой) или в общем центре этих окружностей. Поскольку различные окружности имеют не более двух общих точек, окружность, не принадлежащая этому семейству концентрических окружностей, содержит не более 1 + 2(m – 1) = 2m – 1 = n – 1 отмеченных точек.     2) n = 2m + 1. Диагонали и стороны правильного (2m+1)-угольника имеют m различных длин. Поэтому отмеченные точки лежат на m концентрических окружностях (по n точек на каждой). Окружность, не принадлежащая этому семейству концентрических окружностей, содержит не более 2m = n – 1 отмеченных точек.     В обоих случаях наибольшее число отмеченных точек, лежащих на одной окружности, равно n.",
        "Ответ: n точек."
    ],
    "64330": [
        "Пятиугольники",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Существует ли пятиугольник, который одним прямолинейным разрезом можно разбить на три части так, что из двух частей можно будет сложить третью?",
        "Решение: Рассмотрим, например, пятиугольник АВСDE, составленный из прямоугольника АВXY с отношением сторон АВ : АY = 2 : 1 и прямоугольных треугольников CDX и EDY, равных треугольнику АВX (см. рис.).",
        "Ответ: Cуществует."
    ],
    "64678": [
        "Сумма внутренних и внешних углов многоугольника",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Сколько сторон может иметь выпуклый многоугольник, у которого сумма тупых углов равна 3000°?",
        "Решение: Заметим, что выпуклый многоугольник не может иметь более трёх не тупых углов (если это не прямоугольник). Действительно, если таких углов больше трёх, то внешние углы, смежные с ними, – не острые, а это противоречит тому, что сумма внешних углов выпуклого многоугольника (взятых по одному при каждой вершине) равна 360°.    Таким образом, сумма углов данного многоугольника равна 3000° + S°, где 0 ≤ S ≤ 270. Пусть у него n сторон, тогда 180(n – 2) = 3000 + S, то есть  n = 2 + (3000 + S) : 180  ⇔ n = 18 + (120 + S) : 180. Учитывая, что n – натуральное число, получим: S = 60; n = 19 или S = 240, n = 20.    19-угольник, у которого один острый угол величиной 60° и 18 тупых углов с заданной суммой, равно как и 20-угольник с тремя острыми углами, сумма которых 240°, и 17 тупых углов с заданной суммой построить несложно. Например, в первом случае отложим на окружности последовательно 19 хорд, соответствующих центральному углу 131/3°. Продолжив концы крайних хорд до пересечения, получим 19-угольник, у которого 18 углов равны по 1662/3°.",
        "Ответ: 19 или 20."
    ],
    "57008": [
        "Многоугольники (прочее)",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: а) Докажите, что сумма углов при вершинах выпуклого"
    ],
    "65919": [
        "Правильные многоугольники",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Правильный пятиугольник и правильный двадцатиугольник вписаны в одну и ту же  окружность.   Что больше: сумма квадратов длин всех сторон пятиугольника или сумма квадратов длин всех сторон двадцатиугольника?",
        "Решение: Заметим, что в правильном двадцатиугольнике вершины, взятые через одну, образуют правильный десятиугольник, а вершины этого десятиугольника, взятые через одну, образуют правильный пятиугольник. Достаточно сравнить две величины:  и ,  где a20 и a5 – длины сторон правильных двадцатиугольника и пятиугольника соответственно. Докажем, что ,  то есть сумма квадратов сторон пятиугольника больше.",
        "Ответ: Сумма квадратов длин сторон правильного пятиугольника."
    ],
    "78806": [
        "Правильные многоугольники",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Каждая вершина правильного 13-угольника покрашена либо в чёрный, либо в белый  цвет.   Доказать, что существуют три точки одного цвета, лежащие в вершинах  равнобедренного треугольника.",
        "Подсказка: См. задачу 73681 а."
    ],
    "101897": [
        "Сумма внутренних и внешних углов многоугольника",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В выпуклом шестиугольнике",
        "Подсказка: Пусть прямые",
        "Решение: Пусть прямые",
        "Ответ: 6 и 8."
    ],
    "101898": [
        "Сумма внутренних и внешних углов многоугольника",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В выпуклом шестиугольнике",
        "Ответ: 12 и 16."
    ],
    "104112": [
        "Многоугольники (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: В вершинах правильного девятиугольника расставляют числа 1, 2, 3, 4, 5, 6, 7, 8, 9, после чего на каждой диагонали пишут произведение чисел, стоящих наеё концах. Можно ли так расставить числа в вершинах, чтобы все числа на диагоналях были разные?",
        "Решение: Например, числа можно расставить в таком порядке: 3 – 8 – 1 – 6 – 2 – 9 – 4 – 5 – 7.",
        "Ответ: Можно."
    ],
    "55719": [
        "Правильные многоугольники",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что середины сторон правильного многоугольника образуют правильный многоугольник.",
        "Подсказка: См. задачу 116237.",
        "Решение: Правильный n-угольник переходит в себя при повороте на угол   вокруг его центра. При этом n-угольник с вершинами в серединах сторон данного также переходит в себя. Следовательно, он правильный."
    ],
    "78092": [
        "Правильные многоугольники",
        "Сложность: 3+",
        "Классы: 11",
        "Условие: На продолжениях сторон A1A2, A2A3, ..., AnA1 правильного n-угольника (n ≥ 5) A1A2...An построить точки B1, B2, ..., Bn так, чтобы B1B2 было перпендикулярно к A1A2, B2B3 перпендикулярно к A2A3, ..., BnB1  перпендикулярно к AnA1.",
        "Решение: Пусть xk = Ak+1Bk, α — внешний угол правильного n-угольника, a — длина его стороны. Тогда x1 = (a + x2) cos α, x2 = (a + x3) cos α, ...,  xn = (a + x1) cos α. Тогда x1 = a1 + b1x2 = a2 + b2x3 = ... = an + bnx1, где   bn = (cos α)n ≠ 1. Поэтому x1 (а также и xk для любого k) определено однозначно. Ясно также, что мы получим решение, если положим x1 = x2 = ... = xn = x, где x = (a + x) cos α, то есть"
    ],
    "78147": [
        "Правильные многоугольники",
        "Сложность: 3+",
        "Классы: 11",
        "Условие: На стол кладут правильный 100-угольник, в вершинах которого написаны числа  1, 2, ..., 100. Затем эти числа переписывают в порядке удаления от переднего  края стола. Если две вершины находятся на равном расстоянии от края, сначала  выписывается левое число, затем правое. Выписаны всевозможные наборы чисел,  соответствующие разным положениям 100-угольника. Вычислить сумму чисел,  стоящих в этих наборах на 13-х местах слева.",
        "Решение: В силу симметрии правильного 100-угольника каждое число встречается  в наборах на 13-м месте одинаковое количество раз, а значит, количество наборов кратно 100. Если непрерывно поворачивать правильный 100-угольник против часовой стрелки вокруг его центра, то, во-первых, все наборы встретятся, а во-вторых, смена наборов если и будет происходить, то только тогда, когда одна из диагоналей или сторон 100-угольника будет параллельна краю стола. Всего различных направлений сторон у правильного 100-угольника 50. Каждая диагональ параллельна либо стороне, либо диагонали, соединяющей вершины многоугольника, идущие через одну, – таких различных направлений еще 50. За полный оборот 100-угольника смена наборов происходит не более двух раз по каждому направлению, а значит, всего не более 200 раз. Теперь заметим, что число 1 встречается на первом месте как минимум в двух наборах (когда на втором месте стоит 2 и когда на втором месте стоит 100), а количество наборов кратно 100, значит, всего различных наборов ровно 200. Следовательно, сумма чисел, стоящих в этих наборах на 13-х местах слева,  равна 2·(1 + 2 + ... + 100) = 10100.",
        "Ответ: 10100."
    ],
    "78518": [
        "Шестиугольники",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В шестиугольнике",
        "Решение: Проведём через точки"
    ],
    "78523": [
        "Шестиугольники",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: См.",
        "Решение: Воспользуемся решением"
    ],
    "35643": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: У правильного 5000-угольника покрашено 2001 вершина.   Докажите, что найдутся три покрашенные вершины, лежащие в вершинах равнобедренного треугольника.",
        "Подсказка: Если у правильного пятиугольника покрашены три вершины, то они лежат в вершинах равнобедренного треугольника.",
        "Решение: В правильном 5000-угольнике разобьём все вершины на 1000 групп по пять вершин, расположенных через 999 последовательных вершин. Точки в каждой группе являются вершинами правильного пятиугольника. Покрашенных вершин всего 2001 = 2·1000 + 1, следовательно, в какой-то из групп вершин покрашено не менее трёх. Но каждые три вершины правильного пятиугольника лежат в вершинах равнобедренного треугольника."
    ],
    "64889": [
        "Сумма внутренних и внешних углов многоугольника",
        "Сложность: 2+",
        "Классы: 10,11",
        "Условие: Существует ли выпуклый 1000-угольник, у которого все углы выражаются целыми числами градусов?",
        "Решение: Если внутренние углы многоугольника выражаются целыми числами, то и его внешние углы – целые числа. Но у любого выпуклого многоугольника сумма внешних углов равна 360°, а сумма тысячи любых натуральных чисел больше чем 360.",
        "Ответ: Не существует."
    ],
    "77893": [
        "Шестиугольники",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В произвольном (",
        "Решение: Точкой пересечения медиан каждого из рассматриваемых треугольников служит центр масс шестиугольника (т.е. центр масс шести вершин шестиугольника, в которые помещены одинаковые массы)."
    ],
    "52519": [
        "Вписанные и описанные многоугольники",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Около окружности описан многоугольник. Точки касания его сторон с окружностью служат вершинами второго, вписанного в эту окружность многоугольника. Докажите, что произведение расстояний от произвольной точки M окружности до сторон (или их продолжений) одного многоугольника равно произведению расстояний от этой точки до сторон (или их продолжений) второго.",
        "Подсказка: Расстояние от точки M, лежащей на окружности, до хорды есть среднее геометрическое расстояний от этой точки до касательных, проведённых через концы хорды.",
        "Решение: Лемма. Если M, P и Q – три произвольные  точки данной окружности, то расстояние MK от точки M до прямой PQ равно среднему геометрическому расстояний ML и MN от M до касательных, проведённых в точках P и Q: MK² = ML·MN.  (1)    Доказательство. Будем считать, что M не совпадает  с P или Q (в вырожденном случае равенство  очевидно)."
    ],
    "57069": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 9",
        "Условие: На сторонах AB, BC, CD и DA квадрата ABCD  построены внутренним образом правильные треугольники ABK, BCL, CDM и DAN. Докажите, что середины сторон этих треугольников (не  являющихся сторонами квадрата) и середины отрезков KL, LM, MN  и NK образуют правильный двенадцатиугольник.",
        "Решение: Треугольник BMC равнобедренный с углом при вершине 30° и углом при основании 75°. Следовательно, треугольники BAM и BCN равнобедренные с углом 15° при основании. Поэтому   треугольник BMN правильный. Пусть O – центр квадрата,  P и Q – середины отрезков MN и BK (см. рис.). Так как OQ – средняя линия треугольника MBK, то OQ = 1/2 BM = MP = OP и  ∠QON = ∠MBA = 15°, а значит, ∠POQ = ∠PON – ∠QON = 30°.     Дальнейшее доказательство проводится аналогично."
    ],
    "57072": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: В правильном восемнадцатиугольнике A0...A17 проведены диагонали A0Ap+3, Ap+1A18–r и A1Ap+q+3.   Докажите, что указанные диагонали пересекаются в одной точке в любом из следующих случаев:     а) {p, q, r} = {1, 3, 4},    б) {p, q, r} = {2, 2, 3}.",
        "Решение: Применим теорему Чевы (см. зад. 35216) к шестиугольнику A0A1Ap+1Ap+3Ap+q+3A18–r."
    ],
    "57083": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Правильный n-угольник A1...An вписан в окружность радиуса R с центром O,   ei = , x =  – произвольный вектор.   Докажите, что  Σ (ei, x)² = ½ nR²·OX².",
        "Решение: Пусть Bi – проекция точки X на прямую OAi. Тогда (ei, x) = (,  + ) = (, ) = ±R·OBi. Точки B1, ..., Bn лежат на окружности с диаметром OX и являются  вершинами правильного n-угольника при n нечётном и вершинами n/2-угольника, взятыми по два раза, при n чётном (см. задачу 56549). Поэтому Σ OBi² = n/2 OX² (см. задачу 57080)."
    ],
    "65993": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: В правильном 21-угольнике шесть вершин покрашены в красный цвет, а семь вершин – в синий.   Обязательно ли найдутся два равных треугольника, один из которых с красными вершинами, а другой – с синими?",
        "Решение: Рассмотрим повороты вокруг центра данного многоугольника на все углы вида 2πk/21, где k = 1, 2, ..., 20, по часовой стрелке. Тогда каждая синяя точка попадёт по одному разу в каждую из остальных вершин 21-угольника. Следовательно, каждая синяя точка по одному разу совпадёт с каждой красной точкой, то есть всего таких совпадений будет 6·7 = 42. Так как все такие совпадения приходятся на 20 ненулевых поворотов (в исходном положении совпадений нет), то по принципу Дирихле найдётся поворот, при котором будет не менее трёх совпадений. Значит, при этом повороте образом какого-то треугольника с синими вершинами является треугольник с красными вершинами. Следовательно, эти треугольники равны.",
        "Ответ: Обязательно."
    ],
    "65983": [
        "Сумма внутренних и внешних углов многоугольника",
        "Сложность: 2+",
        "Классы: 9,10,11",
        "Условие: В выпуклом четырёхугольнике тангенс одного из углов равен числу m. Могут ли тангенсы каждого из трёх остальных углов также равняться m?",
        "Решение: Из условия следует, что в четырёхугольнике нет прямых углов. Так как сумма его углов равна 360°, то есть хотя бы один тупой угол и хотя бы один острый угол. Но тангенсы тупого и острого углов имеют разные знаки.",
        "Ответ: Не могут."
    ],
    "78500": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: В правильном десятиугольнике провели все диагонали. Сколько попарно неподобных треугольников имеется на этом рисунке?",
        "Решение: Зафиксируем одну из сторон. Нетрудно понять, что все диагонали и стороны десятиугольника образуют с ней углы, кратные 18°. Поэтому углы всех образованных треугольников кратны 18°. Следовательно, искомое количество треугольников не больше количества способов представить число 10 в виде суммы трех натуральных чисел с точностью до порядка слагаемых. Всего таких способов 8: 1 + 1 + 8, 1 + 2 + 7, 1 + 3 + 6, 1 + 4 + 5, 2 + 2 + 6, 2 + 3 + 5,   2 + 4 + 4, 3 + 3 + 4.     Каждый такой способ легко реализовать, разбив стороны десятиугольника на три соответствующие группы и соединив разделяющие эти группы вершины.",
        "Ответ: 8 треугольников."
    ],
    "79399": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: У правильного 1981-угольника отмечены 64 вершины. Доказать, что существует  трапеция с вершинами в отмеченных точках.",
        "Решение: Рассмотрим все отрезки с концами в отмеченных точках. Так как никакие три из отмеченных 64 точек не лежат на одной прямой, то таких отрезков будет   64&middot63 : 2 = 2016 > 1981. Из задачи 116573 следует, что среди этих отрезков будет хотя бы одна пара параллельных. Четырёхугольник с вершинами в концах этих отрезков – искомый (он не может быть параллелограммом, так как не существует параллелограмма с вершинами в вершинах правильного 1981-угольника)."
    ],
    "79513": [
        "Пятиугольники",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: В выпуклом пятиугольнике ABCDE углы при вершинах B и D – прямые, ∠BCA = ∠DCE, а точка M – середина стороны AE. Доказать, что MB = MD.",
        "Решение: Пусть P – середина диагонали AC, Q – середина диагонали CE. Тогда BP = PA = MQ и PM = QE = QD. Кроме того, ∠APM = ∠MQE и   ∠BPA = ∠EQD, поэтому ∠BPM = ∠MQD. Следовательно, треугольники BPM и MQD равны, а значит, BM = MD."
    ],
    "116237": [
        "Правильные многоугольники",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что выпуклый n-угольник является правильным тогда и только тогда, когда он переходит в себя при повороте на угол 360°/n вокруг некоторой точки.",
        "Решение: Правильный"
    ],
    "56503": [
        "Сумма внутренних и внешних углов многоугольника",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: На сторонах произвольного треугольника ABC внешним образом  построены равнобедренные треугольники с углами 2α, 2β и   2γ при вершинах A', B' и C', причём α + β + γ = 180°. Докажите, что углы треугольника A'B'C' равны  α, β и γ.",
        "Решение: Заметим сначала, что сумма углов при вершинах A, B и C   шестиугольника AB'CA'BC' равна 360°, так как по условию сумма его углов при остальных вершинах равна 360°. Построим на стороне AC' внешним образом треугольник AC'P, равный треугольнику BC'A' (см. рис.). Тогда треугольники AB'P и CB'A' равны, так как   AB' = CB', AP = CA' и ∠PAB' = 360° – ∠PAC' – ∠C'AB' = 360° – ∠A'BC' – ∠C'AB' = ∠A'CB'. Следовательно, треугольники C'B'A' и C'B'P равны, а значит, 2∠A'B'C' = ∠PB'A' = ∠AB'C, так как ∠PB'A = ∠A'B'C."
    ]
}