{
    "35417": [
        "Принцип крайнего  (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: На небе бесконечное число звёзд. Астроном приписал каждой звезде пару натуральных чисел, выражающую яркость и размер. При этом каждые две звезды отличаются хотя бы в одном параметре. Докажите, что найдутся две звезды, первая из которых не меньше второй как по яркости, так и по размеру.",
        "Решение: Так как звёзд бесконечное число, то хотя бы один из параметров принимает бесконечное число значений. Пусть это размер. Тогда выберем звезду А с наименьшей яркостью. Пусть размер звезды А выражается числом n. Поскольку размер принимает бесконечное количество значений, найдётся звезда B размера больше n. Она не уступает звезде A ни по яркости, ни по размеру."
    ],
    "78109": [
        "Принцип крайнего  (прочее)",
        "Сложность: 5",
        "Классы: 11",
        "Условие: Плоский многоугольник",
        "Решение: Если"
    ],
    "58051": [
        "Наименьший или наибольший угол",
        "Сложность: 5",
        "Классы: 8,9",
        "Условие: Внутри остроугольного треугольника взята точка",
        "Решение: Опустим из точки"
    ],
    "58064": [
        "Наибольший треугольник",
        "Сложность: 5",
        "Классы: 9",
        "Условие: Пусть",
        "Решение: Для определенности можно считать, что"
    ],
    "58065": [
        "Наибольший треугольник",
        "Сложность: 5",
        "Классы: 9",
        "Условие: Докажите, что если центр вписанной окружности  четырехугольника совпадает сточкой пересечения диагоналей,  то четырехугольник— ромб.",
        "Решение: Пусть"
    ],
    "58066": [
        "Наибольший треугольник",
        "Сложность: 5",
        "Классы: 9",
        "Условие: Пусть",
        "Решение: Для определенности можно считать, что"
    ],
    "58068": [
        "Выпуклая оболочка и опорные прямые (плоскости)",
        "Сложность: 5",
        "Классы: 8,9",
        "Условие: На плоскости даны 2",
        "Решение: Пусть"
    ],
    "58069": [
        "Выпуклая оболочка и опорные прямые (плоскости)",
        "Сложность: 5",
        "Классы: 8,9",
        "Условие: Докажите, что любой выпуклый многоугольник площади1 можно поместить впрямоугольник площади2.",
        "Решение: Пусть"
    ],
    "58070": [
        "Выпуклая оболочка и опорные прямые (плоскости)",
        "Сложность: 5",
        "Классы: 8,9",
        "Условие: На плоскости дано конечное число точек. Докажите, что из них всегда можно выбрать точку, для которой ближайшими кней являются не более трех данных точек.",
        "Решение: Выберем наименьшее из всех попарных расстояний между данными точками ирассмотрим точки, укоторых есть соседи на таком расстоянии. Достаточно доказать требуемое утверждение для этих точек. Пусть"
    ],
    "58071": [
        "Выпуклая оболочка и опорные прямые (плоскости)",
        "Сложность: 5",
        "Классы: 8,9",
        "Условие: На столе расположено",
        "Решение: Предположим, что есть картонные квадраты, не совпадающие спластмассовыми. Выбросим из рассмотрения все совпадающие квадраты ирассмотрим выпуклую оболочку вершин оставшихся квадратов. Пусть"
    ],
    "58078": [
        "Принцип крайнего  (прочее)",
        "Сложность: 5",
        "Классы: 8,9,10",
        "Условие: На плоскости дано",
        "Решение: Решение 1:"
    ],
    "35484": [
        "Наименьшее или наибольшее расстояние (длина)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: На столе лежат монеты без наложений. Докажите, что одну из них можно выдвинуть, не задевая остальных.",
        "Подсказка: Выдвигайте монету c наиболее удаленным относительно некоторого направления центром.",
        "Решение: Введём некоторую прямоугольную систему координат на плоскости. Рассмотрим монету, центр которой имеет наибольшую ординату. Обозначим через C и r её центр и радиус. Докажем, что эту монету можно выдвинуть вверх, не задевая оставшихся.     Предположим противное – в полосе, которую заметает монета при движении вверх, нашлась точка А, принадлежащая другой монете с центром С' и радиусом r'. Проведём через С горизонтальную прямую m и обозначим через А' проекцию точки А на m. Согласно выбору точки С, точка С' находится не выше прямой m. Поэтому С'A' < C'A < r'. Отсюда следует, что точка A' принадлежит как первой монете, так и второй, а это противоречит условию."
    ],
    "58079": [
        "Принцип крайнего  (прочее)",
        "Сложность: 5",
        "Классы: 8,9",
        "Условие: Дан выпуклый многоугольник",
        "Решение: Рассмотрим все окружности, проходящие через две соседние вершины"
    ],
    "58059": [
        "Наименьшее или наибольшее расстояние (длина)",
        "Сложность: 5+",
        "Классы: 8,9",
        "Условие: На плоскости дано конечное число точек, причем любая прямая, проходящая через две из данных точек, содержит еще одну данную точку. Докажите, что все данные точки лежат на одной прямой (Сильвестр).",
        "Решение: Предположим, что не все данные точки лежат на одной  прямой. Проведем через каждую пару данных точек прямую (этих  прямых конечное число) ивыберем наименьшее ненулевое расстояние  от данных точек до этих прямых. Пусть наименьшим будет  расстояние от точки"
    ],
    "110807": [
        "Принцип крайнего  (прочее)",
        "Сложность: 5+",
        "Классы: 9,10,11",
        "Условие: На плоскости даны точки",
        "Решение: Выберем на плоскости начало координат"
    ],
    "58052": [
        "Наименьший или наибольший угол",
        "Сложность: 6",
        "Классы: 8,9",
        "Условие: а) Длины биссектрис треугольника не превосходят1. Докажите, что его площадь не превосходит 1/",
        "Решение: а) Пусть для определенности"
    ],
    "58060": [
        "Наименьшее или наибольшее расстояние (длина)",
        "Сложность: 6",
        "Классы: 8,9",
        "Условие: На плоскости дано конечное число попарно непараллельных прямых, причем через точку пересечения любых двух из них проходит еще одна из данных прямых. Докажите, что все эти прямые проходят через одну точку.",
        "Решение: Предположим, что не все прямые проходят через одну  точку. Рассмотрим точки пересечения прямых ивыберем наименьшее  ненулевое расстояние от этих точек до данных прямых. Пусть  наименьшим будет расстояние от точки"
    ],
    "58046": [
        "Наименьший или наибольший угол",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что если длины всех сторон треугольника меньше1, то его площадь меньше",
        "Решение: Пусть"
    ],
    "58061": [
        "Наименьшее или наибольшее расстояние (длина)",
        "Сложность: 6",
        "Классы: 8,9",
        "Условие: На плоскости дано",
        "Решение: Пусть"
    ],
    "58072": [
        "Выпуклая оболочка и опорные прямые (плоскости)",
        "Сложность: 6",
        "Классы: 8,9",
        "Условие: На плоскости дано",
        "Решение: Рассмотрим выпуклую оболочку данных точек. Возможны два случая."
    ],
    "76496": [
        "Принцип крайнего  (прочее)",
        "Сложность: 6",
        "Классы: 10,11",
        "Условие: Некоторое количество точек расположено на плоскости так, что каждые 3 из них можно заключить в круг радиуса",
        "Решение: Рассмотрим круг, содержащий все данные точки. Будем уменьшать радиус такого круга до тех пор, пока это возможно. Пусть"
    ],
    "58073": [
        "Выпуклая оболочка и опорные прямые (плоскости)",
        "Сложность: 6+",
        "Классы: 8,9",
        "Условие: На плоскости дано несколько точек, попарные расстояния между которыми не превосходят 1. Докажите, что эти точки можно покрыть правильным треугольником со стороной",
        "Решение: Рассмотрим три прямые, попарно образующие углы"
    ],
    "61399": [
        "Уравнения в целых числах",
        "Сложность: 2",
        "Классы: 8,9,10",
        "Условие: Докажите, что уравнение  x/y + y/z + z/x = 1  неразрешимо в натуральных числах.",
        "Подсказка: x/y·y/z·z/x = 1."
    ],
    "88082": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Можно ли разложить 44 шарика на 9 кучек так, чтобы количество шариков в разных кучках было различным?",
        "Подсказка: Подумайте, сколько нужно шариков, чтобы выполнить условие задачи.",
        "Решение: Предположим, нам это удалось. Упорядочим кучки по возрастанию количества шариков. Тогда в первой кучке должно быть не меньше одного шарика, во второй – не меньше двух, в третьей – не меньше трёх и т. д. Всего шариков должно быть не меньше чем 1 + 2 + 3 + ... + 9 = 45. А у нас только 44. Противоречие.",
        "Ответ: Нельзя."
    ],
    "35578": [
        "Комбинаторика (прочее)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Сколькими способами можно переставить числа от 1 до 100 так, чтобы соседние числа отличались не более, чем на 1?",
        "Подсказка: Где может стоять число 1?",
        "Решение: Рядом с числом 1 может стоять только 2, поэтому 1 стоит с краю. Допустим, что 1 стоит в начале. Тогда следующее число – 2, следующее – 3 (других чисел рядом с 2 быть не может), следующее – 4 и т. д. Получаем расстановку 1, 2, ..., 99, 100.",
        "Ответ: Двумя способами."
    ],
    "107674": [
        "Признаки и свойства параллелограмма",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Из всякого ли выпуклого четырехугольника можно вырезать параллелограмм, три вершины которого совпадают с тремя вершинами этого четырехугольника?",
        "Решение: Рассмотрим произвольный четырёхугольник",
        "Ответ: Да, из всякого."
    ],
    "58048": [
        "Наименьший или наибольший угол",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Внекоторой стране100 аэродромов, причем все попарные расстояния между ними различны. Скаждого аэродрома поднимается самолет илетит на ближайший кнему аэродром. Докажите, что ни на один аэродром не может прилететь больше пяти самолетов.",
        "Решение: Если самолеты из точек"
    ],
    "107699": [
        "Неравенство треугольника (прочее)",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Петя купил Конструктор, в котором было 100 палочек разной длины. В инструкции к Конструктору написано, что из любых трёх палочек Конструктора можно составить треугольник. Петя решил проверить это утверждение, составляя из палочек треугольники. Палочки лежат в конструкторе по возрастанию длин. Какое наименьшее число проверок (в самом плохом случае) надо сделать Пете, чтобы доказать или опровергнуть утверждение инструкции?",
        "Решение: Пете достаточно проверить, можно ли составить треугольник из двух самых коротких палочек и одной самой длинной. Если треугольник не составляется, то утверждение инструкции опровергнуто. Если же треугольник составить можно, то сумма длин двух самых коротких палочек больше длины самой длинной. Но в этом случае сумма длин двух любых палочек набора длиннее любой другой. (Действительно, сумма длин двух любых не меньше суммы длин самых коротких, а длина любой палочки не больше длины самой длинной.) А это и означает, что из любых палочек можно составить треугольник, т. е. утверждение инструкции доказано.",
        "Ответ: Одна проверка."
    ],
    "32023": [
        "Арифметическая прогрессия",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: а) Дано шесть натуральных чисел. Все они различны и  дают в сумме 22. Найти эти числа и доказать, что других нет.",
        "Решение: Расположим числа в порядке возрастания. Тогда  очевидно, что каждое число будет больше своего номера. Найдем  \t\t\t\tсумму номеров всех чисел:  \t\t\t\tа)1+2+3+4+5+6=21; б)1+2++100=5050.  \t\t\t\t(Последнюю сумму можно посчитать следующим способом:  \t\t\t\t(1+100)+(2+99)++(50+51)=50101=5050.) В обоих случаях  \t\t\t\tэта сумма на единицу меньше суммы самих чисел. Значит, одно число  \t\t\t\tна единицу больше своего номера, а остальные — равны ему.  \t\t\t\tЧислом, большим своего номера, может быть только последнее.  \t\t\t\tДействительно, если какое-то число больше своего номера, то все  \t\t\t\tпоследующие числа тоже больше своего номера. Поэтому искомыми  \t\t\t\tчислами будут в пункте а) 1, 2, 3, 4, 5, 7; а в пункте б) — 1,  \t\t\t\t2, …, 99, 101."
    ],
    "35310": [
        "Системы линейных уравнений",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Десять человек сидят за круглым столом. Сумма в десять долларов должна быть распределена среди них так, чтобы каждый получил половину от той суммы, которую  два его соседа получили вместе. Однозначно ли это правило задает распределение денег?",
        "Решение: Рассмотрим человека, получившего наибольшую сумму (если их несколько, рассмотрим любого из них). Тогда оба его соседа получили ту же сумму. То же верно и для соседей этих соседей. Продолжая, убедимся в том, что все получили поровну.",
        "Ответ: Однозначно."
    ],
    "35332": [
        "Числовые неравенства. Сравнения чисел.",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Сумма 123 чисел равна 3813. Доказать, что из этих чисел можно выбрать 100 с суммой не меньше 3100.",
        "Решение: Сумма 100 наибольших чисел не меньше 100/123 суммы всех чисел, то есть не меньше 100/123·3813 = 3100."
    ],
    "32132": [
        "Отношение порядка",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Шеренга солдат называется неправильной, если никакие три подряд стоящих солдата не стоят по росту (ни в порядке возрастания, ни в порядке убывания). Сколько неправильных шеренг можно построить из n солдат разного роста, если",
        "Решение: Поставим между соседними солдатами +, если правый выше левого, и – – в противном случае. По условию плюсы и минусы в неправильной шеренге должны чередоваться. Ясно, что количество шеренг, начинающихся с плюса, равно количеству шеренг, начинающихся с минуса.     а) Найдём количество шеренг типа *+*–*+*. Обозначим солдат буквами A, B, C и D в порядке уменьшения роста. В шеренге указанного типа A может стоять на втором или четвёртом местах (после плюса).     В шеренге *A*+*&nbsp солдат B может стоять на первом или четвёртом месте. В первом случае имеем одну шеренгу – BADC, во втором – две: C и D можно ставить на оставшиеся места произвольно.     В шеренге *+*–*A&nbsp солдат B может стоять только на втором месте. Таких шеренг снова две.     Итого имеем 5 шеренг типа *+*–*+*, а всех неправильных шеренг – вдвое больше.",
        "Ответ: а) 10 шеренг;  б) 32 шеренги."
    ],
    "35094": [
        "Комбинаторная геометрия (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: На окружности отмечено n точек, причём известно, что для каждых двух отмеченных точек одна из дуг, соединяющих их, имеет величину, меньшую 120°. Докажите, что все точки лежат на одной дуге величиной 120°.",
        "Подсказка: Выберите среди всех  дуг (меньших 180°), соединяющих пары точек, наибольшую по величине и докажите, что все отмеченные точки лежат на этой дуге.",
        "Решение: Среди всех  дуг (меньших 180°), соединяющих пары отмеченных точек, выберем наибольшую по величине дугу AB; по условию её величина меньше 120°. Пусть A' и В' – точки, диаметрально противоположные точкам A и B. Окружность разбивается на четыре дуги: AB, BA', A'B' и B'A. Никакая отмеченная точка C не лежит на дуге BA', иначе величина &smile;AC > &smile;AB вопреки выбору дуги AB. Аналогично никакая отмеченная точка не лежит на дуге B'A.      Пусть отмеченная точка C лежит на дуге A'B'. Тогда окружность разбивается на три дуги AB, BC, CA, меньшие 180°. Сумма величин этих трёх дуг равна 360°, поэтому хотя бы одна из этих дуг имеет величину, не меньшую 360° : 3 = 120° вопреки условию.     Следовательно, все отмеченные точки расположены на дуге AB."
    ],
    "35110": [
        "Плоскость, разрезанная прямыми",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: На плоскости нарисовано несколько прямых (не меньше двух),   никакие две из которых не параллельны и никакие три не проходят   через одну точку.   Докажите, что среди частей, на которые эти прямые делят плоскость,   найдется хотя бы один угол.",
        "Подсказка: Рассмотрите выпуклую оболочку   множества точек попарного пересечения прямых.",
        "Решение: Рассмотрим множество точек пересечения P пар прямых.   Возьмем выпуклую оболочку множества P -   наименьший выпуклый многоугольник M,   содержащий это множество. Вершинами многоугольника M являются   некоторые из точек множества P.   Рассмотрим одну из вершин A многоугольника M,   а также прямые k и m, которые   пересекаются в точке A.   Возьмем луч прямой k с началом в A, который не пересекает    многоугольник M (точнее, пересекает многоугольник M по точке A).   Также возьмем луч прямой m с началом в A, который не пересекает    многоугольник M.   Эти два луча образуют угол, лежащий вне многоугольника M.   Понятно, что этот угол и является одной из частей,   на которые плоскость разделена прямыми.   Из приведенного рассуждения следует, что если количество прямых   не меньше трех, то среди частей плоскости найдутся хотя бы    3 угла, поскольку выпуклая оболочка множества точек P   имеет хотя бы 3 вершины."
    ],
    "35777": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Докажите, что никакой выпуклый многоугольник нельзя разрезать на 100 различных правильных треугольников.",
        "Подсказка: Предположите противное и рассмотрите наименьший треугольник, примыкающий к границе многоугольника.",
        "Решение: Предположим, что выпуклый многоугольник разбит на 100 различных правильных треугольников. Рассмотрим наименьший из всех треугольников, примыкающих к границе многоугольника. Пусть это треугольник ABC, у которого сторона AB примыкает к границе многоугольника. Поскольку многоугольник выпуклый, то он весь лежит по одну сторону с точкой C от прямой AB. К одной из сторон AC, BC треугольника ABC должен примыкать еще хотя бы один треугольник (иначе многоугольник совпадал бы с треугольником ABC).   Пусть, например, к стороне AC примыкает ещё один треугольник T. Тогда сторона треугольника T больше стороны треугольниика ABC, и поэтому его сторона, примыкающая к AC, продолжается за точку C. Если бы существовал треугольник, примыкающий к стороне BC треугольника ABC, то мы таким же образом заключили бы, что его сторона, примыкающая к BC, продолжается за точку C. Тем самым этот треугольник пересекался бы с треугольником T. Противоречие. Значит, нет треугольника, примыкающего к стороне BC треугольника ABC. Но это означает, что точка C является вершиной угла многоугольника, большего 180°. Противоречие с выпуклостью многоугольника."
    ],
    "60320": [
        "Геометрическая прогрессия",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: а) На постоялом дворе остановился путешественник, и хозяин согласился в качестве уплаты за проживание брать кольца золотой цепочки, которую тот носил на руке. Но при этом он поставил условие, чтобы оплата была  ежедневной: каждый день хозяин должен был иметь на одно кольцо больше, чем в предыдущий. Замкнутая в кольцо цепочка содержала 11 колец, а путешественник собирался прожить ровно 11 дней, поэтому он согласился. Какое наименьшее число колец он должен распилить, чтобы иметь возможность платить хозяину?  б) Из скольких колец должна состоять цепочка, чтобы путешественник мог прожить на постоялом дворе наибольшее число дней при условии, что он может распилить только",
        "Решение: а) Достаточно разрезать два кольца так, чтобы отделились куски из трёх и шести колец. На третий день путешественник отдает кусок из трёх колец и получает два кольца сдачи, а на шестой – кусок из шести колец и получает пять колец сдачи.",
        "Ответ: а) 2 кольца. б) Из ("
    ],
    "58053": [
        "Наименьшее или наибольшее расстояние (длина)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На плоскости дано",
        "Решение: Пусть"
    ],
    "65991": [
        "Квадратные уравнения и системы уравнений",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Сто положительных чисел записаны по кругу. Квадрат каждого числа равен сумме двух чисел, стоящих за этим числом по часовой стрелке.   Какие числа могут быть записаны?",
        "Решение: См. задачу 79311.",
        "Ответ: Каждое из записанных чисел равно 2."
    ],
    "79287": [
        "Выпуклые многоугольники",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Доказать, что в произвольном выпуклом 2n-угольнике найдётся диагональ, не параллельная ни одной из его сторон.",
        "Решение: Диагоналей, параллельных данной стороне, не более n – 2 (через самую дальнюю от стороны вершину не может проходить параллельная этой стороне диагональ). Потому всего диагоналей, параллельных сторонам, не более 2n(n – 2), что меньше числа n(2n – 3) всех диагоналей 2n-угольника (см. задачу 60391)."
    ],
    "79311": [
        "Квадратные уравнения и системы уравнений",
        "Сложность: 3",
        "Классы: 11",
        "Условие: Найти все положительные решения системы уравнений",
        "Решение: Пусть a – наибольшее из чисел x1, ..., x5, b – наименьшее из этих чисел. Тогда a² ≤ 2a и b² ≥ 2b. По условию числа a и b положительны, поэтому a ≤ 2 и b ≥ 2, следовательно, a = b = 2.",
        "Ответ: (2, 2, 2, 2, 2)."
    ],
    "88317": [
        "Средние величины",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: В вершинах 100-угольника расставлены числа так, что каждое равно среднему арифметическому своих соседей. Докажите, что все они равны.",
        "Решение: Рассмотрим максимальное из чисел. С одной стороны оно не меньше каждого из своих соседей, а с другой стороны, равно их среднему арифметическому. Поэтому это число равно каждому из своих соседей. Аналогичным образом, рассматривая соседей соседних чисел и т. д., двигаясь по цепочке, доказываем, что все числа равны."
    ],
    "98115": [
        "Свойства модуля. Неравенство треугольника",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: По окружности записаны 30 чисел. Каждое из этих чисел равно модулю разности двух чисел, стоящих после него по часовой стрелке. Сумма всех чисел   равна 1. Найти эти числа.",
        "Решение: Поскольку каждое из выписанных чисел равно модулю какого-то числа, то все они должны быть неотрицательны. Пусть наибольшее из них равно M. Два следующих за ним числа должны быть не больше M и различаться на M. Это возможно лишь в случае, когда одно из них равно M, а другое – нулю. Итак, в каком-то месте должны стоять либо числа M, M, 0, либо числа M, 0, M. Двигаясь по окружности против часовой стрелки, мы однозначно восстановим остальные числа. В обоих случаях получается один и тот же набор – M, M, 0, ..., M, M, 0. Поскольку сумма всех чисел равна 1, то M =  1/20.",
        "Ответ: 1/20, 1/20, 0, 1/20, 1/20, 0, ..., 1/20, 1/20, 0."
    ],
    "58054": [
        "Наименьшее или наибольшее расстояние (длина)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На плоскости расположено несколько точек, все попарные расстояния между которыми различны. Каждую из этих точек соединяют сближайшей. Может ли при этом получиться замкнутая ломаная?",
        "Решение: Предположим, что получилась замкнутая ломаная. Пусть"
    ],
    "35063": [
        "Задачи с неравенствами. Разбор случаев",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Даны 10 натуральных чисел, не превышающих 91. Докажите, что отношение некоторых двух из этих чисел принадлежит отрезку [2/3, 3/2].",
        "Подсказка: Упорядочите числа по возрастанию. Может ли при этом каждое число превосходить предыдущее более чем в 1,5 раза?",
        "Решение: Предположим, что для некоторых чисел a1 ≤ a2 ≤ ... ≤ a10 ≤ 91 утверждение не выполнено. Тогда каждое из чисел (кроме первого) больше предыдущего более, чем в 1,5 раза.     a1 ≥ 1 (числа натуральные). Отсюда последовательно получаем: a2 > 3/2, то есть a2 ≥ 2; a3 > 3/2·2 = 3, то есть a3 ≥ 4; a4 > 6,  то есть a4 ≥ 7;  a5 ≥ 11;  a6 ≥ 17; a7 ≥ 26; a8 ≥ 40; a9 ≥ 61; a10 ≥ 92.  Противоречие."
    ],
    "30665": [
        "Уравнения в целых числах",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Решить в целых числах уравнение 1/a + 1/b + 1/c = 1.",
        "Решение: Если a = 1, то c = – b.     Пусть ни одно из чисел не равно 1. Тогда каждое из слагаемых не больше ½. Отсюда сразу следует, что ни одно из чисел не может быть отрицательным. Поэтому можно считать, что 1 < a ≤ b ≤ c (остальные решения получатся перестановкой).     Если a > 3, то 1/a + 1/b + 1/c < 1/3 + 1/3 + 1/3 = 1.     Поэтому возможны только два случая:     1) a = 3 (и тогда, очевидно, b = c = 3);     2) a = 2. В этом случае 1/b + 1/c = ½. При этом b ≤ 4.     Поэтому либо b = 4 (и тогда c = 4), либо b = 3 (и тогда c = 6).",
        "Ответ: (3, 3, 3),  {2, 3, 6},  {2, 4, 4}, {1, t, – t}, где t – любое целое число."
    ],
    "30885": [
        "Алгебраические неравенства (прочее)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: k, l, m – натуральные числа. Докажите, что 2k+l + 2k+m + 2l+m ≤ 2k+l+m+1 + 1.",
        "Решение: Можно считать, что k ≥ l ≥ m. Тогда 2k+l+m+1 ≥ 22·2k+l > 3·2k+l ≥ 2k+l + 2k+m + 2l+m."
    ],
    "31088": [
        "Ориентированные графы",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: В стране каждые два города соединены дорогой с односторонним движением.   Доказать, что существует город, из которого можно проехать в любой другой не более чем по двум дорогам.",
        "Подсказка: Это город, из которого выходит наибольшее число дорог.",
        "Решение: Рассмотрим город A, из которого выходит наибольшее число дороги, и произвольный город B. Если дорога ведёт из A в B, то всё в порядке. Если же дорога ведёт из B в A, то, поскольку из B выходит не больше дорог, чем из A, найдётся город C, в который ведёт дорога из A, но не ведёт дорога из B. Тогда можно из A попасть в B по маршруту ACB."
    ],
    "31296": [
        "Уравнения в целых числах",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: a) Решить в целых числах уравнение",
        "Решение: а) См. задачу 30665.",
        "Ответ: а) (3, 3, 3), {2, 3, 6}, {2, 4, 4}, {1, t, – t}, где t – любое целое число."
    ],
    "34846": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В последовательности троек целых чисел (2, 3, 5), (6, 15, 10),... каждая тройка получается из предыдущей таким образом:   первое число умножается на второе, второе – на третье, а третье – на первое, и полученные произведения дают новую тройку. Докажите, что ни одно из чисел, получаемых таким образом, не будет степенью целого числа: квадратом, кубом и т.д.",
        "Подсказка: Каждая тройка имеет вид: (2a3b5c, 2c3a5b,  2b3c5a).",
        "Решение: Легко проверить, что каждая тройка имеет вид:   (2a3b5c,  2c3a5b, 2b3c5a), где a, b, c – некоторые целые числа. Действительно, тройка показателей (a', b', c') для следующей тройки чисел получается из предыдущей тройки показателей (a, b, c) по правилу:  (a', b', c') = (a + c, a + b, b + c).     Некоторое из чисел какой-либо тройки является степенью тогда и только тогда, когда числа из тройки показателей будут делиться на одно и то же простое число p.     Предположим, что такое случилось, и рассмотрим тройку показателей (a', b', c') с наименьшим номером, где все три числа кратны p. Рассмотрим два случая.     1) p = 2. Это – не первая тройка: она равна (1, 0, 0). Значит, в предыдущей тройке все числа одной чётности, то есть все нечётны. Это снова не первая тройка, значит, в предыдущей все числа разной чётности, что невозможно.     2) p – нечётное простое число. В предыдущей тройке (a, b, c) суммы a + b, b + c, c + a кратны p. Сложив эти числа, получим, что 2(a + b + c) и, следовательно, a + b + c  кратно p. Значит, и a = (a + b + c) – (b + c) кратно p. Аналогично b и c кратны p. Противоречие с выбором тройки (a', b', c')."
    ],
    "58067": [
        "Выпуклая оболочка и опорные прямые (плоскости)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Решите задачу",
        "Решение: Пусть"
    ],
    "34920": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Дано n попарно взаимно простых чисел, больших 1 и меньших (2n – 1)². Докажите, что среди них обязательно есть простое число.",
        "Подсказка: Предположите противное и рассмотрите наименьшие простые делители данных чисел.",
        "Решение: Пусть a1, a2, ..., an – попарно взаимно простые составные числа. Обозначим через pi наименьший простой делитель числа ai. Тогда ai = piqi, причём pi ≤ qi. Поскольку ai < (2n – 1)², то pi < 2n – 1. Кроме того, числа p1, p2, ..., pn различны, так как числа a1, a2, ..., an попарно взаимно просты. Однако существует не более n – 1 простых чисел, больших 1 и меньших 2n – 1: все такие числа содержатся среди чисел 2, 3, 5, 7, ..., 2n – 3. Противоречие."
    ],
    "35142": [
        "Системы отрезков, прямых и окружностей",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: На плоскости дано несколько прямых (больше одной), никакие две из которых не параллельны.   Докажите, что либо найдётся точка, через которую проходят ровно две из данных прямых, либо все прямые проходят через одну точку.",
        "Подсказка: Рассмотрите некоторую прямую m и точку пересечения двух прямых, отличных от m, лежащую ближе всего к прямой m.",
        "Решение: Пусть не все прямые проходят через одну точку. Рассмотрим множество точек M, в которых пересекаются хотя бы две из данных прямых. Выберем одну из прямых – m. По предположению найдётся точка множества M, не принадлежащая прямой m. Из всех таких точек выберем точку P, лежащую на наименьшем расстоянии от m.      Если через P проходят ровно две данные прямые, то все доказано.     Иначе найдутся три данные прямые PA, PB, PC (точки A, B, C лежат на m), проходящие через точку P. Пусть для определенности точка B лежит между точками A и C. Если через точку B проходят ровно две данные прямые, то все доказано.     Иначе найдётся прямая k, отличная от m и PB, проходящая через точку B. Прямая k должна пересекать одну из сторон PA, PC треугольника ACP в некоторой точке K. Эта точка принадлежит множеству M, но расстояние от неё до m меньше расстояния от P до m. Противоречие."
    ],
    "35199": [
        "Деревья",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: В стране несколько городов (больше одного); некоторые пары городов соединены  дорогами. Известно, что из каждого города можно попасть в любой другой, проезжая по нескольким дорогам. Кроме того, дороги не образуют циклов, то есть если выйти из некоторого города по какой-то дороге и далее двигаться так, чтобы не проходить по одной дороге дважды, то невозможно возвратиться в начальный город. Докажите, что в этой стране найдутся хотя бы два города, каждый из которых соединен дорогой ровно с одним городом.",
        "Подсказка: Можно рассмотреть самую длинную цепь из дорог, концы этой цепи будут искомыми городами.",
        "Решение: Первый способ. Рассмотрим самую длинную цепь из дорог, то есть возьмём самую длинную последовательность попарно различных городов  A1, A2, ..., Ak, в которой каждые два соседних города в этой последовательности соединены дорогой. Докажем, что из городов A1 и Ak выходит ровно одна дорога (соответственно в A2 и Ak–1). Пусть, например, из A1 идет дорога в некоторый город B, отличный от A2. Если B – один из городов A3, ..., Ak, то возникает цикл из дорог, что противоречит условию. Таким образом, город B отличен от городов A1, A2, ..., Ak. Следовательно, в последовательности городов B, A1, A2, ..., Ak города попарно различны и соседние города соединены дорогой. Но эта последовательность содержит больше k городов вопреки выбору последовательности A1, A2, ..., Ak."
    ],
    "35498": [
        "Процессы и операции",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Можно ли все натуральные числа разбить на пары так, чтобы сумма    чисел в каждой паре была квадратом целого числа?",
        "Подсказка: Выбирайте пары последовательно одну за другой,    выбирая при этом первое число каждой пары как наименьшее среди еще     не выбранных, а второе - так, чтобы выполнялось условие задачи.",
        "Решение: Выбираем пары натуральных чисел последовательно одну за другой.    Первое число A каждой пары выбираем как наименьшее среди еще     не выбранных. Второе число в каждой паре выбираем среди чисел    вида    B=m",
        "Ответ: можно."
    ],
    "61370": [
        "Квадратичные неравенства (несколько переменных)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите неравенство  (a + b + c + d + 1)² ≥  4(a² + b² + c² + d²) при a, b, c, d ∈ [0, 1].",
        "Решение: Можно считать, что a ≥ b ≥ c ≥ d. Тогда   (a + b + c + d + 1)² = (a² + b² + c² + d²) + 2(ab + ac + ad + bc + bd + cd) + 2(a + b + c + d) + 1 ≥   ≥ (a² + b² + c² + d²) + 2(b² + c² + d² + c² + d² + d²) + 2(a² + b² + c² + d²) + a² ≥ 4(a² + b² + c² + d²)."
    ],
    "64596": [
        "Упорядочивание по возрастанию (убыванию)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Есть тридцать карточек, на каждой написано по числу: на десяти карточках – a, на десяти других – b, и на десяти оставшихся – c (числа a, b, c все разные). Известно, что к любым пяти карточкам можно подобрать еще пять так, что сумма чисел на этих десяти карточках будет равна нулю. Докажите, что одно из чисел a, b, c равно нулю.",
        "Решение: Пусть a < b < c. Отметим на числовой оси всевозможные суммы чисел на пяти карточках. Для каждой из них отмечена и противоположная, поэтому отмеченные точки расположены симметрично относительно нуля. В частности, противоположны наибольшая (5с) и наименьшая (5а) суммы, значит,   5a + 5c = 0, то есть c = – a. Противоположны и суммы, ближайшие к “крайним”: (4a + b) + (4c + b) = 0. Отсюда следует, что b = 0."
    ],
    "65218": [
        "Линейные неравенства и системы неравенств",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Девять чисел таковы, что сумма каждых четырёх из них меньше суммы пяти остальных. Докажите, что все числа положительны.",
        "Решение: Упорядочим данные числа по возрастанию: а1 ≤   а2 ≤ ... ≤ а9. По условию а1 + а2 + а3 + а4 + а5 > а6 + а7 + а8 + а9 ≥ а2 + a3 + а4 + а5. Значит, а1 > 0. Тем более остальные числа положительны."
    ],
    "65266": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: На каждой из четырёх карточек написано натуральное число. Берут наугад две карточки и складывают числа на них. С равной вероятностью эта сумма может быть меньше 9, равна 9 и больше 9. Какие числа могут быть записаны на карточках?",
        "Решение: Пусть на четырёх карточках написаны натуральные числа a ≤ b ≤ c ≤ d. Две из четырёх карточек можно выбрать шестью различными способами. Поскольку по условию пару карточек выбирают случайным образом, то вероятность выбрать конкретную пару равна &frac16;. Так как по условию события {s < 9}, {s = 9}, {s > 9} (где s– сумма чисел на выбранных карточках) равновероятны, то вероятность каждого из них равна &frac13;.    Значит, две из сумм a + b, a + c, a + d, b + c, b + d, c + d равны 9, две больше 9 и две меньше.    В силу неравенств a + b ≤ a + c ≤ a + d ≤ b + d ≤ c + d и a + c ≤ b + c ≤ b + d равны 9 суммы  a + d и b + c, меньше 9 суммы a + b и a + c, а больше 9 – суммы b + d и c + d. В частности, a + c < a + d, значит, c < d. Аналогично a < b. Кроме того, b < c, так как сумма b + c нечётна.    Таким образом, пары {a, d} и {b, c} можно выбирать из пар {1, 8}, {2, 7}, {3, 6}, {4, 5}, с учётом полученных неравенств. Отсюда ответ.",
        "Ответ: (1, 2, 7, 8), (1, 3, 6, 8), (1, 4, 5, 8), (2, 3, 6, 7), (2, 4, 5, 7), (3, 4, 5, 6)."
    ],
    "58075": [
        "Принцип крайнего  (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Можно ли на плоскости расположить1000 отрезков так, чтобы каждый отрезок обоими концами упирался строго внутрь других отрезков?",
        "Решение: Пусть на плоскости расположено1000 отрезков. Возьмем произвольную прямую"
    ],
    "65269": [
        "Математическая статистика",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: В первой четверти у Васи было пять оценок по математике, больше всего среди них пятёрок. При этом оказалось, что медиана всех оценок равна 4, а среднее арифметическое 3,8. Какие оценки могли быть у Васи?",
        "Решение: Выпишем оценки Васи по возрастанию. На третьем (среднем) месте будет стоять 4. Значит, двумя оценками, стоящими правее неё могут быть только (4, 4), (4, 5) либо (5, 5). Первые два варианта не подходят, так как тогда четвёрок будет больше, чем пятёрок, что противоречит условию. Значит, последние две оценки – пятёрки.    Так как среднее всех оценок равно 3,8, то сумма всех пяти оценок равна 3,8·5 = 19. Значит, первые две оценки (стоящие левее четвёрки) в сумме дают 19 – 5 – 5 – 4 = 5. Поэтому ими могут быть только (1, 4) или (2, 3). Первый вариант невозможен, так как иначе у Васи было бы поровну четвёрок и пятёрок. Значит, Васины оценки (2, 3, 4, 5, 5).",
        "Ответ: 2, 3, 4, 5, 5."
    ],
    "65487": [
        "Примеры и контрпримеры. Конструкции",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Сумма девяти различных натуральных чисел равна 200. Всегда ли можно выбрать из них четыре числа так, чтобы их сумма была больше чем 100?",
        "Решение: Рассмотрим девять чисел: 28, 25, 24, 23, 22, 21, 20, 19, 18. Их сумма равна 200, но сумма четырёх наибольших из них равна 28 + 25 + 24 + 23 = 100. Значит, сумма любых четырёх чисел из этих девяти не больше чем 100.    Аналогичный пример: 27, 26, 24, 23, 22, 21, 20, 19, 18.",
        "Ответ: Не всегда."
    ],
    "77892": [
        "Взвешивания",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Имеется 13 гирь, каждая из которых весит целое число граммов. Известно, что  любые 12 из них можно так разложить на две чашки весов, по шесть гирь на каждой, что наступит равновесие. Докажите, что все гири имеют один и тот же вес.",
        "Решение: См. задачу 61350 а)."
    ],
    "78734": [
        "Турниры и турнирные таблицы",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: 12 теннисистов участвовали в турнире. Известно, что каждые два теннисиста  сыграли между собой ровно один раз и не было ни одного теннисиста, проигравшего  все встречи. Доказать, что найдутся такие теннисисты A, B, C, что A выиграл у B, B у C, C у A. (В теннисе ничьих не бывает.)",
        "Решение: Рассмотрим теннисиста B, проигравшего наибольшее количество встреч. По условию есть теннисист C, у которого он выиграл. Если бы C проиграл всем участникам, выигравшим у B, то он проиграл бы больше встреч, чем B, что противоречит выбору B. Следовательно, найдётся теннисист A, выигравший у B, но проигравший C."
    ],
    "88320": [
        "Линейные неравенства и системы неравенств",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Дано 1993 числа. Известно, что сумма любых четырёх чисел положительна. Верно ли, что сумма всех чисел положительна?",
        "Решение: Обозначим числа как a1, a2, ..., a1993. a1 + a2 + a3 + a4 > 0, a2 + a3 + a4 + a5 > 0, ...,    a1990 + a1991 + a1992 + a1993 > 0, a1991 + a1992 + a1993 + a1 > 0,  a1992 + a1993 + a1 + a2 > 0, a1993 + a1 + a2 + a3 > 0. Сложив левые части, получим, что 4(a1 + a2 + ... + a1993) > 0."
    ],
    "102821": [
        "Задачи на смеси и концентрации",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Имеются два сосуда емкостью 1 л и 2 л. Из содержимого приготовили 0,5 л смеси, содержащей 40% яблочного сока, и 2,5 л смеси, содержащей 88% яблочного сока. Каково процентное содержание яблочного сока в сосудах?",
        "Решение: Понятно, что хотя бы в одном из сосудов содержание сока не превышает 40%. При этом условии наибольшее количество сока в 2,5 литрах будет, если мы смешаем пол-литра 40-процентного сока с двумя литрами чистого сока. В этом и только в этом случае в 2,5 литрах будет 0,5·0,4 + 2 = 2,2 л яблочного сока, что как раз и составляет 88%. Таким образом, в сосуде ёмкостью 1 л содержится 40% сока, а в двухлитровом – чистый яблочный сок.",
        "Ответ: В меньшем – 40%, в большем – 100%."
    ],
    "107622": [
        "Диаметр, основные свойства",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: В круге провели несколько (конечное число) различных хорд так, что каждая из них проходит через середину какой – либо другой из проведённых хорд.    Докажите, что все эти хорды являются диаметрами круга.",
        "Решение: Заметим, что чем меньше расстояние от центра"
    ],
    "107700": [
        "Неравенство треугольника (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Имеется 10 отрезков, причём известно, что длина каждого – целое число сантиметров. Два самых коротких отрезка – по сантиметру, самый длинный – 50 см. Докажите, что среди отрезков найдутся три, из которых можно составить треугольник.",
        "Решение: Предположим противное: ни из каких трёх отрезков нельзя составить треугольник. Рассмотрим длины отрезков в сантиметрах по возрастанию:  l1 = l2 = 1 ≤ l3 ≤ l4 ≤ ... ≤ l10 = 50. Так как из трёх самых коротких отрезков нельзя составить треугольник, то l3 ≥ l1 + l2 = 2. Аналогично  l4 ≥ l2 + l3 ≥ 1 + 2 = 3. Далее, l5 ≥ 2 + 3 = 5, l6 ≥ 3 + 5 = 8, l7 ≥ 5 + 8 = 13, l8 ≥ 8 + 13 = 21, l9 ≥ 13 + 21 = 33, l10 ≥ 21 + 33 = 55. Противоречие."
    ],
    "35040": [
        "Стереометрия (прочее)",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Докажите, что у любого выпуклого многогранника найдутся 4 вершины  A, B, C, D, обладающие следующим свойством:  для каждой из четырех вершин A, B, C, D, многогранник целиком лежит  по одну сторону от плоскости,  проходящей через эту точку и параллельной  плоскости, проходящей через три другие вершины.",
        "Подсказка: ABCD - тетраэдр наибольшего объема среди всевозможных тетраэдров,  образованных вершинами многогранника.",
        "Решение: Среди всех четверок вершин многогранника выберем  четверку A, B, C, D, образующую тетраэдр наибольшего объема.  Докажем, что четверка вершин A, B, C, D удовлетворяет условию задачи.  Рассмотрим, например, плоскость П, проходящую через  вершину A и параллельную плоскости, проходящей через вершины  B, C, и D. Предположим, что не весь многогранник лежит по  одну сторону от плоскости П.  Тогда найдется некоторая вершина M многогранника, расположенная  по разные стороны от плоскости П с плоскостью BCD.  Рассмотрим тетраэдр MBCD. Он имеет то же основание BCD,  что и тетраэдр ABCD, а высота, опущенная на основание из вершины  M, больше высоты тетраэдра ABCD, опущенной на основание из вершины  A. Отсюда следует, что объем тетраэдра MBCD больше объема  тетраэдра ABCD вопреки выбору вершин A, B, C, D.  Полученное противоречие показывает, что многогранник целиком лежит  по одну сторону от плоскости П.  Аналогичными рассуждениями доказывается, что многогранник лежит  целиком по одну сторону от трех других плоскостей, о которых  говорится в условии."
    ],
    "78255": [
        "Векторы (прочее)",
        "Сложность: 3+",
        "Классы: 11",
        "Условие: Известно, что",
        "Решение: Во-первых, заметим, что каждому комплексному числу можно сопоставить вектор на комплексной плоскости. Поэтому можно считать, что дано"
    ],
    "78530": [
        "Неравенства с площадями",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: В квадрате со стороной длины 1 выбрано 102 точки, из которых никакие три не лежат на одной прямой. Доказать, что найдётся треугольник с вершинами в этих точках, площадь которого меньше, чем 1/100.",
        "Решение: Рассмотрим наименьший выпуклый многоугольник, содержащий данные точки. Пусть он имеет"
    ],
    "79301": [
        "Теория игр (прочее)",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Коля и Витя играют в следующую игру. На столе лежит куча из 31 камня. Мальчики делают ходы поочерёдно, а начинает Коля. Делая ход, играющий делит каждую кучку, в которой больше одного камня, на две меньшие кучки. Выигрывает тот, кто после своего хода оставляет кучки по одному камню в каждой. Сможет ли Коля сделать так, чтобы выиграть при любой игре Вити?",
        "Решение: Ответ:",
        "Ответ: A"
    ],
    "78507": [
        "Принцип крайнего  (прочее)",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Доказать, что не существует попарно различных натуральных чисел x, y, z, t, для которых было бы справедливо соотношение xx + yy = zz + tt.",
        "Решение: Предположим, что такие числа нашлись. Пусть z – наибольшее изэтих чисел. Тогда z ≥ 4, а значит, xx + yy < 2(z – 1)z–1 < 2zz–1 < zz <  zz + tt. Противоречие."
    ],
    "30928": [
        "Квадратичные неравенства (несколько переменных)",
        "Сложность: 4",
        "Классы: 6,7",
        "Условие: Докажите, что если x + y + z ≥ xyz, то x² + y² + z² ≥ xyz.",
        "Решение: Если среди данных трёх чисел одно или три неположительных, то утверждение очевидно. Если неположительных два, то   |x| + |y| + |z| ≥ x + y + z ≥ xyz = |xyz|. Поэтому достаточно рассмотреть случай, когда все числа положительны.     Можно считать, что x ≥ y ≥ z. Тогда 3x ≥ x + y + z ≥ xyz, значит, yz ≤ 3, откуда z < 2.   Следовательно, x² + y² + z² > x² + y² ≥ 2xy > xyz."
    ],
    "65178": [
        "Турниры и турнирные таблицы",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: В турнире участвовало 11 шахматистов: 4 – из России и 7 зарубежных. Каждый шахматист сыграл с каждым по две партии (выигрыш – 1 очко, ничья – 0,5 очка, поражение – 0). По окончании турнира оказалось, что все участники набрали различное количество очков, причем сумма очков, набранных россиянами, равна сумме очков, набранных иностранцами. Могло ли в тройке призеров не оказаться ни одного россиянина?",
        "Решение: Количество партий, сыгранных в турнире, равно 10·11 = 110. Очков было разыграно столько же, значит, как россияне, так и иностранцы в сумме набрали по 55 очков. Лучший из российских шахматистов не мог набрать меньше, чем 14,5 очков (иначе сумма очков, набранных россиянами, не больше чем 14 + 13,5 + 13 + 12,5 = 53 < 55). Пусть его опередили хотя бы трое иностранцев, тогда они набрали в сумме не меньше чем   15 + 15,5 + 16 = 46,5 очков. Значит, четыре остальных зарубежных шахматиста набрали в сумме не больше чем 55 – 46,5 = 8,5 очков. Но эти шахматисты только во встречах между собой разыграли 3·4 = 12 очков, то есть сумма набранных ими очков не могла быть меньше чем 12. Противоречие.",
        "Ответ: Не могло."
    ],
    "65179": [
        "Последовательности (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Найдите все строго возрастающие последовательности натуральных чисел   a1, a2, ..., an, ..., в которых a2 = 2 и anm = anam для любых натуральных n и m.",
        "Решение: Последовательность аn = n, очевидно, удовлетворяет условию.     Предположим, что есть какая-то другая последовательность. Так как a1 < a2, то a1 = 1. Ясно, что an ≥ n. Рассмотрим наименьшее n, при котором аn > n. Если n = 2m, то аn = a2am = 2m = n. Если же n = 2m + 1 (m ≥ 1), то n < аn < an+1 = a2m+2 = a2am+1 = 2(m + 1) = n + 1, то есть целое число аn находится между n и n + 1.     В обоих случаях мы пришли к противоречию.",
        "Ответ: аn = n."
    ],
    "78605": [
        "Принцип крайнего  (прочее)",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Имеется лабиринт, состоящий из",
        "Решение: Докажем, что они обязательно встретятся на самой большой окружности. Для этого достаточно доказать, что в какой-то момент времени один из них зайдёт на эту окружность, когда другой будет по ней идти. Если в тот момент, когда первый человек, пройдя вторую по величине окружность, заходит на самую большую, второй уже идёт по самой большой окружности, то они обязательно встретятся. Если же второй находится на какой-нибудь другой окружности, то, так как длина самой большой окружности больше суммы длин всех остальных, второй успеет пройти все оставшиеся ему окружности и зайти на самую большую до того, как первый пройдёт её полностью, а значит, и в этом случае они встретятся, причём на самой большой окружности."
    ],
    "65904": [
        "Основная теорема арифметики. Разложение на простые сомножители",
        "Сложность: 4",
        "Классы: 7,8",
        "Условие: Какое наибольшее количество натуральных чисел, не превосходящих 2016, можно отметить так, чтобы произведение любых двух отмеченных чисел было бы точным квадратом?",
        "Решение: Так как 44² < 2016 < 45², то натуральных чисел, квадраты которых не больше чем 2016, всего 44. Произведение двух точных квадратов является точным квадратом, поэтому числа 1 = 1², 4 = 2², ..., 1936 = 44² могут быть отмечены.     Докажем, что большее количество чисел отметить невозможно. Действительно, рассмотрим искомый набор чисел и разделим каждое из чисел этого набора на наибольший точный квадрат, на который оно делится. Получим новый набор чисел, причём в разложение каждого из получившихся чисел на простые множители эти множители входят только в первой степени. Заметим, что каждый простой множитель (если он есть) должен присутствовать во всех разложениях, так как при перемножении любых двух чисел полученного набора он должен оказаться в чётной степени. Это означает, что после деления каждого числа искомого набора на наибольшие квадраты должно получиться одно и то же число q. Если q = 1, то получим набор из 44 чисел, которые сами являются точными квадратами (см. выше), а если q > 1, то получим набор из меньшего количества чисел, поскольку 1936q > 2016.",
        "Ответ: 44 числа."
    ],
    "78189": [
        "Десятичная система счисления",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Доказать, что в любом шестизначном числе можно переставить цифры так, чтобы сумма первых трёх отличалась от суммы вторых трёх меньше, чем на 10.",
        "Решение: Переставим цифры в следующем порядке:"
    ],
    "78269": [
        "Последовательности (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Доказать, что для любых трёх бесконечных последовательностей натуральных чисел",
        "Решение: Докажем сперва, что из любой последовательности натуральных чисел можно  выбрать неубывающую подпоследовательность, т.е. такую, что каждый её член не  меньше предыдущего.    Пусть"
    ],
    "78297": [
        "Текстовые задачи (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Школьник в течение учебного года должен решать ровно по 25 задач за каждые  идущие подряд 7 дней. Время, необходимое на решение одной задачи (любой), не  меняется в течение дня, но меняется в течение учебного года по известному школьнику закону и всегда меньше 45 минут. Школьник хочет затратить на решение  задач в общей сложности наименьшее время. Доказать, что для этого он может   выбрать некоторый день недели и в этот день (каждую неделю) решать по 25 задач.",
        "Решение: Пусть a1, a2, ..., a7, a8 – число задач, решённых школьником за некоторые идущие подряд 8 дней. По условию: a1 + a2 + ... + a7 = 25, a2 + a3 + ... + a8 = 25, откуда a1 = a8. Итак, число задач, решаемых школьником за день, должно повторяться через каждые 7 дней. Школьнику, таким образом, нужно выбрать не некоторый общий план, а лишь план на неделю.     Пусть a1, a2, ..., a7 – произвольный план на неделю. Это значит, что каждый понедельник школьник решает a1 задач, каждый вторник – a2 задач и т.д. Если бы школьник решал все 25 задач в понедельник, то он истратил бы на все задачи в течение учебного года некоторое время, которое обозначим через S1. Точно так же определены числа S2, S3, ..., S7. Решая по понедельникам не 25, а a1 задач, школьник за все понедельники, очевидно, потратит время, равное 1/25 a1S1. Точно так же, за все вторники он потратит время 1/25 a2S2 и т.д. Общее затраченное школьником время равно, таким образом:  S = 1/25 (a1S1 + a2S2 + ... + a7S7).    При этом, по условию, a1 + a2 + ... + a7 = 25.     Ясно теперь, что, выбрав из чисел S1, S2, ..., S7 наименьшее и полагая соответствующий коэффициент ak равным 25, а остальные – нулю, мы добьёмся того, что S станет минимальным."
    ],
    "78584": [
        "Числовые таблицы и их свойства",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: В каждой клетке квадратной таблицы m×m клеток стоит либо натуральное число, либо нуль. При этом, если на пересечении строки и столбца стоит нуль, то сумма чисел в кресте, состоящем из этой строки и этого столбца, не меньше m. Докажите, что сумма всех чисел в таблице не меньше чем ½ m².",
        "Решение: Рассмотрим все ряды (строки и столбцы) и выберем ряд с наименьшей суммой чисел s. Если s ≥ m/2, то требуемое неравенство очевидно.     Пусть s < m/2 и в выбранной строке k нулей и m – k ненулевых чисел. Тогда k > m/2. В каждом из k столбцов, соответствующих нулям исходной строки, сумма чисел не меньше m –  s, а в каждом из остальных столбцов сумма чисел не меньше s. Таким образом, сумма всех чисел в таблице не меньше  k(m – s) + s(m – k) = ½ m² + 2(k – m/2)(m/2 – s) > ½ m²."
    ],
    "79309": [
        "Теория игр (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Коля и Витя играют в следующую игру. На столе лежит куча из 100 камней. Мальчики делают ходы поочерёдно, а начинает Коля. Делая ход, играющий делит каждую кучку, в которой больше одного камня, на две меньшие кучки. Выигрывает тот, кто после своего хода оставляет кучки по одному камню в каждой. Сможет ли Коля сделать так, чтобы выиграть при любой игре Вити?",
        "Решение: Ответ:",
        "Ответ: 79301"
    ],
    "79320": [
        "Числовые таблицы и их свойства",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В клетках таблицы размером 10×20 расставлено 200 различных чисел. В  каждой строчке отмечены два наибольших числа красным цветом, а в каждом столбце  отмечены два наибольших числа синим цветом. Доказать, что не менее трёх чисел  отмечены в таблице как красным, так и синим цветом.",
        "Решение: Если все отмеченные числа – двухцветные, то их по крайней мере 40.     Пусть есть одноцветные отмеченные числа. Рассмотрим наибольшее из них число A. Пусть оно синее (для красного рассуждения аналогичны). Тогда два красных числа в той же строке больше A и, следовательно, двухцветны.     Рассмотрим отмеченные числа, не лежащие с A в одной строке. Если среди них есть двухцветное, то все доказано. В противном случае расмотрим наибольшее среди них число B.     Если B – синее, то два красных числа в одной строке с B двухцветны.     Если B – красное, то два синих числа в одном столбце с B двуцветны. При этом одно из них не лежит в одной строке с A и, поэтому не совпадает с двумя ранее найденными двухцветными числами."
    ],
    "79475": [
        "Последовательности (прочее)",
        "Сложность: 4",
        "Классы: 9",
        "Условие: За дядькой Черномором выстроилось чередой бесконечное число богатырей. Доказать, что он может приказать части из них выйти из строя так, чтобы в строю осталось бесконечно много богатырей и все они стояли по росту (не обязательно в порядке убывания роста).",
        "Решение: Пусть в череде богатырей не существует богатыря наименьшего роста. Это  означает, что для каждого богатыря найдётся богатырь меньшего роста и тогда  искомая цепочка легко строится последовательным выбором все меньших и меньших  по росту богатырей. Если же имеется богатырь"
    ],
    "78693": [
        "Выпуклая оболочка и опорные прямые (плоскости)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Имеется 1000 деревянных правильных 100-угольников, прибитых к полу. Всю эту  систему мы обтягиваем верёвкой. Натянутая верёвка будет ограничивать некоторый  многоугольник. Доказать, что у него более 99 вершин.",
        "Решение: Докажем, что если верёвка натянута на несколько правильных n-угольников, то она ограничивает многоугольник, у которого не менее n вершин. Пусть выпуклая оболочка вершин данных n-угольников является m-угольником и φ1, ..., φm – его углы.  Так как каждый угол выпуклой оболочки содержит угол правильного n-угольника, то φi ≥ (1 − 2/n)π (справа стоит величина угла правильного n-угольника). Поэтому (m – 2)π = φ1 + ... + φm ≥ m(1 − 2/n)π. Следовательно, 2m/n ≥ 2, то есть m ≥ n."
    ],
    "78694": [
        "Выпуклая оболочка и опорные прямые (плоскости)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Имеется 57 деревянных правильных 57-угольников, прибитых к полу. Всю эту  систему мы обтягиваем веревкой. Натянутая веревка будет ограничивать некоторый  многоугольник. Доказать, что у него более 56 вершин.",
        "Решение: См. решение задачи 78693."
    ],
    "78618": [
        "Покрытия",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: В четырёх заданных точках на плоскости расположены прожекторы, каждый из которых может освещать прямой угол. Стороны этих углов могут быть направлены на север, юг, запад или восток. Доказать, что эти прожекторы можно направить так, что они осветят всю плоскость.",
        "Решение: Среди данных точек выберем две наиболее северные (если есть несколько наиболее северных точек, то выбираем любые две из них). Одну из сторон каждого прямого угла в этих точках направим на юг, а другие стороны направим навстречу друг другу. В результате будет освещена вся полуплоскость южнее этих двух прожекторов. С помощью двух оставшихся прожекторов можно осветить полуплоскость севернее их."
    ],
    "30794": [
        "Деревья",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: В стране 100 городов, некоторые из которых соединены авиалиниями. Известно, что от каждого города можно долететь до любого другого (возможно, с пересадками).   Докажите, что можно побывать во всех городах, совершив не более а) 198 перёлетов; б) 196 перелётов.",
        "Решение: б) Рассмотрим соответствующий граф и выделим из него максимальное дерево (см. задачу"
    ],
    "78701": [
        "Выпуклая оболочка и опорные прямые (плоскости)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: В государстве царя Додона расположено 500 городов, каждый из которых имеет  форму правильной 37-угольной звезды, в вершинах которой находятся башни. Додон  решил обнести их выпуклой стеной так, чтобы каждый отрезок стены соединял две  башни. Доказать, что  стена будет состоять не менее чем из 37 отрезков. (Если несколько отрезков лежат на одной прямой, то они считаются за один.)",
        "Решение: Звезды можно заменить на правильные 37-угольники с теми же вершинами – при этом форма стены (выпуклая оболочка) не изменится. Далее см. решение задачи 78693."
    ],
    "31292": [
        "Уравнения в целых числах",
        "Сложность: 4",
        "Классы: 6,7,8",
        "Условие: Решить в целых числах уравнение x² + y² + z² = 2xyz.",
        "Решение: Если есть ненулевое решение этого уравнения в целых числах, то есть и решение в натуральных числах. Докажем, что решений в натуральных числах нет.     Пусть это не так. Тогда рассмотрим наименьшее натуральное число a, для которого найдутся такие натуральные b, c, n, что a² + b² + c² = 2nabc. Заметим, что все слагаемые в левой части чётны (иначе левая часть не делится на 4, а правая делится). Подставляя a = 2u, b = 2v, c = 2w получаем   4(u² + v² + w²) = 2n+3uvw, или u² + v² + w² = 2n+1uvw. Поскольку u < a, это противоречит выбору числа a.",
        "Ответ: (0, 0, 0)."
    ],
    "64191": [
        "Раскраски",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Наострове все страны треугольной формы (границы прямые). Если две страны граничат, топоцелой стороне. Докажите, что страны можно раскрасить в3цвета так, что соседние постороне страны будут покрашены вразные цвета.",
        "Решение: Предположим, что некоторые острова, удовлетворяющие условию задачи, невозможно  покрасить втри цвета так, чтобы каждая страна была покрашена всвой  цвет, асоседние страны были покрашены вразные цвета. Выберем  изних остров, накотором число стран самое маленькое. Рассмотрим  какую–нибудь прибрежную страну (тоесть какую–нибудь страну,  одной изсторон выходящую наберег).  Всилу выбора, весь  остальной остров можно покрасить втри цвета.  Норассматриваемая  страна граничит только сдвумя странами, азначит, для неё запрещены  только два цвета. Поэтому её тоже можно покрасить. Получили противоречие.  Следовательно, карту любого острова, удовлетворяющего условию задачи, можно  раскрасить втри цвета так, чтобы выполнялись требования задачи."
    ],
    "65922": [
        "Доказательство от противного",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Каждое целое число на координатной прямой покрашено в один из двух цветов – белый или чёрный, причём числа 2016 и 2017 покрашены разными цветами. Обязательно ли найдутся три одинаково покрашенных целых числа, сумма которых равна нулю?",
        "Решение: Предположим таких целых чисел нет. Пусть, для определенности, число 2016 – чёрное, а 2017 – белое. Рассмотрим два случая.     1) Число 0 – белое. Тогда любое число, противоположное к белому, – чёрное. В частности, число –2017  – чёрное. Из того, что числа –2017 и 2016 – чёрные и –2017 + 2016 + 1 = 0, следует, что число 1 – белое, а –1 – чёрное. Числа –1 и 2016 – чёрные, значит, число –2015 – белое, а 2015 – чёрное. Числа –2015 и 2017 – белые, –2017 + 2015 + 2 = 0, поэтому число 2 – белое.     Пусть n – наименьшее чёрное натуральное число, тогда число n – 1 – белое, а 1 – n – чёрное. Но –1 + (1 – n) + n = 0, 1 –n ≠ –1, и эти три числа – чёрные. Противоречие.     2) Число 0 – чёрное. Тогда любое число, противоположное к чёрному, – белое. В частности, число –2016 – белое. Из того, что числа –2016 и 2017 – белые и –2016 + 2017 + (–1) = 0 следует, что число –1 – чёрное, а 1 – белое. Числа 1 и –2016 – белые, значит, число 2015 – чёрное, а –2015 – белое. Числа –2015 и 2017 – белые, (–2015) + 2017 + (–2) = 0, поэтому число –2 – чёрное.     Пусть –m – наибольшее отрицательное белое число.  Тогда число 1 – m – чёрное, а m – 1 –  белое. Но 1 + (m – 1) + (–m) = 0, m – 1 ≠ 1, и эти три числа – белые. Противоречие.",
        "Ответ: Обязательно."
    ],
    "73606": [
        "Числовые таблицы и их свойства",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: а) Прямоугольная таблица из m строк и n столбцов заполнена числами. Переставим числа в каждой строке в порядке возрастания. Если после этого переставить числа в каждом столбце в порядке возрастания, то в каждой строке они по-прежнему будут стоять в порядке возрастания. Докажите это.     б) Что будет, если действовать в другом порядке: в первоначальной таблице сначала переставить числа по возрастанию в столбцах, а потом – в строках: получится ли в результате та же самая таблица, что и в первом случае, или другая?",
        "Решение: а) Рассмотрим таблицу, у которой в каждой строке числа стоят в порядке  возрастания.     Докажем, что k-е по величине (считая от наибольшего) число bk в r-м столбце не меньше k-го числа ak в l-м столбце. Действительно, в l-м столбце имеется k чисел, не меньших ak. В тех же строках в r-м столбце имеется k чисел, не меньших ak. Поэтому ak ≤ bk.     Отсюда и следует утверждение задачи.",
        "Ответ: б) Вообще говоря, другая."
    ],
    "77888": [
        "Геометрическая прогрессия",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Имеется 4",
        "Решение: Покажем, что среди данных чисел не может быть больше четырёх попарно различных чисел.  Объединим равные числа в группы, выберем в каждой группе по одному числу и расположим выбранные числа в порядке убывания:"
    ],
    "78568": [
        "Последовательности (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Дана последовательность",
        "Решение: Пусть"
    ],
    "79356": [
        "Системы отрезков, прямых и окружностей",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: На плоскости расположено несколько прямых и точек. Доказать, что на плоскости найдётся точка",
        "Решение: Возьмём произвольную точку"
    ],
    "116873": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Даны n + 1 попарно различных натуральных чисел, меньших 2n (n > 1).   Докажите, что среди них найдутся три таких числа, что сумма двух из них равна третьему.",
        "Решение: Воспользуемся методом математической индукции.    База. При n = 2 выбранными оказываются числа 1, 2, 3. При этом 1 + 2 = 3.    Шаг индукции. Пусть есть n + 2 натуральных числа, меньших 2n + 2. Возможны два случая.    1) Среди выбранных чисел нет числа 2n + 1. Тогда из чисел, меньших 2n, выбрали по крайней мере n + 1 число. По предположению индукции, найдутся три числа, сумма которых равна третьему.    2) Среди выбранных чисел есть число 2n + 1. Разобьём числа 1, 2, ..., 2n на n пар, в сумме дающих 2n + 1: {1, 2n}, {2, 2n – 1}, ..., {n, n + 1}. Поскольку в набор входит ещё n + 1 число, то какая-то из пар входит в набор целиком. Числа этой пары и число 2n + 1 образуют искомую тройку."
    ],
    "60451": [
        "Числа Каталана",
        "Сложность: 4+",
        "Классы: 8,9,10,11",
        "Условие: а) Пусть {a1, a2,..., an} – последовательность целых чисел, сумма которых равна 1. Докажите, что ровно у одного из ее циклических сдвигов   {a1, a2, ..., an}, {a2, ..., an, a1}, ..., {an, a1, ..., an–1} все частичные суммы (от начала до произвольного элемента) положительны.",
        "Решение: а) Назовем весом последовательности такое число k, что частичные суммы s1 = a1, ..., sk = a1 + ... + ak положительны, а sk+1 ≤ 0  (если k < n). Рассмотрим циклический сдвиг, после которого образуется последовательность {b1, ..., bn} наибольшего веса. Докажем, что этот вес равен n. Пусть это не так, тогда рассмотрим наиболее длинную неположительную частичную сумму b1 +  ... + bk. Тогда все суммы bk+1, bk+1 + bk+2, ..., bk+1 + ... + bn положительны. Это значит, что переставив bk+1, ..., bn в начало последовательности, мы увеличим ее вес. Противоречие.     Пусть есть два разных циклических сдвига, удовлетворяющих условию. Например, и у {a1, a2, ..., an} и у {am, ..., an, a1, ..., am–1} все частичные суммы положительны. Тогда числа a1 + ... + am–1 и am + ... + an натуральные, а их сумма равна 1. Противоречие."
    ],
    "78263": [
        "Рекуррентные соотношения",
        "Сложность: 4+",
        "Классы: 8,9,10",
        "Условие: Дана четвёрка ненулевых чисел",
        "Решение: Пусть, напротив, где-нибудь в построенной последовательности встретилась  четвёрка (а,"
    ],
    "78830": [
        "Свойства частей, полученных при разрезаниях",
        "Сложность: 4+",
        "Классы: 8,9,10",
        "Условие: На плоскости проведено 300 прямых, причём никакие две из них не параллельны и никакие три не пересекаются в одной точке. По этим прямым плоскость разрезана на куски. Доказать, что среди кусков найдётся не менее 100 треугольников.",
        "Решение: Возьмём одну из данных прямых и рассмотрим все точки пересечения данных  прямых, не лежащие на выбранной прямой, и выберем среди них ближайшую. Среди  кусков, на которые разрезана плоскость, есть треугольник, одна вершина  которого — выбранная точка, а две другие лежат на выбранной прямой.  Действительно, треугольник, образованный выбранной прямой и двумя прямыми,  проходящими через выбранную точку, не могут пересекать другие прямые.    Мы сопоставили каждой прямой треугольник, причём один и тот же треугольник не  может соответствовать более чем трём разным прямым. Поэтому количество  треугольников не меньше 300/3 = 100."
    ],
    "78630": [
        "Покрытия",
        "Сложность: 5",
        "Классы: 10,11",
        "Условие: В восьми данных точках пространства установлено по прожектору, каждый из  которых может осветить в пространстве октант (трёхгранный угол со   взаимно-перпендикулярными сторонами). Доказать, что можно повернуть прожекторы  так, чтобы они осветили все пространство.",
        "Решение: Введём в пространстве систему координат"
    ],
    "35236": [
        "Прямые и кривые, делящие фигуры на равновеликие части",
        "Сложность: 5",
        "Классы: 9,10,11",
        "Условие: Имеется пирог некоторой формы. Докажите, что его можно   разрезать на четыре равные по массе части двумя прямолинейными   перпендикулярными разрезами.",
        "Подсказка: Для каждого направления найдите прямую, делящую пирог пополам,   а также перпендикулярную ей прямую, делящую пирог пополам.   Непрерывно изменяя эту пару перпендикулярных прямых, найдите   положение, в котором равновелики 4 части, на которые разделен   пирог.",
        "Решение: Можно переформулировать задачу следующим образом: на плоскости   дана некоторая фигура Ф площади S (для простоты можно предполагать,   что Ф -   многоугольник). Требуется найти две перпендикулярные прямые,   делящие Ф на 4 равные по площади части.   Вначале заметим, что для любого направления (или для любого вектора)   найдется прямая этого   направления, делящая площадь Ф пополам.   В самом деле, рассмотрим, например, горизонтальное направление.   Рассмотрим горизонтальную прямую, относительно которой Ф находится   в нижней полуплоскости. Начинаем непрерывно сдвигать прямую вниз   пока Ф не окажется целиком в верхней полуплоскости относительно   прямой. Площадь той части Ф, которая находится выше прямой,   изменяется при этом непрерывно от 0 до S, следовательно, в   некоторый момент эта площадь будет равна  S/2.   Итак, каждому единичному вектору a сопоставляется прямая l(a),   делящая площадь Ф пополам.   Выберем некоторый вектор a и обозначим за b вектор, который получается   из a поворотом на 90"
    ],
    "57349": [
        "Неравенства с площадями",
        "Сложность: 5",
        "Классы: 8,9",
        "Условие: Докажите, что сумма площадей пяти треугольников, образованных парами соседних сторон и соответствующими диагоналями выпуклого пятиугольника, больше площади всего пятиугольника.",
        "Решение: Пусть для определенности"
    ],
    "57987": [
        "Гомотетичные многоугольники",
        "Сложность: 5",
        "Классы: 9,10,11",
        "Условие: Докажите, что любой выпуклый многоугольник",
        "Решение: Пусть"
    ],
    "73571": [
        "Системы точек и отрезков (прочее)",
        "Сложность: 5",
        "Классы: 8,9,10,11",
        "Условие: На плоскости нельзя расположить семь прямых и семь точек так, чтобы через каждую из точек проходили три прямые и на каждой прямой лежали три точки. Докажите это.",
        "Решение: Предположим, что такое расположение семи точек и семи прямых существует. Прежде всего докажем, что каждые две из данных точек лежат на одной из данных прямых. Действительно, если"
    ],
    "78835": [
        "Свойства частей, полученных при разрезаниях",
        "Сложность: 5",
        "Классы: 9,10",
        "Условие: На плоскости проведено 3000 прямых, причём никакие две из них не параллельны и никакие три не пересекаются в одной точке. По этим прямым плоскость разрезана на куски. Доказать, что среди кусков найдётся не менее: а) 1000 треугольников, б) 2000 треугольников.",
        "Решение: а) См. решение задачи"
    ],
    "79323": [
        "Наименьшее или наибольшее расстояние (длина)",
        "Сложность: 5",
        "Классы: 9,10,11",
        "Условие: На плоскости задано конечное множество точек. Доказать, что в нём найдётся точка, у которой имеется не более трёх ближайших к ней точек из этого же множества.",
        "Решение: Предположим, что мы построили такое множество"
    ],
    "79499": [
        "Целочисленные решетки (прочее)",
        "Сложность: 5",
        "Классы: 9,10,11",
        "Условие: На координатной плоскости нарисованы круги радиусом 1/14 с центрами в каждой точке, у которой обе координаты — целые числа. Докажите, что любая окружность радиусом 100 пересечёт хотя бы один нарисованный круг.",
        "Решение: На клетчатой плоскости со стороной клетки 1 выберем самую северную  горизонтальную прямую"
    ],
    "32080": [
        "Выпуклая оболочка и опорные прямые (плоскости)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На плоскости даны четыре точки, не лежащие на одной прямой. Докажите, что существует неостроугольный треугольник с вершинами в этих точках.",
        "Решение: Рассмотрим различные случаи расположения четырёх данных точек на плоскости.     1) Четыре данные точки являются вершинами выпуклого четырёхугольника. Сумма углов этого четырёхугольника равна 360°. Поэтому хотя бы один из его углов не острый. Обозначим вершину, угол при которой не острый, через A. Тогда треугольник с вершинами в точке A и двух соседних с ней вершинах  четырёхугольника будет неостроугольным (рис. слева).     2) Одна из точек (обозначим ее A) лежит внутри треугольника BCD, образованного остальными тремя точками (рис. в центре). Сумма углов BAC, CAD и DAB равна 360°. Поэтому по крайней мере один из них имеет величину не меньше 120°. Неостроугольный треугольник найден и в этом случае.     3) Три точки лежат на одной прямой. Обозначим эти точки A, B и C в порядке их следования на прямой, четвёртую точку обозначим D (рис. справа). Тогда сумма углов DBA и DBC равна 180°. Значит, один из этих углов не меньше 90°. В этом случае требуемый треугольник тоже найден."
    ],
    "104006": [
        "Замощения костями домино и плитками",
        "Сложность: 5",
        "Классы: 7,8,9,10",
        "Условие: а) Наконец, у Снежной Королевы появились все квадраты с целыми сторонами, но каждый в единственном экземпляре. Королева пообещала Каю, что он станет мудрым, если сможет из каких-то имеющихся квадратов сложить прямоугольник. Сможет ли он это сделать?",
        "Решение: а) Можно составить прямоугольник 33×32 из 9 попарно различных квадратов так, как показано на рисунке."
    ],
    "34936": [
        "Наименьшее или наибольшее расстояние (длина)",
        "Сложность: 3+",
        "Классы: 7,8,9,10",
        "Условие: На каждой из 15 планет, расстояния между которыми попарно различны, находится по астроному, который наблюдает ближайшую к нему планету. Докажите, что некоторую планету никто не наблюдает.",
        "Подсказка: Выберите вначале пару ближайших друг к другу планет.",
        "Решение: Возьмём две планеты, расстояние между которыми наименьшее среди всех попарных расстояний. Ясно, что астрономы, находящиеся на этих двух планетах, смотрят друг на друга. Рассмотрим оставшиеся 13 планет. Если хотя бы один из астрономов с этих планет смотрит на одну из двух выбранных планет, то  на все 13 планет не хватит наблюдателей, то есть среди этих планет найдётся та, которую никто не наблюдает. Если же ни на одну из выбранных двух планет никто не смотрит, то эти две планеты можно не рассматривать и повторить все рассуждения для 13 планет. Рассуждая так и далее, мы найдём планету, которую никто не наблюдает (поскольку 15 - нечётное число)."
    ],
    "35232": [
        "Наименьшее или наибольшее расстояние (длина)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: По одну сторону от прямой дороги расположены два дома.   В каком месте дороги нужно поставить автобусную остановку, чтобы суммарное расстояние от остановки до домов было минимальным?",
        "Решение: См. задачу 55557."
    ],
    "35782": [
        "Выпуклая оболочка и опорные прямые (плоскости)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На круглой сковороде площади 1 испекли выпуклый блин площади больше ½.   Докажите, что центр сковороды находится под блином.",
        "Подсказка: Используйте то, что через точку, лежащую вне выпуклой фигуры, можно    провести прямую, не пересекающую этой фигуры. Другой путь – показать, что под блином найдутся две точки, симметричные относительно центра сковороды.",
        "Решение: Первый способ. Пусть центр сковородки O лежит вне выпуклого блина B.     Проведём через O прямую, не пересекающую B (это можно сделать, поскольку B – выпуклая фигура). Эта прямая делит сковороду на две половины; блин B находится в одной из этих половин, поэтому его площадь не больше ½. Противоречие.     Второй способ. Тогда для каждой точки A блина B симметричная ей относительно O точка A' лежит вне B (поскольку B – выпуклая фигура). Эти точки образуют блин B', симметричный B и не пересекающийся с ним. Но общая площадь этих блинов больше площади сковородки. Противоречие."
    ],
    "79244": [
        "Принцип крайнего  (прочее)",
        "Сложность: 3+",
        "Классы: 10",
        "Условие: В городе N с каждой станции метро на любую другую можно проехать. Доказать, что одну из станций можно закрыть на ремонт без права проезда через неё так, чтобы с любой из оставшихся станций можно было по-прежнему проехать на любую  другую.",
        "Решение: Первый способ. Пусть S – какая-то станция метро, T – самая далекая от S станция, то есть такая, что кратчайший путь из S на T ведёт через большее (или, по крайней мере, не меньшее) число станций, чем кратчайший путь от S до любой другой станции. Закроем теперь станцию T. При этом из S мы по-прежнему сможем проехать на любую другую (не закрытую) станцию U, ибо кратчайший путь из S в U никак не может вести через T – иначе станция V была бы расположена дальше от S, чем станция T. Поэтому, если U и V – две какие угодно отличные от T станции метро, то с одной из них мы заведомо сможем проехать на другую, минуя T (если U и V отличны от S, проедем с U на S, а оттуда – на V."
    ],
    "88275": [
        "Упорядочивание по возрастанию (убыванию)",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: Двадцать рыцарей надели двадцать плащей, икаждому плащ оказался короток. Тогда рыцари, сняв плащи, выстроились поросту. Самый высокий рыцарь взял себе самый длинный плащ, второй взял себе самый длинный плащ изоставшихся ит.д. Рыцарь самого маленького роста взял себе самый короткий плащ. Докажите, что ивэтом случае каждому рыцарю плащ окажется короток.",
        "Подсказка: Попробуйте сначала выстроить поросту рыцарей, апотом уже распределять поросту плащи.",
        "Решение: Сначала каждому рыцарю его плащ был короток. Начнём одновременно выстраивать поросту рыцарей иперераспределять плащи.  Поменяем плащи усамого высокого рыцаря ирыцаря, имеющего самый длинный плащ. Тогда каждому изэтих рыцарей их новые плащи будут малы: первому— потому что даже рыцарю меньшего роста этот плащ был короток; второму— потому что ему был короток даже более длинный плащ. Теперь насамого высокого рыцаря надет самый длинный плащ. Отведём этого рыцаря всторону. (Разумеется, если насамом высоком рыцаре был уже надет самый длинный плащ, он небудет нискем меняться плащами, асразу отойдёт всторону.)  Среди оставшихся снова поменяем плащи усамого высокого рыцаря ирыцаря, имеющего самый длинный плащ; снова отведём самого высокого рыцаря всторону. Снова всем рыцарям их плащи будут коротки. Будем повторять всё это дотех пор, пока ивсе рыцари, ивсе плащи невыстроятся поросту.  Поскольку навсех промежуточных этапах всем рыцарям были коротки их плащи, топосле всех переодеваний каждому рыцарю будет короток надетый нанём плащ."
    ],
    "78060": [
        "Наименьший или наибольший угол",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что не существует на плоскости четырех точек",
        "Решение: Мы предполагаем, что никакие три из четырёх данных точек не лежат на одной прямой. Возможны два различных расположения четырёх точек на плоскости.  1) Точки"
    ],
    "58049": [
        "Наименьший или наибольший угол",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Внутри круга радиуса1 лежат восемь точек. Докажите, что расстояние между некоторыми двумя из них меньше1.",
        "Решение: По крайней мере семь точек отличны от центра"
    ],
    "78181": [
        "Наименьшее или наибольшее расстояние (длина)",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Доказать, что не существует тетраэдра, в котором каждое ребро являлось бы стороной плоского тупого угла.",
        "Решение: В треугольнике может быть только один тупой угол, поэтому тупой угол лежит против той стороны, длина которой строго больше длин всех других сторон. В частности, наибольшая сторона треугольника не может быть стороной тупого угла.  Выберем в данном тетраэдре наибольшее ребро (если несколько рёбер тетраэдра имеют наибольшую длину, то выберем любое из них). Это ребро не может быть стороной плоского тупого угла."
    ],
    "78183": [
        "Наименьшее или наибольшее расстояние (длина)",
        "Сложность: 3+",
        "Классы: 11",
        "Условие: Существует ли тетраэдр, каждое ребро которого являлось бы стороной плоского тупого угла?",
        "Решение: Ответ:",
        "Ответ: задачи 5 для 9 класса"
    ],
    "78481": [
        "Выпуклая оболочка и опорные прямые (плоскости)",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Из любых шести точек на плоскости (из которых никакие три не лежат на одной прямой) можно так выбрать три, что треугольник с вершинами в этих точках имеет хотя бы один угол, не больший",
        "Решение: Возьмём на плоскости окружность настолько большого радиуса, чтобы она  содержала внутри себя все данные точки, и рассмотрим любую прямую"
    ],
    "78658": [
        "Принцип крайнего  (прочее)",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: Можно ли расположить на плоскости 1000 отрезков так, чтобы каждый отрезок обоими своими концами упирался строго внутрь других отрезков?",
        "Решение: Ответ:",
        "Ответ: Источники и прецеденты использования"
    ],
    "78660": [
        "Принцип крайнего  (прочее)",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Можно ли расположить на плоскости 1968 отрезков так, чтобы каждый из них обоими концами упирался строго внутрь других отрезков?",
        "Решение: См. решение задачи",
        "Ответ: нет, нельзя."
    ],
    "34963": [
        "Принцип крайнего",
        "Сложность: 2+",
        "Классы: ",
        "Условие: 8 теннисистов провели круговой турнир. Докажите, что найдутся 4  теннисиста A,B,C,D, такие что A выиграл у B,C,D, B выиграл у C и D,  C выиграл у D.",
        "Подсказка: Победитель выиграл хотя бы у четверых.",
        "Решение: Теннисист A, выигравший наибольшее число игр  (или один из таких теннисистов),   выиграл по крайней мере  у 4 человек (в среднем в 7 играх одерживается 3,5 победы).  Рассмотрим подтурнир между этими 4 теннисистами без учета игр с  остальными. Один из них (B) выиграл хотя бы у двух других  (в среднем в 3 играх одерживается 1,5 победы), из  которых один (C) выиграл у другого (D)."
    ],
    "79238": [
        "Выпуклая оболочка и опорные прямые (плоскости)",
        "Сложность: 3+",
        "Классы: 9",
        "Условие: Пусть на плоскости есть пять точек общего положения, то есть никакие три из них не лежат на одной прямой и никакие четыре — на одной окружности. Докажите, что среди этих точек есть две такие, что они лежат по разные стороны от окружности, проходящей через оставшиеся три точки.",
        "Решение: Среди данных точек выберем точки"
    ],
    "34876": [
        "Наименьшее или наибольшее расстояние (длина)",
        "Сложность: 4",
        "Классы: 7,8,9,10",
        "Условие: Круг поделен n диаметрами на 2n равных секторов, из которых n   красных и n синих. В красные сектора, начиная с некоторого,   подряд по часовой стрелке расставляются числа 1,2,...,n;   в синие сектора, начиная с некоторого,   также подряд расставляются числа 1,2,...,n,   но против часовой стрелки. Докажите, что найдется диаметр,   по каждую сторону от которого встречаются числа    1,2,...,n ровно по одному разу.",
        "Подсказка: Выберите ближайшую пару равных   чисел разного цвета.",
        "Решение: Условимся называть красными числа, стоящие в красных секторах, и   синими - стоящие в синих секторах.   Расстоянем между двумя числами a и b назовем количество чисел,   расположенных на меньшей дуге между числами a и b.   Числа, расставленные по окружности, разбиваются на пары равных.   Выберем ту пару равных чисел, расстояние между которыми наименьшее   (если таких пар несколько, выберем одну из них).   Пусть для определенности выбранная пара - красная единица и синяя   единица,   причем меньшая дуга s между ними идет от красной единицы    к синей против   часовой стрелки. На  дуге s либо нет чисел    (т.е. две единицы стоят рядом),   либо все числа одного цвета, иначе красное и синее числа n    были бы на расстоянии   меньшем, чем расстояние между единицами. Пусть все числа на этой дуге   (если они есть) - синие (случай, когда они красные, аналогичен).   Проведем диаметр, отделяющий синюю единицу от числа, следующего за  ним    по часовой стрелке; покажем, что этот диаметр искомый.   Действительно, рассмотрим полукруг, содержащий синюю единицу.   Прочтем синие числа, записанные в этом полукруге, начиная с единицы   против   часовой стрелки - это числа 1,2,...l (l - некоторое число).   Прочтем теперь красные числа. Поскольку на дуге   s нет красных чисел, то это будут числа n,n-1,...,n-m   (m - некоторое число). Т.к. всего в полукруге n чисел, то   в нем записаны все числа от 1 до n по одному разу."
    ],
    "34991": [
        "Принцип крайнего  (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: На прямой дано 50 отрезков.   Докажите, что либо некоторые восемь отрезков имеют общую точку, либо найдутся восемь отрезков, никакие два из которых не имеют общей точки.",
        "Подсказка: Выбирайте отрезок с наименьшим правым концом, далее – отрезок с наименьшим правым концом из отрезков, не пересекающихся с первым отрезком, и т.д.",
        "Решение: Пусть [a1, b1] – отрезок с наименьшим правым концом. Если число отрезков, содержащих точку b1, больше 7, то задача решена. Если оно не больше 7, то имеется по крайней мере 50 – 7 = 43 отрезка, лежащих целиком правее точки b1. Выберем из них отрезок [a2, b2] с наименьшим правым концом. Тогда либо b2 принадлежит восьми отрезкам, либо имеется 50 – 2·7 = 36 отрезков, лежащих целиком правее точки b2. Продолжая так и далее, мы либо найдём точку, принадлежащую восьми отрезкам, либо получим семь таких попарно не пересекающихся отрезков [a1, b1], [a2, b2], ..., [a7, b7], что правее bk лежит еще 50 – 7k отрезков, т.е. правее b7 лежит еще один отрезок [a8, b8], т.е. имеется восемь попарно не пересекающихся отрезков [a1, b1], [a2, b2], ..., [a8, b8]."
    ],
    "78295": [
        "Упорядочивание по возрастанию (убыванию)",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Из чисел",
        "Решение: Упорядочим данные иискомые числа повозрастанию:"
    ],
    "78610": [
        "Наименьший или наибольший угол",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Доказать, что в круге радиуса 1 нельзя найти более 5 точек, попарные расстояния между которыми все больше 1.",
        "Решение: Допустим, что внутри круга радиуса1 можно расположить шесть точек так, чтобы расстояние между любыми двумя было больше1. Так как расстояние от центра круга радиуса1 до любой его точки непревосходит единицы, то ни одна из этих шести точек не может совпадать с центром круга. Пусть"
    ],
    "32125": [
        "Выпуклая оболочка и опорные прямые (плоскости)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: На плоскости отмечены четыре точки. Докажите, что их  можно разбить на две группы так, что эти группы точек нельзя  будет отделить одну от другой никакой прямой.",
        "Решение: Рассмотрим отдельно всевозможные способы расположения  \t\t\t\tчетырех точек на плоскости."
    ],
    "34889": [
        "Выпуклая оболочка и опорные прямые (плоскости)",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На плоскости дан невыпуклый n-угольник    с попарно непараллельными сторонами.  Пусть A и B - две несоседние    вершины n-угольника,    разделяющие его контур на две ломаные AXY...B и BZT...A.    Разрешается отразить одну из этих ломаных относительно середины    отрезка AB.    При этом получится новый многоугольник (а если не получится, то такая операция не разрешена).    Докажите, что с помощью таких действий можно получить выпуклый многоугольник.",
        "Подсказка: При данной операции площадь увеличивается.",
        "Решение: Набор из n векторов, соответствующих сторонам n-угольника,    после выполнения данной операции остается неизменным, изменяется    лишь порядок следования этих векторов.    Поэтому в результате проведения операций мы будем получать только    многоугольники из конечного числа n-угольников    (их не более (n-1)!=(n-1)*(n-2)...*2*1), в которых    векторы, соответствующие сторонам, образуют фиксированный набор.    Если многоугольник невыпуклый, то    найдется прямая,    проходящая через две его несоседние вершины,    относительно которой n-угольник расположен целиком по одну сторону.     Произведем указанную операцию относительно этих двух вершин.    Если получен невыпуклый многоугольник, то опять проведем такую же операцию, и так далее.   Заметим, что при каждой операции площадь n-угольника увеличивается.   Так как может получаться лишь конечное число различных многоугольников, то когда-нибудь    мы придем к многоугольнику, для которого    выполнение указанной операции невозможно.    Этот многоугольник обязан быть выпуклым"
    ],
    "35412": [
        "Принцип крайнего  (прочее)",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: 25 дачников получили садовые участки. Каждый участок представляет собой квадрат 1×1, и все участки вместе составляют квадрат 5×5. Каждый дачник враждует не более, чем с тремя другими дачниками. Докажите, что можно распределить участки таким образом, чтобы участки враждующих дачников не были бы соседними (по стороне).",
        "Подсказка: Распределите участки вначале произвольным образом, а затем пусть дачники меняются участками так, чтобы число пар враждующих соседей уменьшилось.",
        "Решение: Число способов распределить участки между дачниками конечно, поэтому можно рассмотреть способ, при котором число пар враждующих соседей минимально.    Предположим, что пары враждующих соседей имеются; пусть A и B – два враждующих соседа. Рассмотрим 23 дачников, отличных от A и B. Покажем, что среди них найдётся такой дачник C, что а) C не враждует с соседями B; б) C не является соседом враждующих с B дачников. Действительно, условие а) исключает не более 4·3 − 1 = 11 дачников (один из соседей B – дачник A, одним из врагов которого является B). Условие б) исключает еще 3·4 − 1 = 11 дачников. Итак, оба условия исключают не более 22 дачников. Значит, хотя бы один дачник удовлетворяет этим условиям.       Если дачники B и C поменяются участками, то пара враждующих соседей (A, B) исчезнет, а новых пар не возникнет. Это противоречит выбору исходного распределения."
    ],
    "35619": [
        "Принцип крайнего",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: За дядькой Черномором выстроились чередой бесконечное число богатырей разного роста. Докажите, что он может приказать части из них выйти из строя так, чтобы в строю осталось бесконечное число богатырей и все они стояли по росту (в порядке возрастания или убывания).",
        "Подсказка: Возьмите самого высокого богатыря, потом самого высокого среди стоящих за ним, потом самого высокого среди стоящих за вторым выбранным, и т. д. Если это невозможно – найдите бесконечную подпоследовательность богатырей, стоящих в порядке убывания роста.",
        "Решение: Назовём B-хвостом всю череду богатырей, стоящих за богатырем B. Рассмотрим два случая.    1) В одном из хвостов (B-хвосте) нет самого высокого богатыря. Возьмём в этом хвосте произвольного богатыря B1. За ним найдётся более высокий богатырь B2 (иначе самый высокий из богатырей между B и B1, включая последнего, был бы самым высоким в B-хвосте. Аналогично в B2-хвосте найдётся богатырь B3, который выше B2, и т. д. В результате получится бесконечная возрастающая череда богатырей.    2) В каждом хвосте есть самый высокий богатырь. Возьмем произвольного богатыря B. Пусть B1 – самый высокий в B-хвосте, B2 – самый высокий в B1-хвосте (он, конечно, ниже B1), B3 – самый высокий в B2-хвосте (он ниже B2), и т. д. В результате получится бесконечная убывающая череда богатырей."
    ],
    "58050": [
        "Наименьший или наибольший угол",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Шесть кругов расположены на плоскости так, что некоторая точка",
        "Решение: Один из углов между шестью отрезками, соединяющими точку"
    ],
    "58055": [
        "Наименьшее или наибольшее расстояние (длина)",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Докажите, что по крайней мере одно из оснований перпендикуляров, опущенных из внутренней точки выпуклого многоугольника на его стороны, лежит на самой стороне, ане на ее продолжении.",
        "Решение: Пусть"
    ],
    "58056": [
        "Наименьшее или наибольшее расстояние (длина)",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Из каждой вершины многоугольника опущены перпендикуляры на стороны, её не содержащие. Докажите, что хотя бы для одной вершины одно из оснований перпендикуляров лежит на самой стороне, а не на её продолжении.",
        "Решение: Возьмём наибольшую сторону"
    ],
    "58076": [
        "Наименьший или наибольший угол",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: На плоскости даны четыре точки, не лежащие на одной прямой. Докажите, что хотя бы один из треугольников свершинами вэтих точках не является остроугольным.",
        "Решение: Возможны два варианта расположения четырех точек."
    ],
    "58077": [
        "Принцип крайнего  (прочее)",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: На плоскости дано бесконечное множество прямоугольников, вершины каждого из которых расположены вточках скоординатами (0, 0), (0,",
        "Решение: У прямоугольника свершинами вточках (0, 0), (0,"
    ],
    "78019": [
        "Принцип крайнего  (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Если дан ряд из 15 чисел",
        "Решение: Ответ:",
        "Ответ: a"
    ],
    "78087": [
        "Принцип крайнего  (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Взяли три числа",
        "Решение: Ответ:",
        "Ответ: y"
    ],
    "78231": [
        "Принцип крайнего  (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Доказать, что никакую прямоугольную шахматную доску шириной в 4 клетки нельзя обойти ходом шахматного коня, побывав на каждом поле по одному разу и последним ходом вернувшись на исходную клетку.",
        "Решение: Мы представляем себе доску"
    ],
    "78241": [
        "Наименьшее или наибольшее расстояние (длина)",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Имеется 100 точек на плоскости, причём расстояние между любыми двумя из них не превосходит 1, и если",
        "Решение: Выберем среди данных точек две точки"
    ],
    "34989": [
        "Упорядочивание по возрастанию (убыванию)",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Солдаты построены в две шеренги по n человек, так что каждый солдат из первой шеренги не выше стоящего за ним солдата из второй шеренги. В шеренгах солдат выстроили по росту. Докажите, что после этого каждый солдат из первой шеренги также будет не выше стоящего за ним солдата из второй шеренги.",
        "Решение: Обозначим через a1, a2, ..., an рост солдат первой шеренги в порядке убывания, а через b1, b2, ..., bn рост солдат второй шеренги в порядке убывания (те же обозначения используем и для самих солдат). Пусть утверждение задачи неверно: ak > bk для некоторого k. Это означает, что до перестраивания по росту солдат ak мог стоять только перед одним из k – 1 солдат b1, b2, ..., bk–1. То же справедливо и для солдат a1, a2, ..., ak–1, поскольку они не ниже солдата ak. Итак, до перестраивания шеренг k солдат a1, a2, ..., ak могли стоять только перед k – 1 солдатами b1, b2, ..., bk–1. Противоречие."
    ],
    "78265": [
        "Принцип крайнего  (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: В клетки таблицы m×n вписаны некоторые числа. Разрешается одновременно менять знак у всех чисел некоторого столбца или некоторой строки. Доказать, что многократным повторением этой операции можно превратить данную таблицу в такую, у которой суммы чисел, стоящих в каждом столбце и каждой строке, неотрицательны.",
        "Решение: С помощью перемен знака у чисел некоторого столбца или некоторой строки  таблицы мы можем, очевидно, получить не больше чем 2mn, различных таблиц; (2mn— число способов выбора знаков у mn чисел).  Поскольку таких таблиц имеется конечное число, среди них существует (может быть, не одна) таблица, сумма всех чисел которой максимальна. Если бы у этой таблицы сумма чисел некоторой строки была бы отрицательна, то путём перемены знака у всех чисел этой строки мы получили бы таблицу с большей общей суммой (так как суммы чисел, стоящих во всех остальных строках, при этом не меняются). По той же причине не может быть отрицательной сумма чисел никакого столбца таблицы. Итак, мы должны, меняя знаки у чисел некоторых строк и столбцов, прийти к таблице с наибольшей общей суммой – она и будет искомой."
    ],
    "78800": [
        "Упорядочивание по возрастанию (убыванию)",
        "Сложность: 4",
        "Классы: 11",
        "Условие: Даны два набора чисел: a1, ..., an и b1, ..., bn. Расположим числа ak в возрастающем порядке, а числа bk – в убывающем порядке. Получатся наборы  A1 ≤ ... ≤ An, B1 ≥ ... ≥ Bn. Доказать, что max{a1 + b1, ..., an + bn} ≥ max{A1 + B1, ..., An + Bn}.",
        "Решение: Перенумеруем числа в исходных наборах {ai}, {bi} так, что bi = Bi при всех i. Пусть для некоторых индексов k < l выполнено неравенство al < ak. Докажем, что если мы поменяем местами ak и al, то число  {ak + bk} не возрастёт. Действительно, ak + bk ≥ ak + bl и   ak + bk ≥ al + bk.     С другой стороны ясно, что такими операциями можно из произвольной  перестановки чисел a1, ..., an можно получить перестановку A1, ..., An. Следовательно,  max{a1 + b1, ..., an + bn} ≥ max{A1 + B1, ..., An + Bn}."
    ],
    "108996": [
        "Наименьшее или наибольшее расстояние (длина)",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: На плоскости задано",
        "Решение: Так как у нас конечное число точек, то можно выбрать две из них, расстояние между которыми наибольшее. Из этих точек как из центров проведем окружности радиуса 1. Любая третья точка попадет в один из этих кругов. Это происходит потому, что если между выбранными нами точками расстояние больше 1, то третья точка должна от одной из них находиться на расстоянии, не большем 1. Если расстояние между выбранными точками не больше единицы, то утверждение тем более верно, так как выбрано наибольшее расстояние."
    ],
    "78119": [
        "Наименьший или наибольший угол",
        "Сложность: 4+",
        "Классы: 9",
        "Условие: В неравносторонний треугольник вписана окружность, точки касания которой со сторонами приняты за вершины второго треугольника. В этот второй треугольник снова вписана окружность, точки касания которой являются вершинами третьего треугольника; в него вписана третья окружность и т.д. Докажите, что в образовавшейся последовательности треугольников нет двух подобных.",
        "Решение: Пусть"
    ],
    "35135": [
        "Наименьшая или наибольшая площадь (объем)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: На плоскости синим и красным цветом окрашено несколько точек так, что никакие три точки одного цвета не лежат на одной прямой (точек каждого цвета не меньше трёх). Докажите, что какие-то три точки одного цвета образуют треугольник, на трёх сторонах которого лежит не более двух точек другого цвета.",
        "Подсказка: Рассмотрите треугольник наименьшей площади с вершинами в трёх точках одного цвета.",
        "Решение: Рассмотрим треугольник Т наименьшей площади S с вершинами в трёх точках одного цвета. Допустим, что на его сторонах расположено по крайней мере три точки другого цвета. Тогда эти три точки являются вершинами треугольника, площадь которого меньше S, что противоречит выбору треугольника Т."
    ],
    "58057": [
        "Наименьшее или наибольшее расстояние (длина)",
        "Сложность: 4+",
        "Классы: 8,9",
        "Условие: Докажите, что влюбом выпуклом пятиугольнике найдутся три диагонали, из которых можно составить треугольник.",
        "Решение: Пусть"
    ],
    "58062": [
        "Наименьшая или наибольшая площадь (объем)",
        "Сложность: 4+",
        "Классы: 8,9",
        "Условие: На плоскости расположено",
        "Решение: Выберем среди всех треугольников свершинами вданных точках треугольник наибольшей площади. Пусть это будет треугольник"
    ],
    "58063": [
        "Наименьшая или наибольшая площадь (объем)",
        "Сложность: 4+",
        "Классы: 8,9",
        "Условие: Многоугольник",
        "Решение: Пусть"
    ],
    "78105": [
        "Наименьшее или наибольшее расстояние (длина)",
        "Сложность: 4+",
        "Классы: 9,10",
        "Условие: Плоский многоугольник",
        "Решение: Пусть"
    ],
    "78220": [
        "Принцип крайнего  (прочее)",
        "Сложность: 4+",
        "Классы: 11",
        "Условие: Даны числа",
        "Решение: Расположим числа"
    ],
    "78250": [
        "Выпуклая оболочка и опорные прямые (плоскости)",
        "Сложность: 4+",
        "Классы: 9,10,11",
        "Условие: На плоскости дано",
        "Решение: Рассмотрим выпуклую оболочку всех точек— это выпуклый многоугольник"
    ],
    "58058": [
        "Наименьшее или наибольшее расстояние (длина)",
        "Сложность: 5",
        "Классы: 8,9,10",
        "Условие: Докажите, что многоугольник нельзя покрыть двумя многоугольниками, гомотетичными ему скоэффициентом",
        "Решение: Пусть"
    ],
    "77891": [
        "Выпуклая оболочка и опорные прямые (плоскости)",
        "Сложность: 5",
        "Классы: 8,9",
        "Условие: Даны два треугольника:",
        "Решение: Решим задачу в более общем виде, когда вместо двух треугольников взяты выпуклые"
    ]
}