{
    "65331": [
        "Дискретное распределение",
        "Сложность: 2+",
        "Классы: 8,9,10,11",
        "Условие: Вася написал на листке бумаги записку, сложил её вчетверо, надписал сверху   МАМЕ (см. фото). Затем он развернул записку, дописал ещё кое-что, опять сложил записку по линиям сгиба случайным образом (не обязательно, как раньше) и оставил  на столе, положив случайной стороной вверх. Найдите вероятность того,  что надпись МАМЕ по-прежнему сверху.",
        "Решение: У листа две стороны, и каждая разделена линиями сгиба на четыре части. Таким образом, всего на двух сторонах 8 частей. Каждая из этих частей с равной вероятностью может оказаться сверху при случайном складывании листа по старым линиям сгиба.  Следовательно, вероятность того, что сверху  окажется та часть, на которой написано МАМЕ, равна &frac18;.",
        "Ответ: &frac18;."
    ],
    "65272": [
        "Дискретное распределение",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Три усталых ковбоя зашли в салун, и повесили свои шляпы на бизоний рог при входе. Когда глубокой ночью ковбои уходили, они были не в состоянии отличить одну шляпу от другой и поэтому разобрали три шляпы наугад. Найдите вероятность того, что никто из них не взял свою собственную шляпу.",
        "Решение: У ковбоев 6 различных вариантов взять шляпы. При этом только в двух вариантах из шести никто из ковбоев не возьмет свою шляпу, поскольку ковбой, который берет шляпу первым, может взять любую из двух шляп других ковбоев. У оставшихся же ковбоев выбора нет, так как шляпа одного из них по-прежнему никем не взята, и значит, он обязательно должен взять другую шляпу.    Таким образом, искомая вероятность равна 2/6 = &frac13;.",
        "Ответ: &frac13;."
    ],
    "65258": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Проведите следующий эксперимент 10 раз: подбросьте вначале монету 10 раз подряд и запишите количество выпавших орлов, затем подбросьте монету 9 раз подряд и также запишите количество выпавших орлов. Назовём эксперимент удачным, если в первом случае количество выпавших орлов больше, чем во втором. После проведения серии из 10 таких экспериментов запишите количество удачных и неудачных экспериментов. Собранную статистику оформите в виде таблицы.",
        "Решение: См. задачу 34976.",
        "Ответ: ½."
    ],
    "65271": [
        "Непрерывное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Аня, Боря и Вася решили пойти на Ёлку. Они договорились встретиться на автобусной остановке, но не знают, кто во сколько придёт. Каждый из них может прийти в случайный момент времени с 15.00 до 16.00. Вася самый терпеливый из всех: если он придёт и на остановке не будет ни Ани, ни Бори, то он будет ждать кого-нибудь из них 15 минут, и если никого не дождётся, пойдёт на Ёлку один. Боря менее терпеливый: он будет ждать лишь 10 минут. Аня самая нетерпеливая: она вообще не будет ждать. Однако если Боря и Вася встретятся, то они будут ждать Аню до 16.00. Какова вероятность того, что на Ёлку они пойдут все вместе?",
        "Решение: Так как Аня совсем не будет ждать, то ребята все вместе пойдут на Ёлку только если Аня придёт последней. Очевидно, что эти события независимые, следовательно, P({все трое пойдут на Ёлку вместе}) =   P({Аня придёт последней})P({Боря и Вася встретятся}).    Первая вероятность, очевидно, равна &frac13;.     Вторая вероятность находится геометрически (см. рис.):",
        "Ответ: ≈0,124."
    ],
    "65276": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: По случаю начала зимних каникул все мальчики из 8 В пошли в тир. Известно, что в 8 В n мальчиков. В тире, куда пришли ребята, n мишеней. Каждый из мальчиков случайным образом выбирает себе мишень, при этом некоторые ребята могли выбрать одну и ту же мишень. После этого все одновременно делают залп по своим мишеням. Известно, что каждый из мальчиков попал в свою мишень. Мишень считается поражённой, если в нее попал хоть один мальчик.    а) Найти среднее количество поражённых мишеней.    б) Может ли среднее количество поражённых мишеней быть меньше n/2?",
        "Решение: а) Обозначим через p вероятность того, что данная мишень поражена. В силу симметрии, искомое среднее число пораженных целей равно np.     Заметим, что вероятность того, что данный мальчик поразит данную мишень, равна 1/n. Следовательно, вероятность того, что данный мальчик не поразит данную мишень, равна 1 – 1/n. Поэтому (в силу независимости выстрелов) вероятность того, что ни один мальчик не поразит данную мишень равна (1 – 1/n)n. Значит, вероятность того, что хотя бы один мальчик поразит данную мишень, равна 1 – (1 – 1/n)n.     Таким образом, среднее количество поражённых мишеней равно n(1 – (1 – 1/n)n).",
        "Ответ: а) n(1 – (1 – 1/n)n);  б) не может."
    ],
    "65309": [
        "Непрерывное распределение",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: В бумажном квадрате случайным образом выбирается точка O. Затем квадрат сгибают так, чтобы каждая вершина наложилась на точку O. На рисунке показана одна из возможных схем складывания. Найдите математическое ожидание числа сторон появившегося многоугольника.",
        "Решение: Небольшое геометрическое исследование показывает, что в результате может получиться шестиугольник, пятиугольник и четырёхугольник. Четырёхугольник получается, только если точка O попала точно в центр или в вершину квадрата. Вероятность этого равна нулю.",
        "Ответ: 4 + π/2 ≈ 5,571."
    ],
    "65310": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: В автобусе n мест, и все билеты проданы n пассажирам. Первым в автобус заходит Рассеянный Учёный и, не посмотрев на билет, занимает первое попавшееся место. Далее пассажиры входят по одному. Если вошедший видит, что его место свободно, он занимает свое место. Если же место занято, то вошедший занимает первое попавшееся свободное место. Найдите вероятность того, что пассажир, вошедший последним, займет место согласно своему билету?",
        "Решение: Пронумеруем всех пассажиров, начиная с Учёного, в том порядке, в каком они заходили в автобус. Последний пассажир имеет номер n. Для простоты места пронумеруем так же. Пусть все, кроме последнего пассажира, уже вошли и заняли места. Осталось одно свободное место. Если бы это было второе место, то второй пассажир (или Учёный) уже занял бы его. То же верно для мест номерами 3, 4, 5, ..., n – 1. Значит, это место принадлежит либо последнему пассажиру, либо Рассеянному Учёному.     Ясно, что оно с равными шансами может принадлежать как первому, так и последнему. В первом случае последний пассажир сядет не на своё место, а во втором – на своё. Значит, вероятности обоих событий равны ½.",
        "Ответ: ½."
    ],
    "65326": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Рассеянный Ученый в своей лаборатории вывел одноклеточный организм, который с вероятностью 0,6 делится на два таких же организма, а с вероятностью 0,4 погибает, не оставив потомства. Найдите вероятность того, что через некоторое время у Рассеянного Ученого не останется ни одного такого организма.",
        "Решение: Неважно, какое время будет затрачено. Поэтому для простоты будем  считать, что организмы делятся или погибают каждую секунду, но строго по одному. Когда с одним из них что-то происходит, остальные терпеливо ждут своей очереди. Сделав такое предположение, мы получаем стандартную задачу случайного блуждания: каждую секунду организмов становится либо на один больше (с вероятностью p = 0,6), либо на один меньше (с вероятностью q = 0,4), чем было.     Число организмов в некоторый момент будем называть состоянием популяции. Пусть x – вероятность того, что за несколько шагов число организмов уменьшится на 1.    Вначале популяция находится в состоянии 1, и нас интересует вероятность перехода 1 → 0, то есть как раз значение x.    Популяция может прийти в состояние 0 двумя способами.   1) В первую секунду единственный имеющийся организм погибает. Вероятность этого q.    2) В первую секунду единственный организм делится, и популяция переходит в состояние 2. Вероятность этого события p. Дальнейший переход   2 → 0 имеет вероятность x², поскольку он состоит из двух независимых переходов 2 → 1 и 1 →  0, каждый из которых имеет вероятность x.",
        "Ответ: &frac23;."
    ],
    "65338": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: В игре Что? Где? Когда? разыгрываются 13 конвертов с вопросами от телезрителей. Конверты выбираются по очереди в случайном порядке с помощью волчка. Если знатоки отвечают верно, зарабатывают очко, если неверно – одно очко достается телезрителям. Игра оканчивается, как только одна из команд набрала 6 очков. Предположим, что силы команд Знатоков и Телезрителей равны.    а) Найдите математическое ожидание числа очков, набранных командой  Знатоков за 100 игр.    б) Найдите вероятность того, что в следующей игре конверт №5 будет разыгран.",
        "Решение: а) Предположим, что за одну игру проигравшая команда заработала  kочков. Выигравшая команда заработала 6 очков, поэтому всего было разыграно   6 + k конвертов. При этом за вопрос из последнего конверта очко обязательно получила выигравшая команда, а за остальные 5 + k вопросов очки могла получить как та, так и другая команда с вероятностью ½. Поэтому математическое ожидание случайной величины  X число очков, заработанных проигравшей командой за одну игру равно       Заметим, что , в частности, . Поэтому   .     В первой скобке – сумма вероятностей того, что при игре до 7 побед  проигравшая команда заработает k – 1 очко (1 ≤  k ≤ 7); она равна 1. Следовательно,      Прибавляем 6, чтобы получить общую сумму очков (заработанных обеими командами), делим на два, чтобы получить только ожидание суммы очков знатоков (ведь силы равны): . Теперь осталось умножить результат на 100, поскольку прошло 100 игр.",
        "Ответ: а) ;   б) ."
    ],
    "65342": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На сушке в случайном порядке (как достали из стиральной машины) висит n  носков. Среди них – два любимых носка Рассеянного Учёного. Носки загорожены сохнущей простыней, поэтому Учёный их не видит, и достаёт по одному носку на ощупь. Найдите математическое ожидание числа носков, снятых Учёным к моменту, когда у него окажутся оба любимых носка.",
        "Решение: Удобно составить треугольную таблицу. Закрашенные ячейки соответствуют парам любимых носков. Например, пара (2, 4), помеченная знаком Х, соответствует случаю, когда первый любимый носок попался вторым, а второй – четвёртым по счету.  Все пары равновозможны, а общее  их число равно .",
        "Ответ: &frac23; (n + 1)."
    ],
    "65358": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Если один человек тратит в очереди одну минуту на ожидание, будем говорить, что  бесцельно затрачена одна человеко-минута. В очереди в банке стоит восемь человек, из них пятеро планируют простые операции, занимающие 1 минуту, а остальные планируют длительные операции, занимающие 5 минут. Найдите:    а) наименьшее и наибольшее возможное суммарное количество бесцельно затраченных человеко-минут;    б) математическое ожидание количества бесцельно затраченных человеко-минут, при условии, что клиенты встают в очередь в случайном порядке.",
        "Решение: Пусть короткая операция занимает a, а длинная – b  минут (a < b).  Клиента, планирующего простую операцию, будем называть торопыгой, а того, кто собирается возиться долго –  копушей. Предположим, что торопыг всего n, а копуш – m.    Очевидно, число бесцельно потраченных человеко-минут зависит от порядка, в котором чередуются торопыги и копуши.",
        "Ответ: а) 40 минут и 100 минут; б) 70 минут."
    ],
    "66052": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Последовательность состоит из 19 единиц и 49 нулей, стоящих в случайном порядке. Назовём группой максимальную подпоследовательность из одинаковых символов. Например, в последовательности 110001001111 пять групп: две единицы, потом три нуля, потом одна единица, потом два нуля и, наконец, четыре единицы. Найдите математическое ожидание длины первой группы.",
        "Решение: Отдельно пронумеруем единицы числами от 1 до 19 и отдельно – нули числами от 1 до 49. Пусть Ik – индикатор события перед k-й единицей нет нулей и Jm – индикатор события перед m-м нулём нет единиц, где 1 ≤ k ≤ 19 и 1 ≤ m ≤ 19. Если хотя бы один из индикаторов Ik равен единице, то первая группа состоит из единиц, и поэтому все индикаторы Jm равны нулю. И наоборот – если хотя бы один из индикаторов Jm равен единице, то все Ik равны нулю. Искомая величина X длина первой группы равна I1 + I2 + ... + I19 + J1 + J2 + ... + J49.     Вероятность события Ik = 1 равна 1/50, поскольку это событие наступает только тогда, когда в случайно перемешанной последовательности, состоящей из k-й единицы и всех 49 нулей, единица стоит на первом месте. Следовательно, EIk = P(Ik = 1) = 0,02. Аналогично   EJm = P(Jm = 1) = 1/20 = 0,05. Поэтому EX = 19·0,02 + 49·0,05 = 2,823.",
        "Ответ: 2,83."
    ],
    "65277": [
        "Дискретное распределение",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: А и Б стреляют в тире, но у них есть только один шестизарядный револьвер с одним патроном. Поэтому они договорились по очереди случайным образом крутить барабан и стрелять. Начинает А. Найдите вероятность того, что выстрел произойдёт, когда револьвер будет у А.",
        "Решение: Выстрел происходит на нечётной попытке (когда револьвер у А), в остальные попытки выстрела не происходит. Следовательно, искомая вероятность есть сумма    &frac16; + (&frac56;)²·&frac16; + (&frac56;)4·&frac16; + ... = 6/11.",
        "Ответ: 6/11."
    ],
    "65339": [
        "Дискретное распределение",
        "Сложность: 4+",
        "Классы: 9,10,11",
        "Условие: На борту авиалайнера 2n пассажиров, и авиакомпания загрузила для них n порций питания с курицей и n порций с рыбой. Известно, что пассажир с вероятностью 0,5 предпочитает курицу и с вероятностью 0,5 – рыбу. Назовём пассажира недовольным, если ему осталось не то, что он предпочитает.    а) Найдите наиболее вероятное число недовольных пассажиров.    б) Найдите математическое ожидание числа недовольных пассажиров.    в) Найдите дисперсию числа недовольных пассажиров.",
        "Решение: а) Число недовольных пассажиров может быть любым от 0 до n. В случае n = 1 всё очевидно: недовольных либо нет, либо один, причём оба случая равновозможны. Далее считаем, что n > 1.     Введём случайную величину ξ Число недовольных. ξ = 0, только если ровно n пассажиров предпочитают курицу, а n  остальных – рыбу. Будем считать успехом событие пассажир хочет курицу. Тогда      Ровно один пассажир будет недоволен, если число пассажиров, предпочитающих курицу, отличается от n на единицу, то есть число успехов равно   n ± 1. Поэтому  P(ξ = 1) = P({n + 1 успех в серии из 2n испытаний}) +   P({n – 1 успех в серии из 2n испытаний}) =      Рассуждая так же, найдём, что , где k = 1, 2, ..., n.    В последовательности чисел  всего 2n + 1 число (это 2n-я строка треугольника Паскаля). Сначала эти числа возрастают при m = 0, 1, ..., n, а потом убывают при m = n, n + 1, ..., 2n. При этом среднее число  больше других, но меньше, чем удвоенное предыдущее:  (равенство наступает только при n = 1).      Таким образом, при n > 1 P(ξ = 0) < P(ξ  = 1) > P(ξ = 2) > ... > P(ξ = n).    Результат проиллюстрирован на  диаграмме распределения случайной величины ξ при n = 5. Для сравнения бледным цветом на том же рисунке дана диаграмма биномиального распределения   .",
        "Ответ: а) Если n > 1, то наиболее вероятен один недовольный; если n = 1, то с равными вероятностями либо имеется один недовольный, либо недовольных нет вовсе;   б) ;  в)  ."
    ],
    "35178": [
        "Парадоксы",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Каждый вечер Иван Таранов приходит в случайное время на автобусную   остановку. На этой остановке останавливаются два маршрута -    на одном из них Иван может ехать к себе домой, а на другом -    в гости к другу Козявкину.    Иван ждет первого автобуса и в зависимости от того, какой   автобус подошел, он едет либо домой, либо к другу.   Через некоторое время Иван заметил, что   в гостях у Козявкина он оказывается при этом примерно в два    раза чаще, чем дома. На основе этого Иван делает вывод,   что один из автобусов ходит в два раза чаще другого.   Прав ли он? Могут ли при выполнении условия задачи   автобусы ходить с одинаковой частотой?   (Предполагается, что автобусы ходят не случайным образом,   а по некоторому расписанию.)",
        "Подсказка: Если расписание устроено таким образом, что маршрут B всегда   приходит почти сразу после маршрута A, то на автобусе   маршрута B почти никогда не поедешь.",
        "Решение: Рассмотрим следующий пример. Пусть маршрут A, который везет   Ивана домой, приходит каждый час в 00 минут (т.е. в 0.00, 1.00, 2.00,   ... ,23.00), а маршрут B, который везет к другу,   приходит каждый час через 40 минут после автобуса маршрута A   (т.е. в 0.40, 1,40, ... ,23.40).   Таким образом, если Ваня подходит к остановке в первые 40 минут    каждого часа, то он оказывается у друга, а если в последние 20   минут каждого часа (это происходит в два раза реже),   то у себя дома."
    ],
    "35710": [
        "Теория алгоритмов (прочее)",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Трое друзей решают жребием, кто идет за соком.  У них есть одна монета. Как им устроить жребий, чтобы  все имели равные шансы бежать?",
        "Подсказка: Выпадение некоторой комбинации может иметь значение повторить  жребий.",
        "Решение: Один из возможных путей таков. Вначале бросаем монету два раза.  Если оба раза выпал орел, то идет первый,  если первый раз выпал орел, а второй раз - решка, то идет второй,  если же первый раз выпала решка, а второй раз - орел, то идет третий,  если оба раза выпала решка, то проводим второй раунд  жребия, аналогичный первому, т.е. снова бросаем монету два раза, и  т.д.    Ясно, что в каждом раунде вероятность проигрыша каждого из трех  друзей равна 1/4, и еще с вероятностью 1/4 придется провести новый  раунд. Теоретически возможно, что все время выпадают  решки, и этот процесс не закончится. Но вероятность этого события  равна 0. Действительно, вероятность того, что после n раундов  жребий не закончен, равна 1/2"
    ],
    "65315": [
        "Дискретное распределение",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: 40% приверженцев некоторой политической партии являются женщинами. 70% приверженцев этой партии – городские жители. При этом 60% горожан, поддерживающих партию, – мужчины. Являются ли независимыми события приверженец партии – горожанин и приверженец партии – женщина?",
        "Решение: Пусть событие A приверженец – женщина, а B  – приверженец – горожанин. По условию P(A) = 0,4.    В городе живет 70% избирателей партии, из них 60% мужчины. Поэтому оставшиеся 40% – женщины, то есть доля женщин среди горожан такая же, как  и среди всех избирателей. Значит, P(A|B) = 0,4.     Безусловная вероятность события A и условная вероятность этого события при условии B одинаковы. Это и говорит о независимости событий.",
        "Ответ: Являются."
    ],
    "65787": [
        "Дискретное распределение",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Игральный кубик симметричен, но устроен необычно: на двух гранях по два очка, а на остальных четырёх – по одному. Сергей бросил кубик несколько раз, и в результате сумма всех выпавших очков оказалась 3. Найдите вероятность того, что   при каком-то броске выпала грань с 2 очками.",
        "Решение: При одном броске вероятность выпадения двойки p = &frac13;, а вероятность единицы q = 1 – p = &frac23;.     В сумме 3 очка могло выпасть в результате выбрасывания следующих последовательностей:     1, 1, 1 – вероятность этого равна q³.    2, 1 или 1, 2 – вероятность этого равна 2pq.",
        "Ответ: 0,6."
    ],
    "65278": [
        "Непрерывное распределение",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Коля и Женя договорились встретиться в метро в первом часу дня. Коля приходит на место встречи между полуднем и часом дня, ждёт 10 минут и уходит. Женя поступает точно так же.     а) Какова вероятность того, что они встретятся?     б) Как изменится вероятность встречи, если Женя решит прийти раньше половины первого, а Коля по-прежнему – между полуднем и часом?     в) Как изменится вероятность встречи, если Женя решит прийти в произвольное время с 12.00 до 12.50, а Коля по-прежнему между 12.00 и 13.00?",
        "Решение: а) Изобразим графически времена прихода. Время прихода Жени будем откладывать по оси Х, а время прихода Коли – по оси Y.",
        "Ответ: а) 11/36; б) 11/36; в) 19/60."
    ],
    "65291": [
        "Турниры и турнирные таблицы",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: В Анчурии проходит чемпионат по шашкам в несколько туров. Дни и города проведения туров определяются жеребьёвкой. По правилам чемпионата никакие два тура не могут пройти в одном городе, и никакие два тура не могут пройти в один день. Среди болельщиков устраивается лотерея: главный приз получает тот, кто до начала чемпионата правильно угадает, в каких городах и в какие дни пройдут все туры. Если никто не угадает, то главный приз перейдёт в распоряжение оргкомитета чемпионата. Всего в Анчурии восемь городов, а на чемпионат отведено всего восемь дней. Сколько туров должно быть в чемпионате, чтобы оргкомитет с наибольшей вероятностью получил главный приз?",
        "Решение: В таблице 8×8 нужно выбрать k ячеек так, чтобы в одном ряду и в одном столбце было выбрано не более одной ячейки. При этом число туров k нужно подобрать так, чтобы число Nk возможных вариантов выбора было наибольшим возможным.       (  – количество способов выбрать k городов из восьми без учета порядка,  – количество способов выбрать k дней из восьми с учетом порядка, так как каждый из дней должен относиться к одному из городов).    Заметим, что    где m = 9 – k. Поскольку  m² < 9 – m только при m = 1, 2, то N1 < N2 < ... < N6 > N7 > N8.",
        "Ответ: 6 туров."
    ],
    "65284": [
        "Теория вероятностей (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: У Аси и Васи есть три монеты. На разных сторонах одной монеты изображены ножницы и бумага, на сторонах другой монеты – камень и ножницы, на сторонах третьей – бумага и камень. Ножницы побеждают бумагу, бумага побеждает камень и камень побеждает ножницы. Сначала Ася выбирает себе монетку, потом Вася, потом они бросают свои монетки и смотрят, кто выиграл (если выпало одно и то же, то – ничья). Так они делают много раз. Есть ли возможность у Васи выбирать монету так, чтобы вероятность его выигрыша была выше, чем у Аси?",
        "Решение: Пусть Аня выбрала монету Ножницы – бумага. Если Вася выберет монету Камень – ножницы, то Аня будет выигрывать с вероятностью ¼, а Вася – с вероятностью ½ (с вероятностью будет ¼ ничья).     Аналогично Вася совершает выбор при двух других выборах Ани.",
        "Ответ: Есть."
    ],
    "65296": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: На клавиатуре калькулятора есть цифры от 0 до 9 и знаки двух действий (см. рисунок). Вначале на дисплее написано число 0. Можно нажимать любые клавиши. Калькулятор выполняет действия в последовательности нажатий. Если знак действия нажать подряд несколько раз, то калькулятор запомнит только последнее нажатие.     а) Кнопка со знаком умножения сломалась и не работает. Рассеянный Учёный нажал несколько кнопок в случайной последовательности. Какой результат получившейся цепочки действий более вероятен – чётное число или нечётное?    б) Решите предыдущую задачу, если кнопку со знаком умножения  починили.",
        "Решение: а) Обозначим через A событие результат нечётный.     Пусть с вероятностью p предпоследнее число нечётно. Тогда результат останется нечётным, только если прибавить чётное число. Значит, условная вероятность нечётного результата равна p·½.     Предпоследнее число было чётным с вероятностью 1 – p.  Результат будет нечётным, только если последнее слагаемое нечётно.  Значит, в этом случае условная вероятность события A равна (1 – p)·½.    Складывая вероятности этих несовместных событий, получим:   P(A) = ½",
        "Ответ: а) Равновероятен;  б) вероятность чётного числа больше."
    ],
    "65319": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Знатоки и Телезрители играют в Что? Где? Когда до шести побед –  кто первый выиграл шесть раундов, тот и победил в игре. Вероятность выигрыша Знатоков в одном раунде равна 0,6, ничьих не бывает. Сейчас Знатоки проигрывают со счетом 3 : 4. Найдите вероятность того, что Знатоки все же выиграют.",
        "Решение: Чтобы победить, Знатоки должны выиграть три раунда подряд (вероятность этого 0,6³) или проиграв ровно один из трёх следуюших раундов, выиграть 11-й раунд (вероятность этого 3·0,6²·0,4·0,6 = 3·0,6³·0,4).     Итак, вероятность победы Знатоков равна 0,6³ + 3·0,6³·0,4 = 0,4752.",
        "Ответ: 0,4752."
    ],
    "65332": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: У Алисы в кармане шесть волшебных пирожков – два увеличивающих (съешь – вырастешь), а остальные уменьшающие (съешь – уменьшишься). Когда Алиса встретила Мэри Энн, она, не глядя, вынула из кармана три пирожка и отдала их Мэри. Найдите вероятность того, что у одной из девочек нет ни одного увеличивающего пирожка.",
        "Решение: Один из увеличивающих пирожков (УвП), безусловно, оказался у какой-то из девочек. Нужно найти вероятность того, что второй УвП оказался у неё же. У этой девочки после делёжки помимо первого УвП есть ещё два пирожка из пяти оставшихся. Значит, вероятность того, что второй УвП окажется одним из этих двух, равна 2/5.",
        "Ответ: 0,4."
    ],
    "65347": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Будем считать, что рождение девочки и мальчика равновероятны. Известно, что в некоторой семье двое детей.    а) Какова вероятность того, что из них один мальчик и одна девочка?    б) Дополнительно известно, что один из детей – мальчик. Какова теперь вероятность того, что в семье один мальчик и одна девочка?    в) Дополнительно известно, что мальчик родился в понедельник. Какова теперь вероятность того, что в семье один мальчик и одна девочка?",
        "Решение: а) Дети появляются в некоторой последовательности (ММ, МД, ДМ или ДД). Все последовательности равновозможны, и вероятность каждой ¼. Условию Мальчик и девочка благоприятствуют два исхода МД и ДМ, значит, вероятность этого равна 2 : 4 = ½.",
        "Ответ: а) ½; б) &frac23;; в) 14/27."
    ],
    "65768": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 6,7,8,9,10,11",
        "Условие: К юбилею Санкт-Петербургских математических олимпиад монетный двор отчеканил три юбилейные монеты. Одна монета получилась правильно, у второй монеты на обеих сторонах оказалось два орла, а у третьей обе стороны – решки. Директор монетного двора не глядя выбрал одну из этих трёх монет и бросил её наудачу. Выпал орёл. Чему равна вероятность того, что на второй стороне этой монеты тоже орёл?",
        "Решение: Известно, что выпал орёл. Значит, была выбрана либо первая монета, либо вторая. Всего на этих монетах орёл изображен три раза. В одном из этих трёх равновозможных случаев на противоположной стороне монеты решка, а в двух других случаях – орлы.",
        "Ответ: &frac23;."
    ],
    "35691": [
        "Теория алгоритмов (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: В одной из трех коробок лежит приз, две другие коробки пустые.  Вы не знаете, в какой из коробок находится приз, а ведущий знает.  Вы должны показать на одну из коробок, в которой по Вашему мнению  находится приз. После этого ведущий открывает одну из двух  оставшихся коробок. Так как он не хочет сразу отдавать приз,  он открывает пустую коробку. После этого Вам предлагается окончательно   выбрать коробку. Можете ли Вы выиграть приз с вероятностью, большей 1/2?",
        "Подсказка: Показав на коробку в первый раз, Вы скорее всего (с вероятностью 2/3) ошиблись.",
        "Решение: Вы можете выиграть приз с вероятностью 2/3.  Пусть Вы в первый раз показали на коробку A,  а ведущий открыл пустую коробку B. Тогда нужно выбирать третью  коробку (т. е. коробку, отличную от A и B).  Действительно, Вы ошибетесь только если приз находился в коробке A,  но изначально нужно считать, что приз находится в каждой из коробок  с вероятностью 1/3."
    ],
    "65322": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: У короля Артура два одинаково мудрых советника — Мерлин и Персифаль. Каждый из них находит верный ответ на любой вопрос с вероятностью p или неверный ответ – с вероятностью q = 1 –  p.    Если оба советника говорят одно и то же, король слушается их. Если они говорят противоположное, то король выбирает решение, подбрасывая монету.    Однажды Артур задумался – зачем ему два советника, не хватит ли одного? Тогда король позвал советников и сказал:    – Мне кажется, что вероятность принятия верных решений не уменьшится, если оставлю одного советника и буду его слушаться. Если это так, я должен уволить одного из вас. Если это не так, я оставлю все, как есть. Ответьте  мне, должен ли я уволить одного из вас?    – Кого именно ты собираешься уволить, король Артур? – спросили советники.    – Если я приму решение уволить одного из вас, то сделаю выбор с помощью жребия, бросив монету.    Советники ушли думать над ответом. Советники, повторим, одинаково мудрые, но не одинаково честные. Персифаль очень честен и постарается дать верный ответ, даже если ему грозит увольнение. А Мерлин, честный во всем прочем, в этой ситуации решает дать такой ответ, чтобы вероятность его увольнения была как можно меньше. Какова вероятность того, что Мерлин будет  уволен?",
        "Решение: Мерлин должен рассуждать так.    Разберёмся, следует ли увольнять советника. Если советник один, то король, следуя его совету, примет верное решение с вероятностью p по любому вопросу.    Что происходит, когда советников двое? Вероятность того, что мы оба даём верный ответ, равна p². Тогда король с вероятностью 1 принимает верное решение. Если оба советника ошибаются (с вероятностью q²), то король принимает верное решение с вероятностью 0. Наконец, если советники расходятся (вероятность 2pq), то король выбирает верное решение с вероятностью ½. По формуле полной вероятности   P(король принял верное решение) = p² + 2pq·½ = p(p + q) = p.     Таким образом, увольнять одного из советников надо.     Если я скажу Да, нужно увольнять, то есть два варианта.    1) Персифаль тоже скажет Да с вероятностью p, и тогда король уволит меня с вероятностью ½.    2) Персифаль ошибется (вероятность q), и тогда король примет решение, бросая монету. Если он решит кого-то уволить (вероятность ½), то это буду я опять же с вероятностью ½.     Таким образом, P(меня уволят, если я скажу Да) = ½ p + ¼ q.",
        "Ответ: – Кого именно ты собираешься уволить, король Артур? – спросили советники."
    ],
    "65341": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Вася купил n пар одинаковых носков. В течение n дней Вася не знал проблем: каждое утро брал из шкафа новую пару и носил её целый день. Через n дней Васина мама постирала все носки в стиральной машине и разложила  их по парам, как получилось, поскольку, повторим, носки одинаковые. Назовём пару носков удачной, если оба носка в этой паре были на Васе в один и тот же день.    а) Найти вероятность того, что все получившиеся пары удачные.    б) Доказать, что матожидание числа удачных пар больше 0,5.",
        "Решение: а) Вероятность того, что первая пара оказалась удачной, равна 1/2n–1, поскольку, когда мама взяла первый носок в руки, остался 2n – 1 носок, и только один из них составляет удачную пару с первым. Далее – так же: вероятность того, что вторая пара удачная (при условии, что первая пара удачная) равна 1/2n–3 и т.д.  Вероятность того, что все пары удачные, получаем как произведение",
        "Ответ: а) ."
    ],
    "65354": [
        "Средние величины",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: В Анчурии всего K законов и N министров. Вероятность того, что случайно взятый министр знает случайно выбранный закон, равна p. Однажды министры собрались на совет, чтобы написать Концепцию. Если хотя бы один министр знает закон, то этот закон будет учтён в Концепции, в противном случае этот закон в Концепции учтён не будет. Найдите:    а) Вероятность того, что ровно M законов будут учтены в Концепции.      б) Математическое ожидание числа учтённых законов.",
        "Решение: а) Вероятность того, что ни один министр не знает первого закона равна (1 – p)N. Значит, вероятность того, что первый закон будет учтён, равна  q = 1 – (1 – p)N.    Вероятность того, что ровно M каких-то законов из K   имеющихся, будут учтены в Концепции легко найти по формуле биномиальной вероятности:",
        "Ответ: а)  ;    б) K(1 – (1 – p)N)."
    ],
    "65297": [
        "Дискретное распределение",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: На новогоднюю ёлку повесили 100 лампочек в ряд. Затем лампочки стали переключаться по следующему алгоритму: зажглись все, через секунду погасла каждая вторая лампочка, ещё через секунду каждая третья лампочка переключилась: если горела, то погасла и наоборот. Через секунду каждая четвёртая лампочка переключилась, ещё через секунду – каждая пятая и так далее. Через 100 секунд всё закончилось. Найдите вероятность того, что случайно выбранная после этого лампочка горит (лампочки не перегорают и не бьются).",
        "Решение: Очевидно, лампочка с номером n останется гореть, только если её переключили нечётное число раз, то есть если число n имеет нечётное количество натуральных делителей. Ясно, что этому условию удовлетворяют только квадраты: n = 1, 4, 9, ..., 100 (см. задачу 30365). Таким образом, останется гореть 10 лампочек из 100. Поэтому вероятность случайно выбрать горящую лампочку равна 0,1.",
        "Ответ: 0,1."
    ],
    "65777": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Высокий прямоугольник ширины 2 открыт сверху, и в него падают в случайной ориентации Г-тримино (см. рисунок).     а) Упало k тримино. Найдите математическое ожидание высоты получившегося многоугольника.     б) Упало 7 тримино. Найдите вероятность того, что сложенная из тримино фигура будет иметь высоту 12.",
        "Решение: а) Случайную величину высота получившегося многоугольника  обозначим X. Очевидно, X = 2k – (I2 + I3 + ... + Ik), где Ij – индикатор события тримино с номерами j и j – 1 образовали блок высоты 3. Это может быть только в двух случаях, показанных на рисунке. Вероятность такого равна &frac18;. Таким образом, EIj = &frac18;. Поэтому EX = 2k – &frac18; (k – 1) = 15k+1/8.",
        "Ответ: а) 15k+1/8;  б) ≈ 0,133."
    ],
    "65778": [
        "Непрерывное распределение",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Расследуя одно дело, следователь Башковицкий обнаружил, что ключевой свидетель – тот из семьи Петровых, кто в тот роковой день пришёл домой прежде прочих. Расследование выявило следующие факты.     1. Соседка Марья Кузьминична хотела одолжить у Петровых соли, звонила им в дверь, но никто не открыл. Во сколько? Да кто ж знает? Темно уж было...     2. Галина Ефимовна Петрова, придя вечером домой, обнаружила обоих детей на кухне, а мужа на диване – у него болела голова.     3. Муж Анатолий Иванович заявил, что как пришёл, сразу лёг на диван и задремал, никого не видел, ничего не слышал, соседка точно не приходила – звонок бы его разбудил.     4. Дочь Светлана сказала, что, вернувшись домой, сразу ушла к себе в комнату, про отца ничего не знает, но в прихожей, как всегда, споткнулась о Димкин ботинок.     5. Дмитрий когда пришёл – не помнит, отца не видел, а как Светка ругалась из-за ботинка – слышал.     Ага, – задумался Башковицкий. – Какова же вероятность того, что Дмитрий вернулся домой раньше отца?",
        "Решение: Относительно Дмитрия, Светланы и Анатолия определённости нет, известно лишь, что все трое пришли домой между визитом Марьи Кузьминичны и приходом Галины Ефимовны – именно эти два события ограничивают период времени, интересующий Башковицкого. Будем считать, что вероятность прихода члена семьи домой в какой-то промежуток времени пропорциональна длине этого промежутка.     Введём обозначения. Пусть от визита Марьи Кузьминичны до прихода Галины Ефимовны прошло время m, до прихода Анатолия – время x, до прихода Дмитрия – время y, а до прихода Светланы – z.    Из свидетельских показаний следует, что 0 < x < m, 0 < y < z < m. В системе координат Oxyz получаем треугольную призму F с вершинами (0, 0, 0), (0, 0, m), (0, m, m), (m, 0, 0), (m, 0, m) и (m, m, m) (см. рисунок). При этих условиях требуется найти вероятность события y < x. Внутри призмы F это неравенство определяет четырёхугольную пирамиду G с вершинами (0, 0, 0), (m, 0, 0), (m, 0, m), (0, 0, m) и (m, m, m).",
        "Ответ: &frac23;."
    ],
    "66044": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 7,8,9,10",
        "Условие: Игровой круг в телевикторине Что? Где? Когда? разбит на 13 одинаковых секторов. Секторы пронумерованы числами от 1 до 13. В каждом секторе в начале игры лежит конверт с вопросом. Игроки выбирают случайный сектор с помощью волчка со стрелкой. Если этот сектор уже выпадал прежде, то конверта в нём уже нет, и тогда играет следующий по часовой стрелке сектор. Если он тоже пуст, – следующий и т.д., пока не встретится непустой сектор. До перерыва игроки разыграли шесть секторов.    а) Что более вероятно: что в числе разыгранных есть сектор №1 или что среди разыгранных есть сектор №8?     б) Найдите вероятность того, что в результате оказались разыграны подряд шесть секторов с номерами от 1 до 6.",
        "Решение: б) Рассмотрим последовательность секторов n1, n2, ..., n6, выпавших при вращении волчка. Событию A = разыграны секторы 1 – 6 благоприятствуют все последовательности, в которых nk ≤ k, и все перестановки каждой такой последовательности. Например, подходит последовательность 1, 1, 2, 3, 3, 6 и её всевозможные перестановки и т.д.   Количество последовательностей, благоприятствующих A, не зависит от количества невыбранных секторов, а значит, одинаково для любого круга, в котором больше шести секторов. Удобно пересчитать эти последовательности на круге с семью секторами. Тогда, какова ни была бы последовательность выпавших секторов, останется всего один неразыгранный сектор, а разыгранные секторы расположены подряд. Всего последовательностей 76. Последовательностей, при которых не разыгран именно сектор №7, ровно в 7 раз меньше: 75.     На круге всего 136 равновозможных последовательностей. Поэтому вероятность события A равна 75/136.",
        "Ответ: а) Вероятности равны;  б)  75/136 ≈ 0,00348."
    ],
    "65327": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Илья Муромец встречает трёхголового Змея Горыныча. И начинается битва. Каждую минуту Илья отрубает Змею одну голову. С вероятностью ¼ на месте срубленной головы вырастает две новых, с вероятностью &frac13; – только одна новая голова и с вероятностью 5/12 – ни одной головы. Змей считается побеждённым, если у него не осталось ни одной головы. Найдите вероятность того, что рано или поздно Илья победит Змея.",
        "Решение: Удары Ильи Муромца, при которых число голов меняется, назовём успешными.    Найдём вероятность того, что когда-нибудь наступит последний успешный удар. Это значит, что начиная с этого, успешных ударов больше не случится, то есть все удары будут безуспешными. Вероятность этого равна &frac13;·&frac13;·&frac13;·... = 0.    Таким образом, последнего успешного удара не будет, а будет бесконечная  подпоследовательность успешных ударов, которую мы и будем рассматривать, игнорируя все остальные удары.    Вероятность успешного удара равна &frac23;. Условная вероятность того, что при успешном ударе число голов увеличилось, равна ¼ : &frac23; = 3/8.    Аналогично, условная вероятность того, что при успешном ударе голов стало меньше, равна 5/12 : &frac23; = 5/8.    Возникает стандартная задача одномерного случайного блуждания.   Предположим, что в результате некоторой серии успешных ударов число голов Змея стало на одну меньше, чем было. Назовём это событие D, а его вероятность обозначим x.    Есть две возможности.     1) В результате первого успешного удара голов стало на одну меньше (событие M, вероятность 5/8). В этом случае событие D уже произошло – его условная вероятность равна 1.    2) В результате первого успешного удара голов становится больше на одну (событие N, вероятность 3/8). В этом случае событие D наступит, только если число голов уменьшится на 2 – на одну, а потом еще на одну. Поэтому условная вероятность события D в этом случае равна x².    По формуле полной вероятности x = P(D) = P(D|M)·P(M) + P(D|N)·P(N) = 5/8 + 3/8 x².      Отсюда x = 1 или x = 5/3. Второй корень посторонний. Значит, событие D  достоверно.    Таким образом, рано или поздно число голов обязательно уменьшится с трёх до двух. Затем, по той же причине, число голов уменьшится до одной и, наконец, станет равно нулю. У Змея нет шансов.",
        "Ответ: 1."
    ],
    "65311": [
        "Дискретное распределение",
        "Сложность: 4+",
        "Классы: 9,10,11",
        "Условие: Правильная игральная кость бросается много раз. Известно, что в какой-то момент сумма очков стала равна ровно 2010.   Найдите математическое ожидание числа бросков, сделанных к этому моменту.",
        "Решение: Первый способ. Пусть событие An сумма очков равна n, а Xn – число сделанных при этом бросков. Событие An мы считаем уже осуществившимся, и нас интересует ожидание EXn. Пусть Ik равно 1, если первый бросок дал k очков, и 0 в противном случае.     События Bk первый бросок дал k очков и An–k (для оставшихся бросков) относятся к разным броскам и поэтому независимы. Следовательно, условная вероятность события (Ik = 1) равна &nbsp      Ясно, что Xn = Xn–1I1 + Xn–2I2 + ... + Xn–6I6 + 1.     При этом случайные величины Xn–k и Ik независимы, поскольку относятся к разным сериям бросков. Поэтому      Вводя обозначения EXk = ek и P(Ak) = pk, получаем:    (1)     Осталось воспользоваться тем, что 6pn = pn–1 + ... + pn–6. Это следует, например, из того, что сумма вероятностей P(Ik = 1) равна единице. Значит,       Начальные значения: p–5 = p–4 = ... = p–1 = 0; p0 = 1; e–5 = e–4 = ... = e0 = 0. Последовательное вычисление дает e1 = 1, p1 = 1/6;      ...,  e2010 = 574,5238095...",
        "Ответ: 574,5238095..."
    ],
    "73608": [
        "Сочетания и размещения",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: На лотерейном билете требуется отметить 8 клеточек из 64. Какова вероятность того, что после розыгрыша, в котором также будет выбрано 8 каких-то клеток из 64 (все такие возможности равновероятны), окажется, что угаданы     а) ровно 4 клетки?  б) ровно 5 клеток?  в) все 8 клеток?",
        "Решение: 8 клеток из 64 могут быть выбраны  способами. Следовательно, вероятность того, что выпадет какой-то один определённый способ, равна  Число случаев, в которых оказались угаданными ровно k клеток равно числу способов, при которых выбираются k клеток из 8 отмеченных и 8 – k клеток из 56 неотмеченных, то есть    Таким образом, вероятность угадать ровно k клеток равна",
        "Ответ: а)"
    ],
    "65355": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Вероятность рождения двойняшек в Швамбрании равна p, тройняшки в Швамбрании не рождаются.    а) Оцените вероятность того, что встреченный на улице швамбранец – один из пары двойняшек?    б) В некоторой швамбранской семье трое детей. Какова вероятность того, что  среди них есть пара двойняшек?    в) В школах швамбранских двойняшек обязательно зачисляют в один класс.  Всего в Швамбрании N первоклассников.   Каково матожидание числа пар двойняшек среди них?",
        "Решение: а) Пусть по улицам Швамбранских городов и сёл ходят M  пар двойняшек и N одиночек. Тогда , откуда . Встретим случайного швамбранца. Он является одним из двойняшек с вероятностью",
        "Ответ: а) ;  б)  ;    в)  ."
    ],
    "65303": [
        "Графики и ГМТ на координатной плоскости",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Дан числовой набор x1, ..., xn. Рассмотрим функцию .    а) Верно ли, что функция d(t) принимает наименьшее значение в единственной точке, каков бы ни был набор чисел x1, ..., xn?    б) Сравните значения d(c) и d(m), где   , а m  – медиана указанного набора.",
        "Решение: а) Рассмотрим набор {2, 4, 7, 11}. Построим функцию d(t) для этого набора. Сначала построим графики функций y = |x – 2|, y = |x – 4|, y  = |x – 7|, y = |x – 11|.     Теперь построим графики функции  (красный) и  (зелёный)."
    ],
    "65356": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На столе разложена колода игральных карт (например, в ряд). Поверх каждой карты положили карту другой колоды. Некоторые карты, возможно, совпали. Найдите:    а) математическое ожидание числа совпадений;    б) дисперсию числа совпадений.",
        "Решение: а) Пронумеруем пары от 1 до N (мы не знаем, сколько их) в том порядке, в каком они лежат на столе. Пусть индикатор Ik равен 1, если в k-й паре оказались две одинаковые карты, и 0, если в k-й  паре карты не одинаковы. Очевидно, P(Ik = 1) = 1/N. Значит, EIk   = 1/N.     Пусть S – число пар с совпадением. Оно равно I1 + I2 + ... + IN. Следовательно, ES = EI1 + EI2  + ... + EIN = N·1/N = 1.",
        "Ответ: а) 1; б) 1."
    ],
    "65298": [
        "Дискретное распределение",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: В финал конкурса спектаклей к 8 Марта вышли два спектакля. В первом  играли n учеников 5 класса А, а во втором – n учеников 5 класса Б. На спектакле присутствовали 2n мам всех 2n учеников. Лучший спектакль выбирается голосованием мам. Известно, что каждая мама с вероятностью ½ голосует за лучший спектакль и с вероятностью ½  – за спектакль, в котором участвует её ребенок.    а) Найдите вероятность того, что лучший спектакль победит с  перевесом голосов.    б) Тот же вопрос, если в финал вышло больше двух классов.",
        "Решение: а) Назовем маму уверенной, если её ребенок играет в лучшем спектакле. Уверенная мама с вероятностью 1 проголосует за лучший спектакль. Уверенных мам ровно n, поэтому лучший спектакль наберет не меньше половины голосов – он получит, по крайней мере, голоса всех уверенных мам. Единственный случай, когда лучший спектакль не победит – ничья, когда худший спектакль получит голоса всех неуверенных мам. Это возможно, только если все неуверенные мамы проголосуют за своих детей. Вероятность этого события равна 2–n. Значит, вероятность того, что за лучший спектакль будет подано больше голосов, равна 1 – 2–n.",
        "Ответ: а) 1 – 2–n;   б) 1 – 2n–mn, где m – число классов."
    ],
    "35052": [
        "Числовые неравенства. Сравнения чисел.",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: В классе 30 учеников. Докажите, что вероятность того, что у каких-нибудь двух учеников совпадают дни рождения, составляет больше 50%.",
        "Подсказка: Найдите вероятность того, что ни у каких двух учеников не совпадают дни рождения.",
        "Решение: Докажем, что вероятность того, что ни у каких двух учеников не совпадают дни рождения, меньше ½.    Упорядочим учеников. Вероятность того, что второй ученик не родился в один день с первым, равна 364/365 (мы опускаем тонкости, связанные с тем, что днем рождения может быть 29 февраля). Вероятность того, что третий не родился в один день с первым или с вторым, равна 363/365, ..., вероятность того, что день рождения тридцатого не совпал с остальными 29 днями рождения, равна 336/365. Поэтому    Можно убедиться (вычислением на компьютере), что p гораздо меньше ½.    Также можно предложить грубые оценки p."
    ],
    "61535": [
        "Деление с остатком",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Докажите, что 13-е число месяца с большей вероятностью приходится на пятницу, чем на другие дни недели. Предполагается, что мы живем по Григорианскому стилю.",
        "Подсказка: Воспользуйтесь тем, что число дней в 400-летнем цикле делится на 7.",
        "Решение: Напомним. что год не является високосным, если его номер не делится на 4 и если его номер делится на 100, но не на 400. Невисокосный год состоит из 52 недель и одного дня, а в високосном – на один день больше. Таким образом, число дней в 400-летнем цикле сравнимо с 300 + 100 – 3 = 497 (mod 7). то есть делится на 7. Поэтому достаточно исследовать один такой цикл, например, с 2000 по 2399 год.     Если 13-е число месяца – пятница, то 1-е число этого месяца – воскресенье. Поэтому надо проверить, что месяц чаще всего начинается с воскресенья.     Разобьём годы на 7 типов, соответствующие первому дню года: год 1-го типа начинается с понедельника, 2-го – со вторника, ..., 6-го – с субботы, а 0-го с воскресенья. Если невисоскосный год имеет тип n, то следующий год имеет тип n + 1 (mod 7). Если висоскосный год имеет тип n, то следующий год имеет тип n + 2 (mod 7), а следующий високосный год – тип n – 2 (mod 7). Например, как видно из календаря, 2000 год – всиокосный 6-го типа, 2001-й – невисокосный 1-го типа, 2004-й – високосный 4-го типа.     Нетрудно проверить. что в невисокосном году типа 0 понедельник, вторник и четверг будут 1-ми числами по одному разу, пятница, суббота и воскресенье – по 2 раза, и среда – 3 раза. В високосном же году типа 0 понедельник, вторник и пятница будут 1-ми числами по одному разу, среда, четверг и суббота – по 2 раза, а воскресенье – 3 раза. В годах других типов происходит соответствующий сдвиг; например, в невисокосном году типа 1 вторник, среда и пятница будут 1-ми числами по одному разу, суббота, воскресенье и понедельник – по 2 раза, четверг – 3 раза.     В нашем 400-летнем цикле есть два вида подциклов. Во-первых, это 7 подряд идущих невисокосных лет (например, 2097 – 2103 гг.). Ясно, что в таком цикле невисокосный год каждого типа встречается по разу. Во-вторых, это 28 подряд идущих лет, из которых ровно 7 високосных (например, 2000 – 2027 гг.). Нетрудно проверить, что в таком високосный год каждого типа встречается по разу, а високосный год каждого типа – по три раза. Годы, входящие в такие циклы, можно исключить из рассмотрения и оставить только 2000 – 2012, 2104 – 2112, 2204 – 2212, 2304 – 2312, 2397 – 2399.     Заметим, что в силу цикличности 2104 год начинается с того же дня недели, что и 2097-й, 2013-й, а значит, и 2008-й: с 2008-го по 2013 происходит сдвиг на 2 + 1 + 1 + 1 + 2 = 7 дней. Значит период 2104 – 2112 можно заменить на период 2008 – 2016.  Аналогично периоды 2204 – 2212, 2304 – 2312, 2397 – 2399 заменяются на периоды 2012 – 2020, 2016 – 2024 и 2025 – 2027 соотвественно. Накладывая полученные, периоды получаем 28-летний цикл 2000 – 2027 плюс промежуток 2008 – 2020 и еще по разу 2012 и 2016 гг.     Итак, у нас в рассмотрении остаются невисокосные годы 2009, 2010, 2011, 2013, 2014, 2015, 2017, 2019 соответственно типов 4, 5, 6, 2, 3, 4, 0, 1, 2 и високосные 2008, 2012, 2012, 2016, 2016, 2020 соответственно типов 2, 0, 0, 5, 5, 3. Убрав из невисокосных лет встречающиеся по разу типы от 0 до 6, оставляем только типы 2 и 4, что дает в качестве 1-х чисел 5 воскресений, 4 вторника, 4 пятницы, по 3 понедельника, среды и четверга и одну субботу. Указанные високосные годы добавляют по 11 воскресений, вторников и пятниц, по 10 сред, четвергов и суббот и 9 понедельников. Итого, 16 воскресений, по 15 вторников и пятниц, по 13 сред и четвергов и 12 понедельников.     Видим, что воскресенье бывает 1-м числом чуть чаще, чем каждый из остальных дней недели."
    ],
    "65359": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Вдоль дороги стоит 9 фонарей. Если перегорел один из них, а соседние светят, то дорожная служба не беспокоится. Но если перегорают два фонаря подряд, то   дорожная служба сразу меняет все перегоревшие фонари. Каждый фонарь перегорает независимо от других.    а) Найдите вероятность того, что при очередной замене придётся поменять ровно 4 фонаря.    б) Найдите математическое ожидание числа фонарей, которые придётся поменять при очередной замене.",
        "Решение: Решать задачу будем в общем случае. Заменим горящий фонарь единицей, а перегоревший – нулём. Тогда сначала мы имеем ряд из n единиц, которые последовательно и в случайном порядке превращаются в нули.",
        "Ответ: a) 25/84 ≈ 0,294;  б) 837/252 ≈ 3,32."
    ],
    "65336": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: На клавиатуре калькулятора есть цифры от 0 до 9 и знаки двух действий (см. рисунок). Вначале на дисплее написано число 0. Можно нажимать любые клавиши. Калькулятор выполняет действия в последовательности нажатий. Если знак действия нажать подряд несколько раз, то калькулятор запомнит только последнее нажатие. Рассеянный Учёный нажал очень много кнопок в случайной последовательности. Найдите  приблизительно вероятность, с которой результат получившейся цепочки  действий – нечётное число?",
        "Решение: Будем говорить, что Учёный проделал n шагов, если он набрал n чисел, а между ними n – 1 раз совершил какие-то арифметические действия. Обозначим через pn  вероятность того, что после n шагов на калькуляторе будет нечётное число, и выразим pn+1 через pn.     Если последним действием было умножение, то результат будет нечётным, только если оба множителя нечётны; вероятность этого равна ½ pn.     Если последним действием было сложение, то результат будет нечётным, если последнее слагаемое отличается от предпоследнего чётностью; вероятность этого равна ½.    Последнее действие может быть как умножением, так и сложением, и оба этих варианта равновозможны. Поэтому формула полной вероятности даёт:  pn+1 = ½·½ + ½·½ pn = ¼ + ¼ pn.    Переписав это равенство в виде  pn+1 – &frac13; = ¼ (pn – &frac13;), видим, что при увеличении n на 1 разность pn – &frac13; уменьшается в 4 раза. Следовательно, pn близко к &frac13; при больших n.",
        "Ответ: &frac13;."
    ],
    "61474": [
        "Линейные рекуррентные соотношения",
        "Сложность: 4+",
        "Классы: 10,11",
        "Условие: Лягушка прыгает по вершинам шестиугольника ABCDEF, каждый раз перемещаясь в одну из соседних вершин.    а) Сколькими способами она может попасть из A в C за n прыжков?    б) Тот же вопрос, но при условии, что ей нельзя прыгать в D?  Лягушка-сапер.    в) Пусть путь лягушки начинается в вершине A, а в вершине D находится мина. Каждую секунду она делает очередной прыжок. Какова вероятность того, что она еще будет жива через n секунд?    г)* Какова средняя продолжительность жизни таких лягушек?",
        "Решение: а) Ясно, что после чётного числа прыжков лягушка может находиться только в вершинах A, C или E. Обозначим через ak, ck, ek число путей длины 2k, ведущих из A в A, C и E соответственно. В силу симметрии ck = ek. Легко видеть, что выполняются равенства  ck+1 = ak + 3ck,  ak+1 = 2ak + 2ck.      Отсюда  ck+2 = ak+1 + 3ck+1 = 2ak + 2ck + 3ck+1 = 2(ck+1 – 3ck) + 2ck + 3ck+1 = 5ck+1 – 4ck.     Из начальных условий  c0 = 0, c1 = 1, находим  ck = 1/3 (4k – 1)  (это нетрудно доказать по индукции).",
        "Ответ: а) 1/3 (2n – 1) способами при чётном n; нельзя попасть при нечётном n.    б) 3n/2–1 способами при чётном n; нельзя попасть при нечётном n.  в) (¾)k–1 при n = 2k – 1 и при n = 2k (k ≥ 1).    г) 9 секунд."
    ],
    "65300": [
        "Математическая статистика",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Служить на подводной лодке может матрос, рост которого не превышает 168 см. Есть четыре команды А, Б, В и Г. Все матросы в этих командах хотят служить на подводной лодке и прошли строгий отбор. Остался последний отбор – по росту.    В команде А средний рост матросов равен 166 см.    В команде Б медиана роста матросов равна 167 см.    В команде В самый высокий матрос имеет рост 169 см.    В команде Г мода роста матросов равна 167 см.  В какой команде по крайней мере половина матросов точно может служить на подводной лодке?",
        "Решение: Контрпример для команды А: три матроса с ростом 160, 169 и 169 см. Средний рост 166 см, но двое из трёх не годны к службе на подводной лодке.     Контрпример для команды В: два матроса с ростом 169 см. Служить на лодке не может ни один. Команда В тоже не дает ответа на вопрос.",
        "Ответ: В команде Б."
    ],
    "65312": [
        "Математическая статистика",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: В числовом наборе 100 чисел. Если выкинуть одно число, то медиана оставшихся чисел будет равна 78. Если выкинуть другое число, то медиана оставшихся чисел будет 66. Найдите медиану всего набора.",
        "Решение: Расположим числа в порядке возрастания. Если выкинуть число из первой  половины ряда (с номером до 50), то медианой оставшихся чисел будет 51-е число ряда. Если выкинуть число из второй половины, то медианой оставшихся чисел станет число с номером 50, но оно не больше чем 51-е число. Таким образом, 50-е число равно 66, а 51-е число равно 78. Значит, медиана всего набора равна (66  + 78) : 2 = 72.",
        "Ответ: 72."
    ],
    "65313": [
        "Дискретное распределение",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: В городе, где живет Рассеянный Ученый, телефонные номера состоят из 7 цифр.  Ученый легко запоминает телефонный номер, если этот номер палиндром, то есть он одинаково читается слева направо и справа налево. Например, номер 4435344  Ученый запоминает легко, потому что этот номер палиндром. А номер 3723627 не палиндром, поэтому Ученый такой номер запоминает с трудом. Найдите вероятность того, что телефонный номер нового случайного знакомого Ученый запомнит легко.",
        "Решение: Как известно, первая цифра телефонного номера может быть не всякой. Пусть число разрешённых первых цифр равно m. Тогда общее число номеров равно m·106. Легкий номер (тот, который запоминается легко) однозначно определяется первыми четырьмя цифрами. Значит, семизначных палиндромов всего m·103.    Поэтому вероятность того, что случайно взятый номер окажется лёгким, равна",
        "Ответ: 0,001."
    ],
    "65316": [
        "Теория вероятностей (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Рассеянный Ученый сконструировал прибор, состоящий из датчика и передатчика. Средний срок (математическое ожидание) службы датчика 3 года, средний срок службы передатчика 5 лет. Зная распределения срока службы датчика и передатчика, Рассеянный Ученый вычислил, что средний срок службы всего прибора равен 3 года 8 месяцев. Не ошибся ли Рассеянный Ученый в своих расчетах?",
        "Решение: Пусть ξ и η – сроки службы датчика и передатчика соответственно. Очевидно, min(ξ, η) ≤ ξ. Переходя к ожиданиям, получим, что Emin(ξ, η) ≤ Eξ = 3. Значит, средний срок службы прибора не больше трёх лет.",
        "Ответ: Ошибся."
    ],
    "65345": [
        "Теория вероятностей (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Точка выходит из начала координат на прямой и делает a шагов на единицу вправо, b шагов на единицу влево в каком-то порядке, причём a > b. Размахом блуждания точки назовём разность между наибольшей и  наименьшей координатами точки за всё время блуждания.    а) Найдите наибольший возможный размах блуждания.    б) Найдите наименьший возможный размах.    в) Сколько существует различных последовательностей движения точки, при которых размах блуждания будет наибольшим возможным?",
        "Решение: б) В конце своего пути точка неизбежно (каков бы ни был порядок шагов вправо и влево) имеет координату a – b.   Значит, размах не может быть меньше a – b.     Такой размах получается, например, так: точка движется вправо-влево ровно b раз, а затем a – b раз вправо.",
        "Ответ: а) a; б) &nbspa – b; в) b + 1."
    ],
    "66038": [
        "Непрерывное распределение",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Для тестирования новой программы компьютер выбирает случайное действительное число A из отрезка [1, 2] и заставляет программу решать уравнение 3x + A = 0. Найдите вероятность того, что корень этого уравнения меньше чем –0,4.",
        "Ответ: 0,8."
    ],
    "65767": [
        "Дискретное распределение",
        "Сложность: 3",
        "Классы: 6,7,8,9,10,11",
        "Условие: Василий Петров выполняет задание по английскому языку. В этом задании есть 10 английских выражений и их переводы на русский в случайном порядке. Нужно установить верные соответствия между выражениями и их переводами. За каждое правильно установленное соответствие даётся 1 балл. Таким образом, можно получить от 0 до 10 баллов. Вася ничего не знает, поэтому выбирает варианты наугад. Найдите вероятность того, что он получит ровно 9 баллов.",
        "Решение: Если угадано девять верных ответов, то десятый ответ тоже будет верным. Значит, искомая вероятность равна нулю.",
        "Ответ: 0."
    ],
    "65783": [
        "Дискретное распределение",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: Дана таблица 3×3 (как для игры в крестики-нолики). В четыре случайно выбранные ячейки случайным образом поставили четыре фишки.   Найдите вероятность того, что среди этих четырёх фишек найдутся три, которые стоят в один ряд по вертикали, по горизонтали или по диагонали.",
        "Решение: Всего возможных расстановок . Расстановки, где занята вертикаль,   горизонталь или диагональ, легко пересчитать: их 8·6 = 48. В силу случайности и равновозможности расстановок искомая вероятность равна 48/126 = 8/21.",
        "Ответ: 8/21."
    ],
    "66051": [
        "Дискретное распределение",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: По будням Рассеянный Учёный едет на работу по кольцевой линии московского метро от станции Таганская до станции Киевская, а вечером – обратно (см. схему).",
        "Решение: Пусть p – вероятность того, что Учёный садится в поезд, идущий по часовой стрелке. Тогда математическое ожидание времени в пути от Таганской до Киевской равно 11p + 17(1 – p) = 17 – 6p.     На обратном пути Киевская – Таганская математическое ожидание времени в пути равно 17p + 11(1 – p) = 11 + 6p.     По условию (11 + 6p) – (17 – 6p) = 1, откуда p = 7/12. Обозначим интервал между поездами T. Тогда T(1 – p) = Y, где Y – время между приходом поезда по часовой и приходом поезда против часовой на любимые станции. Значит, ET = EY/1–p = 5/4·12/5 = 3.",
        "Ответ: 3 минуты."
    ],
    "65264": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Петя играет в компьютерную игру “Куча камней”. Сначала в куче 16 камней. Игроки по очереди берут из кучи 1, 2, 3 или 4 камня. Выигрывает тот, кто заберёт последний камень. Петя играет впервые и поэтому каждый раз берёт случайное число камней, при этом он не нарушает правила игры. Компьютер играет по следующему алгоритму: на каждом ходу он берёт столько камней, чтобы оказаться в наиболее выгодном положении. Игру начинает всегда Петя. С какой вероятностью Петя выиграет?",
        "Решение: Заметим, что игрок, делающий первый ход, всегда имеет преимущество и выигрывает при правильной стратегии. Действительно, на первом шаге нужно взять один камень из кучи, а на каждом последующем шаге брать такое количество камней, чтобы число оставшихся камней делилось на 5. Поскольку согласно правилам игры на каждом шаге разрешено брать 1, 2, 3 или 4 камня, то такая стратегия всегда осуществима.    В то же время, если на каком-то из шагов игрок, делающий первый ход, отступит от этой стратегии, то его соперник имеет возможность выиграть игру, воспользовавшись той же стратегией. Заметим также, что если в игре побеждает игрок, делающий первый ход, то он обязательно делает за игру 4 хода.    Таким образом, у Пети при каждом ходе есть только одна возможность не проиграть: если он возьмёт один камень первым ходом, оставит компьютеру ровно 10 камней вторым ходом, ровно 5 камней третьим и возьмёт все оставшиеся камни на четвёртом.     После каждого Петиного хода компьютер, чтобы минимизировать вероятность своего проигрыша, должен взять один камень. Тогда Петя выигрывает, только если будет брать 4 камня из четырёх оставшихся до делимости на 5.    Таким образом, вероятность выигрыша Пети равна (¼)4 = 1/256, где ¼ – вероятность того, что в свой ход Петя возьмёт правильное количество камней.",
        "Ответ: 1/256."
    ],
    "65265": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Петя предлагает Васе сыграть в следующую игру. Петя дает Васе две коробки с конфетами. В каждой из двух коробок шоколадные конфеты и карамельки. Всего в обеих коробках 25 конфет. Петя предлагает Васе взять из каждой коробки по конфете. Если обе конфеты окажутся шоколадными, то Вася выиграл. В противном случае выиграл Петя. Вероятность того, что Васе достанутся две карамельки, равна 0,54. У кого больше шансов на победу?",
        "Решение: Поскольку Вася вынет две карамельки с вероятностью 0,54, то вероятность того, что он вынет две шоколадные конфеты, заведомо не превосходит   1 – 0,54 = 0,46, то есть вероятность выигрыша для Васи меньше ½. Значит, больше шансов на победу у Пети.",
        "Ответ: У Пети."
    ],
    "65266": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: На каждой из четырёх карточек написано натуральное число. Берут наугад две карточки и складывают числа на них. С равной вероятностью эта сумма может быть меньше 9, равна 9 и больше 9. Какие числа могут быть записаны на карточках?",
        "Решение: Пусть на четырёх карточках написаны натуральные числа a ≤ b ≤ c ≤ d. Две из четырёх карточек можно выбрать шестью различными способами. Поскольку по условию пару карточек выбирают случайным образом, то вероятность выбрать конкретную пару равна &frac16;. Так как по условию события {s < 9}, {s = 9}, {s > 9} (где s– сумма чисел на выбранных карточках) равновероятны, то вероятность каждого из них равна &frac13;.    Значит, две из сумм a + b, a + c, a + d, b + c, b + d, c + d равны 9, две больше 9 и две меньше.    В силу неравенств a + b ≤ a + c ≤ a + d ≤ b + d ≤ c + d и a + c ≤ b + c ≤ b + d равны 9 суммы  a + d и b + c, меньше 9 суммы a + b и a + c, а больше 9 – суммы b + d и c + d. В частности, a + c < a + d, значит, c < d. Аналогично a < b. Кроме того, b < c, так как сумма b + c нечётна.    Таким образом, пары {a, d} и {b, c} можно выбирать из пар {1, 8}, {2, 7}, {3, 6}, {4, 5}, с учётом полученных неравенств. Отсюда ответ.",
        "Ответ: (1, 2, 7, 8), (1, 3, 6, 8), (1, 4, 5, 8), (2, 3, 6, 7), (2, 4, 5, 7), (3, 4, 5, 6)."
    ],
    "65267": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Имеются два симметричных кубика. Можно ли так написать на их гранях некоторые числа, чтобы сумма очков при бросании принимала значения 1, 2, ..., 36 с равными вероятностями?",
        "Решение: Приведём пример таких кубиков. Пусть на первом кубике написаны числа 1, 2, 3, 4, 5, 6, а на втором 0, 6, 12, 18, 24, 30. Любое число от 1 до 36 представимо единственным образом в виде суммы чисел, написанных на двух кубиках. Таким образом, сумма очков при бросании принимает значения 1, 2, ..., 36 с равными вероятностями.",
        "Ответ: Можно."
    ],
    "65268": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: В классе 25 детей. Для дежурства наугад выбирают двоих. Вероятность того, что оба дежурных окажутся мальчиками, равна 3/25.   Сколько в классе девочек?",
        "Решение: Пусть в классе n мальчиков, тогда число способов выбрать из них упорядоченную пару дежурных равно n(n – 1), число способов выбрать упорядоченную пару из всего классе равно 25·24. Поэтому вероятность того, что будут выбраны два мальчика, равна n(n – 1) : (25·24) = 3/25. Отсюда    n(n – 1) = 72 = 9·8. Следовательно,   n = 9, то есть в классе 9 мальчиков и 16 девочек.",
        "Ответ: 16 девочек."
    ],
    "65269": [
        "Математическая статистика",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: В первой четверти у Васи было пять оценок по математике, больше всего среди них пятёрок. При этом оказалось, что медиана всех оценок равна 4, а среднее арифметическое 3,8. Какие оценки могли быть у Васи?",
        "Решение: Выпишем оценки Васи по возрастанию. На третьем (среднем) месте будет стоять 4. Значит, двумя оценками, стоящими правее неё могут быть только (4, 4), (4, 5) либо (5, 5). Первые два варианта не подходят, так как тогда четвёрок будет больше, чем пятёрок, что противоречит условию. Значит, последние две оценки – пятёрки.    Так как среднее всех оценок равно 3,8, то сумма всех пяти оценок равна 3,8·5 = 19. Значит, первые две оценки (стоящие левее четвёрки) в сумме дают 19 – 5 – 5 – 4 = 5. Поэтому ими могут быть только (1, 4) или (2, 3). Первый вариант невозможен, так как иначе у Васи было бы поровну четвёрок и пятёрок. Значит, Васины оценки (2, 3, 4, 5, 5).",
        "Ответ: 2, 3, 4, 5, 5."
    ],
    "65270": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: В классе меньше 30 человек. Вероятность того, что наугад выбранная девочка отличница, равна 3/13, а вероятность того, что наугад выбранный мальчик – отличник, равна 4/11. Сколько в классе отличников?",
        "Решение: Вероятность того, что наугад выбранная девочка – отличница,   равна отношению количества девочек отличниц к общему количеству девочек в классе. Следовательно, количество девочек делится на 13, то есть равно 13 или 26.     Аналогично количество мальчиков равно 11 либо 22. Учитывая, что в классе меньше 30 человек, находим, что в классе 13 девочек (3 отличницы) и 11 мальчиков (4 отличника).",
        "Ответ: 7 отличников."
    ],
    "65273": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Игральную кость бросают раз за разом. Обозначим через Pn вероятность того, что в какой-то момент сумма очков, выпавших при всех   сделанных бросках, равна n. Докажите, что при n ≥ 7 верно равенство Pn = &frac16; (Pn–1 + Pn–2 + ... + Pn–6).",
        "Решение: Разделим игру на два независимых испытания: первый бросок, который даёт с вероятностью &frac16; любое число очков k от 1 до 6, и второе испытание – все последующие броски. Все последующие броски – такая же игра, которая даёт в какой-то момент сумму m с вероятностью Pm. Вероятность P(Ak,m) события Ak,m = {первый раз выпало k; сумма остальных в какой-то момент равна m} равна &frac16; Pm.      Очевидно, во всей игре сумма очков в какой-то момент станет равна n, если m = n – k. События A1,n–1, A2,n–2, ... и т.д. несовместны, поэтому  Pn = P(A1,n–1) + ... + P(A1,n–6) = &frac16; Pn–1 + ... + &frac16; Pn–6."
    ],
    "65279": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Вероятность того, что купленная лампочка будет работать, равна 0,95.  Сколько нужно купить лампочек, чтобы с вероятностью 0,99 среди них было не менее пяти работающих?",
        "Решение: Возьмём 6 лампочек. Вероятность того, что среди них будет не менее 5 работающих, есть сумма вероятностей того, что среди них будет ровно 5 работающих и ровно 6 работающих, то есть 6·0,955·0,05 + 0,956 = 0,9672.     Возьмём 7 лампочек. Искомая вероятность равна 21·0,955·0,052 + 7·0,956·0,05 + 0,957 = 0,9962.",
        "Ответ: 7 лампочек."
    ],
    "65280": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: У охотника есть две собаки. Однажды, заблудившись в лесу, он вышел на развилку. Охотник знает, что каждая из собак с вероятностью p выберет дорогу домой. Он решил выпустить собак по очереди. Если обе выберут одну и ту же дорогу, он пойдёт за ними; если же они разделятся, охотник выберет дорогу, кинув монетку. Увеличит ли таким способом охотник свои шансы выбрать дорогу домой, по сравнению с тем, как если бы у него была одна собака?",
        "Решение: Вероятность выбрать верный путь, имея одну собаку, равна p. Вероятность выбрать верную дорогу, если действовать указанным способом, имея двух собак, равна p² + ½·2p(1 – p) = p, то есть та же самая.",
        "Ответ: Не увеличит."
    ],
    "65282": [
        "Математическая статистика",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Маркетинговая компания решила провести социологическое исследование, чтобы узнать, какая часть городского населения узнаёт новости в основном из радиопередач, какая часть – из телепрограмм, какая часть – из прессы, а какая – по интернету. Для исследования было решено использовать выборку из 2000 случайно выбранных владельцев адресов электронной почты. Можно ли считать такую выборку репрезентативной?",
        "Решение: Выборка нерепрезентативна, так как два события: A = {у данного человека есть электронная почта} и B = {данный человек пользуется Интернетом} являются зависимыми. С другой стороны, люди, пользующиеся Интернетом, в большинстве своём используют его, в частности, и для чтения новостей. Таким образом, процент людей, которые скажут, что узнают новости из Интернета, в данной выборке будет заметно больше, чем среди всех людей.",
        "Ответ: Нельзя."
    ],
    "65283": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: В ящике 2009 носков – синих и красных. Может ли синих носков быть столько, чтобы вероятность вытащить наудачу два носка одного цвета была равна 0,5?",
        "Решение: Пусть в ящике m + n носков, из которых m одного цвета и n другого. Тогда вероятность вытащить два носка одного цвета равна сумме вероятностей вытащить два носка первого и второго цветов:       Если это число равно ½, то 2m² + 2n² – 2(m + n) = m² + 2mn + n² – (m + n) ⇔ (m – n)² = m + n = 2009. Но число 2009 не является точным квадратом.",
        "Ответ: Не может."
    ],
    "65285": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Ася и Вася вырезают прямоугольники из клетчатой бумаги. Вася ленивый; он кидает игральную кость один раз и вырезает квадрат, сторона которого равна выпавшему числу очков. Ася кидает кость дважды и вырезает прямоугольник с длиной и шириной, равными выпавшим числам. У кого математическое ожидание площади прямоугольника больше?",
        "Решение: Пусть A и B – независимые случайные величины, принимающие значения 1, 2, ..., 6 с равными вероятностями. Тогда математическое ожидание площади Асиного прямоугольника равно EAB = EA·EB = (EA)² (так как A и B независимы). Ожидание площади Васиного прямоугольника EA².     Поскольку 0 < DA = EA² – (EA)², то EA² > (EA)².    Значит, в среднем площадь Васиного квадрата больше площади Асиного прямоугольника.",
        "Ответ: У Васи."
    ],
    "65287": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: По условиям шахматного матча победителем объявляется тот, кто опередил соперника на две победы. Ничьи в счет не идут. Вероятности выигрыша у соперников одинаковы. Число результативных партий в таком матче – величина случайная. Найдите её математическое ожидание.",
        "Решение: Пусть Х – число результативных партий. В начале матча разница между числом побед двух участников равна нулю. Перечислим возможные случаи двух результативных партий, обозначая единицей выигрыш первого и двойкой выигрыш второго участника: 11, 12, 21, 22. Два из четырёх случаев означают победу в матче, а именно, 11 и 22. Другие два случая приводят нас в начальное состояние с нулевой разницей числа побед.     Таким образом, с вероятностью ½ число побед 2 и с той же вероятностью X = 2 + X', где X' распределено, так же, как и X. Отсюда   EX = 2·½ + (2 + EX)·½, то есть EX = 4.",
        "Ответ: 4."
    ],
    "65288": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: В соревнованиях по пиханию животами шансы противников на победу относятся так же, как массы их тел. Юмбо весит больше Джумбо, а Пинк весит меньше Бонка. Ничьей в поединке быть не может. Юмбо и Джумбо по очереди должны пихаться с Пинком и Бонком. Какое из событий более вероятно:",
        "Решение: Обозначим массы противников u, j, p, b в соответствии с первыми буквами их имен. Вероятность того, что Юмбо победит только Пинка равна произведению вероятностей того, что он победит Пинка и проиграет Бонку, то есть      Аналогично вероятность того, что Джумбо победит только Бонка равна          Следовательно, вероятность P(A) события A равна        Аналогично",
        "Ответ: Вероятности равны."
    ],
    "65289": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Монету бросают 10 раз. Найдите вероятность того, что ни разу не выпадут два орла подряд.",
        "Решение: Общее число исходов при десяти бросаниях монеты равно 210. Найдём число комбинаций, где нет двух орлов подряд.",
        "Ответ: 9/64."
    ],
    "65301": [
        "Математическая статистика",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Длина гипотенузы прямоугольного треугольника равна 3.    а) Рассеянный Учёный вычислил дисперсию длин сторон этого треугольника и нашёл, что она равняется 2. Не ошибся ли он в расчетах?    б) Какое наименьшее стандартное отклонение сторон может иметь такой прямоугольный треугольник? Какие у него при этом катеты?",
        "Решение: а) Пусть a и b – катеты треугольника. Тогда a² + b² = 9, а D = &frac13; (a² + b² + 9) – &frac19; (a + b + 3)² = 18/3 – 1/9 (a + b + 3)² = 6 – 1/9 (a + b + 3)². Из неравенства треугольника следует, что a + b > 3. Значит, D < 6 – 1/9·6² = 2.",
        "Ответ: а) Ошибся;  б) ; ."
    ],
    "65305": [
        "Непрерывное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Верхняя сторона бумажного квадрата белая, а нижняя – красная. В   квадрате случайным образом выбирается точка F. Затем квадрат сгибают так, чтобы одна случайно выбранная вершина наложилась на точку F. Найдите математическое ожидание числа сторон появившегося красного многоугольника.",
        "Решение: Результат зависит только от взаимного положения точки F и выбранной вершины. Поэтому можно считать, что вершина фиксирована (пусть это будет вершина A), а точка F выбирается случайно.",
        "Ответ: 5 – π/2 ≈ 3,429."
    ],
    "65314": [
        "Непрерывное распределение",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Митя собирается согнуть квадратный лист бумаги ABCD. Митя называет сгиб красивым, если сторона AB пересекает сторону CD и четыре получившихся прямоугольных треугольника равны. Перед этим Ваня выбирает на  листе случайную точку F. Найдите вероятность того, что Митя сможет сделать красивый сгиб, проходящий через точку F.",
        "Решение: Развернём красивый сгиб (рис. справа). Пусть диагональ BD и линия сгиба ST пересекаются в точке O. Треугольники BSO  и DTO равны по стороне и двум углам. Значит, BO = OD, и поэтому O – центр квадрата. Таким образом, линия сгиба ST  проходит через центр квадрата. Очевидно, обратное также верно – если линия сгиба проходит через центр квадрата, то сгиб будет красивым.",
        "Ответ: ½."
    ],
    "65317": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Муха ползёт из начала координат. При этом муха двигается только по \t\tлиниям целочисленной сетки вправо или вверх (монотонное блуждание). В каждом узле сетки муха случайным образом выбирает направление дальнейшего движения: вверх или вправо. Найдите вероятность того, что в какой-то момент:   \tа) муха окажется в точке (8, 10);    б) муха окажется в точке (8, 10), по дороге пройдя по отрезку, соединяющему точки (5,6) и (6. 6);    в) муха окажется в точке (8, 10), пройдя внутри круга радиуса 3 с центром в точке (4, 5).",
        "Решение: а) Муха может достичь точки (8, 10) ровно за 18 шагов. Поэтому достаточно рассмотреть первые 18 шагов мухи. Общее число возможных путей, состоящих из 18 шагов равно 218.    Чтобы попасть в точку (8, 10) из этих 18 шагов, муха должна ровно 8 шагов сделать вправо и ровно 10 вверх. При этом порядок, в котором чередуются шаги вправо и вверх, не важен. Значит, число путей, приводящих в точку (8, 10), равно .     Таким образом, вероятность попасть в эту точку равна   .",
        "Ответ: а) ;    б) ;    в)  ."
    ],
    "65318": [
        "Математическая статистика",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: В числовом наборе n чисел, причём одно из чисел равно 0, а другое равно 1.     а) Какова наименьшая возможная дисперсия такого набора чисел?      б) Каким для этого должен быть набор?",
        "Решение: Обозначим числа ak, где k  = 1, ..., n, а среднее арифметическое всех чисел a.    Дисперсия D набора равна 1/n ((0 – a)² + (a2 – a)² + ... + (an–1 – a)² + (1 – a)²). Разобьём сумму в числителе на две группы – первое слагаемое объединим с последним, а во вторую группу войдут остальные слагаемые (если они есть): (a² + (1 – a)²) + ((a² – a)² + ... + (an–1 – a)²).     Если n = 2, то вторая группа отсутствует. Если n > 2, то, чтобы эта сумма была наименьшей возможной, положим a2 = a3 = ... = an–1 = a. Тогда  D = 1/n (a² + (1 – a)2).     Минимум квадратичной функции a² + (1 – a)² = 2a² – 2a + 1 = 2(a – ½)² + ½ равен ½. При этих условиях дисперсия равна 1/2n.",
        "Ответ: а) 1/2n;  б) все числа, кроме первого и последнего, равны ½."
    ],
    "65333": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Петр Иванович, еще 49 мужчин и 50 женщин в случайном порядке рассаживаются  вокруг круглого стола. Назовём мужчину довольным, если рядом с ним сидит женщина. Найдите:    а) вероятность того, что Петр Иванович доволен;    б) математическое ожидание числа довольных мужчин.",
        "Решение: а) Петр Иванович недоволен, только если по обе стороны от него сидят  мужчины. Вероятность этого равна 49/99·48/98 = 8/33.    Следовательно, вероятность противоположного события Петр Иванович доволен равна 25/33.",
        "Ответ: а) 25/33;   б) 3729/33."
    ],
    "65772": [
        "Непрерывное распределение",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: В треугольнике ABC угол A равен 40°. Треугольник случайным образом бросают на стол.  Найдите вероятность того, что вершина A окажется восточнее двух других вершин.",
        "Решение: Пусть треугольник упал так, что обход от A к B и далее к C осуществляется против часовой стрелки. Проведём через вершину A прямую, идущую строго с юга на север. Событие Вершина A восточнее двух других осуществляется тогда и только тогда, когда вершины B и C расположены в западной полуплоскости от проведённой прямой. На рисунке показаны два крайних положения треугольника, при которых вершины B и C не расположены в восточной полуплоскости. Видно, что луч AB должен проходить внутри закрашенного угла, который является внешним к углу A треугольника. Следовательно, вероятность этого события равна (180 – 40) : 360 = 7/18.",
        "Ответ: 7/18."
    ],
    "65774": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: На знакомом нам заводе вырезают металлические диски диаметром 1 м. Известно, что диск диаметром ровно 1 м весит ровно 100 кг. При изготовлении возникает ошибка измерения, и поэтому стандартное отклонение радиуса составляет 10 мм. Инженер Сидоров считает, что стопка из 100 дисков в среднем будет весить 10000 кг. На сколько ошибается инженер Сидоров?",
        "Решение: По условию ER = 0,5 м, DR = 10–4 м². Найдём математическое ожидание площади одного диска:   ES = E(πR²) = πER² = π(DR + E²R) = π(10–4 + 0,25) = 0,2501π.     Значит, математическое ожидание массы диска равно 0,2501π/0,25π·100 = 100,04 кг. Следовательно, стопка из 100 дисков в среднем будет весить 10004 кг.",
        "Ответ: На 4 кг."
    ],
    "65784": [
        "Непрерывное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Однажды осенью Рассеянный Учёный глянул на свои старинные настенные часы   и увидел, что на циферблате уснули три мухи. Первая спала в точности на отметке 12 часов, а две другие так же аккуратно расположились на отметках 2 часа и 5 часов. Учёный произвёл измерения и определил, что часовая стрелка мухам не грозит, а вот минутная сметёт их всех по очереди. Найдите вероятность того, что ровно через 40 минут после того, как Учёный заметил мух, ровно две мухи из трёх были сметены минутной стрелкой.",
        "Решение: Будем называть мух – муха 2, муха 5 и муха 12 по месту, где они заснули.     Стрелка могла смести муху 12 и муху 2, но не тронуть муху 5, только если в момент первого наблюдения она располагалась в промежутке от 6 до 9 часов,   что даёт ¼ круга.     Смести только муху 2 и муху 5 стрелка могла, если только в момент первого наблюдения она располагалась между 12 и 2 часами. Это даёт &frac16; круга.     Наконец, стрелка могла смести только мух 5 и 12 в том случае, если вначале она располагалась между 4 и 5 часами, то есть на промежутке,   занимающем 1/12 круга. Таким образом, считая все начальные положения стрелки равновозможными и учитывая равномерность её движения, получаем, что искомая вероятность равна ¼ + &frac16; + 1/12 = ½.",
        "Ответ: ½."
    ],
    "65330": [
        "Математическая статистика",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: В наборе –5, –4, –3, –2, –1, 0, 1, 2, 3, 4, 5 замените одно число двумя другими целыми числами так, чтобы дисперсия набора и его среднее не изменились.",
        "Решение: Как известно, дисперсия набора равна разности среднего квадрата и  квадрата среднего. Поэтому задачу можно переформулировать: нужно заменить одно число двумя другими так, чтобы среднее арифметическое и средний квадрат чисел в наборе не изменились. Среднее арифметическое данного набора равно 0, поэтому  среднее арифметическое нового набора, а, следовательно, и сумма чисел  в нём также должна быть равна 0.     В данном наборе 11 чисел, а сумма квадратов равна 2·(1² + 2² + 3² + 4² + 5²) = 110, так что средний квадрат равен 10. В новом наборе 12 чисел, поэтому сумма квадратов чисел нового набора должна быть 120, то есть увеличивается на 10. Заменим число a числами b и c. Тогда a = b + c и  a² + 10 = b² + c². Следовательно, b² + c² – 10 = (b + c)² = b² + c² + 2bc, откуда bc = –5.     Значит, одно из чисел равно 5 или –5, а другое, соответственно, –1 или 1. В первом случае a = 4, во втором случае a = –4.",
        "Ответ: Надо заменить –4 на 1 и –5 или заменить 4 на –1 и 5."
    ],
    "65785": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Билет на электричку стоит 50 рублей, а штраф за безбилетный проезд – 450 рублей. Если безбилетник (заяц) попадается контролёру, то оплачивает и штраф, и стоимость билета. Известно, что контролёр встречается в среднем один раз на 10 поездок. Заяц ознакомился с основами теории вероятностей и решил придерживаться стратегии, которая делает математическое ожидание расходов наименьшим возможным. Как ему поступать: покупать билет каждый раз, не покупать никогда или бросать монетку – покупать билет или нет?",
        "Решение: Пусть вероятность покупки билета p, а вероятность появления контролера q. Случайная величина X Расходы на поездку имеет распределение   .     Математическое ожидание расходов EX = 50p + 500(1 – p)q = 500q – 50p(10q – 1).    По условию q = 0,1. Следовательно, EX = 50, то есть не зависит от p. Возникает равновесие – средний расход на поездку не зависит от частоты или вероятности покупки билета.",
        "Ответ: Все равно."
    ],
    "66040": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В торговом центре три автомата продают кофе. В течение дня первый автомат ломается с вероятностью 0,4, второй – с вероятностью 0,3. Каждый вечер приходит механик Иванов и чинит все сломанные автоматы. Однажды Иванов написал в отчете, что математическое ожидание поломок в неделю равно 12. Докажите, что Иванов преувеличивает.",
        "Решение: Математическое ожидание числа поломок в день, очевидно, не превосходит 0,4 + 0, 3 + 1 = 1,7. А за неделю – 1,7·7 = 11,9 < 12."
    ],
    "66041": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: Когда Рассеянному Учёному приходит в голову гениальная идея, он записывает её на листке бумаги, но тут же понимает, что идея не гениальная, комкает лист и кидает под стол, где стоят две мусорные корзины. Учёный промахивается мимо первой корзины с вероятностью p > 0,5, и с такой же вероятностью он промахивается мимо второй. За утро Учёный бросил под стол пять скомканных гениальных идей. Найдите вероятность того, что в каждой корзине оказалось хотя бы по одной из утренних идей.",
        "Решение: Введём обозначения событий: A = {В первой корзине есть идея}, B = {Во второй корзине есть идея}. Требуется найти вероятность события  A∩B. Из условия следует, что P(A) = P(B) = 1 – p5. Вероятность того, что при одном броске Учёный попадёт в одну определённую корзину, равна 1 – p. Попасть сразу в две невозможно, поэтому вероятность того, что Учёный попал хотя бы в одну корзину, равна 2 – 2p. Значит, вероятность не попасть одним броском ни в одну из корзин равна 1 – (2 – 2p) = 2p – 1, а вероятность не попасть ни разу из пяти равна (2p – 1)5. Следовательно,   P(A∪B) = 1 – (2p – 1)5, а P(A∩B) = P(A) + P(B) – P(A∪B) = 2 – 2p5 – 1 + (2p – 1)5 = 1 – 2p5 + (2p – 1)5.",
        "Ответ: 1 – 2p5 + (2p – 1)5."
    ],
    "66047": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: На берёзе сидели белые и чёрные вороны – всего их было 50. Белые точно были, а чёрных было не меньше, чем белых. На дубе тоже сидели белые и чёрные вороны, и было их всего 50. На дубе чёрных тоже было не меньше, чем белых или столько же, а может быть, даже на одну меньше. Одна случайная ворона перелетела с берёзы на дуб, а через некоторое время другая (может быть, та же самая) случайная ворона перелетела с дуба на берёзу. Что более вероятно: что количество белых ворон на берёзе стало таким же, как было сначала, или что оно изменилось?",
        "Решение: Пусть на берёзе было a белых и b чёрных ворон, а на дубе – c белых и d чёрных. Вероятности перелётов чёрных и белых ворон с берёзы на дуб и обратно изобразим с помощью дерева. Точка S – начало, событие B – перелёт чёрной вороны, событие W – перелёт белой.",
        "Ответ: Что количество белых ворон станет прежним."
    ],
    "66048": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На антарктической станции n полярников, все разного возраста. С вероятностью p между каждыми двумя полярниками завязываются дружеские отношения, независимо от других симпатий или антипатий. Когда зимовка заканчивается и наступает пора разъезжаться по домам, в каждой паре друзей старший даёт младшему дружеский совет. Найдите математическое ожидание числа тех, кто так и не получил ни одного дружеского совета.",
        "Решение: Пусть 0 < p < 1. Дадим полярниками номера от 1 до n в соответствии с возрастом – чем старше, тем номер меньше. Полярник с номером k может получить советы от k – 1 полярников старше него. Поэтому он не получит ни одного совета, только если не дружит ни с кем из них. Вероятность этого (1 – p)k–1. Поэтому событие полярник k вообще не получил советов имеет индикатор Ik с математическим ожиданием EIk = (1 – p)k–1. Общее число полярников, не получивших ни одного совета, равно I1 + I2 + ... + In.     E(I1 + I2 + ... + In) = (1 – p)0 + (1 – p)1 + ... + (1 – p)n–1 = 1/p (1 – (1 – p)n).     При p = 0, очевидно, E = n, а при p = 1  E = 1.",
        "Ответ: n при p = 0;  1/p (1 – (1 – p)n) при 0 < p < 1;  1 при p = 1."
    ],
    "66049": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 7,8,9,10",
        "Условие: В турнире участвуют 100 борцов, все разной силы. В любом поединке двух борцов всегда побеждает тот, кто сильнее. В первом туре борцы разбились на случайные пары и провели поединки. Для второго тура борцы ещё раз разбиваются на случайные пары соперников (может случиться, что какие-то пары повторятся). Приз получает тот, кто выиграет оба поединка. Найдите:",
        "Решение: а) См. задачу 64440.",
        "Ответ: а) 1;  б) ≈33,5."
    ],
    "66050": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На бал пришли n семейных пар. В каждой паре муж и жена абсолютно одинакового роста, но двух пар одного роста нет. Начинает звучать вальс, и все пришедшие разбиваются случайным образом на пары: каждый кавалер танцует со случайно выбранной дамой. Найдите математическое ожидание случайной величины X Число кавалеров, которые ниже своей партнёрши.",
        "Решение: Дадим кавалерам номера от 1 до n. Пусть Ij – индикатор события кавалер номер j ниже своей дамы. P(Ij = 1) = j–1/n. Значит,   EX = E(I1 + I2 + ... + In) = 1/n (0 + 1 + ... + (n – 1)) = n–1/2.",
        "Ответ: ½ (n – 1)."
    ],
    "66053": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Имеется n случайных векторов вида (y1, y2, y3), где ровно одна случайная координата равна 1, остальные равны 0. Их складывают. Получается случайный вектор a с координатами (Y1, Y2, Y3).     а) Найдите математическое ожидание случайной величины a².     б) Докажите, что",
        "Решение: а) Величина Yj – число единиц среди чисел yj – распределена по биномиальному закону с вероятностью p = &frac13; и числом испытаний n. Поэтому   EYj = n/3 и DYj = n·&frac13;·&frac23; = 2n/9.     Значит,",
        "Ответ: а)"
    ],
    "66057": [
        "Дискретное распределение",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Согласно одной неправдоподобной легенде, Коши и Буняковский очень любили по вечерам играть в дартс. Но мишень у них была необычная – секторы на ней были неравные, так что вероятности попасть в разные секторы были не одинаковы. Однажды Коши бросил дротик и попал в мишень. Следующим бросает Буняковский. Что более вероятно: что Буняковский попадёт в тот же сектор, в который попал Коши, или что он попадёт в следующий сектор по часовой стрелке?",
        "Решение: Пусть вероятности поразить секторы равны p1, p2, ..., pn (индексы указывают номера секторов). Вероятность того, что Буняковский попадёт в тот же сектор, что и Коши, равна    а вероятность того, что Буняковский попадёт в следующий по часовой стрелке сектор, равна  p1p2 + p2p3 + ... + pn–1pn + pnp1.     Из очевидного неравенства a² + b² ≥ 2ab следует, что       При этом равенство достигается только в случае p1 = p2 = ... = pn, который противоречит условию.",
        "Ответ: Что попадёт в тот же."
    ],
    "35352": [
        "Теория вероятностей (прочее)",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: При посадке в самолет выстроилась очередь из n пассажиров,    у каждого из которых имеется билет на одно из  n мест.    Первой в очереди стоит сумасшедшая старушка. Она вбегает в салон и    садится на случайное место (возможно, и на свое). Далее    пассажиры по очереди занимают свои места, а в случае, если свое    место уже занято, садятся случайным образом на одно из свободных    мест. Какова вероятность того, что последний пассажир займет свое    место?",
        "Подсказка: Пусть последний сел не на свое место. Тогда в тот момент, когда      некоторый пассажир     занимал место последнего, он мог занять и старушкино место.",
        "Решение: Пусть при некоторой рассадке пассажиров последний пассажир сел не    на свое место (такую рассадку назовем неудачной).    Тогда до прихода последнего пассажира его место    было занято пассажиром A (A может быть и сумасшедшей старушкой).    В момент прихода пассажира A перед ним стоит выбор - какое место    занять. В рассматриваемой рассадке он занимает место последнего    пассажира. Но с той же вероятностью он мог занять и место    старушки,    и в дальнейшем все пассажиры, включая последнего, займут свои    собственные места.    (Конечно, нужно еще пояснить, почему в момент прихода пассажира A    старушкино место все еще свободно. Но это действительно так -    нетрудно проследить, что пока старушкино место свободно,    среди всех еще не вошедших пассажиров есть ровно один, чье    место уже занято. Как только очередной пассажир занимает старушкино место,    все остальные будут садиться только на свои места.)    Таким образом, каждой неудачной рассадке соответствует удачная,    которая может случиться с той же вероятностью.     Это говорит о том, что ровно в половине    случаев рассадка будет неудачной.",
        "Ответ: 0.50"
    ],
    "66034": [
        "Математическая статистика",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Найдите медиану набора длин: 2 м 30 см, 250 мм, 0,02 км, 0,002 км, 2700 см, 2800 мм, 240 см.",
        "Ответ: 240 см."
    ],
    "65263": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Можно ли:    а) нагрузить две монеты так, чтобы вероятности выпадения орла и решки были разные, а вероятности выпадения любой из комбинаций решка, решка, орел, решка, орел, орел были бы одинаковы?    б) нагрузить две кости так, чтобы вероятность выпадения любой суммы от 2 до 12 была одинаковой?",
        "Решение: а) Покажем, что так нагрузить монеты невозможно. Сразу заметим, что если обе монеты симметричны, то выпадение комбинации орел, решка более вероятно, чем выпадение остальных комбинаций. Поэтому можно считать, что у первой монеты вероятность выпадения орла больше. Рассмотрим все возможные случаи.    1) У второй монеты вероятность выпадения орла не меньше, чем вероятность выпадения решки. Тогда при бросании двух монет вероятность выпадения комбинации орел, орел больше, чем вероятность выпадения комбинации   решка, решка.    2) У второй монеты вероятность выпадения решки больше, чем вероятность выпадения орла. Тогда вероятность выпадения комбинации орел, решка не меньше вероятности выпадения на первой монете орла, а на второй – решки, что в свою очередь больше вероятности выпадения комбинации решка, решка.",
        "Ответ: Нельзя."
    ],
    "65274": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На рулетке может выпасть любое число от 0 до 2007 с одинаковой вероятностью. Рулетку крутят раз за разом. Обозначим через Pk вероятность того, что в какой-то момент сумма чисел, выпавших при всех сделанных бросках, равна k. Какое число больше:   P2007 или P2008?",
        "Решение: Так как до начала игры сумма равна нулю, то P0 = 1.     Рассуждая так же, как и в задаче 65273 (отличие в одном: вместо числа 6 – число 2008), имеем:  P2007 – P2008 = 1/2008 (P2007 + P2006 + ... + P0) – 1/2008 (P2008 + P2007 + ... + P1) = 1/2008 (P0 – P2008) > 0, так как P2008 < 1 (сумма 2008, очевидно, может и не случиться).",
        "Ответ: P2007."
    ],
    "65275": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На рисунке изображена схема трассы для картинга. Старт и финиш в точке A, причём картингист по дороге может сколько угодно раз заезжать в точку A и возвращаться на круг.",
        "Решение: Обозначим через Mn число всевозможных маршрутов длительностью n минут. Каждый такой маршрут состоит ровно из n   участков (участок – это отрезок AB, BA или кольцо BB). Пусть Mn,A – число таких маршрутов, оканчивающихся в A, а Mn,B – число маршрутов   с конечной точкой B.    В точку B за минуту можно попасть как из точки A, так и из точки B, поэтому Mn,B = Mn–1.    В точку A за минуту можно попасть только из точки B, поэтому Mn,A = Mn–1,B   = Mn–2 = Mn–2,  A + Mn–2,B = Mn–2,A + Mn–3 = Mn–2,A + Mn–1,A.     Дополнительно заметим, что M1,A = 0, M2,A = 1. Таким образом, числа Mn,A образуют последовательность 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, ...    Число M10,A равно 34 – девятому числу Фибоначчи.",
        "Ответ: 34 маршрута."
    ],
    "65286": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На экзамене даётся три задачи по тригонометрии, две по алгебре и пять по геометрии. Ваня решает задачи по тригонометрии с вероятностью  p1 = 0,2, по геометрии – с вероятностью p2 = 0,4, по алгебре – с вероятностью p3 = 0,5. Чтобы получить тройку, Ване нужно решить не менее пяти задач.    а) С какой вероятностью Ваня решит не менее пяти задач?   Ваня решил усиленно заняться задачами какого-нибудь одного раздела. За неделю он может увеличить вероятность решения заданий этого раздела на 0,2.     б) Каким разделом следует заняться Ване, чтобы вероятность решить не менее пяти задач стала наибольшей?     в) Каким разделом следует заняться Васе, чтобы математическое ожидание числа решённых задач стало наибольшим?",
        "Решение: а) Пусть случайная величина X – число решённых задач по тригонометрии, Y – число решённых задач по геометрии и Z – число решённых задач по алгебре. Тогда сумма U = X + Y + Z есть общее число решённых задач. Мы хотим найти вероятность P(U ≥ 5). Проще вычислить   P(U < 5) = P(U = 0) + P(U = 1) + P(U = 2) + P(U = 3) + P(U = 4).     Запишем таблицы распределения случайных величин X, Y и Z.    Вероятность решить 0 ≤ k ≤ 3 задач по тригонометрии равна",
        "Ответ: а) ≈ 0,27;  б)-в) геометрией."
    ],
    "65290": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: В затылок друг другу выстроились n человек. Более высокие загораживают более низких, и тех не видно.   Чему равно математическое ожидание числа людей, которых видно?",
        "Решение: Обозначим через Xn случайную величину Число видимых среди n человек. Что происходит при добавлении n-го человека в хвост очереди?   С вероятностью 1/n он выше всех прочих и с вероятностью n–1/n он не самый высокий. В первом случае станет видно на одного человека больше, а во втором число тех, кто виден, не изменится. Значит, Xn = 1/n (Xn–1 + 1) + n–1/n Xn–1.     Перейдём к ожиданиям: EXn = EXn–1 + 1/n = EXn–2 + 1/n–1 + 1/n = ... = EX1 + ½ + &frac13; + ... + 1/n.     EX1 = 1, поскольку один человек всегда виден. Значит, EXn = 1 + ½ + &frac13; + ... + 1/n.",
        "Ответ: 1 + ½ + &frac13; + ... + 1/n."
    ],
    "65304": [
        "Непрерывное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Вася в ярости режет прямоугольный лист бумаги ножницами. Каждую секунду он разрезает первый попавшийся кусок случайным прямолинейным разрезом на две части.     а) Найдите математическое ожидание числа сторон многоугольника,  который случайно попадётся Васе через час такой работы.    б) Решите эту же задачу, если вначале лист бумаги имел форму  произвольного многоугольника.",
        "Решение: б) Пусть в результате Васиной деятельности на столе оказался k + 1 многоугольник, в том числе p3 треугольников, p4 четырёхугольников, ..., pm m-угольников (m – наибольшее возможное число сторон у получившегося многоугольника). Тогда математическое ожидание числа сторон выбранного  многоугольника равно 1/k+1 (3p3 + 4p4 + ... + mpm).     В скобках находится общее число сторон всех полученных   многоугольников.     Предположим, что у Васи был n-угольник. Вероятность сделать случайный разрез точно через какую-нибудь вершину равна нулю. Значит, каждый разрез делит какие-то две стороны разрезаемого многоугольника на две части каждую, и еще две новые стороны получаются вдоль разреза. Таким образом, каждый разрез добавляет 4 новые стороны. После k разрезов общее число сторон будет равно n + 4k.    Таким образом, .",
        "Ответ: а) 4;  б)   где n – число сторон исходного многоугольника."
    ],
    "65307": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: В Долине Пяти Озёр есть пять одинаковых озёр, некоторые из которых соединены ручьями (на рис. пунктиром обозначены возможные маршруты ручьёв). Маленькие караси появляются на свет только в озере S. Пока карась взрослеет, он ровно четыре раз переходит из одного озера в другое по какому-нибудь ручью (карась выбирает ручей наудачу), а затем остается жить в том озере, в котором оказался. Из каждой тысячи карасей в среднем 375 остается жить в озере S, а остальные остаются жить в озере B, в других озерах не остается жить никто. Определите, сколько ручьёв в Долине Пяти Озёр.",
        "Решение: Переход из озера в озеро будем называть маршрутом длины n, если он проходит через n ручьев. Докажем несколько утверждений."
    ],
    "65308": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Правильная игральная кость бросается много раз. Найдите математическое ожидание числа бросков, сделанных до того момента, когда сумма всех выпавших очков достигнет 2010 (то есть стала не меньше 2010).",
        "Решение: Пусть Xn – число бросков, которые пришлось сделать, чтобы сумма очков достигла n. Введём индикатор Ik: Ik равно 1, если первый бросок дал k очков, и 0 в противном случае. Очевидно, EIk = 1/6.    Ясно, что Xn = Xn–1I1 + Xn–2I2 + ... + Xn–6I6 + 1. Величина Xn–k не зависит от результата первого броска. Значит, величины Xn–k и Ik независимы. Переходя к математическим ожиданиям, получим: EXn = EXn–1EI1 + EXn–2EI2 + ... + EXn–6EI6 + 1 = 1/6 (EXn–1 + EXn–2 + ... + EXn–6) + 1.     Обозначая для краткости EXk = ek, запишем рекуррентную формулу: en = 1/6 (en–1 + en–2 + ... + en–6) + 1.  (1)     Полученная формула справедлива для всех n ≥ 1, если положить EXk = 0 при всех k ≤ 0.    Из (1) можно получить другую формулу. Запишем равенство (1) для en–1: en–1 = 1/6 (en–2 + en–3 + ... + en–7) + 1.     Теперь вычитая второе равенство из первого почленно, получим: en – en–1 = 1/6 (en–1 – en–7), откуда en = 7/6 en–1 – 1/6 en–7.  (2)     При выводе этой формулы уже предполагалось, что en–1 > 0, поэтому по ней можно считать en, только начиная с n = 2.    Поскольку e1 = 1, по формуле (2) последовательно вычисляем: e2 = 7/6·1 – 1/6·0 = 7/6; e3 = 7/6·7/6 – 1/6·0 = 49/36; e4 = 7/6·49/36 – 1/6·0 = 343/216, ..., e2010 ≈ 574,761904.",
        "Ответ: ≈ 574,761904."
    ],
    "65320": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Муха двигается из начала координат только вправо или вверх по линиям   целочисленной сетки (монотонное блуждание). В каждом узле сетки муха случайным образом выбирает направление дальнейшего движения: вверх или вправо.    а) Докажите, что рано или поздно муха достигнет точки с абсциссой 2011.      б) Найдите математическое ожидание ординаты Мухи в момент, когда муха достигла абсциссы 2011.",
        "Решение: а) Муха никогла не попадёт в точку с абсциссой 1, только если она на каждом шаге двигается вверх. Вероятность этого равна 0,5·0,5·0,5·0,5·... = 0.     Таким образом, муха обязательно попадёт в точку с абсциссой 1. Рассуждая точно так же, получим, что рано или поздно муха из точки с абсциссой 1 перейдёт в точку с абсциссой 2. И так далее – рано или поздно муха  достигнет любой целой положительной абсциссы. В частности, абсциссы 2011.",
        "Ответ: 2011."
    ],
    "65321": [
        "Математическая статистика",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Точку O, лежащую внутри треугольника ABC, соединили отрезками с вершинами треугольника. Докажите, что дисперсия набора углов AOB, AOC и BOC меньше чем     а) 10π²/27;     б) 2π²/9.",
        "Решение: Упорядочим указанные углы по убыванию: α ≥ β ≥ γ."
    ],
    "65323": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: На шкуре у Носорога складки – вертикальные и горизонтальные.  Если у Носорога на левом боку a вертикальных, b горизонтальных складок, а на правом – c вертикальных и d горизонтальных, будем говорить, что это Носорог в состоянии (abcd)  или просто Носорог (abcd).    Если Носорог чешется каким-то боком о баобаб вверх-вниз, и у Носорога на этом боку есть две горизонтальные складки, то эти две горизонтальные складки  разглаживаются. Если двух таких складок нет, то ничего не происходит.     Аналогично если Носорог чешется боком вперед-назад, и на этом боку есть две вертикальные складки, то они разглаживаются, если же таких двух складок не найдётся, то ничего не происходит.    Если на каком-то боку две какие-то складки разглаживаются, то на другом боку немедленно появляется две новые складки: одна вертикальная и одна горизонтальная.    Носороги чешутся часто, случайным боком о случайные баобабы в случайных направлениях.",
        "Решение: Построим граф, вершинами которого будем считать состояния Носорога, а рёбрами со стрелками укажем возможные переходы между состояниями и их вероятности.    Оказывается, всего состояний 8. При этом никакое состояние не является конечным – из любого Носорог может перейти в любое другое. Но вот перейдёт ли? Рассмотрим бесконечную последовательность переходов. Поскольку всего состояний конечное число, в силу принципа Дирихле среди них найдётся такое состояние a, которое встретится бесконечное число раз."
    ],
    "65324": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: По свистку учителя физкультуры все 10 мальчиков и 7 девочек выстроились в шеренгу в случайном порядке – кто куда успел.   Найдите математическое ожидание величины Число девочек, стоящих левее всех мальчиков.",
        "Решение: Добавим мысленно еще одного мальчика, поставив его правее всех. Тогда  вся шеренга разделилась на 11 групп, каждая из которых заканчивается мальчиком. Наименьшая группа состоит из одного мальчика, наибольшая может состоять из 8 человек – 7 девочек и одного мальчика.    Пронумеруем эти группы слева направо и назовём ξk  численность k-й группы. Нас интересует ожидаемая численность первой группы, то есть Eξ1.    Сумма всех величин ξk равна 18 (17 настоящих школьников и один мысленный мальчик): ξ1 + ξ2  + ... + ξ11 = 18  (*).    В силу случайности все величины ξk распределены одинаково, поэтому их ожидания равны между собой и равны Eξ1.    Переходя в равенстве (*) к ожиданиям, получим: 11Eξ1  = 18, откуда Eξ1 = 18/11. Ожидаемое число девочек на единицу меньше: 7/11.",
        "Ответ: 7/11."
    ],
    "65325": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Илья Муромец встречает трёхголового Змея Горыныча. Каждую минуту Илья   отрубает одну голову Змею. Пусть x – живучесть Змея (x > 0). Вероятность ps того, что на месте отрубленной головы вырастет s новых голов (s = 0, 1, 2), равна  В течение первых 10 минут сражения Илья записывал, сколько голов вырастало на месте каждой срубленной. Получился следующий вектор: K = (1, 2, 2, 1, 0, 2, 1, 0, 1, 2). Найдите такое значение живучести Змея, при котором вероятность вектора K наибольшая.",
        "Решение: В силу взаимной независимости отрастания голов (число отросших голов  зависит только от живучести, но не от предыдущих событий) вероятность вектора K равна  Нужно найти точку, в которой эта функция принимает наибольшее значение на луче (0, +∞).         Приравнивая производную к нулю, получаем единственный положительный корень x0 = .   Поскольку P(x) ≥ 0, P(0) = 0 и P(x) → 0  при x → ∞, то x0 – единственная точка максимума.",
        "Ответ: ."
    ],
    "65334": [
        "Математическая статистика",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Ваня написал на доске число 1, а затем ещё несколько чисел. Как только  Ваня пишет очередное число, Митя вычисляет медиану уже имеющегося  набора чисел и записывает его себе в тетрадку. В некоторый момент в  Митиной тетради записаны числа: 1; 2; 3; 2,5; 3; 2,5; 2; 2; 2; 2,5.    а) Какое число записано на доске четвёртым?",
        "Решение: а) Первое число, очевидно, единица. Тогда, чтобы медиана двух первых  чисел была равна 2, второе число должно быть равно 3.    Для наглядности будем писать Ванины числа. Ваня написал третье число a:  1 3 a3. Медиана теперь  равна 3, а это может быть, только если a ≥ 3. Добавим очередное число:  1 3 a ≥ 3  b.",
        "Ответ: а) 2;  б) если шестое или седьмое число равно 2, то восьмое число –  не больше 2; если и шестое и седьмое число меньше 2, то восьмое число равно 2. Другие варианты невозможны."
    ],
    "65335": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Из 27 игральных кубиков сложен куб.    а) Найдите вероятность того, что на поверхности куба оказалось ровно 25  шестёрок.    б) Найдите вероятность того, что на поверхности куба оказалась хотя бы  одна единица.    в) Найдите математическое ожидание числа шестёрок, смотрящих наружу.    г) Найдите математическое ожидание суммы чисел, которые оказались на  поверхности куба.    д) Найдите математическое ожидание случайной величины: Число  различных цифр, оказавшихся на поверхности куба.",
        "Решение: а) Один из 27 кубиков в центре и поэтому не виден вовсе. Остальные 26  кубиков видны. Значит, нужное событие A = {25 шестёрок} состоит в том, что все кубики смотрят шестёрками наружу, кроме одного – назовем  его особым кубиком.     Рассмотрим все кубики. Если кубик в центре одной из граней, то он показывает шестёрку с вероятностью &frac16;. Если он находится в середине ребра, то видны две его грани, поэтому шестёрка на нём видна с вероятностью 2/6 = &frac13;. Наконец, если кубик находится в вершине большого куба, то видно три его грани, поэтому на нём видно шестёрку с вероятностью ½.     Особый кубик может оказаться в центре конкретной грани с вероятностью   &frac56;5/6·(&frac16;)5·(&frac13;)12·(½)8 – здесь перемножаются вероятности независимых событий особый кубик смотрит наружу ланной грани не шестёркой, 5 других кубиков в центрах граней смотрят наружу шестёрками, на всех 12 кубиках в серединах рёбер видна шестёрка и на всех 8 кубиках в вершинах видна шестёрка.     Особый кубик расположен в середине конкретного ребра с вероятностью (&frac16;)6·&frac23;·(&frac13;)11·(½)8.      И, наконец, особый кубик может быть в конкретной вершине большого куба с вероятностью (&frac16;)6·(&frac13;)12·(½)8.     У куба 6 граней, 12 рёбер и 8 вершин. Поэтому",
        "Ответ: а) ;    б) ;     в) 9;  г) 189; д) ."
    ],
    "65337": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Петя и ещё 9 человек играют в такую игру: каждый бросает игральную кость. Игрок  получает приз, если он выбросил число очков, которое не удалось выбросить никому больше.    а) Какова вероятность того, что Петя получит приз?    б) Какова вероятность того, что хоть кто-то получит приз?",
        "Решение: а) Предположим (исключительно для наглядности), что Петя бросает  прежде всех. Он выбросил какое-то количество очков. Вероятность того,  что каждый следующий игрок выбросит другое число очков, равна &frac56;. Поскольку броски независимы, вероятность того, что девять оставшихся игроков выбросят не то, что Петя, равна (&frac56;)9 ≈ 0,194.",
        "Ответ: а) (&frac56;)9 ≈ 0,194;  б) ≈ 0,919."
    ],
    "65340": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: В Анчурии проходит единый государственный экзамен. Вероятность угадать верный ответ на каждый вопрос экзамена равна 0,25. В 2011 году, чтобы получить аттестат, нужно было ответить верно на три вопроса из 20. В 2012 году Управление школ Анчурии решило, что три вопроса это мало. Теперь нужно верно ответить на шесть вопросов из 40. Спрашивается, если ничего не знать, а просто угадывать ответы, в каком году вероятность получить анчурийский аттестат выше – в 2011 или в 2012?",
        "Решение: Если выпускник угадывает ответы, ЕГЭ можно рассматривать как схему  Бернулли с вероятностью успеха p = 0,25 и вероятностью неудачи q = 0,75. В 2011 году, чтобы сдать экзамен, нужно было правильно ответить, по крайней мере, на три вопроса. Удобнее найти вероятность  противоположного события, то есть вероятность ответить менее чем на три вопроса. Она равна сумме вероятностей того, что выпускник ответил на 0, на 1 и на 2 вопроса, то есть   ≈ 0,091; следовательно, вероятность сдать экзамен приближённо равна 0,909.    Аналогично находим, что в 2012 году вероятность провалиться на экзамене равна  а   вероятность сдать экзамен приближённо равна 0,957.",
        "Ответ: В 2012 году."
    ],
    "65348": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На рисунке показано платежное поручение на оплату электричества некоторой энергосбытовой компании.",
        "Решение: а) Очевидно, что сумма, которую потребует компания, будет наибольшей, если расход по самому высокому тарифу будет наибольшим возможным, по среднему – наибольшим возможным из оставшихся. Наибольшая возможная сумма при этом равна 4,03·(1402 – 1214) + 3,39·(1347 – 1270) + 1,01·(1337 – 1298) = 1058,06 (руб.). Компания потребует доплатить 1058,06 – 660,72 = 397,34 (руб.).",
        "Ответ: а) 397 руб. 34 коп.; б) 19 руб. 3 коп."
    ],
    "65349": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Каждый день пёс Патрик сгрызает одну тапочку из имеющегося дома запаса. Строго с вероятностью 0,5 Патрик хочет сгрызть левую тапочку и с вероятностью 0,5 – правую. Если желаемой тапочки нет, Патрик расстраивается. Сколько пар одинаковых тапочек нужно купить, чтобы с вероятностью не меньше чем 0,8 Патрик не расстраивался целую неделю (7 дней)?",
        "Решение: Пусть за неделю Патрик захочет съесть S левых и 7 – S правых тапочек. Нам нужно найти такое k, что выполняется неравенство P(S ≤ k ∩ 7 – S ≤ k) ≥ 0,8. Запишем иначе событие в скобках: P(7 – k ≤ S ≤ k). Ясно, что 7 – k ≤ k, то есть k ≥ 4.     Вероятность в левой части неравенства равна сумме    Значит,      Заметим, что    поэтому уже сумма . Значит, наименьшее k равно 5.",
        "Ответ: 5 пар."
    ],
    "65259": [
        "Дискретное распределение",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: В школьном футбольном турнире участвуют 8 команд, одинаково хорошо играющих в футбол. Каждая игра заканчивается победой одной из команд. Случайно выбираемый по жребию номер определяет положение   команды в турнирной таблице:",
        "Решение: а) Для того, чтобы встретиться в полуфинале, команды должны попасть в разные, но сходящиеся  к одному полуфиналу подгруппы (событие X).    Команда A может попасть в любую подгруппу. Чтобы команда B могла встретиться с A в полуфинале, она должна попасть в смежную подгруппу.   Вероятность этого 2/7.    Затем и A;, и B должны выиграть свои встречи (событие Y). Так как команды одинаково хорошо играют в футбол, то вероятность выигрыша в подгруппе равна ½, и выигрыши команд A и B независимые события, значит, P(Y) = ½·½ = ¼.    Поскольку события X и Y независимы, искомая вероятность равна P(X)P(Y) = 2/7·½ = 1/14.",
        "Ответ: а) 1/14;  б) 1/28."
    ],
    "65350": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Найдите вероятность того, что орёл выпадет чётное число раз, в эксперименте, в котором:    а) симметричную монету бросают n раз;    б) n раз бросают монету, у которой вероятность выпадения орла при одном бросании равна p (0 < p < 1).",
        "Решение: Вероятность того, что орёл выпадет ровно k раз, как известно, равна  ,    где q = 1 – p – вероятность выпадения решки. Поэтому событие Орёл выпал чётное число раз имеет вероятность , где  k – наибольшее чётное число, не превосходящее n.    Дополнением к этому событию служит событие Орёл выпал нечётное число раз. Вероятность этого получается аналогично заменой чётных индексов и  степеней нечётными: , где m – наибольшее нечётное, не превосходящее n. Разность этих вероятностей:  = (q – p)n.     С другой стороны, P2 + P1 = 1. Из полученной системы уравнений находим:    .    В частности, для симметричной монеты p = 0,5, поэтому P2 = 0,5.",
        "Ответ: а) 0,5;  б)  ."
    ],
    "65351": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: В Анчурии готовятся президентские выборы, в которых хочет победить президент Мирафлорес. Ровно половина многочисленных избирателей поддерживает Мирафлореса, а  другая половина – Дика Малони. Мирафлорес тоже является избирателем. По закону он имеет право поделить всех избирателей на два избирательных округа по своему усмотрению. В каждом из округов голосование проводится следующим образом: каждый избиратель отмечает на бюллетене имя своего кандидата; все бюллетени помещаются в урну. Затем из урны достаётся один случайный бюллетень, и тот, чьё имя на нём отмечено, победит в этом округе. Кандидат побеждает на выборах,  только если победит в обоих округах. Если победитель не выявился, назначается следующий тур голосования по тем же правилам. Как Мирафлорес должен поделить избирателей, чтобы максимизировать вероятность своей победы на первом туре?",
        "Решение: Предположим, что всего в Анчурии 2n избирателей. Можно разделить их на округа так что в каждом округе ровно половина избирателей — приверженцы Мирафлореса. При этом условии вероятность, что победы Мирафлореса в первом туре равна ½·½ = ¼.    Теперь предположим, что в одном из округов меньше половины избирателей голосует за Мирафлореса. Такой округ назовем оппозиционным. Тогда в другом округе больше половины избирателей – за Мирафлореса.     Если в оппозиционном округе m избирателей (m < 2n), то число избирателей, голосующих за Мирафлореса в этом округе, не превосходит m/2 – 0,5. Поэтому вероятность победы Мирафлореса в оппозиционном округе не  больше       Вероятность победы Мирафлореса в неоппозиционном округе не превосходит 1. Значит, вероятность победы Мирафлореса в первом туре не больше  Достичь такой вероятности можно если Мирафлорес отнесет к неоппозиционному округу единственного избирателя – своего приверженца. Тогда в оппозиционном округе окажется 2n – 1 избирателей, из которых n  – 1 избиратель голосует за Мирафлореса.",
        "Ответ: Один округ должен состоять из одного Мирафлореса, а второй – из  всех остальных избирателей."
    ],
    "65352": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: В страшную грозу по верёвочной лестнице цепочкой поднимаются n  гномиков. Если вдруг случится удар грома, то от испуга каждый гномик, независимо от других, может упасть с вероятностью p (0 < p < 1). Если гномик падает, то он сшибает и всех гномиков, которые находятся ниже. Найдите:    а) Вероятность того, что упадёт ровно k гномиков.    б) Математическое ожидание числа упавших гномиков.",
        "Решение: Пусть q = 1 – p – вероятность того, что гномик не упадёт от испуга (хотя, может быть, упадёт, но не от испуга, а от того, что на него кто-то свалился сверху).",
        "Ответ: а) p(1 – p)n–k;  б) ."
    ],
    "65353": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Бросим симметричную монету n раз. Предположим, что орёл выпал m раз. Число m/n называется частотой выпадения орла. Число m/n – 0,5 называется отклонением частоты от вероятности, а число |m/n – 0,5| называется абсолютным отклонением. Заметим, что отклонение и абсолютное отклонение являются случайными величинами. Например, если монету бросили 5 раз, и два раза выпал орёл, то отклонение равно &frac25; – 0,5 = –0,1, а абсолютное отклонение равно 0,1.    Эксперимент состоит из двух частей: сначала монету бросают 10 раз, а потом – 100 раз. В каком из этих случаев больше математическое ожидание абсолютного отклонения частоты выпадения орла от вероятности?",
        "Решение: Пусть в серии из 10 бросаний орёл выпал m раз. Тогда отклонение частоты от вероятности равно |α|, где α = m/10 – 0,5.     Вторую последовательность, состоящую из 100 бросаний, разобьём на 10 серий по десять бросков. В каждой из этих 10 малых серий имеется своё отклонение (неабсолютное) αi (i – номер серии), причём E|αi| = E|α|.    Тогда отклонение β в последовательности 100 бросаний равно",
        "Ответ: В серии из 10 бросков."
    ],
    "65357": [
        "Непрерывное распределение",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Башня в замке короля Артура увенчана крышей, которая представляет собой   треугольную пирамиду, у которой все плоские углы при вершине – прямые. Три ската крыши покрашены в разные цвета. Красный скат крыши наклонён к горизонтали под углом α, а синий – под углом β. Найдите вероятность того, что дождевая капля, вертикально упавшая на крышу в случайном месте, упала на зелёный скат.",
        "Решение: Естественно считать, что капля падает на крышу случайно в том смысле, что вероятность попадания её в какую-то область крыши пропорциональна  площади проекции этой области на горизонтальную поверхность. Тогда нас должны интересовать площади проекций скатов на треугольное основание крыши.",
        "Ответ: 1 – sin²β – cos²α."
    ],
    "65769": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 7,8,9,10,11",
        "Условие: В выпуклом шестиугольнике независимо друг от друга выбраны две случайные диагонали.   Найдите вероятность того, что эти диагонали пересекаются внутри шестиугольника (внутри – то есть не в вершине).",
        "Решение: Всего у шестиугольника девять диагоналей и, значит, 9·8 : 2 = 36 пар диагоналей. Осталось понять, сколько пар диагоналей пересекается внутри шестиугольника. Диагонали у шестиугольника бывают двух видов: главные (соединяют противоположные вершины) и неглавные. Например, диагональ AC – неглавная (см. рис.). Всего неглавных диагоналей 6, и каждая пересекает 3 другие диагонали. Главных диагоналей (таких, как AD) всего три штуки, и каждая пересекает четыре другие диагонали. Всего получается (см. рис.) (6·3 + 3·4) : 2 = 15 пар пересекающихся диагоналей.",
        "Ответ: 5/12."
    ],
    "65770": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 7,8,9,10,11",
        "Условие: Стрелок стреляет по трём мишеням до тех пор, пока не собьёт все. Вероятность попадания при одном выстреле равна p.     a) Найдите вероятность того, что потребуется ровно 5 выстрелов.     б) Найдите математическое ожидание числа выстрелов.",
        "Решение: а) Искомое событие наступает, только если четыре первых выстрела дали две сбитые мишени, а последний выстрел был удачным. Вероятность этого равна",
        "Ответ: а)  6p³(1 – p)²;  б) 3/p."
    ],
    "65771": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: На соревнования приехали 10 теннисисток, из них 4 из России. По правилам для проведения первого тура теннисистки разбиваются на пары случайным образом. Найдите вероятность того, что в первом туре все россиянки будут играть только с россиянками.",
        "Решение: Представим, что вместо разбиения на игровые пары мы хотим расселить 10 теннисисток по двое в пяти двухместных комнат в гостинице, что с точки зрения теории вероятностей то же самое. Вопрос задачи сводится к тому, какова вероятность, что четыре российские спортсменки займут ровно две комнаты.     Схематично можно изобразить двухместные комнаты пятью прямоугольниками. Каждый прямоугольник разделен пополам (ведь в комнате две спортсменки). При этом не важно, какая именно российская спортсменка какое место занимает. Важно только, что она российская. Поэтому места, занятые россиянками, можно пометить одинаково. Например, флажком. Прочие места помечать не будем.",
        "Ответ: 1/21."
    ],
    "65773": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На заводе имени матроса Железняка изготавливают прямоугольники длиной 2 м и шириной 1 м. Длину отмеряет рабочий Иванов, а ширину, независимо от Иванова, отмеряет рабочий Петров. Средняя ошибка у обоих нулевая, но Иванов допускает стандартную ошибку измерения (стандартное отклонение длины) 3 мм, а Петров допускает стандартную ошибку 2 мм.     а) Найдите математическое ожидание площади получившегося прямоугольника.    б) Найдите стандартное отклонение площади получившегося прямоугольника в квадратных сантиметрах.",
        "Решение: а) Пусть X – ширина, а Y – длина вырезанного прямоугольника в метрах. По условию EX = 2, EY = 1. Поскольку измерения независимы,   E(XY) = EX·EY = 2 (м²).",
        "Ответ: а) 2 м²; б) ≈50 см²."
    ],
    "65260": [
        "Дискретное распределение",
        "Сложность: 3",
        "Классы: 9,10,11",
        "Условие: Иван Семёнов выполняет тест ЕГЭ по математике. Экзамен состоит из заданий трёх типов: A, B и C. К каждому из заданий типа А даны на выбор четыре варианта ответа, только один из которых верный. Всего таких заданий 10. Задания типа B и C требуют развёрнутого ответа. Так как Ваня постоянно прогуливал, его познания в математике неглубоки. Задания типа А он выполняет, выбирая ответы наугад. Первое из заданий типа В Ваня решает с вероятностью &frac13;. Больше ничего Иван сделать не может. За правильный ответ на одно задание типа A ставится 1 балл, за задание типа B – 2 балла. С какой вероятностью Ваня наберёт больше 5 баллов?",
        "Решение: Событие An = {Иван Семенов получает по заданиям типа A n баллов или больше}.     Событие B = {Он решает задачу типа B}.     Тогда  P({Иван получил больше 5 баллов}) =      Вероятность правильно угадать одно из 4 решений конкретной задачи равна ¼. По закону распределения Бернулли      Следовательно,  P({Иван получил больше 5 баллов}) = &frac13; P(A4) + &frac23; P(A6) =",
        "Ответ: ≈0,088."
    ],
    "65779": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Каждую пятницу десять джентльменов приходят в клуб, и каждый отдает швейцару свою шляпу. Каждая шляпа точно впору своему хозяину, но двух одинаковых по размеру шляп нет. Уходят джентльмены по одному в случайном порядке.     Провожая очередного джентльмена, швейцар клуба пробует надеть ему на голову первую попавшуюся шляпу. Если налезает, джентльмен уходит в этой шляпе. Если мала, то швейцар пробует следующую случайную шляпу из оставшихся. Если все оставшиеся шляпы оказались малы, швейцар говорит бедняге: Сэр, сегодня шляпа вам не к лицу, и джентльмен отправляется домой с непокрытой головой. Найдите вероятность того, что в следующую пятницу у швейцара не останется ни одной шляпы.",
        "Решение: Пусть джентльменов n. Занумеруем их в порядке возрастания размеров их шляп номерами от 1 до n. Шляп не останется, только если каждый забрал свою же шляпу. Обозначим вероятность этого pn. Если первым уходит k-й джентльмен (вероятность этого 1/n), то вероятность получить свою шляпу у него равна 1/n–k+ 1 (поскольку своя шляпа – единственная среди n – k + 1 подходящих этому джентльмену). Если это случилось, то вероятность того, что все оставшиеся заберут свои же шляпы, равна pn–1. По формуле полной вероятности получаем    где  Hn = 1 + ½ + ... + 1/n – n-е гармоническое число. Учитывая, что p1 = 1 (если джентльмен только один, то он обязательно возьмёт свою шляпу), получаем       Подставляя n = 10, получаем  p10 = 1/10!·(1 + ½)(1 + ½ + &frac13;)...(1 + ½ + ... + 1/10) ≈ 0,000516. Вычисление можно легко провести с помощью калькулятора или компьютера.",
        "Ответ: ≈ 0,000516."
    ],
    "65780": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Две хоккейные команды одинаковой силы договорились, что будут играть до тех пор, пока суммарный счёт не достигнет 10.   Найдите математическое ожидание числа моментов, когда наступала ничья.",
        "Решение: Если 2n – максимальный суммарный счёт, то игру можно рассматривать как случайное блуждание длины 2n: на каждом шаге разрыв в счете либо увеличивается на единицу, либо уменьшается на единицу.     Пусть I2k – индикатор ничьей на 2k-м шаге:      Случайная величина X число моментов, когда наступала ничья равна сумме всех индикаторов. Начало игры не будем считать наступлением ничьей. Следовательно, X = I2 + I4 + ... + I2n, а       При n = 5 получаем EX = 2/4 + 6/16 + 20/64 + 70/256 + 252/2048 ≈ 1,707.",
        "Ответ: ≈ 1,707."
    ],
    "65786": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Поля шахматной доски пронумерованы по строкам сверху вниз числами от 1 до 64.   На доску случайным образом поставлено шесть ладей, которые не бьют друг друга (одна из возможных расстановок показана на рисунке). Найдите математическое ожидание суммы номеров полей, занятых ладьями.",
        "Решение: Пусть Xk – номер поля, где стоит ладья номер   k (k = 1, ..., 6). Тогда сумма номеров полей равна Y = X1 + X2 + ... + X6.    Любая из ладей может с равными шансами оказаться на любом поле. Поэтому EXk = (1 + 64) : 2 = 65/2, а EY = 6EX1 = 195.",
        "Ответ: 195."
    ],
    "65788": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Преподаватель кружка по теории вероятностей откинулся в кресле и посмотрел на экран. Список записавшихся готов. Всего получилось n человек. Только они пока не по алфавиту, а в случайном порядке, в каком они приходили на занятие.     Надо отсортировать их в алфавитном порядке, – подумал преподаватель. – Пойду по порядку сверху вниз, и, если нужно,   буду переставлять фамилию ученика вверх в подходящее место. Каждую фамилию придётся переставить не более одного раза.     Докажите, что математическое ожидание числа фамилий, которые не придётся переставлять, равно 1 + ½ + &frac13; + ... + 1/n.",
        "Решение: Введём для каждого k индикатор Ik, который равен 1, если k-ю по списку фамилию не нужно переставлять, и 0, если нужно. Общее число фамилий, которые не надо переставлять, равно I1 + I2 + ... In.     Фамилию номер k не нужно переставлять, если и только если среди первых k фамилий она последняя по алфавиту. Поскольку среди этих   k фамилий она с равными шансами может оказаться на любом из   k мест по алфавиту, вероятность того, что она оказалась по алфавиту последней, равна 1/k. Следовательно, математическое ожидание числа не переставляемых фамилий равно 1 + ½ + &frac13; + ... + 1/n."
    ],
    "66054": [
        "Непрерывное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: У одного островного племени есть обычай – во время ритуального танца шаман подбрасывает высоко вверх три тонких прямых прута одинаковой длины, связанных в подобие буквы П. Соседние прутья связаны короткой ниткой и поэтому свободно вращаются друг относительно друга. Прутья падают на песок, образуя случайную фигуру. Если получается самопересечение (первый и третий прутья перекрещиваются), то племя в наступающем году ждут неурожаи и всякие неприятности. Если же самопересечения нет, то год будет удачным – сытным и счастливым. Найдите вероятность того, что на 2017 год прутья напророчат удачу.",
        "Решение: Ломаную, образованную прутьями, назовём ABCD. Пусть α = ∠ABC – угол между первым звеном и вторым, а β = ∠BCD – угол между вторым и третьим (рис. слева). Можно считать, что 0 ≤ α ≤ π и тогда 0 ≤ β 2π. Элементарными исходами являются пары (α, β). На координатной плоскости αOβ они заполняют прямоугольник G (рис. справа), при этом вероятность попадания точки (α, β) внутрь некоторой фигуры пропорциональна площади этой фигуры.",
        "Ответ: 11/12."
    ],
    "66056": [
        "Дискретное распределение",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Неправдоподобная легенда гласит, что однажды Стирлинг размышлял над числами Стирлинга второго рода и в задумчивости бросал на стол 10 правильных игральных костей. После очередного броска он вдруг заметил, что в выпавшей комбинации очков присутствуют все числа от 1 до 6. Тут же Стирлинг задумался, а какова же вероятность такого события? Какова вероятность, что при бросании 10 костей каждое число очков от 1 до 6 выпадет хотя бы на одной кости?",
        "Решение: Найдём вероятность события A в выпавшей комбинации какого-то числа нет. Обозначим Ak событие нет числа k. Тогда  A = A1 ∪ A2 ∪ A3 ∪ A4 ∪ A5 ∪ A6.     С помощью формулы включения-исключения получаем:   P(A) = P(A1) + P(A2) + ... + P(A6) – P(A1∩A2) – P(A1∩A3) – ... – P(A5∩A6) + P(A1∩A2∩A3) + P(A1∩A2∩A4) + ... + P(A4∩A5∩A6) – ... – P(A1∩A2∩A3∩A4∩A5∩A6).     Все вероятности P(Ak) равны (5/6)10, а всего их  Вероятности попарных пересечений равны (4/6)10, а всего их  и т.д. Значит,  P(A) = 6·(5/6)10 – 15·(4/6)10 + 20·(3/6)10 – 15·(2/6)10 + 6·(1/6)10.     Следовательно, вероятность того, что каждое число встретится хотя бы раз, равна 1 – P(A).",
        "Ответ: 1 – 6·(5/6)10 + 15·(4/6)10 – 20·(3/6)10 + 15·(2/6)10 – 6·(1/6)10 ≈ 0,272."
    ],
    "35161": [
        "Теория вероятностей (прочее)",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: В каждую жвачку вложен один из n вкладышей, причём каждый вкладыш встречается с вероятностью 1/n.   Сколько в среднем надо купить жвачек, чтобы собрать полную коллекцию вкладышей?",
        "Подсказка: В ситуации, когда уже собрано k вкладышей, вычислите среднее количество жвачек, которое нужно купить, чтобы последняя жвачка добавляла новый вкладыш.",
        "Решение: Пусть у нас уже собрано k вкладышей. Посчитаем, сколько ждать    следующего вкладыша. Назовем жвачку новой, если вложенный в нее вкладыш не встречается среди k уже собранных вкладышей. Обозначим через Mk среднее количество жвачек, которое нужно купить, чтобы последняя купленная жвачка была новой. Рассмотрим следующую купленную жвачку. Она с вероятностью n–k/n новая (и при этом ожидание (k+1)-й жвачки в коллекции заканчивается), и с вероятностью k/n не является новой (в этом случае мы, купив одну жвачку, снова оказываемся в состоянии, когда среднее число жвачек, которые нужно купить до покупки новой, равно Mk). Следовательно, Mk = n–k/n·1 + k/n·(Mk + 1), откуда Mk = n/n–k. Значит, среднее число жвачек, которое необходимо купить для полной коллекции вкладышей, равно M0 + M1 + ... + Mn–1 = n/n + n/n–1 + ... + n/1 = n(1 + 1/2 + 1/3 + ... + 1/n).",
        "Ответ: n(1 + 1/2 + 1/3 + ... + 1/n)."
    ]
}