{
    "34913": [
        "Доказательство от противного",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Среди любых десяти из шестидесяти ребят найдутся трое одноклассников.   Докажите, что среди всех них найдутся 15 одноклассников.",
        "Подсказка: Предположите, что из каждого класса присутствует не более 14 ребят.",
        "Решение: Разделим ребят на группы одноклассников. Предположим, что в каждой группе не более 14 ребят. Тогда в четырёх самых больших по количеству группах не более 4·14 = 56 ребят.     Если в каждой из этих групп не менее двух человек, то можно взять по два школьника из этих четырёх групп и добавить двух школьников из оставшихся (их не менее 60 – 56 = 4). Среди этих 10 школьников нет трёх одноклассников, что противоречит условию.     Если хотя бы в одной из этих четырёх групп меньше двух человек, то имеется не менее 60 – 3·14 = 18 школьников, которые учатся в разных классах. Это также противоречит условию."
    ],
    "34887": [
        "Доказательство от противного",
        "Сложность: 3+",
        "Классы: 7,8,9,10",
        "Условие: Каждый из голосующих на выборах   вносит в избирательный бюллетень фамилии   10 кандидатов. На избирательном участке   находится 11 урн. После выборов выяснилось,   что в каждой урне лежит хотя бы один бюллетень и при всяком   выборе 11 бюллетеней по одному из каждой урны найдется кандидат,   фамилия которого встречается в каждом из выбранных бюллетеней.   Докажите, что по крайней мере в одной урне   все бюллетени содержат фамилию одного и того же кандидата.",
        "Подсказка: Возьмите произвольный бюллетень из 11-й урны и рассуждайте от   противного.",
        "Решение: Возьмем произвольный бюллетень из 11-й урны.   Пронумеруем кандидатов, фамилии которых   встречаются в этом бюллетене. Предположим,   что требуемое в задаче не выполнено. Тогда в k-й урне (k=1,2,...10)   найдется бюллетень, не содержащий фамилии k-го кандидата.   Набор этих   бюллетеней вместе со взятым вначале   бюллетенем из 11-й урны противоречит условию задачи."
    ],
    "35537": [
        "Малая теорема Ферма",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Докажите, что ни при каком целом k число k² + k + 1 не делится на  101.",
        "Подсказка: Рассуждайте от противного; можно воспользоваться малой теоремой Ферма.",
        "Решение: Предположим, что для некоторого k число k² + k + 1 делится на 101. Тогда (k –  1)(k² + k + 1) = k³ – 1 также делится на 101, то есть k³ ≡ 1 (mod 101). Поэтому     k100(k – 1) = k101 – (k³)33k ≡ k – k = 0 (mod 101). Значит, k даёт остаток 0 или 1 при делении на 101, и k² + k + 1 не делится на 101. Противоречие."
    ],
    "78006": [
        "Четырехугольник (неравенства)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Дан треугольник",
        "Решение: Предположим, что в каждом из полученных четырёхугольников"
    ],
    "78576": [
        "Процессы и операции",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: На лист клетчатой бумаги размером n×n клеток кладутся чёрные и белые кубики, причём каждый кубик занимает ровно одну клетку. Первый слой кубиков положили произвольно, а затем вспомнили, что каждый чёрный кубик должен граничить с чётным числом белых, а каждый белый — с нечётным числом чёрных. Кубики во второй слой положили так, чтобы для всех кубиков первого слоя выполнялось это условие. Если для всех кубиков второго слоя это условие уже выполняется, то больше кубиков не кладут, если же нет, то кладут третий слой так, чтобы чтобы для всех кубиков второго слоя выполнялось это условие, и так далее. Существует ли такое расположение кубиков первого слоя, что этот процесс никогда не кончится?",
        "Решение: Подложим под первый слой ещё один – нулевой – совпадающий с первым. Это не повлияет на требуемую чётность, а значит, и на дальнейший процесс. Предположим, что этот процесс бесконечен. Количество возможных пар слоев конечно, следовательно, найдутся такие i и j (i < j), что i-й слой совпадает с j-м, а (i+1)-й – с (j+1)-м. Очевидно, каждый слой однозначно восстанавливается по двум следующим, поэтому (i–1)-й слой совпадает с (j–1)-м, (i–2)-й – с (j–2)-м и т. д. В частности, первый слой совпадает с (j–i+1)-м, а нулевой – с (j–i)-м. Значит, (j–i+1)-й слой совпадает с (j–i)-м, и класть его было не нужно. Противоречие."
    ],
    "79608": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 4+",
        "Классы: 8,9",
        "Условие: Каково наименьшее число гирь в наборе, который можно разложить и на 3, и на 4, и на 5 кучек равной массы?",
        "Решение: Ответ:",
        "Ответ: m"
    ],
    "78579": [
        "Комбинаторика (прочее)",
        "Сложность: 5",
        "Классы: 10,11",
        "Условие: В ящике лежат два ящика поменьше, в каждом из них ещё по два ящика и т.д. n раз. В каждом из 2n маленьких ящиков лежит по монете, причём одни вверх гербом, а остальные – вверх решкой. За один ход разрешается перевернуть один любой ящик вместе со всем, что в нём лежит. Доказать, что не больше, чем за n ходов можно расположить ящики так, что число монет, лежащих вверх гербом, будет равно числу монет, лежащих вверх решкой.",
        "Решение: Назовём самый большой ящик ящиком ранга n, следующие по величине два ящика – ящиками ранга n – 1 и т. д. до ящиков ранга 1, в которых лежат монеты. Разность между количеством гербов и решек в каком-нибудь ящике назовём дефектом этого ящика; дефект ящика ранга обозначим через d. Докажем, что всегда найдётся ящик, при переворачивании которого |d| уменьшается не меньше, чем вдвое. Этого достаточно, так как в исходном положении |d| ≤ 2n, и любой дефект ящика ранга n чётен.     Рассмотрим случай d > 0. Предположим, что указанное уменьшение невозможно. При переворачивании ящика с дефектом d1 из d вычитается 2d1. По предположению  |d – 2d1| > d/2,  поэтому либо d1 <  d/4, либо d1 >  3d/4 ≥ 3/2.     Дефект каждого ящика ранга 1 не больше 1, что меньше 3d/4, поэтому он меньше d/4. Но тогда дефект каждого ящика ранга 2 меньше d/2, значит, он меньше d/4. Продолжая аналогичные рассуждения, получим, что и дефект самого большого ящика меньше d/2. Противоречие."
    ],
    "32013": [
        "Подсчет двумя способами",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Можно ли в прямоугольной таблице 5×10 так расставить числа, чтобы сумма чисел каждой строки равнялась бы 30, а сумма чисел каждого столбца равнялась бы 10?",
        "Решение: Предположим, что такая таблица существует, и подсчитаем, чему равняется сумма всех ее чисел. С одной стороны, таблица содержит 5 строк, сумма чисел в каждой из которых – 30, значит, искомая сумма равна 150. С другой стороны, в таблице 10 столбцов, сумма чисел в каждом из которых – 10. Отсюда общая сумма равна 100. Противоречие."
    ],
    "60458": [
        "Простые числа и их свойства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что если число n! + 1 делится на n + 1, то n + 1 – простое число.",
        "Решение: Пусть n + 1 – составное число. Если p – некоторый его простой делитель, то p ≤ n. Значит, n! делится на p, а n! + 1 не делится. Противоречие."
    ],
    "65170": [
        "Четырехугольники (прочее)",
        "Сложность: 2+",
        "Классы: 8,9,10,11",
        "Условие: Существует ли выпуклый четырёхугольник, каждая диагональ которого делит его на два остроугольных треугольника?",
        "Решение: Из условия следует, что каждый угол такого четырёхугольника острый. Но тогда их сумма меньше, чем 360°.",
        "Ответ: Не существует."
    ],
    "86507": [
        "Задачи на движение",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Рассмотрим все моменты времени, когда часовая и минутная стрелки часов лежат на одной прямой, образуя развёрнутый угол.   Найдутся ли среди таких прямых две взаимно перпендикулярные?",
        "Решение: Предположим, что такие прямые найдутся. Тогда в эти моменты времени часовые стрелки перпендикулярны. Значит, между ними прошло целое количество часов (а именно 6n + 3, где n – целое число). Тогда положение минутных стрелок в эти моменты времени одинаково, и угла в 90° они образовать не могут, что противоречит нашему предположению.",
        "Ответ: Не найдутся."
    ],
    "102843": [
        "Десятичная система счисления",
        "Сложность: 2+",
        "Классы: 6,7",
        "Условие: Существуют ли такие двузначные числа ab, cd, что ab·cd = abcd.",
        "Решение: Допустим, что равенство верно, и преобразуем его:  ab·cd = abcd = ab·100 + cd > ab·cd + cd. Противоречие.",
        "Ответ: Не существуют."
    ],
    "30429": [
        "Связность и разложение на связные компоненты",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: В Тридевятом царстве лишь один вид транспорта – ковер-самолет. Из столицы выходит 21 ковролиния, из города Дальний – одна, а из всех остальных городов – по 20. Докажите, что из столицы можно долететь в Дальний (возможно, с пересадками).",
        "Решение: Рассмотрим компоненту связности графа ковролиний, содержащую столицу. Предположим, что она не содержит город Дальний. Тогда в этой компоненте связности из одной вершины (столицы) выходит 21 ребро, а из всех остальных вершин – по 20 рёбер. Таким образом в этом подграфе ровно одна нечётная вершина.  Противоречие с задачей 87972 б)."
    ],
    "31072": [
        "Связность и разложение на связные компоненты",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: В некоторой стране из столицы  выходит  89  дорог,  из  города Дальний – одна дорога, из остальных 1988 городов – по  20  дорог.  Доказать, что из столицы можно проехать в Дальний.",
        "Решение: См. задачу 30429."
    ],
    "34979": [
        "Средние величины",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Имеется набор натуральных чисел (известно, что чисел не меньше семи), причём сумма каждых семи из них меньше 15, а сумма всех чисел из набора равна 100. Какое наименьшее количество чисел может быть в наборе?",
        "Решение: Набор из 50 чисел, каждое из которых равно 2, удовлетворяет условию.     Если в наборе не более 49 чисел, то их можно разбить на 7 групп так, что в каждой группе будет содержаться 7 или меньше чисел. По условию сумма чисел в каждой группе меньше 15, то есть не больше 14. Следовательно, сумма чисел во всех семи группах не больше 7·14 = 98, что меньше 100. Противоречие.",
        "Ответ: 50 чисел."
    ],
    "34988": [
        "Делимость чисел. Общие свойства",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Докажите, что ни при каком натуральном m число 1998m – 1 не делится на 1000m – 1.",
        "Подсказка: Если число A делится на B, то A – B также делится на B.",
        "Решение: Если число 1998m – 1 делится на 1000m – 1, то при этом m разность (1998m – 1) – (1000m – 1) = 1998m – 1000m = 2m(999m – 500m) также делится на   1000m – 1. Поскольку 1000m – 1 – число нечётное, то на 1000m – 1 должна делиться также разность 999m – 500m. Но это невозможно, так как   999m – 500m < 1000m – 1."
    ],
    "60845": [
        "Рациональные и иррациональные числа",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Пусть число α задаётся десятичной дробью     а) 0,101001000100001000001...;     б) 0,123456789101112131415....   Будет ли это число рациональным?",
        "Решение: См. задачу 35079.",
        "Ответ: а-б) Не будет."
    ],
    "64949": [
        "Исследование квадратного трехчлена",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Про коэффициенты a, b, c и d двух квадратных трёхчленов x² + bx + c и x² + ax + d известно, что0 <  a < b < c < d.  Могут ли эти трёхчлены иметь общий корень?",
        "Решение: Поскольку коэффициенты обоих трёхчленов положительны, то их корни (если они есть) отрицательны.     Общий корень x0 этих трёхчленов являентся корнем их разности, то есть x0(b – a) = d – c. Из условия следует, что d – c > 0 и b – a > 0, то есть  x0 > 0. Противоречие.",
        "Ответ: Не могут."
    ],
    "78069": [
        "Числовые таблицы и их свойства",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: На клетчатой бумаге написана таблица, причём в каждой клетке стоит число,  равное среднему арифметическому четырёх чисел, стоящих в соседних клетках. Все числа в таблице различны. Докажите, что наибольшее число стоит с края (то есть по крайней мере одна из соседних клеток отсутствует).",
        "Решение: Предположим, что наибольшее число a стоит не с края. Тогда у него в таблице есть все четыре соседних числа a1, a2, a3, a4 и при этом  a = ¼ (a1 + a2 + a3 + a4). Но a > a1, a > a2, a > a3, a > a4. Поэтому a > ¼ (a1 + a2 + a3 + a4). Противоречие."
    ],
    "78507": [
        "Принцип крайнего  (прочее)",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Доказать, что не существует попарно различных натуральных чисел x, y, z, t, для которых было бы справедливо соотношение xx + yy = zz + tt.",
        "Решение: Предположим, что такие числа нашлись. Пусть z – наибольшее изэтих чисел. Тогда z ≥ 4, а значит, xx + yy < 2(z – 1)z–1 < 2zz–1 < zz <  zz + tt. Противоречие."
    ],
    "78703": [
        "Периодичность и непериодичность",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Дана бесконечная последовательность чисел a1, ..., an, ... Она периодична с периодом 100, то есть a1 = a101, a2 = a102, ... Известно, что a1 ≥ 0,   a1 + a2 ≤ 0, a1 + a2 + a3 ≥ 0 и вообще, сумма a1 + a2 + ... + an неотрицательна при нечётном n и неположительна при чётном n. Доказать, что |a99| ≥ |a100|.",
        "Решение: Предположим, что"
    ],
    "79570": [
        "Степень вершины",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В компании из семи мальчиков каждый имеет среди остальных не менее трёх братьев.  Докажите, что все семеро – братья.",
        "Решение: Возьмём любых двух мальчиков из этой компании. Предположим, что они не братья. Тогда каждый из них имеет среди оставшихся пяти мальчиков по три брата. Следовательно, у них есть общий брат, а значит, они братья. Итак, любые два мальчика из этой компании – братья."
    ],
    "105198": [
        "Числовые таблицы и их свойства",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: В клетках таблицы 3×3 расставлены числа так, что сумма чисел в каждом столбце ивкаждой строке равна нулю. Какое наименьшее количество чисел, отличных от нуля, может быть в этой таблице, если известно, что оно нечётно?",
        "Решение: Пример.",
        "Ответ: 7 чисел."
    ],
    "109457": [
        "Исследование квадратного трехчлена",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: На рисунке изображены графики трёх квадратных трёчленов.   Можно ли подобрать такие числа a, b и c, чтобы это были графики трёхчленов ax² + bx + c, bx² + cx + a и cx² + ax + b?",
        "Решение: Пусть это удалось. У двух парабол ветви направлены вверх, а у одной – вниз, поэтому у двух трёхчленов старший коэффициент положительный, а у одного – отрицательный. Следовательно, среди чисел a, b и c должны быть два положительных и одно отрицательное. С другой стороны, две из парабол пересекают ось Оy в точках с отрицательными ординатами, а третья –  в точке с положительной ординатой, поэтому у двух трёхчленов свободный член отрицательный, а у одного – положительный. Следовательно, среди чисел a, b и c должны быть два отрицательных и одно положительное. Противоречие.",
        "Ответ: Нельзя."
    ],
    "65922": [
        "Доказательство от противного",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Каждое целое число на координатной прямой покрашено в один из двух цветов – белый или чёрный, причём числа 2016 и 2017 покрашены разными цветами. Обязательно ли найдутся три одинаково покрашенных целых числа, сумма которых равна нулю?",
        "Решение: Предположим таких целых чисел нет. Пусть, для определенности, число 2016 – чёрное, а 2017 – белое. Рассмотрим два случая.     1) Число 0 – белое. Тогда любое число, противоположное к белому, – чёрное. В частности, число –2017  – чёрное. Из того, что числа –2017 и 2016 – чёрные и –2017 + 2016 + 1 = 0, следует, что число 1 – белое, а –1 – чёрное. Числа –1 и 2016 – чёрные, значит, число –2015 – белое, а 2015 – чёрное. Числа –2015 и 2017 – белые, –2017 + 2015 + 2 = 0, поэтому число 2 – белое.     Пусть n – наименьшее чёрное натуральное число, тогда число n – 1 – белое, а 1 – n – чёрное. Но –1 + (1 – n) + n = 0, 1 –n ≠ –1, и эти три числа – чёрные. Противоречие.     2) Число 0 – чёрное. Тогда любое число, противоположное к чёрному, – белое. В частности, число –2016 – белое. Из того, что числа –2016 и 2017 – белые и –2016 + 2017 + (–1) = 0 следует, что число –1 – чёрное, а 1 – белое. Числа 1 и –2016 – белые, значит, число 2015 – чёрное, а –2015 – белое. Числа –2015 и 2017 – белые, (–2015) + 2017 + (–2) = 0, поэтому число –2 – чёрное.     Пусть –m – наибольшее отрицательное белое число.  Тогда число 1 – m – чёрное, а m – 1 –  белое. Но 1 + (m – 1) + (–m) = 0, m – 1 ≠ 1, и эти три числа – белые. Противоречие.",
        "Ответ: Обязательно."
    ],
    "35063": [
        "Задачи с неравенствами. Разбор случаев",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Даны 10 натуральных чисел, не превышающих 91. Докажите, что отношение некоторых двух из этих чисел принадлежит отрезку [2/3, 3/2].",
        "Подсказка: Упорядочите числа по возрастанию. Может ли при этом каждое число превосходить предыдущее более чем в 1,5 раза?",
        "Решение: Предположим, что для некоторых чисел a1 ≤ a2 ≤ ... ≤ a10 ≤ 91 утверждение не выполнено. Тогда каждое из чисел (кроме первого) больше предыдущего более, чем в 1,5 раза.     a1 ≥ 1 (числа натуральные). Отсюда последовательно получаем: a2 > 3/2, то есть a2 ≥ 2; a3 > 3/2·2 = 3, то есть a3 ≥ 4; a4 > 6,  то есть a4 ≥ 7;  a5 ≥ 11;  a6 ≥ 17; a7 ≥ 26; a8 ≥ 40; a9 ≥ 61; a10 ≥ 92.  Противоречие."
    ],
    "30430": [
        "Связность и разложение на связные компоненты",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: В стране из каждого города выходит 100 дорог и от каждого города можно добраться до любого другого. Одну дорогу закрыли на ремонт.  Докажите, что и теперь от каждого города можно добраться до любого другого.",
        "Решение: Если закрыта дорога AB, то нам достаточно доказать, что и после этого можно добраться из A в B. Если это не так, то в компоненте связности, содержащей A, все вершины, кроме A, – чётные. Но наличие ровно одной нечётной вершины противоречит задаче 87972 б)."
    ],
    "31300": [
        "Уравнения в целых числах",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: Решить в целых числах: a² + b² = 3(c² + d²).",
        "Решение: Как и в задаче 31291, уравнение однородно, поэтому достаточно найти ненулевые решения, в которых неизвестные взаимно просты в совокупности.     Пусть такое решение есть, тогда не все неизвестные кратны 3. Но правая часть, а значит, и левая часть делится на 3. А сумма двух квадратов кратна 3 только, если оба слагаемых кратны 3 (см. задачу 108744). Подставим x = 3u, y = 3v и сократим на 3: 3(u² + v²) = z² + w². Теперь в правой части сумма двух квадратов кратна 3, значит, оба они кратны 3. Противоречие.",
        "Ответ: (0, 0, 0, 0)."
    ],
    "32011": [
        "Турниры и турнирные таблицы",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: В соревнованиях участвуют 10 фигуристов. Соревнования судят трое судей следующим способом: каждый судья по-своему распределяет между фигуристами места (с первого по десятое),\tпосле чего победителем считается фигурист с наименьшей суммой мест. Какое наибольшее значение может принимать эта сумма у победителя (победитель единственный)?",
        "Решение: Оценка. Поскольку каждый из трёх судей распределил набор мест с первого по десятое, то сумма мест, присуждённых всеми судьями всем участникам соревнований, равна 3·(1 + 2 + ... + 10) = 165.     С другой стороны, если победитель получил сумму не меньше 16, то все остальные получили сумму мест не меньше 17, и рассматриваемая общая сумма не меньше чем 16 + 9·17 = 169. Противоречие. Следовательно, сумма мест победителя не больше 15.     Пример. См. таблицу:",
        "Ответ: 15."
    ],
    "32074": [
        "Произведения и факториалы",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Докажите, что произведение ста последовательных натуральных чисел не может быть сотой степенью натурального числа.",
        "Решение: Предположим, что для некоторых натуральных n и k n(n + 1)(n + 2)...(n + 99) = k100.     Тогда n100 < k100 < (n + 99)100, то есть n < k < n + 99. Поэтому число k входит множителем в левую часть исходного равенства. Число k + 1, также входящее множителем в левую часть этого равенства, взаимно просто с k. Поэтому k100 не делится на k + 1. Противоречие"
    ],
    "32884": [
        "Целочисленные и целозначные многочлены",
        "Сложность: 3+",
        "Классы: 7",
        "Условие: Доказать, что если несократимая рациональная дробь p/q является корнем многочлена P(x) с целыми коэффициентами, то P(x) = (qx – p)Q(x), где многочлен Q(x) также имеет целые коэффициенты.",
        "Решение: Предположим, что утверждение неверно, и рассмотрим многочлен   P(x) = a0xn + a1xn–1 + ... + an наименьшей степени, для которого это не так. Ясно, что n > 0. Согласно задаче 61013 a0 кратно q: a0 = qb0, поэтому R(x) = P(x) – (qx – p)b0xn–1 – многочлен степени n – 1 с целыми коэффициентами. p/q – корень многочлена R(x), следовательно, по выбору n, R(x) = (qx – p)T(x), где T(x) – многочлен с целыми коэффициентами (если n = 1, то R(x) ≡ T(x) ≡ 0). Значит,  P(x) = (qx – p)(b0xn–1 + T(x)). Противоречие."
    ],
    "34927": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Может ли произведение трёх последовательных натуральных чисел быть степенью натурального числа (квадратом, кубом и т.д.)?",
        "Подсказка: Докажите, что среднее число само является степенью.",
        "Решение: Пусть произведение чисел n – 1, n, n + 1 является точной m-й степенью. Поскольку число n взаимно просто с числами n – 1 и n + 1, то любой простой делитель числа n входит в разложение числа (n – 1)n(n + 1) с таким же показателем, с каким он входит в разложение числа n, то есть он  входит в разложение числа n в степени, кратной m. Поэтому n (а следовательно, и n²) является точной m-й степенью. Но и (n – 1)(n + 1) = n² – 1 также является m-й степенью натурального числа, как частное от деления чисел (n – 1)n(n + 1) и n, являющихся  m-ми степенями. Таким образом, нами найдены два последовательных натуральных числа (n² и n² – 1), являющихся m-ми степенями. Ясно, что это невозможно. Противоречие.",
        "Ответ: Не может."
    ],
    "35079": [
        "Периодические и непериодические дроби",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: Докажите, что бесконечная десятичная дробь 0,1234567891011121314... (после запятой подряд выписаны все натуральные числа по порядку) представляет собой иррациональное число.",
        "Решение: Рациональные числа выражаются периодическими десятичными дробями. Предположим, что наша дробь периодическая: некоторая последовательность T, состоящая из n цифр, является периодом дроби начиная с m-го знака после запятой. Среди цифр после m-го знака встречаются ненулевые, поэтому в последовательности цифр T есть ненулевая цифра. Это означает, что начиная с m-й цифры после запятой, среди любых n цифр подряд есть ненулевая цифра. Однако в десятичной записи данной дроби должна присутствовать десятичная запись числа 10k, где k больше m и n. Эта запись встретится правее m-й цифры и содержит более n нулей подряд. Противоречие."
    ],
    "35702": [
        "Арифметика остатков (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Суммой двух букв назовём букву, порядковый номер которой в алфавите имеет тот же остаток от деления на число букв в алфавите, что и сумма порядковых номеров исходных двух букв. Суммой двух буквенных последовательностей одинаковой длины назовём буквенную последовательность той же длины, полученную сложением букв    исходных последовательностей, стоящих на одинаковых местах. Докажите, что сумма любой последовательности из 26 различных букв английского алфавита с последовательностью букв, представляющей собой сам этот алфавит, содержит не менее двух одинаковых букв.",
        "Подсказка: Используйте то, что сумма всех букв имеет нечётный остаток при делении на 26.",
        "Решение: При сложении двух последовательностей сумма порядковых номеров всех букв получаемой при этом последовательности и сумма порядковых номеров всех букв обоих слагаемых имеет один и тот же остаток от деления на 26. Значит, разность упомянутых сумм должна делиться на 26 без остатка.     Если в сумме двух указанных последовательностей все буквы различны, то упомянутая разность равна сумме порядковых номеров букв алфавита. Однако сумма 1 + 2 + ... + 26 = 13·27 на не делится."
    ],
    "35796": [
        "Произведения и факториалы",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Может ли произведение 2002 последовательных натуральных чисел являться 2002-й степенью натурального числа?",
        "Решение: См. задачу 32074.",
        "Ответ: Не может."
    ],
    "60459": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Докажите, что множество простых чисел вида p = 4k + 3  бесконечно.",
        "Решение: Пусть p1 = 3, p2 = 7, ..., pn – все такие простые числа. Рассмотрим число N = 4p2...pn + 3. Оно не делится ни на одно из чисел p1, p2, ..., pn, но содержит простой делитель вида 4k + 3. Противоречие."
    ],
    "60460": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Докажите, что множество простых чисел вида p = 6k + 5 бесконечно.",
        "Решение: Доказательство повторяет рассуждения задачи 60459 с заменой числа N на N = 6p1...pn + 5."
    ],
    "60698": [
        "Арифметика остатков (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Целые числа a, b и c таковы, что a³ + b³ + c³ делится на 7. Докажите, что abc делится на 7.",
        "Решение: Пусть a не делится на 7. Тогда по малой теореме Ферма (a³ – 1)(a³ + 1) = a6 – 1 делится на 7. Значит, одно из чисел a³ – 1, a³ + 1 делится на 7, то есть  a³ ≡ ±1 (mod 7). То же верно для чисел b³ и c³. Но сумма трёх чисел вида ±1 не делится на 7."
    ],
    "116302": [
        "Доказательство от противного",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Могут ли три точки с целыми координатами быть вершинами равностороннего треугольника?",
        "Решение: Предположим, что такой равносторонний треугольник",
        "Ответ: Нет."
    ],
    "64600": [
        "Уравнения в целых числах",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Может ли наименьшее общее кратное целых чисел 1, 2, ..., n быть в 2008 раз больше, чем наименьшее общее кратное целых чисел 1, 2, ..., m?",
        "Решение: Пусть 2k ≤ m < 2k+1, 3l ≤ m < 3l+1. Если частное    делится на 8, то n ≥ 2k+3 > 4m > 3m ≥ 3l+1, и, следовательно, с делится на 3. А 2008 делится на 8, но не на 3.",
        "Ответ: Не может."
    ],
    "64796": [
        "Замощения костями домино и плитками",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: Из шахматной доски (размером 8×8) вырезали центральный квадрат размером 2×2.   Можно ли оставшуюся часть доски разрезать на равные фигурки в виде буквы Г, состоящие из четырёх клеток?",
        "Решение: Предположим, что искомое разрезание возможно. Покрасим горизонтали доски поочередно в два цвета (матрасиком, см. рис.). Тогда в каждой фигурке, независимо от её расположения, будут три клетки одного цвета и одна клетка другого цвета. Так как в оставшейся части доски – по 30 клеток каждого цвета, то фигурок при разрезании может получиться только чётное количество.    С другой стороны, фигурок будет (64 – 4) : 2 = 15, то есть нечётное количество. Противоречие.",
        "Ответ: Нельзя."
    ],
    "65247": [
        "Последовательности (прочее)",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Существует ли такая бесконечная последовательность натуральных чисел, что для любого натурального k сумма любых k идущих подряд членов этой последовательности делится на k + 1?",
        "Решение: Предположим, что такая последовательность нашлась. Рассмотрим первые 2k – 1 членов a1, a2, ..., a2k–1 этой последовательности. Сумма  a1 + a2 + ... + a2k–1 делится на 2k, а каждая из сумм a2 + a3 + ... + ak и ak+1 + ak+2 + ... + a2k–1 делится на k.     Отсюда следует, что a1 делится на k при всех k. Это невозможно.",
        "Ответ: Не существует."
    ],
    "66128": [
        "Четность и нечетность",
        "Сложность: 3+",
        "Классы: 7,8",
        "Условие: В ряд стоят 33 девочки и каждая держит по ромашке. Одновременно каждая из девочек передаёт свою ромашку девочке, стоящей от неё через одну.   Может ли оказаться так, что у каждой девочки будет опять по одной ромашке?",
        "Решение: Предположим, что девочки смогут обменяться ромашками указанным образом.     Пронумеруем стоящих девочек, например, слева направо. Для того, чтобы у первой девочки оказалась ромашка, она должна поменяться ромашками с третьей девочкой. Тогда у пятой девочки останется ромашка только тогда, когда она поменяется ромашками с седьмой девочкой, девятая должна поменяться с одиннадцатой, тринадцатая с пятнадцатой, и так далее. Таким образом, все девочки, стоящие на нечётных местах, должны разбиться на пары. Но это невозможно, так как на нечётных местах – 17 девочек.",
        "Ответ: Не может."
    ],
    "66189": [
        "Десятичная система счисления",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Последовательность нулей и единиц строится следующим образом: на k-м месте ставится 0, если сумма цифр числа k чётна, а иначе (если сумма цифр числа k нечётна) ставится 1. Докажите, что эта последовательность непериодична.",
        "Решение: Допустим, последовательность имеет период d и предпериод m. Возьмём такое n, что 10n > m + d. Суммы цифр чисел 10n и 10n+1 равны 1, а суммы цифр чисел 10n – d и 10n+1 – d отличаются на 9, то есть имеют разную чётность. Противоречие."
    ],
    "78578": [
        "Арифметика остатков (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Все целые числа от 1 до 2n выписаны в строчку. Затем к каждому числу  прибавили номер того места, на котором оно стоит.   Доказать, что среди полученных сумм найдутся хотя бы две, дающие при делении на 2n одинаковый остаток.",
        "Решение: Пусть в строчку выписаны числа a1, a2, ..., a2n. Предположим, что все числа a1 + 1, a2 + 2, ..., a2n + 2n дают разные остатки при делении на 2n. Тогда эти остатки равны 1, 2, ..., 2n. Поэтому (a1 + 1) + (a2 + 2) + ... + (a2n + 2n) = 2(1 + 2 + ... + 2n) ≡ 1 + 2 + ... + 2n (mod 2n). Противоречие, поскольку   1 + 2 + ... + 2n = n(2n + 1) ≡ n (mod 2n)."
    ],
    "78652": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Доказать, что для любых трёх чисел, меньших 1000000, найдётся число, меньшее 100 (но большее 1), взаимно простое с каждым из них.",
        "Решение: Составим сначала список простых чисел, меньших 100: 2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 78, 83, 89, 97. Предположим, что на каждое из этих чисел делится хотя бы одно из трёх данных чисел a, b, c. Тогда abc ≥ 2·3·5·...·97 > 1018. Но a, b, c ≤ 106, поэтому abc ≤ 1018. Противоречие."
    ],
    "73693": [
        "Доказательство от противного",
        "Сложность: 5",
        "Классы: 7,8,9",
        "Условие: Треугольная таблица строится по следующему правилу: в верхней её строке написано одно только натуральное число",
        "Решение: Предположим, что в некоторых строчках таблицы встречаются одинаковые числа. Пусть"
    ],
    "34953": [
        "Раскраски",
        "Сложность: 3+",
        "Классы: 7,8,9,10",
        "Условие: Каждая точка пространства окрашена в один из пяти цветов, причем  каждым из этих пяти цветов окрашена хотя бы одна точка.  Докажите, что найдется плоскость, все точки которой окрашены не  менее, чем в 4 цвета.",
        "Подсказка: Если некоторая прямая окрашена в 3 цвета, то задача решается  просто.",
        "Решение: Если некоторая прямая окрашена в 3 или более цветов,  то проведем плоскость  через эту прямую и точку одного из недостающих цветов.  Эта плоскость будет окрашена  не менее, чем в 4 цвета.  Далее, предположим, что каждая прямая окрашена не более, чем в 2  цвета.  Фиксируем по одной точке каждого из пяти цветов.  Пусть никакие четыре из этих пяти точек не лежат в одной плоскости  (в противном случае решение очевидно).  Рассмотрим прямые, попарно соединяющие эти точки.  Они пересекают некоторую плоскость П, им не параллельную, в 10  различных точках. Покажем, что эти 10 точек окрашены не менее, чем  в 4 цвета. В противном случае некоторые 2 цвета (a и b) отсутствуют.  Но одним из этих цветов должна быть окрашена точка пересечения   прямой, соединяющей точки  цветов a и b, с плоскостью П   (вся эта прямая окрашена два цвета a и b)."
    ],
    "35077": [
        "Периодичность и непериодичность",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Последовательность f(n) (n=1,2,...), состоящая из натуральных  чисел, такова, что f(f(n))=f(n+1)+f(n) для всех натуральных n.  Докажите, что все члены этой последовательности различны.",
        "Подсказка: Предположите противное и выведите из этого предположения, что  последовательность периодическая начиная с некоторого члена.",
        "Решение: Предположим противное: для некоторых различных натуральных k и m  выполнено  f(k)=f(m). Тогда f(f(k))=f(k+1)+f(k) и f(f(m))=f(m+1)+f(m),  откуда f(k+1)=f(f(k))-f(k) и  f(m+1)=f(f(m))-f(m).  Правые части полученных равенств по нашему предположению равны,  следовательно, f(k+1)=f(m+1).  Рассуждая далее таким же образом, получаем, что   f(k+2)=f(m+2),  f(k+3)=f(m+3), и т.д.  Таким образом, для любого натурального n,  большего k и m, выполнено f(n)=f(n+|m-k|).  Итак, начиная с некоторого члена последовательность периодична с  периодом |m-k|.  Это, в частности, означает, что все члены последовательности  ограничены некоторой константой.  С другой стороны f(f(n))=f(n+1)+f(n)>f(n), поскольку f(n+1) -  натуральное.  Следовательно, последовательность f(n),  f(f(n)),...,f(f...(f(n))...)  (являющаяся подпоследовательностью последовательности f(n))  строго возрастает и не ограничена  никакой константой.  Тем самым получено противоречие, завершающее доказательство."
    ],
    "30783": [
        "Связность и разложение на связные компоненты",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: В связном графе степени четырёх вершин равны 3, а степени остальных вершин равны 4.   Докажите, что нельзя удалить ребро так, чтобы граф распался на две изоморфные компоненты связности.",
        "Решение: Пусть это удалось. Если удалённое ребро соединяло вершины с одинаковыми степенями, то в каждой полученной компоненте будет нечётное число нечётных вершин (по одной или по три), что невозможно.     Если же удалённое ребро соединяло вершины со степенями 3 и 4, то только в одной компоненте будет вершина степени 2, то есть компоненты не будут изоморфны."
    ],
    "30812": [
        "Деревья",
        "Сложность: 4",
        "Классы: 8",
        "Условие: Расстоянием между двумя произвольными вершинами дерева будем называть длину простого пути, соединяющего их. Удалённостью вершины дерева назовём сумму расстояний от неё до всех остальных вершин. Докажите, что в дереве, у которого есть две вершины с удалённостями, отличающимися на 1, нечётное число вершин.",
        "Решение: Соединим эти две вершины A и B путем. Пусть a – его длина. Расстояние от любой вершины до A и B отличаются на величину, имеющую ту же чётность, что и a. Поэтому если число вершин чётно, то (независимо от чётности a) удаленности A и B отличаются на чётное число, что противоречит условию."
    ],
    "103976": [
        "Доказательство от противного",
        "Сложность: 2+",
        "Классы: 5,6,7",
        "Условие: Юра, Лёша и Миша коллекционируют марки. Количество Юриных марок, которых нет у Лёши, меньше, чем количество марок, которые есть и у Юры, и у Лёши. Точно так же, число Лёшиных марок, которых нет у Миши, меньше, чем число марок, которые есть и у Лёши и у Миши. А число Мишиных марок, которых нет у Юры, меньше, чем число марок, которые есть и у Юры и у Миши. Докажите, что какая-то марка есть у каждого из трех мальчиков."
    ],
    "60687": [
        "Арифметика остатков (прочее)",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: а) Докажите, что квадрат целого числа не может оканчиваться  четырьмя одинаковыми цифрами, отличными от 0.   б) Какими тремя цифрами может оканчиваться целое число, квадрат которого оканчивается тремя одинаковыми цифрами, отличными от 0?",
        "Решение: Квадрат не может оканчиваться на 2 и 8. Кроме того, квадрат не может оканчиваться на две нечётные цифры (см. задачу 31234). Остаются четвёрки и шестерки.     Число вида ...66 чётно, но не делится на 4, поэтому квадратом быть не может.",
        "Ответ: б) Тремя четвёрками."
    ],
    "64965": [
        "Процессы и операции",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На экране компьютера сгенерирована некоторая конечная последовательность нулей и единиц. С ней можно производить следующую операцию: набор цифр 01 заменять на набор цифр 1000. Может ли такой процесс замен продолжаться бесконечно или  когда-нибудь он обязательно прекратится?",
        "Решение: Первый способ. Каждую операцию можно понимать как ход  какой-то единицы: единица меняется местами со стоящим перед нею нулём, а потом после нуля появляются ещё два нуля. Пусть ежеминутно делается один такой ход, и процесс продолжается бесконечно долго. Тогда найдутся единицы, которые ходили  бесконечное число раз. Рассмотрим самую левую из них и покрасим её в красный цвет. Все единицы левее красной через несколько минут перестанут перемещаться. После этого красная единица каждым своим ходом будет перемещаться  ближе к началу последовательности, то есть сделает ещё лишь конечное  число ходов, что противоречит её выбору.",
        "Ответ: Процесс прекратится."
    ],
    "65179": [
        "Последовательности (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Найдите все строго возрастающие последовательности натуральных чисел   a1, a2, ..., an, ..., в которых a2 = 2 и anm = anam для любых натуральных n и m.",
        "Решение: Последовательность аn = n, очевидно, удовлетворяет условию.     Предположим, что есть какая-то другая последовательность. Так как a1 < a2, то a1 = 1. Ясно, что an ≥ n. Рассмотрим наименьшее n, при котором аn > n. Если n = 2m, то аn = a2am = 2m = n. Если же n = 2m + 1 (m ≥ 1), то n < аn < an+1 = a2m+2 = a2am+1 = 2(m + 1) = n + 1, то есть целое число аn находится между n и n + 1.     В обоих случаях мы пришли к противоречию.",
        "Ответ: аn = n."
    ],
    "78122": [
        "Арифметика остатков (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Два равных диска насажены на одну ось. На окружности каждого из них по кругу  на одинаковых расстояниях в произвольном порядке расставлены числа 1, 2, 3, ..., 20. Всегда ли можно повернуть один диск относительно другого так, чтобы никакие два одинаковых числа не стояли друг против друга?",
        "Решение: Предположим, что при каждом повороте (при котором напротив числа, написанного на одном диске, стоит число, написанное на другом диске) найдутся два одинаковых числа, стоящих друг напротив друга. Тогда при каждом повороте есть ровно одна пара одинаковых чисел, стоящих друг напротив друга. Действительно, поворотов у нас всего 20, поэтому если бы хотя бы для одного поворота совпали две пары чисел, то количество чисел должно было бы быть не менее 21.     Пусть в исходном положении против числа i стоит число ai. Тогда остатки от деления чисел i – ai на 20 должны принимать все значения от 0 до 19. Значит, (1 – a1) + (2 – a2) + ... + (1 – a20) ≡ 0 + 1 + 2 + ... + 19 = 19·10 ≠ 0 (mod 20). Но сумма в левой части равна нулю. Противоречие.",
        "Ответ: Всегда."
    ],
    "88335": [
        "Четность и нечетность",
        "Сложность: 4",
        "Классы: 7,8,9",
        "Условие: Можно ли в кружочках расставить все цифры от 0 до 9 так, чтобы сумма трёх чисел по любому из шести отрезков была бы одной и той же?",
        "Решение: Допустим, что это возможно. Пусть сумма чисел, стоящих в концах отрезков, равна А, сумма чисел, расположенных в серединах отрезков, равна B, а сумма трёх чисел вдоль каждого отрезка равна C. Ясно, что А + В = 0 + 1 + 2 + ... + 9 = 45. Каждая концевая точка принадлежит ровно трём отрезкам, а все середины различны. Поэтому, сложив сумму всех шести отрезков, получим: 3А + B = 6C. Отсюда 2А = 6С − (А + B) = 6C − 45. Противоречие, так как слева чётное число, а справа нечётное.",
        "Ответ: Нельзя."
    ],
    "35395": [
        "Комбинаторика (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: На доске n×n расставлено n – 1 фишек так, что никакие две из них не стоят на соседних (по стороне) клетках.   Докажите, что одну из них можно передвинуть на соседнюю клетку так, чтобы снова никакие две фишки не стояли на соседних клетках.",
        "Подсказка: Предположите противное и докажите, что число пустых меньше числа пустых столбцов.",
        "Решение: Предположим противное. Ясно, что в таблице есть пустые столбцы. Заметим, что пустой столбец не может быть крайним. Действительно, если, скажем, правый столбец пуст, то из самого правого непустого столбца можно сдвинуть фишку вправо. Аналогично доказывается, что не может быть двух пустых столбцов подряд. Итак, слева от каждого пустого столбца есть фишка. Её нельзя сдвинуть вправо, значит, в той же строке справа через одну от неё стоит фишка. Таким образом, каждая левая фишка находится в строке, где есть другие фишки.    Пусть всего пустых столбцов k. Тогда соответствующих левых фишек не меньше k. Следовательно, все фишки занимают не более n – 1 – k строк, и пустых строк не меньше k + 1, то есть больше чем пустых столбцов.    Но аналогично можно доказать, что пустых столбцов больше, чем пустых строк. Противоречие."
    ],
    "58167": [
        "Четность и нечетность",
        "Сложность: 4",
        "Классы: 7,8",
        "Условие: Вершины правильного 2n-угольника A1...A2n разбиты на n пар.   Докажите, что если n = 4m + 2 или n = 4m + 3, то две пары вершин являются концами равных отрезков.",
        "Решение: Предположим, что все пары вершин задают отрезки разной длины. Отрезку ApAq поставим всоответствие наименьшее из чисел |p – q| и 2n – |p – q|. В результате для данных n пар вершин получим числа 1, 2, ..., n. Заметим, что среди этих чисел чётных ровно k = 2m + 1, а нечётных – n – k. Нечётным числам соответствуют отрезки ApAq, где числа p и q разной чётности. Поэтому среди вершин остальных отрезков будет n – (n – k) = k вершин с чётными номерами. Поскольку эти отрезки соединяют вершины с номерами одной чётности, то k чётно. Противоречие."
    ],
    "78185": [
        "Линейные неравенства и системы неравенств",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Дана невозрастающая последовательность чисел   1/2k = a1 ≥ a2 ≥ ... ≥ an ≥ ... > 0, a1 + a2 + ... + an + ... = 1.   Доказать, что найдутся k чисел, из которых самое маленькое больше половины самого большого.",
        "Решение: Пусть, напротив, среди любых k чисел нашей последовательности наименьшее не больше половины наибольшего. Рассмотрим числа a1, a2, ..., ak. По условию, a1 – наибольшее среди них, ak –  наименьшее; согласно сделанному предположению, ak ≤ ½ a1. Рассматривая числа ak, ak+1, ..., a2k–1, точно так же получим a2k–1 ≤ ½ ak ≤ ¼ a1. Продолжая далее, обнаружим, что an(k–1)+1 ≤ 2–na1. Рассмотрим теперь сумму  S1 = a1 + ak + a2k–1 + ... + an(k–1)+1 + ... . Вследствие полученных выше неравенств S1 ≤ a1(1 + 2–1 + 2–2 + ... + 2–n + ...) = 2a1. Отсюда следует, что  S2 = a2 + ak+1 + ... + an(k–1)+2 + ... ≤ 2a1, S3 = a3 + ak+2 + ... + an(k–1)+3 + ... ≤ 2a1, Sk–1 = ak–1 + a2k–2 + ... + an(k–1)+k–1 + ... ≤ 2a1 (так как каждому слагаемому в этих суммах соответствует не меньшее слагаемое в сумме S1). Суммируя полученные неравенства, имеем  S = S1 + S2 + ... + Sk–1 ≤ 2(k – 1)a1 = k–1/k < 1. В то же время S = S1 + S2 + ... + Sk–1 = а1 + а2 + ... + ak + ... = 1 по условию. Противоречие."
    ],
    "73656": [
        "Средние величины",
        "Сложность: 4+",
        "Классы: 8,9,10",
        "Условие: Для любых n вещественных чисел a1, a2, ..., an существует такое натуральное k ≤ n, что каждое из k чисел ak, ½ (ak + ak–1),   &frac13; (ak + ak–1 + ak–2), ..., 1/k (ak + ak–1 + ... + a2 + a1) не превосходит среднего арифметического c чисел a1, a2, ..., an.",
        "Решение: Предположим противное: существуют такие вещественные числа a1, a2, ..., an, что для каждого k (1 < k ≤ n) найдётся такое l (1 ≤ l < k), что    больше среднего арифметического c всех этих чисел.     В частности, найдётся такое n1, что среднее арифметическое чисел от an1+1 до an больше c. Возьмём теперь k = n1; для него найдётся такое n2 (0 ≤ n2 < n1), что среднее арифметическое чисел от an2+1 до an1 больше c; если n2 > 0, то найдём но нему n3, и т.д. до тех пор, пока некоторое nr+1 не окажется нулём, то есть очередное среднее арифметическое будет браться от a1 до anr. Так как среднее арифметическое в каждой группе больше c, то и среднее арифметическое всех чисел больше c. Но c – среднее всех n чисел. Противоречие."
    ],
    "30292": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: Из набора домино выбросили все кости с шестёрками. Можно ли оставшиеся кости выложить в ряд?",
        "Решение: Предположим, что нам это удалось. Теперь пятерка встречается 7 раз. Внутри цепочки она встречается чётное число раз. Значит, на одном из концов – пятерка. Аналогично можно доказать, что на концах находятся и все остальные знаки домино. Но знаков шесть, а концов всего два. Противоречие."
    ],
    "78215": [
        "Прямые и кривые, делящие фигуры на равновеликие части",
        "Сложность: 4+",
        "Классы: 9,10,11",
        "Условие: Дан выпуклый многоугольник и точка",
        "Решение: Пусть"
    ],
    "78631": [
        "Десятичная система счисления",
        "Сложность: 5",
        "Классы: 9,10,11",
        "Условие: Рассматриваются всевозможные",
        "Решение: Докажем, что есть два числа, различающиеся лишь одной цифрой, к которым приписываются  разные цифры. Действительно, предположим, что к любым двум числам, различающимся лишь   одной цифрой, приписываются одинаковые цифры. Тогда по индукции доказывается, что к любым  двум числам, различающимся"
    ],
    "97913": [
        "Шахматные доски и шахматные фигуры",
        "Сложность: 5",
        "Классы: 7,8,9",
        "Условие: Каждая клетка шахматной доски закрашена в один из цветов – синий или красный. Докажите, что клетки одного из цветов обладают тем свойством, что их может обойти шахматный ферзь (на клетках этого цвета ферзь может побывать не один раз, на клетки другого цвета он не ставится, но может через них перепрыгивать).",
        "Решение: Если на доске найдётся одноцветная строка или столбец, то утверждение  очевидно. Иначе будем действовать следующим образом: обойдём все красные клетки первой горизонтали, перейдём на вторую, там тоже обойдём все красные клетки и т.д. Пусть мы не смогли перейти с i-й горизонтали на (i+1)-ю. Тогда начнём обходить все синие клетки последовательно, начиная с первой вертикали. Пусть мы не смогли перейти с j-й вертикали на (j+1)-ю. Пусть (i, j) – красная клетка, тогда (i + 1, j) и (i + 1, j + 1) – синие. Но тогда можно перейти с синей клетки (i + 1, j) на j-й вертикали на синюю клетку   (i + 1, j + 1) на (j+1)-й вертикали. Противоречие.     Аналогично приходим к противоречию и в случае, когда клетка (i, j) – синяя."
    ],
    "30299": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: Произведение 22 целых чисел равно 1. Докажите, что их сумма не равна нулю.",
        "Решение: Ясно, что все эти числа равны ±1. Сумма может равняться нулю, только если единиц и минус единиц поровну – по 11. Но тогда их произведение равнялось бы –1."
    ],
    "79514": [
        "Последовательности (прочее)",
        "Сложность: 5",
        "Классы: 8,9,10",
        "Условие: Можно ли выбрать некоторые натуральные числа так, чтобы при любом натуральном значении",
        "Решение: Ответ:",
        "Ответ: n"
    ],
    "88082": [
        "Принцип Дирихле (прочее)",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Можно ли разложить 44 шарика на 9 кучек так, чтобы количество шариков в разных кучках было различным?",
        "Подсказка: Подумайте, сколько нужно шариков, чтобы выполнить условие задачи.",
        "Решение: Предположим, нам это удалось. Упорядочим кучки по возрастанию количества шариков. Тогда в первой кучке должно быть не меньше одного шарика, во второй – не меньше двух, в третьей – не меньше трёх и т. д. Всего шариков должно быть не меньше чем 1 + 2 + 3 + ... + 9 = 45. А у нас только 44. Противоречие.",
        "Ответ: Нельзя."
    ],
    "31363": [
        "Теория графов (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: а) В группе из четырёх человек, говорящих на разных языках, любые трое могут общаться (возможно, один переводит двум другим).   Доказать, что их можно разбить  на пары, в каждой из которых имеется общий язык.   б) То же для группы из 100 человек.   в) То же для группы из 102 человек.",
        "Решение: а) Рассмотрим граф с четырьмя вершинами A, B, C, D, соответствующими людям, и соединим ребрами людей, знающих общий язык. Условие означает, что каждая тройка вершин соединена хотя бы двумя рёбрами. А доказать нужно, что есть два ребра без общих вершин. Пусть это неверно.     Первый способ. Если в тройке (A, B, C) проведены рёбра AB и AC, то рёбер BD и CD нет. Но тогда в тройке (B, C, D) не больше одного ребра. Противоречие.     Второй способ. Всего есть 4 тройки. Каждое ребро входит в две тройки. Следовательно, рёбер не менее 4·2 : 2 = 4. С другой стороны, каждому ребру соответствует отсутствующее противоположное ребро. Следовательно, рёбер не более трёх. Противоречие."
    ],
    "35466": [
        "Последовательности (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Даны 20 различных натуральных чисел, меньших 70.    Докажите, что среди их попарных разностей найдутся четыре одинаковых.",
        "Подсказка: Расположите числа в порядке возрастания и предположите противное -    среди разностей между последовательными числами нет четырех различных.",
        "Решение: Обозначим числа через    a"
    ],
    "32006": [
        "Подсчет двумя способами",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: а) Можно ли занумеровать рёбра куба натуральными числами от 1 до 12 так, чтобы для каждой вершины куба сумма номеров рёбер, которые в ней сходятся, была одинаковой?",
        "Решение: а) Предположим, что это возможно, и сумма номеров рёбер, сходящихся в каждой из восьми вершин, равна x. Сложив эти суммы для всех вершин, получим 8x. С другой стороны, эта сумма равна удвоенной сумме номеров всех рёбер, так как номер каждого ребра входит в неё дважды. Вычислим эту сумму: 2·(1 + 2 + ... + 12) = 156. Отсюда следует, что 8x = 156, то есть x – не целое. Противоречие.",
        "Ответ: а) Нельзя; б) можно."
    ],
    "32824": [
        "Турниры и турнирные таблицы",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Трое друзей играли в шашки. Один из них сыграл 25 игр, а другой – 17 игр. Мог ли третий участник сыграть  а) 34;  б) 35;  в) 56 игр?",
        "Решение: а) Например, первый с третьим сыграли 21 игру, второй с третьим – 13 игр, а первый со вторым – 4 игры.     б) Пусть это произошло. Тогда общее число игр было бы равно (25 + 17 + 35) : 2 = 38.5 игр – не целое число. Противоречие.     в) Третий игрок не может сыграть больше партий, чем первый и второй вместе взятые. Не играл же он сам с собой!",
        "Ответ: а) Мог; б)-в) не мог."
    ],
    "34920": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Дано n попарно взаимно простых чисел, больших 1 и меньших (2n – 1)². Докажите, что среди них обязательно есть простое число.",
        "Подсказка: Предположите противное и рассмотрите наименьшие простые делители данных чисел.",
        "Решение: Пусть a1, a2, ..., an – попарно взаимно простые составные числа. Обозначим через pi наименьший простой делитель числа ai. Тогда ai = piqi, причём pi ≤ qi. Поскольку ai < (2n – 1)², то pi < 2n – 1. Кроме того, числа p1, p2, ..., pn различны, так как числа a1, a2, ..., an попарно взаимно просты. Однако существует не более n – 1 простых чисел, больших 1 и меньших 2n – 1: все такие числа содержатся среди чисел 2, 3, 5, 7, ..., 2n – 3. Противоречие."
    ],
    "35659": [
        "Замощения костями домино и плитками",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Можно ли доску 10×10 разрезать на фигурки из четырёх клеток в форме буквы Г?",
        "Подсказка: Раскрасьте в шахматном порядке вертикали доски.",
        "Решение: Раскрасим в шахматном порядке вертикали доски. При этом 50 клеток покрашено в белый цвет и 50 – в чёрный. Каждая буква Г занимает нечётное число (1 или 3) белых клеток. Поэтому если бы доску можно было разрезать на 25 фигурок в виде буквы Г, то белых клеток на доске было бы нечётное число (сумма 25 нечётных чисел). Противоречие.",
        "Ответ: Нельзя."
    ],
    "64835": [
        "Пятиугольники",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На доске был изображен пятиугольник, вписанный в окружность. Маша измерила его углы и у нее получилось, что они равны 80°, 90°, 100°, 130° и 140° (именно в таком порядке). Не ошиблась ли Маша?",
        "Решение: Пусть АВСDE – данный пятиугольник, в котором углы А, В, С, D и Е соответственно равны 80°, 90°, 100°, 130° и 140° (см. рис.). Далее можно рассуждать по-разному.",
        "Ответ: Ошиблась."
    ],
    "79486": [
        "Линейные неравенства и системы неравенств",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите, что ни для каких чисел x, y, t не могут одновременно выполняться три неравенства: |x| < |y − t|, |y| < |t − x|, |t| < |x − y|.",
        "Решение: Предположим, что указанные неравенства имеют место. Возведём почленно в квадрат каждое неравенство, перенесём влево все правые части и разложим на множители полученные разности квадратов. Получим: (x − y + t)(x + y − t) < 0, (y − t + x)(y + t − x) < 0, (t − x + y)(t + x − y) < 0.    Произведение трёх отрицательных чисел отрицательно, поэтому   (x − y + t)²(x + y − t)²(y + t − x)² < 0. Противоречие."
    ],
    "102844": [
        "Таблицы и турниры (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Клетки квадратной таблицы 15×15 раскрашены в красный, синий и зелёный цвета.   Докажите, что найдутся, по крайней мере, две строки, в которых клеток хотя бы одного цвета поровну.",
        "Решение: Допустим противное. Тогда в каждых двух строках разное количество клеток красного цвета, и всего их в таблице не менее   0 + 1 + 2 + ... + 13 + 14  = 105. То же верно для синих и зелёных клеток. Тогда всего в таблице должно быть не менее 3·105 = 315 клеток, в то время как всего их 15² = 225. Противоречие."
    ],
    "107700": [
        "Неравенство треугольника (прочее)",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Имеется 10 отрезков, причём известно, что длина каждого – целое число сантиметров. Два самых коротких отрезка – по сантиметру, самый длинный – 50 см. Докажите, что среди отрезков найдутся три, из которых можно составить треугольник.",
        "Решение: Предположим противное: ни из каких трёх отрезков нельзя составить треугольник. Рассмотрим длины отрезков в сантиметрах по возрастанию:  l1 = l2 = 1 ≤ l3 ≤ l4 ≤ ... ≤ l10 = 50. Так как из трёх самых коротких отрезков нельзя составить треугольник, то l3 ≥ l1 + l2 = 2. Аналогично  l4 ≥ l2 + l3 ≥ 1 + 2 = 3. Далее, l5 ≥ 2 + 3 = 5, l6 ≥ 3 + 5 = 8, l7 ≥ 5 + 8 = 13, l8 ≥ 8 + 13 = 21, l9 ≥ 13 + 21 = 33, l10 ≥ 21 + 33 = 55. Противоречие."
    ],
    "30309": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: За круглым столом сидят 25 мальчиков и 25 девочек. Докажите, что у кого-то из сидящих за столом оба соседа – мальчики.",
        "Решение: Уберём из-за стола каждого второго и посадим их за другой стол в том же порядке. За каждым столом теперь по 25 человек, поэтому мальчиков и девочек не поровну – есть стол, где мальчиков больше, чем девочек. За этим столом два мальчика должны сидеть рядом (если рядом с каждым мальчиком сидит две девочки, то девочек не меньше, чем мальчиков). Но за исходным столом между этими мальчиками кто-то сидел."
    ],
    "30811": [
        "Степень вершины",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Каждый из 102 учеников одной школы знаком не менее чем с 68 другими.   Докажите, что среди них найдутся четверо, имеющие одинаковое число знакомых.",
        "Решение: Предположим противное. Тогда для каждого числа от 68 до 101 есть ровно три человека, имеющие такое число знакомых. Но тогда количество людей, имеющих нечётное число знакомых, нечётно. Противоречие."
    ],
    "77885": [
        "Уравнения в целых числах",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Найти такие целые числа x, y, z и t, что x² + y² + z² + t² = 2xyzt.",
        "Решение: Пусть (x, y, z, t) – ненулевое решение. Число x² + y² + z² + t² чётно, поэтому среди чисел x, y, z, t чётное число нечётных чисел. Если все числа x, y, z, t нечётны, то x² + y² + z² + t² ≡ 0 (mod 4), но при этом 2xyzt не делится на 4. Если ровно два из чисел x, y, z, t нечётны, то x² + y² + z² + t² не делится на 4, а 2xyzt делится на 4. Поэтому все числа x, y, z, t чётны.     Пусть 2n – максимальная степень двойки, на которую делятся эти числа. Тогда x = 2nu, y = 2nv, z = 2nw, t = 2ns, причём хотя бы одно из чисел u, v, w, s нечётно. Сократив обе части уравнения на 22n, получим u² + v² + w² + s² = 22n+1uvws. Но левая часть не делится на 8 (см. задачу 34944). Противоречие.",
        "Ответ: x = y = z = t = 0."
    ],
    "35422": [
        "Доказательство от противного",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: 1000 яблок разложены в несколько корзин.    Можно убирать корзины и вынимать яблоки из корзин. Докажите, что    можно добиться того, чтобы во всех корзинах стало поровну яблок и    общее число оставшихся яблок было не меньше 100.",
        "Подсказка: Рассуждая от противного, оцените количество корзин, в которых    вначале было не меньше одного яблока, не меньше двух яблок и т.д.",
        "Решение: Предположим противное. Тогда вначале было меньше 100 корзин, в     которых было по крайней мере одно яблоко, иначе мы бы взяли     из каждой корзины все яблоки кроме одного, и после этого осталось     бы не меньше 100 яблок.     Таким же образом,     вначале было меньше 50 корзин, в     которых было по крайней мере два яблока,     иначе мы убрали бы все корзины, где было меньше двух яблок и взяли     бы из каждой оставшейся корзины все яблоки кроме двух; после этого осталось     бы не меньше 100 яблок.     Вообще,     если обозначить за А"
    ],
    "34989": [
        "Упорядочивание по возрастанию (убыванию)",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Солдаты построены в две шеренги по n человек, так что каждый солдат из первой шеренги не выше стоящего за ним солдата из второй шеренги. В шеренгах солдат выстроили по росту. Докажите, что после этого каждый солдат из первой шеренги также будет не выше стоящего за ним солдата из второй шеренги.",
        "Решение: Обозначим через a1, a2, ..., an рост солдат первой шеренги в порядке убывания, а через b1, b2, ..., bn рост солдат второй шеренги в порядке убывания (те же обозначения используем и для самих солдат). Пусть утверждение задачи неверно: ak > bk для некоторого k. Это означает, что до перестраивания по росту солдат ak мог стоять только перед одним из k – 1 солдат b1, b2, ..., bk–1. То же справедливо и для солдат a1, a2, ..., ak–1, поскольку они не ниже солдата ak. Итак, до перестраивания шеренг k солдат a1, a2, ..., ak могли стоять только перед k – 1 солдатами b1, b2, ..., bk–1. Противоречие."
    ],
    "35655": [
        "Задачи с неравенствами. Разбор случаев",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: На контрольной работе учитель дал пять задач и ставил за контрольную оценку,   равную количеству решённых задач. Все ученики, кроме Пети, решили одинаковое число задач, а Петя – на одну больше. Первую задачу решили 9 человек, вторую – 7 человек, третью – 5 человек, четвёртую – 3 человека, пятую – один человек. Сколько четвёрок и пятерок было получено на контрольной?",
        "Решение: Предположим, что Петя получил не меньше 4, тогда остальные решили не меньше 3 задач каждый, и суммарное число задач, решённых всеми учениками, – не меньше 3·9 = 27 (из условия видно, что число учеников не меньше 9). Но, с другой стороны, это число равно 9 + 7 + 5 + 3 + 1 = 25. Противоречие.",
        "Ответ: Ни одной."
    ],
    "35673": [
        "Игры-шутки",
        "Сложность: 3",
        "Классы: 7,8,9,10",
        "Условие: Двое играют в двойные шахматы: все фигуры ходят как обычно,  но каждый делает по два шахматных хода подряд. Докажите, что  первый может как минимум сделать ничью.",
        "Подсказка: Предположите, что второй имеет выигрышную стратегию и покажите,  что первый может применить эту стратегию.",
        "Решение: Предположим, противное, т.е. второй игрок имеет  выигрышную стратегию. Это означает, что у второго есть  правило П ответа на любые  возможные ходы первого такое, что если второй ему следует,  то независимо от ходов первого второй игрок побеждает.  Пусть первый игрок первые два хода подряд сделал конем  - первым ходом вывел коня, а вторым - поставил его обратно.  Тогда позиция такая же как вначале, а очередь хода - у второго игрока.  Таким образом, в этот момент первый игрок может воспользоваться  стратегией П, чтобы наверняка выиграть. Но это противоречие  тому, что у второго игрока имеется выигрышная стратегия."
    ],
    "64324": [
        "Сумма углов треугольника. Теорема о внешнем угле.",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Даны два треугольника. Сумма двух углов первого треугольника равна некоторому углу второго. Сумма другой пары углов первого треугольника также равна некоторому углу второго. Верно ли, что первый треугольник – равнобедренный?",
        "Решение: Предположим, что первый треугольник – неравнобедренный, α, β и γ – его углы, а суммы α + β и β + γ равны углам второго треугольника. Так как эти суммы не равны, то это – разные углы второго треугольника. Значит, сумма углов этого треугольника больше α + β + β + γ = 180╟ + β > 180╟, что невозможно.     Таким образом, первый треугольник – равнобедренный.",
        "Ответ: Верно."
    ],
    "64562": [
        "Уравнения в целых числах",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Найдутся ли такие три натуральных числа, что сумма каждых двух из них – степень тройки?",
        "Решение: Пусть нашлись три числа, удовлетворяющие условию. Среди них найдутся два числа одной чётности. Их сумма – чётное число, а степень тройки – нечётное число.",
        "Ответ: Не найдутся."
    ],
    "64995": [
        "Числовые таблицы и их свойства",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: В клетках таблицы 3×3 расставили цифры от 1 до 9. Затем нашли суммы цифр в каждой строке.   Какое наибольшее количество из этих сумм может оказаться полным квадратом?",
        "Решение: Наименьшая возможная сумма цифр в строке: 1 + 2 + 3 = 6, а наибольшая: 7 + 8 + 9 = 24. Значит, если сумма является полным квадратом, то она равна 9 или 16. Предположим, что в каждой строке сумма равна 9 или 16, то есть даёт остаток 2 при делении на 7. Тогда сумма всех цифр в таблице при делении на 7 даст остаток 6. Но сумма чисел от 1 до 9 равна 45, то есть , что при делении на 7 даёт остаток 3. Следовательно, трёх сумм – полных квадратов быть не может.     Две такие суммы возможны, например, см. таблицу:",
        "Ответ: Две суммы."
    ],
    "65622": [
        "Замощения костями домино и плитками",
        "Сложность: 3",
        "Классы: 1,9,10,11",
        "Условие: Квадрат со стороной 9 клеток разрезали по линиям сетки на 14 прямоугольников таким образом, что длина каждой стороны любого прямоугольника не меньше, чем две клетки. Могло ли оказаться так, что среди этих прямоугольников не было ни одного квадрата?",
        "Решение: Площадь прямоугольника, отличного от квадрата, с указанными сторонами не меньше чем 2·3 = 6 клеток. Так как 6·14 > 9², то площадь 14 таких прямоугольников заведомо больше площади исходного квадрата. Следовательно, обойтись без квадратов невозможно.",
        "Ответ: Не могло."
    ],
    "31353": [
        "Доказательство от противного",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: В автобусе едут 20 пассажиров, и у каждого много монет по  10, 15 и 20 копеек. Каждый должен заплатить 5 копеек.   Могут ли они сделать это, использовав (в том числе и для обмена между собой)  а) 24 монеты;  б) 25 монет?",
        "Решение: а) Пусть это произошло. Каждый пассажир получил сдачу, значит, из 24 монет в кассу попало не более четырёх, то есть не более 80 коп. А общий проезд стоит рубль.",
        "Ответ: а) Не могут; б) могут."
    ],
    "78155": [
        "Линейные неравенства и системы неравенств",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: Для любых чисел a1 и a2, удовлетворяющих условиям a1 ≥ 0, a2 ≥ 0, a1 + a2 = 1, можно найти такие числа b1 и b2, что b1 ≥ 0, b2 ≥ 0, b1 + b2 = 1,   (5/4 – a1)b1 + 3(5/4 – a2)b2 > 1. Доказать.",
        "Решение: Предположим, что 5/4 – a1 ≤ 1 и 3(5/4 – a2) ≤ 1. Умножив первое неравенство на 3 и сложив со вторым, получим 3(5/2 – a1 – a2) ≤ 4, откуда  a1 + a2 ≥ 5/2 – 4/3 = 7/6 > 1, что противоречит условию.     Итак, одно из чисел 5/4 – a1 ≤ 1, 3(5/4 – a2) больше единицы. Следовательно, достаточно взять  либо b1 = 1, b2 = 0, либо b1 = 0, b2 = 1."
    ],
    "78521": [
        "НОД и НОК. Взаимная простота",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: Доказать, что произведение двух последовательных натуральных чисел не является  степенью никакого целого числа.",
        "Решение: Предположим, что n(n + 1) = am, где m ≥ 2 (a, m и n – натуральные  числа). Числа n и n + 1 не имеют общих делителей, поэтому n = bm и n + 1 = cm. Но этого не может быть, потому что разность между двумя последовательными m-ми степенями больше 1."
    ],
    "79362": [
        "Геометрическая прогрессия",
        "Сложность: 3",
        "Классы: 8",
        "Условие: Имеется несколько гирь, общая масса которых равна 1 кг. Каждой гире присвоен  свой номер: 1, 2, 3, .... Доказать, что найдётся такой номер",
        "Решение: Пусть"
    ],
    "79438": [
        "Сочетания и размещения",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Двадцать городов соединены 172 авиалиниями.   Доказать, что, используя эти авиалинии, можно из любого города перелететь в любой другой (быть может, делая пересадки).",
        "Решение: Предположим, что из города"
    ],
    "30954": [
        "Четность и нечетность",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: В квадрате 25&times25 стоят числа 1 и –1. Вычислили все произведения этих чисел по строкам и по столбцам.   Доказать, что сумма этих произведений не равна нулю.",
        "Решение: Произведение всех 50 произведений равно квадрату произведения всех чисел таблицы, то есть 1. Далее см. задачу 30299."
    ],
    "31074": [
        "Связность и разложение на связные компоненты",
        "Сложность: 3+",
        "Классы: 6,7,8",
        "Условие: Из полного 100-вершинного графа выкинули 98 рёбер. Доказать, что он остался связным.",
        "Решение: Предположим, что полученный граф оказался несвязным, и в одной из компонент связности n вершин. Тогда было выкинуто по крайней мере  n(100 – n) рёбер, соединявших вершины этой компоненты с вершинами других компонент. Но n(100 – n) = 50² – (n – 50)² ≥ 50² – 49² = 1·99 > 98. Противоречие."
    ],
    "35122": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Докажите, что простых чисел, дающих остаток 2 при делении на 3, бесконечно много.",
        "Подсказка: Если имеются простые числа p1, p2, ..., pn, то все простые делители чисел p1p2...pn + 1 и p1p2...pn – 1 отличны от чисел p1, p2, ..., pn.",
        "Решение: Предположим, что напротив, найдётся лишь конечное число таких простых чисел, обозначим эти числа p1, p2, ... , pn. Число A = 3p1p2...pn – 1 не делится на простые числа p1, p2, ..., pn и даёт остаток 2 при делении на 3. Значит, среди его простых делителей должно быть число вида 3k + 2. Противоречие."
    ],
    "60753": [
        "Простые числа и их свойства",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: При помощи задачи 60752 докажите, что существует бесконечно много простых чисел вида p = 4k + 1.",
        "Решение: Пусть таких чисел всего n: p1, ..., pn. Рассмотрим число (2p1...pn)² + 1. Согласно задаче 60752 у него есть простой множитель вида p = 4k + 1. С другой стороны, это число не делится ни на одно из чисел p1, ..., pn. Противоречие."
    ],
    "64670": [
        "Турниры и турнирные таблицы",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: В турнире по игре в крестики – нолики, проведённом по системе проиграл – выбыл, участвовали 18 школьников. Каждый день играли одну партию, участников которой выбирали жребием из ещё не выбывших школьников. Каждый из шестерых школьников утверждает, что сыграл ровно четыре партии. Не ошибается ли кто-то из них?",
        "Решение: Всего в турнире было сыграно 17 партий, так как каждый проигравший выбывал. Если каждый из шести школьников сыграл   по 4 партии, то каждый выиграл не менее трёх. Так как в партии есть только один победитель, то партий в турнире было не меньше, чем 6·3 = 18. Противоречие.",
        "Ответ: Ошибается."
    ],
    "64941": [
        "Уравнения в целых числах",
        "Сложность: 3+",
        "Классы: 6,7",
        "Условие: Можно ли в кружках (см. рисунок) разместить различные натуральные числа таким образом, чтобы суммы трёх чисел вдоль каждого отрезка оказались равными?",
        "Решение: Пусть требуемая расстановка существует, S – сумма всех расставленных чисел, a и b – числа, стоящие в кружках, расположенных в каких-либо двух вершинах треугольника. Тогда для той вершины, в которой стоит число a, сумма чисел вдоль трёх отрезков, содержащих эту вершину, равна S + 2a. Аналогично для вершины, в которой стоит число b, эта сумма равна S + 2b. Так как суммы чисел вдоль каждого отрезка равны, то S + 2a = S + 2b, то есть a = b. Но это противоречит условию.",
        "Ответ: Нельзя."
    ],
    "65590": [
        "Выделение полного квадрата. Суммы квадратов",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: Петя записал несколько алгебраических выражений, возвёл каждое из них в квадрат и сложил результаты.   Могло ли у него в итоге получиться выражение x² + y² + z² + 3y + 4x + xz + 1?",
        "Решение: Если выражение x² + y² + z² + 3y + 4x + xz + 1 равно сумме квадратов нескольких алгебраических выражений, то при любых x, y и z его значение  неотрицательно. Но, например, при x = z = 0, y = –1, x² + y² + z² + 3y + 4x + xz + 1 = 1 – 3 + 1 < 0.",
        "Ответ: Не могло."
    ],
    "65614": [
        "Функции. Непрерывность (прочее)",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Существует ли такая функция f(x), определённая для всех действительных чисел, что f(sin x) + f(cos x) = sin x?",
        "Решение: Пусть такая функция существует. Тогда f(sin 0) + f(cos 0) = sin 0, то есть f(0) + f(1) = 0. Но   f(sin π/2) + f(cos π/2) = sin π/2, то есть f(0) + f(1) = 1. Противоречие.",
        "Ответ: Не существует."
    ],
    "77975": [
        "Многочлены (прочее)",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Докажите, что многочлен вида x200y200 + 1 нельзя представить в виде произведения многочленов от одного только x и одного только y.",
        "Решение: Предположим, что существуют многочлены f(x) = a0xn + a1xn–1 + ... + an и g(y) = b0ym + b1ym–1 + ... + bm, для которых f(x)g(y) = x200y200 + 1. Положив  x = 0, получим  ang(y) = 1, то есть g(y) = 1/an при всех y. Положив y = 0, аналогично получим, что f(x) = 1/bm при всех x. Таким образом, f(x)g(y) = 1/anbm – константа, а функция x200y200 + 1, очевидно, не является константой."
    ],
    "78804": [
        "Системы показательных уравнений и неравенств",
        "Сложность: 3+",
        "Классы: 8",
        "Условие: Дано 17 натуральных чисел: a1, a2, ..., a17. Известно, что    Доказать, что a1 = a2 = ... = a17.",
        "Решение: Предположим, что a1 < a2. Тогда    поэтому a2 > a3. Далее получаем a3 < a4, ..., a16 > a17, a17 < a1, a1 > a2. Противоречие.     Остальные случаи разбираются аналогично."
    ],
    "79243": [
        "Деление многочленов с остатком. НОД и НОК многочленов",
        "Сложность: 3+",
        "Классы: 10",
        "Условие: Дан многочлен с целыми коэффициентами. В трёх целых точках он принимает   значение 2.   Доказать, что ни в какой целой точке он не принимает значение 3.",
        "Решение: Пусть P(x) – наш многочлен. Тогда для целых a и b число P(a) − P(b) делится на a − b (см. решение задачи 35562). Предположим, что  P(a1) = P(a2) = P(a3) = 2 и P(b) = 3, где a1, a2, a3 и b – различные целые числа. Тогда |a1 − b| = |a2 − b| = |a3 − b| = 1, что невозможно."
    ],
    "79452": [
        "Квадратичные неравенства (несколько переменных)",
        "Сложность: 3+",
        "Классы: 9",
        "Условие: Сумма пяти неотрицательных чисел равна единице.   Докажите, что их можно расставить по кругу так, что сумма всех пяти попарных произведений соседних чисел будет не больше &frac15;.",
        "Решение: Допустим, что при любой расстановке чисел a, b, c, d, e рассматриваемая сумма больше &frac15;, в частности при расстановках a, b, c, d, e и a, c, e, b, d:  ab + bc + cd + de + ea > &frac15;, ac + ce + eb + bd + da > &frac15;.     Тогда 1 = (a + b + c + d + e)² = ½ (a² + b² + b² + c² + c² + d² + d² + e² + e² + a²) + 2((ab + bc + cd + de + ea) + (ac + ce + eb + bd + da)) ≥   ≥ 3(ab + bc + cd + de + ea) + 2(ac + ce + eb + bd + da) > 1. Противоречие."
    ],
    "73633": [
        "Доказательство от противного",
        "Сложность: 3+",
        "Классы: 7,8,9",
        "Условие: а) Докажите, что в таблице",
        "Решение: а) Будем в нашей таблице вместо чётных чисел писать 0, а вместо нечётных – 1. Тогда таблицу из нулей и единиц нужно будет составлять по тому же правилу (каждое число получается как сумма трёх, стоящих над ним в предыдущей строке), только сложение нужно выполнять по модулю два.    Первый способ. Последние четыре числа в каждой строке зависят только от того, каковы последние четыре числа в предыдущей строке, поэтому эта четвёрка периодически повторяется (с периодом 4, см. рис. 1)."
    ],
    "107741": [
        "Тетраэдр (прочее)",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Существует ли тетраэдр, все грани которого — равнобедренные треугольники, причём никакие два из них не равны?",
        "Решение: Допустим, такой тетраэдр",
        "Ответ: Нет, не существует."
    ],
    "78787": [
        "Целочисленные решетки",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Имеется сетка, состоящая из квадратов размером 1×1. Каждый её узел покрашен в один из четырёх данных цветов так, что вершины любого квадрата 1×1 покрашены в разные цвета. Доказать, что найдётся прямая, принадлежащая сетке, такая, что узлы, лежащие на ней, покрашены в два цвета.",
        "Решение: Предположим противное. Поскольку соседние узлы раскрашены в разные цвета, то на горизонтальной прямой найдутся три подряд идущих узла различных цветов. Обозначим эти цвета через 1, 2 и 3, тогда над и под этими узлами должны находиться узлы 3, 4, 1 (действительно, над и под узлом 2 может быть только узел 4). Таким образом получили, что вверх и вниз чередуются узлы 1, 2, 3 с узлами 3, 4, 1, а значит, эти вертикальные прямые покрашены ровно в два цвета.  Получили противоречие."
    ],
    "79571": [
        "Разбиения на пары и группы; биекции",
        "Сложность: 3+",
        "Классы: 9",
        "Условие: Докажите, что из 53 различных натуральных чисел, не превосходящих в сумме 1990, всегда можно выбрать  2 числа, составляющих в сумме 53.",
        "Решение: Допустим, что такой набор, из которого выбраны 2 числа, составляющие в сумме  53, не нашёлся.  Пусть"
    ],
    "30801": [
        "Планарные графы. Формула Эйлера",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Можно ли построить три дома, вырыть три колодца и соединить тропинками каждый дом с каждым колодцем так, чтобы тропинки не пересекались?",
        "Решение: Пусть это удалось. Полученный плоский граф двудолен, поэтому согласно задаче 31110 E ≥ 2F, то есть F ≤ 4. Подставив в формулу Эйлера (задача 30759), получим 2 = 6 – 9 + F ≤ 1. Противоречие.",
        "Ответ: Нельзя."
    ],
    "58164": [
        "Четность и нечетность",
        "Сложность: 4",
        "Классы: 7,8",
        "Условие: Окружность разбита точками на 3k дуг: по k дуг длины 1, 2 и 3. Докажите, что найдутся две диаметрально противоположные точки деления.",
        "Решение: Предположим, что окружность разбита на дуги указанным образом, причём диаметрально противоположных точек деления нет. Поскольку против концов дуги длины 1 не лежат точки разбиения, то против неё лежит дуга длины 3. Выбросим одну из дуг длины 1 и противолежащую ей дугу   длины 3. При этом окружность разбивается на две дуги. Если на одной из них лежит m дуг длины 1 и n дуг длины 3, то на другой лежит m дуг длины 3 и n дуг длины 1. Общее количество дуг длины 1 и 3, лежащих на этих двух больших дугах, равно 2(k – 1), поэтому n + m = k – 1. Так как, кроме дуг длиной 1 и 3, есть дуги только чётной длины, то чётность длины каждой из двух рассматриваемых дуг совпадает с чётностью числа k – 1. С другой стороны, длина каждой из них равна ½ (6k – 1 – 3) = 3k – 2. Противоречие, так как числа k – 1 и 3k – 2 имеют разную чётность."
    ],
    "79335": [
        "Доказательство от противного",
        "Сложность: 3+",
        "Классы: 6,7,8,9",
        "Условие: Каждая точка числовой оси, координата которой – целое число, покрашена либо в красный, либо в синий цвет. Доказать, что найдётся цвет со следующим  свойством: для каждого натурального числа k имеется бесконечно много точек  этого цвета, координаты которых делятся на k.",
        "Решение: Пусть A и B – множества соответственно синих и красных точек. Предположим утверждение задачи неверно. Тогда найдется такое натуральное число a, что A содержит лишь конечное число точек с координатами, кратными a. Также найдётся такое натуральное число b, что B содержит лишь конечное число точек с координатами, кратными b. Но тогда A ∪ B содержит лишь конечное число точек, с координатами, кратными ab. Противоречие, так как число таких точек бесконечно."
    ],
    "65130": [
        "Системы линейных уравнений",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: По кругу расставлено 300 положительных чисел. Могло ли случиться так, что каждое из этих чисел, кроме одного, равно разности своих соседей?",
        "Решение: Предположим, что требуемая расстановка существует. Ясно, что наибольшее из чисел не может равняться разности соседей; значит, каждое из остальных чисел равно разности соседей. В частности, наибольшее число встречается ровно один раз; обозначим его через m.    Пусть d – одно из наименьших чисел в круге. Рассмотрим любую из двух дуг между d и m; пусть на ней стоят подряд числа d = a0, a1, ..., ak = m. Докажем индукцией по i, что ai+1 ≥ ai. В базовом случае i = 0 утверждение верно, ибо d – наименьшее число.    Шаг индукции. Пусть i > k и ai–1 ≤ ai. Тогда равенство ai = ai–1 – ai+1 невозможно, ибо ai+1 > 0, и поэтому ai = ai+1 – ai–1. Значит, ai+1 > ai.     Мы заодно показали, что ai+1 = ai + ai – 1 при всех i = 1, .., k – 1.    Аналогично, если на другой дуге между d и m стоят подряд числа d = b0, b1, ..., bl = m, то b0 ≤ b1 ≤ ... ≤ bl и bi+1 = bi + bi–1 при всех  i = 1, 2, ..., l – 1. Наконец, для числа a0 = b0 = d условие задачи также должно выполняться; без ограничения общности можно считать, что  d = a1 – b1; тогда a2 = a0 + a1 = b1 > a1.    Продолжим теперь последовательности a0, a1, ... и b0, b1, ... согласно формулам ai+1 = ai + ai–1 и bi+1 = bi + bi–1. Докажем индукцией по i, что  ai < bi ≤ ai+1. Для i = 1 это уже доказано выше. При i = 2 из соотношений b0 = a0 ≤ a1 < b1 = a2 получаем a2 = a1 + a0 < b1 + b0 = b2 ≤ a2 + a1 = a3.    Шаг индукции. Пусть i ≥ 3. По предположению индукции ai–2 < bi–2 < bi–1 ≤ ai, откуда ai = ai–1  + ai–2 < bi–1  + bi–2 = bi ≤ ai + ai–1  = ai+1.    Итак, a0 = b0 ≤ a1 < b1 ≤ a2 < b2 ≤ ... . Значит, равенство bl = ak возможно лишь при k = l + 1; но тогда общее количество чисел в круге равно  k + l = 2l + 1, что не может равняться 300. Противоречие.",
        "Ответ: Не могло."
    ],
    "66084": [
        "Раскраски",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Все натуральные числа, бóльшие единицы, раскрасили в два цвета – синий и красный – так, что сумма каждых двух синих (в том числе одинаковых) – синяя, а произведение каждых двух красных (в том числе одинаковых) – красное. Известно, что при раскрашивании были использованы оба цвета и что число 1024 покрасили в синий цвет. Какого цвета при этом могло оказаться число 2017?",
        "Решение: Заметим, что если число bn синего цвета, то число b тоже синее. Так как 1024 = 210, то число 2 синее. Отсюда следует, что все чётные числа синие, а также то, что если число a > 4 – красное, то a – 2 – тоже красное.     Рассмотрим произвольное красное число k. Тогда и любая степень k тоже красная. Так как k > 2, то существует степень k, которая превосходит 2017. Вычитая нужное количество двоек получим, что 2017 – красное число.",
        "Ответ: Красного."
    ],
    "79368": [
        "Линейные неравенства и системы неравенств",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Имеется несколько камней, масса каждого из которых не превосходит 2 кг, а  общая масса равна 100 кг. Из них выбирается несколько камней, суммарная масса  которых отличается от 10 кг на наименьшее возможное для данного набора число  d. Какое максимальное значение может принимать число d для всевозможных наборов камней?",
        "Решение: Пример. Для набора 55 камней весом 20/11 кг число d равно 10/11 (надо взять 5 или 6 камней).",
        "Ответ: 10/11."
    ],
    "79479": [
        "Подсчет двумя способами",
        "Сложность: 4",
        "Классы: 10",
        "Условие: Доказать, что в любой группе из 12 человек можно выбрать двоих, а среди  оставшихся 10 человек еще пятерых так, чтобы каждый из этих пятерых удовлетворял  следующему условию: либо он дружит с обоими выбранными вначале, либо не дружит  ни с одним из них.",
        "Решение: Предположим, что это не так. Выбрав любых двух человек A  и B, среди оставшихся десятерых выберем таких людей C1, C2, ..., Ck, каждый из которых знает ровно одного в этой паре. В силу предположения k ≥ 6. Подсчитаем число N троек{A, В, Ci} двумя способами. Всего имеется 12·11 : 2 = 66 пар {A, В}, и каждой паре отвечает не менее шести человек Сi, поэтому   N ≥ 6·66 = 396. С другой стороны, Ci можно фиксировать и искать для него такие пары {A, В}, в которых он знает ровно одного человека. Если у Сi есть n знакомых, то число искомых пар {A, В} равно n(11 − n) ≤ 30. Выбрать же Сi можно 12 способами, откуда N ≤ 5·6·12 = 360. Противоречие."
    ],
    "109171": [
        "Средние величины",
        "Сложность: 4",
        "Классы: 8,9,10,11",
        "Условие: Все целые числа произвольным образом разбиты на две группы. Доказать, что хотя бы в одной из групп найдутся три числа, одно из которых есть среднее арифметическое двух других.",
        "Решение: Будем разбивать натуральные числа, начиная с 1, на два класса: I и  II, причём будем стараться, чтобы ни один класс не содержал вместе с двумя числами их среднее арифметическое. Поскольку ½ (a + c) = b ⇔ c = 2b – a, то если, например, a и b отнесены в класс I, то число 2b – a должно быть отнесено в класс II. Не нарушая общности, положим 1 ∈ I. Возможны два случая.     1) 2 ∈ I. Тогда 3 ∈ II. Возможны два подслучая.     1а) 4 ∈ I."
    ],
    "115454": [
        "Принцип Дирихле (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: В течение",
        "Решение: Рассмотрим"
    ],
    "30814": [
        "Связность и разложение на связные компоненты",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В некоторой стране каждые два города соединены либо авиалинией, либо железной дорогой.  Докажите, что     а) можно выбрать вид транспорта так, чтобы от каждого города можно было добраться до любого другого, пользуясь только этим видом транспорта;    \tб) из некоторого города, выбрав один из видов транспорта, можно добраться до любого другого города не более чем с одной пересадкой (пользоваться можно только выбранным видом транспорта);     в) каждый город обладает свойством из пункта б);     г) можно выбрать вид транспорта так, чтобы пользуясь только им, можно было добраться из каждого города до любого другого не более чем с двумя пересадками.",
        "Решение: а) Первый способ. Пусть из некоторого города A нельзя попасть в некоторый город B по железной дороге. Рассмотрим множество M всех городов, в которые можно попасть из города A по железной дороге. Множество городов, не входящих в M, обозначим N. Множество N непусто, поскольку в нём содержится город B. Ясно, что из городов множества M нельзя попасть в города множества N по железной дороге.     Докажем, что из каждого города в любой другой можно попасть  авиарейсами.     Если один из городов принадлежит M, а другой – множеству N, то между ними есть прямая авиалиния.     Пусть два города принадлежат M. Тогда из первого города можно попасть авиарейсом в некоторый город множества N, а оттуда (также самолётом) – во второй город.     Аналогично рассматривается случай, когда оба города принадлежат N.     Второй способ. См. г)."
    ],
    "32112": [
        "Рекуррентные соотношения (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Барон Мюнхгаузен заявил Георгу Кантору, что он может выписать в ряд все натуральные числа без единицы так, что только конечное их число будет больше своего номера. Не хвастает ли барон?",
        "Решение: Пусть a1, a2, a3, ... – выписанные в ряд все натуральные числа без единицы. Построим для этого новую последовательность (bn) натуральных чисел, заданную следующим образом: b1 = 1, bn+1 = abn при n ≥ 2.     Докажем, что все члены последовательности (bn) различны. Действительно, пусть bk = bm, причём k > m > 1, то abk–1 = abm–1, откуда   bk–1 = bm–1, так как все члены последовательности (an) различны. Продолжая, получим bk–2 = bm–2, ...,  \tbk–m+1 = b1, то есть abk–m = 1. Противоречие: последовательность (an) не содержит единицы.     Так как (bn) – бесконечная последовательность различных натуральных чисел, то в ней существует бесконечно много членов, больших предыдущего (в противном случае она бы убывала, начиная с некоторого места, что невозможно). Иными словами, bk+1 > bk, то есть abk > bk для бесконечного числа k. А это и значит, что бесконечное число членов последовательности (an) больше своего номера.",
        "Ответ: Хвастает."
    ],
    "35412": [
        "Принцип крайнего  (прочее)",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: 25 дачников получили садовые участки. Каждый участок представляет собой квадрат 1×1, и все участки вместе составляют квадрат 5×5. Каждый дачник враждует не более, чем с тремя другими дачниками. Докажите, что можно распределить участки таким образом, чтобы участки враждующих дачников не были бы соседними (по стороне).",
        "Подсказка: Распределите участки вначале произвольным образом, а затем пусть дачники меняются участками так, чтобы число пар враждующих соседей уменьшилось.",
        "Решение: Число способов распределить участки между дачниками конечно, поэтому можно рассмотреть способ, при котором число пар враждующих соседей минимально.    Предположим, что пары враждующих соседей имеются; пусть A и B – два враждующих соседа. Рассмотрим 23 дачников, отличных от A и B. Покажем, что среди них найдётся такой дачник C, что а) C не враждует с соседями B; б) C не является соседом враждующих с B дачников. Действительно, условие а) исключает не более 4·3 − 1 = 11 дачников (один из соседей B – дачник A, одним из врагов которого является B). Условие б) исключает еще 3·4 − 1 = 11 дачников. Итак, оба условия исключают не более 22 дачников. Значит, хотя бы один дачник удовлетворяет этим условиям.       Если дачники B и C поменяются участками, то пара враждующих соседей (A, B) исчезнет, а новых пар не возникнет. Это противоречит выбору исходного распределения."
    ]
}