{
    "65328": [
        "https://www.problems.ru/view_problem_details_new.php?id=65328",
        "Теория множеств (прочее)",
        "Сложность: 2",
        "Классы: 8,9,10,11",
        "Условие: Аня ждёт автобус. Какое событие имеет наибольшую вероятность?\r\n   А = {Аня ждет автобуса не меньше минуты},\r\n   В = {Аня ждет автобуса не меньше двух минут},\r\n   С = {Аня ждет автобуса не меньше пяти минут}.",
        "Решение: Событие A включает в себя событие B, а событие B включает в себя событие C, то есть событие A наиболее обширное:  C ⊂ B ⊂ A.  Следовательно, \r\nP(C) ≤ P(B) ≤ P(A).",
        "Ответ: Событие A. "
    ],
    "35123": [
        "https://www.problems.ru/view_problem_details_new.php?id=35123",
        "Мощность множества. Взаимно-однозначные отображения",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Рассматриваются всевозможные треугольники с целочисленными сторонами и периметром 2000, а также всевозможные треугольники с целочисленными сторонами и периметром 2003. Каких треугольников больше? ",
        "Подсказка: Поставьте в соответствие каждому треугольнику с периметром 2000 некоторый треугольник с периметром 2003. ",
        "Решение: Пусть стороны треугольника равны целым числам a, b, c и его периметр равен 2000. Поставим этому треугольнику в соответствие треугольник со сторонами  a + 1,  b + 1,  c + 1,  периметр которого равен 2003 (нетрудно проверить, что неравенство треугольника для таких сторон выполняется). При этом соответствии различным треугольникам соответствуют различные. Однако треугольник периметра 2003 со сторонами 1, 1001, 1001 не соответствует никакому треугольнику периметра 2000. Следовательно, треугольников периметра 2003 больше.\n",
        "Ответ: С периметром 2003. \n"
    ],
    "76449": [
        "https://www.problems.ru/view_problem_details_new.php?id=76449",
        "Формула включения-исключения",
        "Сложность: 3",
        "Классы: 7,8,9,10",
        "Условие: \r\nСколько существует натуральных чисел, меньших тысячи, которые не делятся \r\nни на 5, ни на 7?  \r\n      ",
        "Решение: Сначала вычеркнем из набора чисел 1, 2, ..., 999 числа, кратные 5; их количество равно  [999/5] = 199.  Затем из того же набора чисел 1, 2, ..., 999 вычеркнем числа, кратные 7; их количество равно  [999/7] = 142.  При этом числа, кратные 35, будут вычеркнуты дважды. Их количество равно  [999/35] = 28.  Значит, всего мы вычеркнули   199 + 142 – 28 = 313  чисел, а осталось  999 – 313 = 686 чисел.",
        "Ответ: 686 чисел. "
    ],
    "60440": [
        "https://www.problems.ru/view_problem_details_new.php?id=60440",
        "Формула включения-исключения",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Сколько существует целых чисел от 1 до 1000000, которые не являются ни полным\r\nквадратом, ни полным кубом, ни четвёртой степенью?  ",
        "Решение: 1000000 = 1000² = 100³ = 106.  Поэтому в указанном промежутке ровно 1000 квадратов и 100 кубов. 10 чисел из них являются шестыми степенями, то есть квадратами и кубами одновременно. Все четвёртые степени находятся среди квадратов. Следовательно, условию удовлетворяют \r\n1000000 – 1000 – 100 + 10 = 998910  чисел. ",
        "Ответ: 998910 чисел. "
    ],
    "107636": [
        "https://www.problems.ru/view_problem_details_new.php?id=107636",
        "Формула включения-исключения",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Куб со стороной 10 разбит на 1000 кубиков с ребром 1. В каждом кубике записано число, при этом сумма чисел в каждом столбике из 10 кубиков (в любом из трёх направлений) равна 0. В одном из кубиков (обозначим его через A) записана единица. Через кубик A проходит три слоя, параллельных граням куба (толщина каждого слоя равна 1). Найдите сумму всех чисел в кубиках, не лежащих в этих слоях. \n",
        "Решение: Через заданный кубик A проходят один горизонтальный слой Г и два вертикальных слоя. Сумма всех чисел в 81 вертикальном столбике, не входящем в последние два слоя, равна 0. Из полученной суммы надо вычесть сумму S чисел, лежащих в кубиках, на пересечении этих столбиков с Г (таких кубиков 81). Эти кубики полностью покрываются девятью столбиками, лежащими в Г. Сумма всех чисел в этих столбиках (она равна 0) превышает S на сумму девяти чисел, лежащих в перпендикулярном им столбике, содержащем A. Последняя сумма очевидно равна – 1. Отсюда  S = 1.  Окончательно имеем:  0 – 1 = –1. ",
        "Ответ: \n–1.\n",
        "Замечания:  1. Знающие формулу включения-исключения легко могут найти ответ с её помощью:  0 – 3·0 + 3·0 – 1 = –1. \n2. Ср. с задачей 98400. \n"
    ],
    "110007": [
        "https://www.problems.ru/view_problem_details_new.php?id=110007",
        "Объединение, пересечение и разность множеств",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Автор: Дольников В.Л.\n\nКаждый голосующий на выборах вносит в избирательный бюллетень фамилии  n \nкандидатов. На избирательном участке находится  n+1  урна. После выборов\nвыяснилось, что в каждой урне лежит по крайней мере один бюллетень и\nпри всяком выборе  (n+1) -го бюллетеня по одному из каждой урны\nнайдется кандидат,\nфамилия которого встречается в каждом из выбранных бюллетеней. Докажите, что\nпо крайней мере в одной урне все бюллетени содержат фамилию одного и того же\nкандидата.\n",
        "Решение: \nВозьмем произвольный бюллетень из  (n+1) -й урны.\nПронумеруем кандидатов, фамилии которых встречаются в этом бюллетене.\nПредположим, что требуемое в задаче не выполнено. Тогда в  k -й урне\n( k=1 ,  n ) найдется бюллетень, не содержащий фамилии  k -го кандидата.\nНабор этих бюллетеней вместе со взятым вначале бюллетенем из  (n+1) -й урны\nпротиворечит условию задачи.\n\n\n"
    ],
    "109702": [
        "https://www.problems.ru/view_problem_details_new.php?id=109702",
        "Формула включения-исключения",
        "Сложность: 4+",
        "Классы: 8,9,10",
        "Условие: Автор: Канель-Белов А.Я.\nЧисла от 1 до 1000000 покрашены в два цвета – чёрный и белый. За ход\r\nразрешается выбрать любое число от 1 до 1000000 и перекрасить его и все числа,\r\nне взаимно простые с ним, в противоположный цвет. Вначале все числа были чёрными.\r\nМожно ли за несколько ходов добиться того, что все числа станут белыми? ",
        "Решение:    Лемма. Пусть дан набор простых чисел p1, ..., pn. Тогда можно за несколько перекрашиваний добиться того, что поменяют цвет те и только те числа, которые кратны всем простые числа этого набора. \r\n   Доказательство. Для каждого непустого поднабора наших простых чисел перекрасим числа, не взаимно простые с произведением всех чисел этого поднабора.\r\n   Число, кратное всем числам набора, перекрашивалось при каждом таком перекрашивании, всего перекрашиваний было  2n – 1,  следовательно, все эти числа перекрашены.\r\n   Пусть некоторое число k не делится хотя бы на одно из чисел набора, например, на p1. Тогда оно не перекрашивалось, когда\r\nмы перекрашивали числа, не взаимно простые с p1. Остальные непустые поднаборы чисел можно разбить на пары следующим образом: поднабору, не\r\nсодержащему p1, в пару ставится поднабор, полученный из него\r\nдобавлением p1. При этом число k перекрашивается или при обоих перекрашиваниях пары, или ни при одном. Поэтому число k не будет перекрашено.\n   Первый способ. Для каждого набора простых чисел, произведение которых не больше 1000000, перекрасим числа, кратное всем этим простым числа.\r\nПо лемме такая операция возможна.\r\n   Докажем, что каждое число k при этом будет перекрашено. Пусть k имеет m различных простых делителей, тогда оно перекрашивалось при  2m – 1  операции, то есть нечётное число раз.\n   Второй способ. Назовём два числа эквивалентными, если у них совпадают наборы простых делителей. Заметим, что при наших операциях классы эквивалентности перекрашиваются целиком. Будем говорить, что один класс больше другого, если все простые делители второго класса являются делителями первого.\r\n   Из леммы следует, что мы можем перекрасить любой класс, перекрасив вместе с ним только большие классы.\r\n   Сначала перекрасим минимальные классы (класс называется минимальным,\r\nесли он не больше никакого другого класса). Исключим их из рассмотрения.\r\n   Среди оставшихся некоторые классы станут после такого исключения минимальными. При необходимости перекрасим их и тоже исключим. И так далее.\r\n   Поскольку классов конечное число, процесс закончится. ",
        "Ответ: Можно. "
    ],
    "116142": [
        "https://www.problems.ru/view_problem_details_new.php?id=116142",
        "Текстовые задачи (прочее)",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Автор: Фольклор\nВ стаде, состоящем из лошадей, двугорбых и одногорбых верблюдов, в общей сложности 200 горбов. \r\nСколько животных в стаде, если количество лошадей равно количеству двугорбых верблюдов? .",
        "Решение: Пусть каждый двугорбый верблюд “поделится” горбом с лошадью. Тогда у каждого животного будет по одному горбу, следовательно, количество горбов равно количеству животных в стаде.\n",
        "Ответ: 200.\t"
    ],
    "32791": [
        "https://www.problems.ru/view_problem_details_new.php?id=32791",
        "Задачи на проценты и отношения",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Трое сумасшедших маляров принялись красить пол каждый в свой цвет. Один успел закрасить красным 75% пола, другой зелёным – 70%, третий синим – 65%. Какая часть пола заведомо закрашена всеми тремя красками? \n",
        "Решение:    Оценка. Красным цветом не закрашено 25% пола, зелёным цветом не закрашено 30% пола, синим цветом не закрашено 35% пола. 25 + 30 + 35 = 90.  Отсюда следует, что всеми тремя красками закрашено не менее 10%. \r\n   Пример, когда тремя красками закрашено ровно 10%, ясен из оценки: 25% пола закрашено в два цвета: синий и зелёный, 30% – в красный и зелёный, 35% – в красный и синий. ",
        "Ответ: 10%. "
    ],
    "35398": [
        "https://www.problems.ru/view_problem_details_new.php?id=35398",
        "Неравенства с площадями",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Внутри квадрата со стороной 2 расположено семь многоугольников площадью не менее 1 каждый. \r\nДокажите, что существует два многоугольника, площадь пересечения которых не менее 1/7. \n",
        "Подсказка: Оцените площадь объединения этих многоугольников, предполагая, что утверждение задачи не выполняется. ",
        "Решение: Предположим, что площадь пересечения каждых двух из данных семи многоугольников меньше 1/7. Оценим площадь фигуры \nAi = M1 ∪ M2 ∪ ... ∪ Mi  (i = 1, 2, ..., 7),  исходя из нашего предположения. Площадь  S(A1) = S(M1) ≥ 1.  Далее, для каждого  i = 2, ..., 7  многоугольник Mi пересекается с каждым из многоугольников M1, ..., Mi–1 по площади, меньшей 1/7. Значит,  S(Mi ∩ Ai–1) < i–1/7,  S(Mi \\ Ai–1) > 1 – i–1/7 = 8–i/7,\r\nа  S(Ai) > S(Ai–1) + 8–i/7.  Следовательно,  S(A7) > 1 + 6/7 + 5/7 + ... + 1/7 = 4.  Но это противоречит тому, что все многоугольники лежат внутри квадрата площади 4. "
    ],
    "35355": [
        "https://www.problems.ru/view_problem_details_new.php?id=35355",
        "Формула включения-исключения",
        "Сложность: 3+",
        "Классы: 7,8,9,10",
        "Условие: Антон, Артем и Вера решили вместе 100 задач по математике. Каждый из них решил    \r\n   60 задач. Назовем задачу трудной, если ее решил только один человек, и легкой,    \r\n   если ее решили все трое. Насколько отличается количество трудных задач    \r\n   от количества легких?\r\n\r\n\r\n\t\t\t",
        "Подсказка: Нарисуйте пересекающиеся круги, где каждый круг обозначает множество задач,  \r\n решенных одним из друзей.\r\n\t\t\t",
        "Решение: Пусть S1 - число задач, решенных только Антоном, S2 - число\r\nзадач, решенных только Артемом, S3 - число задач, решенных только\r\nВерой, S12 - число задач, решенных только Антоном и Артемом, и так далее.\r\nТогда Антон решил S1+S12+S13+S123 = 60 задач,\r\nАртем решил S2+S12+S23+S123 = 60 задач,\r\nВера решила S3+S13+S23+S123 = 60 задач.\r\nОбщее число задач : S1+S2+S3+S12+\r\nS13+S23+S123=100.\r\nСложим первые три равенства и вычтем последнее, умноженное на 2.\r\nПолучим:\r\n-S1-S2-S3+S123=-20\r\n\r\nЭто значит, что трудных задач на 20 больше, чем легких, потому что \r\nS1+S2+S3 - число трудных задач,\r\nа S123 - число легких.\r\n"
    ],
    "35627": [
        "https://www.problems.ru/view_problem_details_new.php?id=35627",
        "Обыкновенные дроби",
        "Сложность: 3+",
        "Классы: 7,8,9,10",
        "Условие: Хозяйка испекла для гостей пирог. К ней может прийти либо 10, либо 11 человек. На какое наименьшее число кусков ей нужно заранее разрезать пирог так, чтобы его можно было поделить поровну как между 10, так и между 11 гостями? \n",
        "Подсказка: Если придут 10 гостей, то каждый должен получить не меньше двух кусков. \n",
        "Решение:    Если придут 10 гостей, то каждый должен получить не меньше двух кусков. В самом деле, иначе один из 10 гостей получил бы один кусок в 1/10 часть пирога, и если бы пришло 11 гостей, то этот кусок нужно было бы дополнительно разделить. Таким образом, количество кусков не меньше, чем  2·10 = 20. \r\n   Покажем, что двадцати кусков хватит. Разрежем пирог на 10 кусков по 1/11 части пирога и на 10 кусков по 1/110 пирога. Если придут 10 гостей, то каждому дадим один большой кусок и один маленький – всего 1/11 + 1/110 = 1/10. Если же придут 11 гостей, то десяти из них дадим по одному большому куску в 1/11, а одному – 10 маленьких кусков.  ",
        "Ответ: На 20 кусков. \n",
        "Замечания:  См. также задачу 98057. \n"
    ],
    "104074": [
        "https://www.problems.ru/view_problem_details_new.php?id=104074",
        "Формула включения-исключения",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: В саду у Ани и Вити росло 2006 розовых кустов. Витя полил половину всех кустов, и Аня полила половину всех кустов. При этом оказалось, что ровно три куста, самые красивые, были политы и Аней, и Витей. Сколько розовых кустов остались не политыми? ",
        "Решение: Витя полил 1003 куста, из них 1000 он поливал один, а три – вместе с Аней. Точно так же Аня полила 1003 куста, из них 1000 она поливала в одиночку, а три – с Витей. Значит, вместе они полили  1000 + 1000 + 3 = 2003  куста. Следовательно, остались не политыми  2006 – 2003 = 3  розовых куста. ",
        "Ответ: 3 куста. "
    ],
    "35642": [
        "https://www.problems.ru/view_problem_details_new.php?id=35642",
        "Формула включения-исключения",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Пол комнаты площадью 6 м² покрыт тремя коврами, площадь каждого из которых равна 3 м². \r\nДокажите, что какие-то два из этих ковров перекрываются по площади, \r\nне меньшей 1 м². ",
        "Подсказка: Предположите противное и оцените площадь, покрытую всеми тремя коврами. ",
        "Решение: Пусть это не так. Тогда первый и второй ковры пересекаются по площади, меньшей  1 м². Поэтому объединение этих двух ковров покрывает площадь, большую  3  + 3 – 1 = 5 м².  Третий ковер имеет общую площадь, меньшую 1 м², с первым ковром и общую площадь, меньшую 1 м², со вторым ковром. Следовательно, площадь, большая 1 м², покрыта только третьим ковром. \r\nТаким образом, площадь, покрытая всеми тремя коврами, больше  5 + 1 = 6 м²,  т.е. больше площади комнаты. Противоречие. "
    ],
    "65697": [
        "https://www.problems.ru/view_problem_details_new.php?id=65697",
        "Теория множеств (прочее)",
        "Сложность: 3+",
        "Классы: 9,10,11",
        "Условие: Автор: Богданов И.И.\nВ классе учится 23 человека. В течение года каждый ученик этого класса один раз праздновал день рождения, на который пришли некоторые (хотя бы один, но не все) его одноклассники. Могло ли оказаться, что каждые два ученика этого класса встретились на таких празднованиях одинаковое число раз? (Считается, что на каждом празднике встретились каждые два гостя, а также именинник встретился со всеми гостями.) ",
        "Решение:    Предъявим примеры, как такое могло произойти. \n   Первый пример. Выстроим учеников по кругу. Предположим, что к каждому на день рождения пришли все одноклассники, кроме следующего за ним по часовой стрелке. Тогда каждые два ученика A и B встретились на всех празднованиях, кроме двух: того, на которое не пришёл A, и того, на которое не пришёл B. Значит, каждая пара учеников встретилась 21 раз.\n   Второй пример. Выделим из класса двух учеников A и B. Пусть на день рождения к A пришли все одноклассники, кроме B, на день рождения к B пришёл только A, а на остальные дни рождения приходил только B. Тогда каждая пара, в которой нет B, встретилась только на дне рождения A, а все пары, содержащие B, встречались ровно по разу на остальных празднованиях. Итого, каждая пара встретилась ровно по разу.",
        "Ответ: Могло."
    ],
    "60445": [
        "https://www.problems.ru/view_problem_details_new.php?id=60445",
        "Формула включения-исключения",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: В прямоугольнике площади 1 расположено пять фигур площади ½ каждая. Докажите, что найдутся\r\n   а) две фигуры, площадь общей части которых не меньше 3/20; \r\n   б) две фигуры, площадь общей части которых не меньше &frac15;; \r\n   в) три фигуры, площадь общей части которых не меньше 1/20. ",
        "Решение:    Мы будем пользоваться обозначениями задачи 58106.\r\n   а) Согласно задаче 58106 б)  1 ≥ 5·0,5 – M2,  то есть  M2 ≥ 1,5.  M2 – сумма 10 площадей попарных пересечений пяти фигур, значит, площадь наибольшего из этих пересечений на меньше 0,15.\r\n   Замечание. Можно получить эту же оценку, рассуждая аналогично решению 2 задачи 58107 б).\r\n   б) Согласно задаче 58106 а)  S = M1 – M2 + M3 – M4 + M5.       (*)\r\n   Применив ту же формулу включения-исключения к первой фигуре, получим  S1 = ∑ S1i – ∑ S1ij + ∑ S1ijk – S12345.\r\n   Сложив пять подобных равенств для пяти фигур, получим  M1 = 2M2 – 3M3 + 4M4 – 5M5.       (**)\r\n   Прибавив утроенное равенство (*), получим  3S = 2M1 – M2 + M4 – 2M5 ≥ 2M1 – M2   (M4 ≥ 5M5 ≥ 2M5,  поскольку  Sijkl ≥ S12345 = M5  для каждой из пяти площадей вида Sijkl).\r\n   Отсюда  M2 ≥ 2M1 – 3M = 5 – 3 = 2.  Значит, площадь наибольшего из 10 попарных пересечений пяти фигур не меньше  2 : 10 = 0,2.\r\n   в) Заменив формулу включения-исключения на неравенство из задачи 50106 б) (для  m = 2),  мы вместо (**) получим неравенство  M1 ≥ 2M2 – 3M3,  откуда \r\n3M3 ≥ 2M2 – M1 ≥ 2·2 – 2,5 = 1,5.  Значит, площадь наибольшего из 10 \"тройных\" пересечений пяти фигур не меньше  0,5 : 10 = 0,05.. "
    ],
    "98377": [
        "https://www.problems.ru/view_problem_details_new.php?id=98377",
        "Примеры и контрпримеры. Конструкции",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Автор: Шаповалов А.В.\nАня, Боря и Вася составляли слова из заданных букв. Все составили разное\r\nчисло слов: больше всех – Аня, меньше всех – Вася. Затем ребята просуммировали очки за свои слова. Если слово есть у двух игроков, за него даётся 1 очко, у одного игрока – 2 очка, слова, общие у всех трёх игроков, вычёркиваются. Могло ли так случиться, что больше всех очков набрал Вася, а меньше всех – Аня? ",
        "Решение: Пусть, например, всего составлено 15 слов, из них два есть только у Бори, 4 – только у Васи, 6 – у Ани и Бори и 3 – у Ани и Васи. Всего Аня составила 9 слов и набрала 9 очков, у Бори – 8 слов и 10 очков, а у Васи – 7 слов и 11 очков. ",
        "Ответ: Могло. ",
        "Замечания:  3 балла \n"
    ],
    "60449": [
        "https://www.problems.ru/view_problem_details_new.php?id=60449",
        "Числа Каталана",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Рассмотрим шахматную доску n×n. Требуется провести ладью из левого нижнего угла в правый верхний. Двигаться можно только вверх и вправо, не заходя при этом на клетки главной диагонали и ниже нее. (Ладья оказывается на главной диагонали только в начальный и в конечный моменты времени.) Сколько у ладьи существует таких маршрутов? ",
        "Подсказка: Установите соответствие между всеми такими маршрутами ладьи и последовательностями чисел из задачи 60447. ",
        "Решение: Пусть первый ход ладья делает вверх, тогда последний – вправо. Кроме этого, она должна сделать  n – 1  ход вверх и столько же – вправо. Каждому ходу вверх поставим в соответствие единицу, а ходу вправо – минус единицу. Мы получим последовательность из  2n – 2  чисел, удовлетворяющую условиям задачи 60447. Обратно, по каждой такой последовательности можно построить маршрут ладьи в верхней части доски. ",
        "Ответ: 2Cn–1."
    ],
    "79604": [
        "https://www.problems.ru/view_problem_details_new.php?id=79604",
        "Таблицы и турниры (прочее)",
        "Сложность: 4-",
        "Классы: 8,9,10,11",
        "Условие: Автор: Часовских А.\nНа прямоугольном экране размером m×n, разбитом на единичные клетки, светятся более  (m – 1)(n – 1)  клеток. Если в каком-либо квадрате 2×2 не светятся три клетки, то через некоторое время погаснет и четвёртая. Докажите, что тем не менее на экране всегда будет светиться хотя бы одна клетка. \n",
        "Решение: Поставим в соответствие каждой погасшей клетке квадратик 2×2, в котором она была последней светящейся (если таких квадратиков несколько, выберем любой из них). Ясно, что двум клеткам не может соответствовать один и тот же квадратик.\r\nЗначит, общее число погасших клеток не больше числа квадратов 2×2 в прямоугольнике m×n. Нетрудно подсчитать, что это число равно  (m − 1) (n − 1).  Таким образом, погаснут не более  (m − 1)(n − 1)  клеток, что меньше исходного количества светящихся клеток..  "
    ],
    "78818": [
        "https://www.problems.ru/view_problem_details_new.php?id=78818",
        "Процессы и операции",
        "Сложность: 4-",
        "Классы: 8,9,10",
        "Условие: В городе \"Многообразие\" живут n жителей, любые два из которых либо\r\nдружат, либо враждуют между собой. Каждый день не более чем один житель может\r\nначать новую жизнь: перессориться со всеми своими друзьями и подружиться со\r\nвсеми своими врагами. Доказать, что все жители могут подружиться.\r\n\nПримечание.  Если A — друг B, а B — друг C, то A — также друг C. Предполагается также, что среди любых троих жителей хотя бы двое дружат между собой.",
        "Решение: Пусть A, B и C — какие-то три жителя города. \r\n    Ясно, что возможен случай, когда все они дружат между собой; возможно также,\r\nчто один из них (скажем, A) не дружит ни с B, ни с C, а B и C дружат между собой:  тогда для того, чтобы A, B и C все подружились, достаточно, чтобы A \"начал новую жизнь\".\r\n\r\n    Нетрудно также видеть, что два других случая: когда все три жителя A, B и C между собой враждуют и когда один житель, — например, тот же A, — дружит с\r\nB и с C, а те враждуют между собой, уже невозможны.\r\n\r\n    Описанное строение \"отношения дружбы\" между любыми тремя лицами A, B и C доказывает, что в пределах всего города это отношение можно описать весьма просто: в городе имеются две группы жителей (две партии M и N, такие, что все жители принадлежат либо к одной, либо к другой партии (но никогда — к обеим сразу), причём каждые два члена одной партии между собой дружат, а жители, принадлежащие к разным партиям, обязательно враждуют. В самом деле, присоединим к нашим трем жителям A, B и C города Многообразие еще одного жителя D; в таком случае, если A и B дружат между собой и D дружит хоть с одним из них, то он дружит и со вторым — и, значит, принадлежит к партии, в которую входят и A, и B; если же A и B между собой враждуют, то D дружит лишь с одним из них (но с одним дружит непременно!). Это рассуждение обеспечивает возможность разбиения четвёрки жителей A, B, C и D на две партии M и N (впрочем, одна из этих партий может быть и \"пустой\": так будет, если\r\nвсе жители A, B, C и D дружат между собой). Поступая так же и дальше, т. е.  последовательно присоединяя к уже рассмотренным жителям города по одному человеку, мы докажем возможность разбиения на две партии всех n жителей города.\r\n\r\n    Теперь доказательство утверждения задачи не представляет уже никакого труда. Если все жители города дружат между собой, то нам и доказывать нечего; если же ни одна из партий M и N не \"пуста\", то мы предложим каждый день одному из участников партии M \"начинать новую жизнь\", т. е., попросту, переходить в партию N. Если в партии M имеется k человек, то все жители города смогут подружиться за k дней."
    ]
}