{
    "35772": [
        "Касательные к сферам",
        "Сложность: 2+",
        "Классы: 10,11",
        "Условие: В пространстве дана плоскость П и точки A и B по одну  сторону от П (AB не параллельно П).   Рассматриваются сферы, проходящие через точки  A и B, касающиеся плоскости П.   Докажите, что точки касания этих сфер и плоскости П   лежат на одной окружности.",
        "Подсказка: Квадрат длины касательной равен произведению длин отрезков секущих.",
        "Решение: Пусть M - точка пересечения прямой AB и плоскости П,  а T - точка касания некоторой сферы, проходящей через A, B,  и плоскости П.   Тогда согласно известной теореме о квадрате длины касательной  получаем: MT"
    ],
    "109281": [
        "Касательные к сферам",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Два шара касаются плоскости",
        "Ответ: 4.00"
    ],
    "109315": [
        "Касательные к сферам",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Шар радиуса",
        "Решение: Пусть",
        "Ответ: Окружности радиусов"
    ],
    "111188": [
        "Касающиеся сферы",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Три шара касаются некоторой плоскости и попарно касаются  друг друга. Найдите радиусы шаров, если известно, что точки касания шаров с плоскостью являются вершинами треугольника  со сторонами",
        "Ответ: Пусть"
    ],
    "79292": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Шарообразная планета окружена 37-ю точечными астероидами. Доказать, что в любой момент на поверхности планеты найдётся точка, из которой астроном не сможет наблюдать более 17 астероидов.",
        "Решение: Проведём через центр планеты и произвольную пару астероидов плоскость П  (будем считать её экваториальной). Проведём ось планеты, перпендикулярную  плоскости П. Она пересекает поверхность планеты в полюсах"
    ],
    "110292": [
        "Сфера, вписанная в многогранный угол",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Докажите, что если в четырёхгранный угол можно вписать сферу, то суммы противоположных плоских углов этого четырёхгранного угла равны.",
        "Решение: Пусть сфера с центром O касается граней APB, BPC, CPD и APD четырёхгранного угла PABCD с вершиной P в точках K, L, M и N соответственно. Точки K и N симметричны относительно плоскости APO, поэтому ∠APK = ∠APN."
    ],
    "79358": [
        "Принцип Дирихле (площадь и объем)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: У белой сферы 12% её площади окрашено в красный цвет. Доказать, что в сферу можно вписать параллелепипед, у которого все вершины белые.",
        "Решение: Проведём через центр сферы три взаимно перпендикулярные плоскости и для каждой точки сферы рассмотрим её образы при симметриях относительно этих плоскостей и при композициях этих симметрий. Каждая точка, не лежащая на этих плоскостях, имеет ровно 8 образов. Следовательно, красные точки и их образы занимают не более"
    ],
    "87278": [
        "Касающиеся сферы",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Рёбра правильного тетраэдра",
        "Ответ: 1,"
    ],
    "109316": [
        "Касательные к сферам",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Через точку",
        "Решение: Рассмотрим сечение сферы плоскостью, проходящей через  пересекающиеся прямые"
    ],
    "108828": [
        "Векторы (прочее)",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В правильную треугольную пирамиду",
        "Ответ: 9.00"
    ],
    "109317": [
        "Касательные к сферам",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Сторона правильного треугольника равна 11. Центры трёх шаров  находятся в вершинах этого треугольника. Сколько существует  различных плоскостей касающихся одновременно трёх шаров, если  радиусы шаров равны 3, 4, 6.",
        "Решение: Решим сначала такую задачу. Расстояние между центрами",
        "Ответ: 6.00"
    ],
    "110245": [
        "Правильная призма",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: В основании призмы лежит равносторонний треугольник",
        "Ответ: 1.00"
    ],
    "111370": [
        "Касающиеся сферы",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Какому соотношению должны удовлетворять радиусы трёх шаров, попарно касающихся друг друга, для того, чтобы к ним можно было провести общую касательную плоскость.",
        "Решение: Пусть",
        "Ответ: Если"
    ],
    "116318": [
        "Прямоугольные параллелепипеды",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Точка",
        "Решение: Обозначим",
        "Ответ: 3."
    ],
    "116319": [
        "Прямоугольные параллелепипеды",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Точка",
        "Решение: Обозначим",
        "Ответ: 4."
    ],
    "116320": [
        "Прямоугольные параллелепипеды",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Точка",
        "Ответ: 6."
    ],
    "116321": [
        "Прямоугольные параллелепипеды",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Точка",
        "Ответ: 6."
    ],
    "87156": [
        "Конус",
        "Сложность: 4+",
        "Классы: 8,9,10,11",
        "Условие: Можно ли точку в пространстве закрыть четырьмя шарами?",
        "Решение: Пусть",
        "Ответ: Да."
    ],
    "35086": [
        "Окружности на сфере",
        "Сложность: 3+",
        "Классы: 8,9,10,11",
        "Условие: Итак, Чукча выходит каждый день на охоту по следующему маршруту:     10 км на юг,     10 км на восток,     10 км на север     (На запад чукча не ходит)     И хоп! Оказывается перед своим чумом.     Однако! говорит чукча.     Теперь вопрос:     найти Геометрическое Место Точек, где может находиться чум чукчи.",
        "Подсказка: Чукча живет на земле, а земля-то круглая.    Идя на восток - чукча шел по параллели. Идя на север (на юг) -  по    меридиану.    Если он вернулся в исходную точку, то следовательно меридианы    пересеклись.    Подумайте: это был один и тот же меридиан или нет?",
        "Решение: ГМТ разбивается на две качественно различных категории:            Северный полюс - как раз точка пересечения меридианов. Но здесь    присутствует    некая неопределенность в выборе начального направления движения.    Поскольку все    направления на юг, то любое начало приведет обратно на северный   полюс.        Совокупность параллелей около южного полюса.    Возьмем параллель около южного полюса длиной 10км (*), отступим от   нее    на 10 км на север и получим    новую параллель. Любая ее точка может служить местом стоянки чума.    Действительно:    идя 10 км на юг, чукча окажется на параллели длиной 10 км, пройдет  10    км на восток    (Полный оборот вокруг южного полюса), окажется на Том Же меридиане.  И    пройдя 10    км на север, очутится около своего чума.    Если в (*) взять параллель длиной 5 км, чукча по ней пройдет Два    оборота - те же    10км на восток, если взять длиной 0.5км - то все Двадцать.        Итак, Ответ: {Северный полюс}U{счетное семейство параллелей около    южного полюса}",
        "Ответ: Источники и прецеденты использования"
    ],
    "109021": [
        "Пространственные многоугольники",
        "Сложность: 4+",
        "Классы: 10,11",
        "Условие: Около сферы описан пространственный четырёхугольник. Доказать, что точки касания лежат в одной плоскости.",
        "Решение: Решение 1"
    ],
    "77916": [
        "Пространственные многоугольники",
        "Сложность: 4+",
        "Классы: 10,11",
        "Условие: Около сферы описан пространственный четырёхугольник. Докажите, что четыре точки касания лежат в одной плоскости.",
        "Решение: Пусть сфера касается сторон AB, BC, CA и AD в точках K, L, M и N соответственно. Тогда AN = AK, BK = BL, CL = CM и DM = DN. Поэтому"
    ],
    "76439": [
        "Касательные к сферам",
        "Сложность: 6+",
        "Классы: 10,11",
        "Условие: В пространстве расположены 3 плоскости и шар. Сколькими различными способами можно поместить в пространстве второй шар так, чтобы он касался трёх данных плоскостей и первого шара? (",
        "Решение: Ответ:",
        "Ответ: O"
    ],
    "76460": [
        "Пересекающиеся сферы",
        "Сложность: 6+",
        "Классы: 10,11",
        "Условие: На какое самое большее число частей можно разбить пространство пятью сферами?",
        "Решение: Пусть",
        "Ответ: На 30 частей."
    ],
    "77951": [
        "Сфера, вписанная в трехгранный угол",
        "Сложность: 3+",
        "Классы: 11",
        "Условие: В трёхгранный угол с вершиной S вписана сфера с центром в точке O.   Докажите, что плоскость, проходящая через три точки касания, перпендикулярна к   прямой SO.",
        "Решение: Пусть A, B и C – точки касания сферы с гранями. Радиус OA перпендикулярен касательной SA, поэтому ∠SAO = 90°. Аналогично ∠SBO = ∠SCO = 90°. В прямоугольных треугольниках SAO, SBO и SCO катеты AO, BO и CO равны (они равны радиусу сферы), поэтому равны и сами треугольники. Следовательно, проекции вершин A, B и C на гипотенузу SO совпадают. Но это и означает, что прямая SO перпендикулярна плоскости ABC."
    ],
    "35073": [
        "Пространственные многоугольники",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Стороны AB, BC, CD, DA пространственного четырёхугольника ABCD касаются некоторой сферы в точках K, L, M, N соответственно.   Докажите, что точки K, L, M, N лежат в одной плоскости.",
        "Подсказка: Докажите, что прямые KL, MN и AC пересекаются в одной точке или параллельны; воспользуйтесь при этом теоремой Менелая.",
        "Решение: Поскольку отрезки касательных, проведённых из одной точки к сфере, равны, можно обозначить AN = AK = a, BK = BL = b, CL = CM = c,  DM = DN = d. Заметим, что точки K и L лежат в плоскости (ABC). Рассмотрим два случая.    1) KL || AC. Тогда по теореме Фалеса a = c; значит, и MN || AC || KL.     2) Прямые KL и AC пересекаются в точке O. По теореме Менелая (для треугольника ABC и секущей KL) AK/KB·BL/LC·CO/AO = 1, т.е. CO/AO = b/a·c/b = c/a. Значит, AN/ND·DM/MC·CO/AO = a/d·d/c·c/a = 1. По теореме Менелая точки O, M, N лежат на одной прямой, следовательно, точки K, L, M, N лежат в одной плоскости."
    ],
    "115389": [
        "Неравенства с объемами",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: На левую чашу весов положили два шара радиусов3 и5, ана правую— один шар радиуса8. Какая из чаш перевесит? (Все шары изготовлены целиком из одного и того же материала.)",
        "Решение: Заметим, что два меньших шара, если их поставить рядом, поместятся внутрь большого. Значит, их суммарный объем меньше.",
        "Ответ: Перевесит правая чаша весов."
    ],
    "87097": [
        "Углы между прямыми и плоскостями",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Высота правильной треугольной призмы ABCA'B'C' равна h. Точка D расположена на ребре AB. Прямая C'D образует угол 30° с плоскостью AA'C и угол arcsin ¾ с плоскостью ABC. Найдите:     а) сторону основания призмы;     б) радиус шара с центром на отрезке C'D, касающегося плоскостей ABC и AA'C'C.",
        "Ответ: а) ;  б) ."
    ],
    "87098": [
        "Углы между прямыми и плоскостями",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Ребро куба",
        "Ответ: Ю)"
    ],
    "111296": [
        "Площадь сечения",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Сторона основания",
        "Ответ: 1)"
    ],
    "111297": [
        "Площадь сечения",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Сторона основания",
        "Ответ: 1)"
    ],
    "79322": [
        "Принцип Дирихле (площадь и объем)",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На сферическом Солнце обнаружено конечное число круглых пятен, каждое из которых занимает меньше половины поверхности Солнца. Эти пятна предполагаются замкнутыми (т.е. граница пятна принадлежит ему) и не пересекаются между собой. Доказать, что на Солнце найдутся две диаметрально противоположные точки, не покрытые пятнами.",
        "Решение: Рассмотрим пятно самого большого радиуса. Слегка увеличим радиус содержащего его круга так, чтобы он снова был меньше радиуса Солнца и этот круг не пересекался с остальными пятнами. Отразим границу круга относительно центра Солнца. Полученная окружность не может быть полностью покрыта одним пятном, потому что радиус окружности больше радиуса любого пятна. Но она не может быть полностью покрыта и несколькими пятнами, потому что пятна замкнутые и не пересекаются между собой. Любая непокрытая точка окружности и диаметрально противоположная ей точка не покрыты пятнами."
    ],
    "116524": [
        "Углы между прямыми и плоскостями",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: В прямоугольном параллелепипеде   ABCDA1B1C1D1 четыре числа   – длины рёбер и диагонали AC1 – образуют арифметическую прогрессию с   положительной разностью d, причём AA1 < AB < BC.   Две внешне касающиеся друг друга сферы одинакового неизвестного радиуса R расположены   так, что их центры лежат внутри параллелепипеда, причём первая сфера касается граней   ABB1A1, ADD1A1,   ABCD, а вторая – граней BCC1B1,   CDD1C1,   A1B1C1D1.   Найдите: а) длины рёбер параллелепипеда; б) угол между прямыми   CD1 и AC1; в) радиус R.",
        "Решение: P>а) Пусть",
        "Ответ: а) ,   ,   ;"
    ],
    "66251": [
        "Тетраэдр (прочее)",
        "Сложность: 5",
        "Классы: 10,11",
        "Условие: В тетраэдр ABCD вписана сфера с центром O, касающаяся его граней BCD, ACD, ABD и ABC в точках A1, B1, C1 и D1 соответственно.     а) Пусть Pa – такая точка, что точки, симметричные ей относительно прямых OB, OC и OD, лежат в плоскости BCD. Точки Pb, Pc и Pd определяются аналогично. Докажите, что прямые A1Pa, B1Pb, C1Pc и D1Pd пересекаются в некоторой точке P.    б) Пусть I – центр сферы, вписанной в тетраэдр A1B1C1D1; A2 – точка пересечения прямой A1I с плоскостью B1C1D1; B2, C2, D2 определены аналогично. Докажите, что P лежит внутри тетраэдра A2B2C2D2.",
        "Решение: а) Пусть Ba – второй конец диаметра A1Ba описанной окружности треугольника A1С1D1 с центром Ob и радиусом RB. Точки Ca, Da, Oa и т.д. определим аналогично. Обозначим вписанную сферу тетраэдра ABCD через ω, а её радиус через r. Пусть da(X) – расстояние от точки X до плоскости (B1C1D1), аналогично определим db(X) и т.д.     Очевидно, Ba симметрична A1 относительно BO. Так как плоскость (BCD) касается ω, то и PaBa касается ω. Пусть Q – проекция Pa на плоскость (A1С1D1). ∠PaBaO = 90°, значит, треугольники PaQBa и BaOaO подобны, и db(Pa) : RB = PaBa : r. Аналогично  dc(Pa) : RC = PaCa : r и dd(Pa) : RD = PaDa : r. Поскольку PaBa = PaCa = PaDa (как касательные к сфере), то расстояния db(Pa), dc(Pa), dd(Pa) от Pa до граней тетраэдра A1В1С1В1 относятся, как RB : RC : RD. Аналогично расстояния от Pb до соответствующих граней относятся, как RA : RC : RD, и такие же пропорции верны для Pc и Pd.     Но геометрическим местом точек с фиксированным отношением расстояний до трёх данных плоскостей является прямая, проходящая через общую точку этих плоскостей, а геометрическим местом точек с данным отношением расстояний до двух плоскостей – плоскость, проходящая через линию их пересечения. Следовательно, прямые A1Pa и B1Pb лежат в одной плоскости и пересекаются в некоторой точке P. Через эту же точку проходят прямые C1Pc и D1Pd."
    ],
    "34903": [
        "Сферы (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: На одной из двух данных пересекающихся сфер взяты точки A и B, на другой – C и D. Отрезок AC проходит через общую точку сфер. Отрезок BD проходит через другую общую точку сфер и параллелен прямой, содержащей центры сфер. Докажите, что проекции отрезков AB и CD на прямую AC равны.",
        "Подсказка: Вначале рассмотрите сечение, проходящее через B, D и центры сфер.",
        "Решение: Пусть E и F – общие точки сфер, лежащие соответственно на AC и BD, P и Q – центры сфер, G – точка, симметричная F относительно прямой PQ. Очевидно, G – также общая точка сфер, причём BG и DG – диаметры сфер. Будем обозначать через X' проекцию произвольной точки X на AC. Ясно, что что P' – середина хорды AE первой сферы, Q' – середина хорды EC второй сферы. В то же время P' – середина отрезка B'G' (так как P – середина отрезка BG), а Q' – середина отрезка G'D'. Отсюда легко следует, что AB' = G'E = D'C."
    ],
    "86994": [
        "Касательные к сферам",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В треугольной пирамиде",
        "Решение: Пусть",
        "Ответ: 36.00"
    ],
    "87145": [
        "Касающиеся сферы",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Высота цилиндра равна",
        "Решение: Пусть $R$ – радиус основания цилиндра, $h$ – его высота, $O_1$ – центр сферы, касающейся верхнего основания цилиндра, $O_2$ и $O_3$   – центры сфер, касающихся нижнего основания (рис.1).",
        "Ответ: $\\frac{r (3\\sqrt{2}+4)}{4}.$"
    ],
    "87337": [
        "Сферы (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: На сфере радиуса",
        "Решение: Пусть",
        "Ответ: 20.00"
    ],
    "87339": [
        "Сферы (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Через точку",
        "Ответ: 12.00"
    ],
    "87374": [
        "Касательные к сферам",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Ребро куба",
        "Ответ: 1.00"
    ],
    "104040": [
        "Окружности на сфере",
        "Сложность: 4",
        "Классы: 7,8,9,10",
        "Условие: Турист вышел утром из палатки, прошел 10 км на юг, потом 10 км на восток, 10 км на север и оказался у своей палатки. В палатке он обнаружил медведя."
    ],
    "108829": [
        "Касательные к сферам",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В основании треугольной пирамиды",
        "Ответ: 450.00"
    ],
    "110315": [
        "Касающиеся сферы",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Центры четырёх сфер радиуса",
        "Решение: Пусть"
    ],
    "87449": [
        "Касательные к сферам",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Ребро правильного тетраэдра равно",
        "Решение: Пусть сфера с центром",
        "Ответ: 3.00"
    ],
    "111369": [
        "Касающиеся сферы",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Докажите, что если в треугольной пирамиде сумма длин противоположных рёбер одна и та же для любой пары таких рёбер, то вершины этой пирамиды являются центрами четырёх шаров, попарно касающихся друг друга.",
        "Решение: Пусть"
    ],
    "111728": [
        "Пересекающиеся сферы",
        "Сложность: 4+",
        "Классы: 10,11",
        "Условие: В пространстве даны две пересекающиеся сферы разных радиусов и  точка A, принадлежащая обеим сферам. Докажите, что в пространстве существует точка B, обладающая следующим свойством: если через точки A и B провести произвольную окружность, то точки ее повторного пересечения с данными сферами будут равноудалены от B.",
        "Решение: Проведём через A прямую, параллельную линии центров данных сфер, и найдём вторые точки C, D ее пересечения со сферами. Покажем, что середина B отрезка CD – искомая точка. Возьмем произвольную окружность, проходящую через A и B, и рассмотрим сечения сфер плоскостью этой окружности. Эти сечения представляют собой две окружности, одна из которых проходит через точки A и C, другая – через A и D. Центрами этих окружностей будут проекции O1, O2 центров сфер на плоскость сечения, следовательно, прямые O1O2 и CD параллельны. Поэтому достаточно доказать плоский аналог утверждения задачи.     Пусть X1, X2 – вторые точки пересечения окружности, проходящей через A и B, с данными окружностями; A' – вторая точка пересечения данных окружностей. Тогда O1O2 – средняя линия треугольника A'CD, то есть CB = BD = O1O2. Следовательно, O1B = O2D = O2X2, O2B = O1C = O1C1. Кроме того, центр O окружности ABX1X2O1 и O2, поэтому   ∠BO1X1 = ∠BO1O + ∠OO1X1 = ∠BO1O + ∠AO1O =  ∠AO2O + ∠BO2O = ∠BO2O + ∠OO2X2 = ∠BO2X2. Таким образом, треугольники O1X1B и O2BX2 равны, а значит, BX1 = BX2."
    ],
    "79298": [
        "Сфера, касающаяся ребер угла",
        "Сложность: 4+",
        "Классы: 9,10,11",
        "Условие: Можно ли разместить в пространстве четыре свинцовых шара и точечный источник света так, чтобы каждый исходящий из источника света луч пересекал хотя бы один из шаров?",
        "Решение: Ответ:",
        "Ответ: O"
    ],
    "79625": [
        "Сферическая геометрия и телесные углы",
        "Сложность: 5",
        "Классы: 10,11",
        "Условие: Аладдин побывал во всех точках экватора, двигаясь то на восток, то на запад,  а иногда мгновенно перемещаясь в диаметрально противоположную точку Земли.  Докажите, что был отрезок времени, за которое разность расстояний, пройденных  Аладдином на восток и на запад, не меньше половины длины экватора.",
        "Решение: Сначала склеим противоположные точки экватора. Тогда мы можем считать, что Аладдин двигался не по экватору, а по полученной после склейки окружности, ни в какой момент не телепортировался и побывал во всех её точках. Пусть   2πφ("
    ],
    "78510": [
        "Окружности на сфере",
        "Сложность: 5",
        "Классы: 10,11",
        "Условие: Доказать, что на сфере нельзя так расположить три дуги больших окружностей в",
        "Решение: Предположим, что требуемое расположение  возможно. Проведем большие окружности сферы, содержащие  данные дуги.   Пусть"
    ],
    "73537": [
        "Окружности на сфере",
        "Сложность: 7",
        "Классы: 10,11",
        "Условие: Дана сфера",
        "Решение: Каждой окружности на сфере можно сопоставить ее центр на сфере– конец  радиуса сферы, проходящего через центр окружности (никогда не лежащий на сфере).  Эту точку мы будем называть центром окружности в кавычках, подчеркивающих,  что это не обычный центр (рис. 1",
        "Ответ: n"
    ],
    "116514": [
        "Тригонометрические соотношения в прямоугольном треугольнике",
        "Сложность: 2+",
        "Классы: 10,11",
        "Условие: Три сферы попарно касаются внешним образом, а также касаются некоторой плоскости в   вершинах прямоугольного треугольника с катетом 1 и противолежащим углом 30°.   Найдите радиусы сфер.",
        "Подсказка: Если окружности радиусов r и R касаются внешним образом, то отрезок   их общей внешней касательной, заключённый между точками касания равен   .",
        "Решение: Пусть ABC – прямоугольный треугольник, в котором ∠C = 90°,   ∠A = 90°, BC = 1. Тогда AB = 2,   . Обозначим через x, y и z   радиусы сфер с центрами O1, O2 и O3,   касающихся плоскости треугольника ABC в точках A, B и C   соответственно и попарно касающихся между собой внешним образом (рис.1).",
        "Ответ: ответ"
    ],
    "78779": [
        "Пространственные многоугольники",
        "Сложность: 3",
        "Классы: 11",
        "Условие: Дана замкнутая пространственная ломаная с вершинами",
        "Решение: Отрезки, прилегающие к вершине"
    ],
    "109280": [
        "Касательные к сферам",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: В треугольнике",
        "Решение: Пусть",
        "Ответ: 6.00"
    ]
}