{
    "56746": [
        "Площадь (прочее)",
        "Сложность: 2",
        "Классы: 9",
        "Условие: Докажите, что площадь выпуклого четырехугольника равна"
    ],
    "98652": [
        "Отношения площадей подобных фигур",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: Население Китая составляет один миллиард человек. Казалось бы, на карте Китая с масштабом 1 : 1000000 (1 см : 10 км) сможет поместиться в миллион раз меньше людей, чем находится на всей территории страны. Однако на самом деле не только 1000, но даже 100 человек не смогут разместиться на этой карте. Можете ли Вы объяснить это противоречие?",
        "Подсказка: Обратите внимание, речь идет не о линейных размерах, а о площади.",
        "Решение: Поскольку речь идет не о линейных размерах, а о площади, то и число людей надо уменьшить не в 1000000, а в 1000000"
    ],
    "111658": [
        "Площадь фигуры равна сумме площадей фигур, на которые она разбита",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Точка O, лежащая внутри правильного шестиугольника, соединена с вершинами. Возникшие при этом шесть треугольников раскрашены попеременно в красный и синий цвет. Докажите, что сумма площадей красных треугольников равна сумме площадей синих.",
        "Решение: Пусть сторона правильного шестиугольника равна a. Прямые, содержащие стороны шестиугольника, принадлежащие красным треугольникам, задают равносторонний треугольник со стороной 3a. Обозначим его высоту через h, а площадь – через S.     Сумма расстояний от точки O до сторон этого треугольника равна h (см. задачу 55277). С другой стороны, это сумма высот, проведённых из общей вершины O красных треугольников, значит, сумма площадей красных треугольников равна S/3.     Аналогично сумма площадей синих треугольников равна S/3."
    ],
    "115637": [
        "Отношение площадей треугольников с общим углом",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На сторонах",
        "Решение: Обозначим",
        "Ответ: 15."
    ],
    "115638": [
        "Отношение площадей треугольников с общим углом",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В треугольник ABC со сторонами AB = 18 и BC = 12 вписан параллелограмм BKLM, причём точки K, L и M лежат на сторонах AB, AC и BC соответственно. Известно, что площадь параллелограмма составляет 4/9 площади треугольника ABC. Найдите стороны параллелограмма.",
        "Решение: Обозначим BM = KL = x, BK = LM = y, SABC = S. Тогда SBKLM = 4S/9, 2S/9 = ½ SBKLM = SBKM = x/12·y/18 S, то есть xy = 48. Треугольник AKL подобен треугольнику ABC, поэтому KL : BC = AK : AB, или x/12 = 18–y/18, откуда 3x + 2y = 36. Из системы xy = 48, 3x + 2y = 36 находим, что x = 8, y = 6 или x = 4, y = 12.",
        "Ответ: 8, 6 или 4, 12."
    ],
    "103947": [
        "Площадь фигуры равна сумме площадей фигур, на которые она разбита",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Найдите площадь фигур, изображенных на рисунке."
    ],
    "35011": [
        "Площадь треугольника (через две стороны и угол между ними)",
        "Сложность: 2+",
        "Классы: 9",
        "Условие: Диагонали четырёхугольника ABCD пересекаются в точке O.   Докажите, что произведение площадей треугольников AOB и COD равно произведению площадей треугольников BOC и DOA.",
        "Подсказка: Используйте формулу, выражающую площадь треугольника через две стороны и угол между ними.",
        "Решение: SAOB = ½ OA·OB sin φ, SBOC = ½ OB·OC sin φ, SCOD = ½ OC·OD sin φ, SDOA = ½ OD·OA sin φ, где φ – угол между диагоналями. Значит,  SAOBSCOD = ¼ OA·OB·OC·OD sin²φ = SBOCSDOA."
    ],
    "35015": [
        "Вспомогательная площадь. Площадь помогает решить задачу",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите, что сумма расстояний от любой точки внутри  равностороннего треугольника до его сторон не зависит от положения  точки.",
        "Подсказка: Выразите площадь равностороннего треугольника, используя расстояния  от точки до его сторон.",
        "Решение: Пусть точка P находится внутри равностороннего треугольника ABC.  Обозначим за a сторону треугольника и за S его площадь, также  обозначим  за h"
    ],
    "52687": [
        "Площадь треугольника (через полупериметр и радиус вписанной или вневписанной окружности)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: К окружности, вписанной в равнобедренный треугольник с основанием 12 и высотой 8, проведена касательная, параллельная основанию.   Найдите длину отрезка этой касательной, заключённого между сторонами треугольника.",
        "Подсказка: Найдите коэффициент подобия отсеченного и данного треугольников.",
        "Решение: Треугольник, отсечённый данной касательной, подобен исходному. Чтобы найти коэффициент подобия, вычтем из высоты исходного треугольника диаметр вписанной окружности, который найдём по формуле площади треугольника (2r = S/p = 96/32 = 3) и разделим эту разность на 8. Получим k = ¼. Поэтому искомый отрезок равен 12 : 4 = 3.",
        "Ответ: 3."
    ],
    "52786": [
        "Площадь фигуры равна сумме площадей фигур, на которые она разбита",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Дан треугольник со сторонами 10, 24 и 26. Две меньшие стороны являются касательными к окружности, центр которой лежит на большей стороне.   Найдите радиус окружности.",
        "Подсказка: Площадь данного треугольника равна сумме площадей треугольников, на которые он разбивается отрезком, соединяющим вершину большего угла с центром данной окружности.",
        "Решение: Заметим, что данный треугольник – прямоугольный   (12² + 5² = 13²). Пусть r – искомый радиус.      Отрезок, соединяющий вершину прямого угла с центром данной окружности, разбивает треугольник на два треугольника. Радиусы окружности, проведённые в точки касания, являются высотами этих треугольников. Сумма площадей получившихся треугольников равна площади данного треугольника, то есть   5r + 12r = 120. Отсюда r = 120/17.",
        "Ответ: 120/17."
    ],
    "52793": [
        "Площадь четырехугольника",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В остроугольном треугольнике ABC проведены высоты AM и CN, O – центр описанной окружности. Известно, что ∠B = β, а площадь четырёхугольника NOMB равна S. Найдите AC.",
        "Подсказка: Диагонали четырёхугольника NOMB взаимно перпендикулярны.",
        "Решение: На касательной к описанной окружности Ω, проведённой в точке B, отметим точку P так, чтобы она и точка C лежали по разные стороны от прямой AB. Поскольку ∠ABP = ∠C = ∠BNM, то BP || MN, а OB ⊥  MN. Треугольник BMN подобен треугольнику BAC с коэффициентом cos β, значит, MN = AC cos β.",
        "Ответ: 2."
    ],
    "53179": [
        "Площадь трапеции",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Окружность касается сторон AB и AD прямоугольника ABCD и  пересекает сторону DC в единственной точке F и сторону BC в  единственной точке E.   Найдите площадь трапеции AFCB, если AB = 32, AD = 40 и BE = 1.",
        "Решение: Пусть O – центр данной окружности, R – её радиус, P и K – точки касания окружности со сторонами AB и AD, K – проекция точки E на OM, L – проекция точки F на ON. Тогда KE = MB = 32 – R.     По теореме Пифагора (R – 1)² + (32 – R)² = R², откуда R = 25 (второй корень R = 41 не удовлетворяет условию R < 32).     LO² = OF² – LF² = R² – (40 – R)² = 25² – 15² = 20², FC = LO + MB = 27.     Следовательно, SAFCB = ½ (AB + FC)BC = ½ (32 + 27)·40 = 1180.",
        "Ответ: 1180."
    ],
    "54283": [
        "Площадь трапеции",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Диагональ равнобедренной трапеции делит её тупой угол пополам. Меньшее основание трапеции равно 3, периметр равен 42.   Найдите площадь трапеции.",
        "Подсказка: Докажите, что большее основание трапеции равно боковым сторонам.",
        "Решение: Пусть BC и AD – основания трапеции ABCD, BC = 3, CA – биссектриса угла BCD. Поскольку ∠CAD = ∠BCA = ∠DCA,   то треугольник ACD – равнобедренный. Поэтому AD = CD = AB = (42 – 3) : 3 = 13.     Опустим перпендикуляр CK на основание AD. Тогда DK = ½ (АD – BC) = 5, CK² = CD² – KD² = 12².     Следовательно, SABCD = ½ (AD + BC)·CK = 96.",
        "Ответ: 96."
    ],
    "54363": [
        "Отношение площадей треугольников с общим основанием или общей высотой",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В прямоугольном треугольнике ABC (∠C = 90°) проведены высота CD и медиана CE. Площади треугольников ACD и ECB равны соответственно 4 и 10. Найдите AB.",
        "Подсказка: См. задачу 54362.",
        "Ответ: 10."
    ],
    "54955": [
        "Отношение площадей треугольников с общим основанием или общей высотой",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На сторонах AB и AD параллелограмма ABCD взяты точки M и N так, что прямые MC и NC разбивают параллелограмм на три равновеликие части.   Найдите MN, если BD = d.",
        "Подсказка: Найдите отношения, в которых точки M и N делят стороны AB и AD.",
        "Решение: Поскольку SABC = SCDA, SMBC = 2/3 SABC, то AM/MB = ½. Аналогично AN/ND = ½. Следовательно, треугольник AMN подобен треугольнику ABD с коэффициентом AM/AB = 1/3. Поэтому MN = 1/3 BD = d/3.",
        "Ответ: d/3."
    ],
    "54987": [
        "Отношение площадей треугольников с общим углом",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Площадь треугольника ABC равна 16. На сторонах AB, BC и AC этого треугольника взяты соответственно точки P, Q и R, причём прямая PQ параллельна AC, а прямая BR проходит через точку пересечения прямых PC и AQ. Известно, что S – точка пересечения PQ и BR, и на отрезке BS взята точка T так, что  BT : TS : SR = 1 : 2 : 5. Найдите площадь треугольника PTB.",
        "Ответ: 3/8."
    ],
    "55001": [
        "Отношение площадей подобных треугольников",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Найдите площадь трапеции ABCD (AD || BC), если её  основания относятся как 5 : 3, а площадь треугольника ADM равна 50, где M – точка пересечения прямых AB и CD.",
        "Подсказка: Отношение площадей подобных треугольников равно квадрату коэффициента подобия.",
        "Решение: Пусть BC/AD = 3/5. Коэффициент подобия треугольников MBC и MAD равен 3/5. Поэтому SMBC = 9/25 SMAD = 18.     Следовательно, SABCD = SMAD – SMBC = 50 – 18 = 32.",
        "Ответ: 32."
    ],
    "55010": [
        "Отношение площадей треугольников с общим углом",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В треугольнике ABC угол C равен 30°, а угол A – острый. Перпендикулярно стороне BC проведена прямая, отсекающая от   треугольника ABC треугольник CNM (точка N лежит между вершинами B и C). Площади треугольников CNM и ABC относятся, как 3 : 16. Отрезок MN равен половине высоты BH треугольника ABC. Найдите отношение AH : HC.",
        "Подсказка: Треугольники BHC и MNC подобны.",
        "Решение: Заметим, что CN/BC·CM/AC = SMNC/SABC = 3/16.     Треугольник MNC подобен треугольнику BHC с коэффициентом  ½, поэтому CN/CH = ½, CM/CB = ½. Значит, CN/AC = 3/8, а  CH/AC = ¾. Следовательно,  AH/HC = 1/3.",
        "Ответ: 1 : 3."
    ],
    "55015": [
        "Площадь фигуры равна сумме площадей фигур, на которые она разбита",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Диагонали выпуклого четырёхугольника ABCD пересекаются в точке E. Известно, что площади треугольников ABE и CDE равны между собой, диагональ AC является биссектрисой угла A, AB = 4. Найдите BC.",
        "Подсказка: Докажите, что BC || AD.",
        "Решение: Согласно задаче 35162 CB || AD. Значит, ∠BCA = ∠DAC = ∠BAC, то есть треугольник ABC – равнобедренный и BC = AB = 4.",
        "Ответ: 4."
    ],
    "56751": [
        "Медиана делит площадь пополам",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что медианы разбивают треугольник на шесть равновеликих треугольников.",
        "Решение: Треугольники, прилегающие к одной стороне, имеют равные основания и общую высоту, поэтому они равновелики. Пусть"
    ],
    "55021": [
        "Отношение площадей треугольников с общим углом",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В треугольнике ABC из точки E стороны BC проведена прямая,  параллельная высоте BD и пересекающая сторону AC в точке F.  Отрезок EF делит треугольник ABC на две равновеликие фигуры.  Найдите EF, если BD = 6, AD : DC = 2 : 7.",
        "Подсказка: SCEF/SCBA = CE/CB·CF/AC.",
        "Решение: По условию    Отсюда CE/CB·CF/CD = 9/14.     По теореме Фалеса CE : CB = CF : CD. Поэтому (CE/CB)2 = 9/14, EF = BD·CE/CB = 9 .",
        "Ответ: 9 ."
    ],
    "55022": [
        "Отношение площадей треугольников с общим основанием или общей высотой",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В трапеции MPQF основания MF = 24, PQ = 4. Высота трапеции равна 5. Точка N делит боковую сторону на отрезки MN и NP, причём MN = 3NP.   Найдите площадь треугольника NQF.",
        "Подсказка: Продолжите FN до пересечения с прямой QP и рассмотрите  образовавшиеся подобные треугольники.",
        "Решение: Продолжим отрезок FN до пересечения с прямой QP в точке A. Из подобия треугольников APN и FMN находим, что  AN : NF = PN : NM = 1 : 3, AP = 1/3 MF = 8.     Значит, AQ = AP + PQ = 12, SAQF = ½ AQ·5 = 30.     Следовательно, SNQF = FN/AF·SAQF = ¾·30 = 45/2.",
        "Ответ: 22,5."
    ],
    "55024": [
        "Отношение площадей треугольников с общим углом",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Высота трапеции ABCD равна 7, основания AD и BC равны  соответственно 8 и 6. Через точку E, лежащую на стороне CD,   проведена прямая BE, которая делит диагональ AC в точке O в  отношении AO : OC = 3 : 2. Найдите площадь треугольника OEC.",
        "Подсказка: SOEC = CE/CD·CO/CA SACD.",
        "Решение: Продолжим отрезок BE до пересечения с прямой AD в точке M. Из подобия треугольников BOC и MOA следует, что BC : AM = CO : OA. Отсюда  AM = BC·OA/OC = 9, DM = AM – AD = 1.     Поэтому коэффициент подобия треугольников BCE и MDE равен  BC/DM = 6. Значит, CE/DE = 6, CE/CD = 6/7.     Следовательно, SOEC = 6/7·2/5 SACD = 6/35·8·7 = 48/5.",
        "Ответ: 9,6."
    ],
    "55025": [
        "Отношение площадей треугольников с общим углом",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В параллелограмме ABCD на диагонали AC взята точка E, причём расстояние AE составляет треть AC, а на стороне AD взята точка F, причём расстояние AF составляет четверть AD. Найдите площадь параллелограмма ABCD, если известно, что площадь  четырёхугольника ABGE, где G – точка пересечения прямой FE со стороной BC, равна 8.",
        "Подсказка: Найдите отношение CG/CB.",
        "Решение: Из подобия треугольников GEC и FEA следует, что  GC = 2AF = ½ AD = ½ BC.   Поэтому SGEC = CG/CB·CE/CA SABC = 1/3 SABC.     Следовательно, SABGE = 2/3 SABC, SABCD = 2SABC = 3 SABGE = 24.",
        "Ответ: 24."
    ],
    "55040": [
        "Отношение площадей подобных треугольников",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В равнобедренном треугольнике ABC (AB = BC) проведены  высоты AA1, BB1 и CC1.  Найдите отношение площади треугольника A1B1C1 к площади треугольника ABC, если   AB/A1B1 = .",
        "Подсказка: cos∠C = .",
        "Решение: Обозначим ∠C = ∠A = α,  SABC = S. Треугольник A1CB1 подобен треугольнику ABC с коэффициентом cos α = A1B1/AB = . Поэтому  SA1CB1 = SC1AB1 = S/3.     Треугольник A1BC1 подобен треугольнику ABC с коэффициентом BA1/BA = cos(180° – 2α) = – cos 2α = 1 – 2cos²α = 1/3.     Поэтому SA1BC1 = S/9. Следовательно, SA1B1C1 = SABC – 2SA1CB1 – SA1BC1 = S – 2S/3 – S/9 = 2S/9.",
        "Ответ: 2 : 9."
    ],
    "55057": [
        "Отношение площадей треугольников с общим основанием или общей высотой",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В трапеции ABCD даны основания AD = 8 и BC = 4. На продолжении стороны BC выбрана такая точка M, что прямая AM отсекает от трапеции треугольник, площадь которого в четыре раза меньше площади трапеции. Найдите CM.",
        "Подсказка: Найдите отношение CK : KD, где K – точка пересечения AM и CD.",
        "Решение: Обозначим S = SABCD. Пусть K – точка  пересечения прямой AM со стороной CD. Тогда по условию   SAKD = S/4.     Поскольку AD = 2BC, то SACD  = 2SABC = 2S/3, SAKC = 2S/3 – S/4 = 5S/12.     Поэтому CK/KD = SAKC/SAKD = 5/3.     Из подобия треугольников AKD и MKC следует, что  CM = AD·CK/KD = 40/3.",
        "Ответ: 40/3."
    ],
    "55059": [
        "Отношение площадей треугольников с общим основанием или общей высотой",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В трапеции ABCD даны основания AD = 12 и BC = 3. На продолжении стороны BC выбрана такая точка M, что прямая AM отсекает от трапеции треугольник, площадь которого составляет ¾ площади трапеции. Найдите CM.",
        "Подсказка: См. задачу 55057.",
        "Ответ: 0,8."
    ],
    "55060": [
        "Отношение площадей треугольников с общим основанием или общей высотой",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В трапеции ABCD даны основания AD = 16 и BC = 9. На продолжении BC выбрана такая точка M, что CM = 3,2.   В каком отношении прямая AM делит площадь трапеции ABCD?",
        "Подсказка: Пусть прямая AM пересекает сторону CD в точке K. Воспользуйтесь подобием треугольников CKM и DKA.",
        "Ответ: 8 : 15."
    ],
    "55062": [
        "Отношение площадей треугольников с общим основанием или общей высотой",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В параллелограмме ABCD на стороне AB взята точка M, причём  AB = 3AM. N – точка пересечения прямых AC и DM.   Найдите отношение площади треугольника AMN к площади всего параллелограмма.",
        "Подсказка: Найдите отношение MN : ND.",
        "Решение: Из подобия треугольников AMN и CDN следует, что  MN : ND = AN : NC = AM : CD = 1 : 3. Поэтому SAMN = ¾·1/3 SABC = 1/24 SABCD.",
        "Ответ: 1 : 24."
    ],
    "55063": [
        "Отношение площадей треугольников с общим углом",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В трапеции ABCD основание AB в три раза больше основания CD. На основании CD взята точка M, причём MC = 2MD. N – точка пересечения прямых BM и AC. Найдите отношение площади треугольника MNC к площади всей трапеции.",
        "Решение: SADC = 1/3 SABC = ¼ SABCD, поскольку AB = 3 CD.     Из подобия треугольников MNC и BNA следует, что  MN : NB = MC : AB = 2 : 9.     Поэтому SMNC = 2/3·2/11 SADC = 1/33 SABCD.",
        "Ответ: 1 : 33."
    ],
    "102499": [
        "Отношение площадей подобных треугольников",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Прямая, параллельная стороне AB треугольника ABC, пересекает сторону BC в точке M, а сторону AC – в точке N. Площадь треугольника MCN в два раза больше площади трапеции ABMN. Найдите CM : MB.",
        "Подсказка: Площади подобных треугольников относятся как квадраты соответствующих сторон.",
        "Решение: Обозначим SABMN = S. Тогда SCMN = 2S и SABC = 3S.     Треугольник MCN подобен треугольнику BCA c коэффициентом подобия       Следовательно,",
        "Ответ: 2 + ."
    ],
    "55074": [
        "Отношение площадей треугольников с общим углом",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Диагональ KM трапеции KLMN в 3 раза длиннее отрезка KP  этой диагонали. Основание KN трапеции в 3 раза длиннее основания LM.   Найдите отношение площади трапеции KLMN к площади треугольника KPR, где R – точка пересечения прямой PN и стороны KL.",
        "Подсказка: Проведите через точку P прямую, параллельную основаниям трапеции, до пересечения со стороной KL в точке Q.",
        "Ответ: 32 : 3."
    ],
    "101874": [
        "Площадь фигуры равна сумме площадей фигур, на которые она разбита",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Через точку",
        "Подсказка: Пусть точка",
        "Решение: Пусть точка"
    ],
    "102500": [
        "Отношение площадей подобных треугольников",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Прямая, параллельная стороне LM треугольника KLM, пересекает сторону KL в точке A, а сторону KM – в точке B. Площадь трапеции ALMB в три раза меньше площади треугольника ABK. Найдите MB : MK.",
        "Подсказка: См. задачу 102499.",
        "Ответ: 1 – ."
    ],
    "102319": [
        "Площадь круга, сектора и сегмента",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите или опровергните следующее утверждение: круг площадью",
        "Подсказка: Если",
        "Решение: Поскольку",
        "Ответ: Утверждение верно."
    ],
    "108971": [
        "Площадь треугольника (через полупериметр и радиус вписанной или вневписанной окружности)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Доказать, что если в треугольнике ABC со стороной BC = 1 радиус ra вневписанной окружности вдвое больше радиуса r вписанной окружности, то площадь треугольника численно равна 2r.",
        "Решение: Пусть O и O1 – центры вписанной и вневписанной окружностей."
    ],
    "109022": [
        "Площадь трапеции",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Трапеция, основания которой равны a и b (a > b), рассечена прямой, параллельной основаниям, на две трапеции, площади которых относятся как k : p. Найти длину общей стороны образовавшихся трапеций.",
        "Решение: Обозначим длину отрезка MN через x (см. рис.). Проведём через точку M прямые EF || CD и KL ⊥ AD . Длину отрезка KM обозначим через H1, длину отрезка ML – через H2. Тогда    Из подобия треугольников EMB и FMA  MK : ML = EB : AF, или H1/H2 = x–b/a–x. Следовательно,  x–b/a–x = k(a+x)/p(b+x), откуда",
        "Ответ: ."
    ],
    "110984": [
        "Площадь треугольника (через полупериметр и радиус вписанной или вневписанной окружности)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В равнобедренный треугольник ABC (AB = BC) вписана окружность. Прямая, параллельная стороне BC и касающаяся окружности, пересекает сторону AB в такой точке  N  такой, что AN = &frac38; AB. Найдите радиус окружности, если площадь треугольника ABC равна 12.",
        "Решение: Пусть касательная пересекает основание AC в точке M, а окружность касается прямых MN, AB и AC в точках D, E и H соответственно. Обозначим  BC = AB = a, AH = CH = b. Тогда AE = AH = b, MD = MH, ND = NE,  AE = AN + NE = AN + ND, AH = AM + MH = AM + MD, AE = AH.     Если p' и p – полупериметры подобных треугольников ANM и ABC, то p' = AE = AH = b, p = AB + AH = a + b, p' : p = AN : AB1 = 3 : 8, или b/a+b = &frac38;. Отсюда b = 3a/5. Значит, BH² = AB² – AH² = a² – (3a/5)² = (4a/5)², а так как SABC = AH·BH, то 12 = b·4a/5 = 3a/5·4a/5, откуда a = 5, b = 3. Пусть r – радиус вписанной окружности треугольника ABC. Тогда r = SABC/p = 12/a+b = 3/2.",
        "Ответ: 3/2."
    ],
    "111574": [
        "Площадь треугольника (через две стороны и угол между ними)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Биссектриса, медиана и высота некоторого треугольника, проведённые из трёх разных вершин, пересекаются в одной точке и делят этот треугольник на шесть треугольников (см.рисунок). Площади трёх закрашенных треугольников равны. Верно ли, что исходный треугольник равносторонний?",
        "Решение: Пусть медиана AK, высота BM и биссектриса CT треугольника ABC пересекаются в точке O. Треугольники BOK и COK равновелики, так как у них равные основания (BK = CK) и общая высота. SCOK = ½ CK·CO sin∠OCK, SCOM = ½ CK·CO sin∠OCM, а так как SCOK = SBOK = SCOM и   ∠OCK = ∠OCM, то CM = CK, поэтому треугольники COK и COM равны по двум сторонам и углу между ними. Следовательно,   ∠OKC = ∠OMC = 90°,  значит, медиана AK треугольника ABC является также его высотой, поэтому треугольник ABC – равнобедренный. Кроме того, из равенства CM = CK = ½BC следует, что в прямоугольном   треугольнике BCM катет CM вдвое меньше гипотенузы BC, значит, ∠BCM = 60°. Таким образом, один из углов равнобедренного треугольника ABC равен 60°. Следовательно, этот треугольник – равносторонний.",
        "Ответ: Верно."
    ],
    "78176": [
        "Площадь четырехугольника",
        "Сложность: 2+",
        "Классы: 9,10",
        "Условие: Дан выпуклый четырёхугольник",
        "Решение: Пусть расстояние от точек"
    ],
    "115639": [
        "Отношение площадей треугольников с общим основанием или общей высотой",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Точки D и E расположены на стороне AC треугольника   ABC. Прямые BD и BE разбивают медиану AM треугольника ABC на три равных отрезка.   Найдите площадь треугольника BDE, если площадь треугольника ABC равна 1.",
        "Решение: Пусть прямые AD и AE пересекают медиану AM в   точках K и L соответственно, причём точка K лежит между A и L, AK = KL = LM. Ясно, что L – точка пересечения медиан треугольника, поэтому BE – также медиана. Через вершину A проведём прямую, параллельную стороне BC, до пересечения с прямой BD в точке P. Треугольник AKP подобен треугольнику MKB с коэффициентом AK/KM = ½, поэтому AP = ½ BM = ¼ BC. Треугольник ADP подобен треугольнику CDB, значит, AD : DC = AP : BC = 1 : 4, поэтому AD = &frac15; AC, DE = AE – AD = ½ AC – &frac15; AC = 3/10 AC.     Следовательно, SBDE = 3/10 SABC.",
        "Ответ: 0,3."
    ],
    "78554": [
        "Отношение площадей треугольников с общим основанием или общей высотой",
        "Сложность: 2+",
        "Классы: 9,10",
        "Условие: Внутри данного треугольника",
        "Решение: Предположим, что искомая точка"
    ],
    "54900": [
        "Площадь треугольника (через две стороны и угол между ними)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В треугольнике",
        "Подсказка: Пользуясь формулой",
        "Решение: Пусть",
        "Ответ: 5/2."
    ],
    "56747": [
        "Площадь (прочее)",
        "Сложность: 2",
        "Классы: 9",
        "Условие: Пусть",
        "Ответ: S/4."
    ],
    "109437": [
        "Вспомогательная площадь. Площадь помогает решить задачу",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Точка",
        "Решение: Пусть",
        "Ответ: нет, не может."
    ],
    "109008": [
        "Медиана делит площадь пополам",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На продолжении",
        "Решение: Проведём диагональ"
    ],
    "52716": [
        "Площадь треугольника (через полупериметр и радиус вписанной или вневписанной окружности)",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В равносторонний треугольник со стороной a вписана окружность. К окружности проведена касательная, отрезок которой внутри треугольника равен b.   Найдите площадь треугольника, отсечённого этой касательной.",
        "Подсказка: Впишите окружность в отсечённый треугольник.",
        "Решение: Полупериметр p отсечённого треугольника MNB равен a/2. Надо найти его площадь S.",
        "Ответ: ."
    ],
    "55094": [
        "Отношение площадей треугольников с общим углом",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Продолжения сторон AD и BC выпуклого четырёхугольника ABCD  пересекаются в точке M, а продолжения сторон AB и CD – в точке O. Отрезок MO перпендикулярен биссектрисе угла AOD. Найдите отношение площадей треугольников AOD и BOC, если OA = 6, OD = 4, CD = 1.",
        "Подсказка: См. задачу 55092.",
        "Ответ: 2."
    ],
    "101875": [
        "Вспомогательная площадь. Площадь помогает решить задачу",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Через точку L, взятую внутри параллелограмма ABCD, проведены прямые, параллельные его сторонам и пересекающие стороны AB и CD соответственно в точках K и G, а стороны BC и AD соответственно в точках F и M. Докажите, что прямые BM, KD и CL пересекаются в одной точке.",
        "Подсказка: Воспользуйтесь задачей 101874.",
        "Решение: Пусть прямые BM и KD пересекаются в точке N. Проведём через точку N прямые, параллельные сторонам исходного параллелограмма. Пусть прямая, параллельная AB, пересекает стороны BC и AD соответственно в точках P и Q, а вторая прямая – стороны AB и CD соответственно в точках R и S, H – точка пересечения отрезков KG и PQ, E – точка пересечения отрезков RS и MF. Поскольку точка N лежит на диагонали BM параллелограмма ABFM и на диагонали KD параллелограмма AKGD, то SARNQ = SNPFE и   SARNQ = SNHGS (см. задачу 101874). Значит, SNPFE = SNHGS, поэтому параллелограммы  HPFL и ELGS равновелики. Согласно задаче 101874 точка L лежит на диагонали CN параллелограмма NPCS, то есть прямая CL проходит через точку N."
    ],
    "35640": [
        "Перегруппировка площадей",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: В правильном шестиугольнике ABCDEF точки K и L - середины сторон  AB и BC  соответственно. Отрезки DK и EL пересекаются в точке N.  Докажите, что площадь четырехугольника KBLN равна площади  треугольника DEN.",
        "Подсказка: Четырехугольники KBCD и LCDE совмещаются поворотом.",
        "Решение: Совершим поворот на 60"
    ],
    "111655": [
        "Перегруппировка площадей",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: На сторонах AB и CD четырёхугольника ABCD взяты точки M и N так, что AM : MB = CN : ND.   Отрезки AN и DM пересекаются в точке K, а отрезки BN и CM – в точке L. Докажите, что SKMLN = SADK + SBCL.",
        "Решение: Пусть A1, M1 и B1 – проекции точек соответственно A, M и B на прямую CD, F – точка пересечения отрезков MM1 и BA1. Пусть  AM : AB = CN : CD = p : 1. Тогда MM1 = MF + FM1 = AA1·MB/AB + BB1·A1F/A1B = (1 – p)AA1 + pBB1. Поэтому   2SCMD = CD·MM1 = CD((1 – p)AA1 + pBB1) = (1 – p)CD·AA1 + pCD·BB1 = ND·AA1 + NC·BB1 = 2(SAND + SBNC).     Треугольник CLN – общая часть треугольников CMD и BCN, а треугольник DKN – общая часть треугольников  CMD и ADN, поэтому  SKMLN = SCMD – SCLN – SDKN = (SAND + SBNC) – SCLN – SDKN = (SAND – SDKN) + (SBNC – SCLN) = SADK + SBCL."
    ],
    "54846": [
        "Отношение площадей треугольников с общим углом",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: На боковых сторонах",
        "Решение: Продолжим боковые стороны трапеции до пересечения в точке",
        "Ответ: 23:13."
    ],
    "54975": [
        "Перегруппировка площадей",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В параллелограмме соединены середина каждой стороны с концом следующей стороны, отчего получился внутренний параллелограмм. Докажите, что его площадь составляет",
        "Решение: Пусть"
    ],
    "56755": [
        "Медиана делит площадь пополам",
        "Сложность: 4",
        "Классы: 9",
        "Условие: На продолжениях сторон",
        "Решение: Поскольку"
    ],
    "109451": [
        "Медиана делит площадь пополам",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Сторону",
        "Решение: Проведем отрезки",
        "Ответ: 7.00"
    ],
    "56760": [
        "Площадь треугольника.",
        "Сложность: 4",
        "Классы: 9",
        "Условие: В прямоугольник",
        "Решение: Центры всех трех прямоугольников совпадают (см.задачу"
    ],
    "56770": [
        "Площадь четырехугольника",
        "Сложность: 4",
        "Классы: 9",
        "Условие: На сторонах",
        "Решение: Пусть"
    ],
    "56771": [
        "Площадь четырехугольника",
        "Сложность: 4",
        "Классы: 9",
        "Условие: На стороне",
        "Решение: Согласно задаче"
    ],
    "56786": [
        "Прямые и кривые, делящие фигуры на равновеликие части",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Отрезок",
        "Решение: Пусть для определенности лучи"
    ],
    "56787": [
        "Прямые и кривые, делящие фигуры на равновеликие части",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Каждая из трех прямых делит площадь фигуры пополам. Докажите, что часть фигуры, заключенная внутри треугольника, образованного этими прямыми, имеет площадь, не превосходящую1/4 площади всей фигуры.",
        "Решение: Обозначим площади частей фигуры, на которые ее делят прямые, так, как показано на рис. Площадь всей фигуры обозначим через"
    ],
    "56794": [
        "Площадь четырехугольника",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Четырехугольник",
        "Решение: Применяя теорему синусов к треугольникам"
    ],
    "56801": [
        "Вспомогательная площадь. Площадь помогает решить задачу",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Дан выпуклый многоугольник",
        "Решение: Так как"
    ],
    "56802": [
        "Вспомогательная площадь. Площадь помогает решить задачу",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Длины сторон треугольника образуют арифметическую прогрессию. Докажите, что радиус вписанной окружности равен трети одной из высот треугольника.",
        "Решение: Пусть длины сторон треугольника"
    ],
    "56803": [
        "Вспомогательная площадь. Площадь помогает решить задачу",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Расстояния от точки",
        "Решение: Достаточно заметить, что"
    ],
    "56812": [
        "Перегруппировка площадей",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Из середины каждой стороны остроугольного треугольника  опущены перпендикуляры на две другие стороны. Докажите, что площадь  ограниченного ими шестиугольника равна половине площади исходного  треугольника.",
        "Решение: Пусть"
    ],
    "35010": [
        "Площадь треугольника (через высоту и основание)",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Существует ли треугольник с высотами, равными 1, 2 и 3?",
        "Подсказка: Чему могут быть равны стороны такого треугольника?",
        "Решение: Предположим, что такой треугольник существует. Согласно формуле площади треугольника, его стороны обратно пропорциональны высотам, т.е. числам 1, &frac12, &frac13;. Но треугольника с такими сторонами не существует согласно неравенству треугольника.",
        "Ответ: Не существует."
    ],
    "78278": [
        "Отношение площадей треугольников с общим углом",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: На сторонах",
        "Решение: Обозначим через",
        "Ответ: точки"
    ],
    "108481": [
        "Отношение площадей треугольников с общим основанием или общей высотой",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Четырёхугольник разделен диагоналями на четыре треугольника. Площади трёх из них равны 10, 20 и  30,  и  каждая меньше площади четвёртого треугольника. Найдите площадь  данного четырёхугольника.",
        "Решение: Пусть",
        "Ответ: 120."
    ],
    "110924": [
        "Площадь трапеции",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: На рисунке изображена фигура",
        "Решение: Воспользуемся формулой площади трапцеии – площадь равна  произведению средней линии на высоту.    В нашем случае боковыми сторонами трапеции будут отрезок",
        "Ответ: Касательную к дуге"
    ],
    "111447": [
        "Площадь четырехугольника",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Около окружности описана равнобочная трапеция. Площадь четырёхугольника с вершинами в точках касания составляет",
        "Решение: Пусть вписанная окружность касается оснований",
        "Ответ: 3.00"
    ],
    "111477": [
        "Вспомогательная площадь. Площадь помогает решить задачу",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Докажите, что в любом остроугольном треугольнике",
        "Решение: Пусть"
    ],
    "111582": [
        "Вспомогательная площадь. Площадь помогает решить задачу",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Точка",
        "Решение: Пусть",
        "Ответ: Нет."
    ],
    "111653": [
        "Перегруппировка площадей",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Перпендикуляры, опущенные из внутренней точки равностороннего треугольника на его стороны, и отрезки,  соединяющие эту точку с вершинами, разбивают треугольник  на шесть прямоугольных треугольников. Докажите, что сумма  площадей трёх из них, взятых через один, равна сумме площадей  трёх остальных.",
        "Решение: Через данную внутри равностороннего треугольника точку"
    ],
    "111664": [
        "Площадь фигуры равна сумме площадей фигур, на которые она разбита",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В прямоугольник",
        "Решение: Известно, что если один параллелограмм вписан в другой, то центры этих параллелограммов совпадают. Следовательно, центры прямоугольников, о которых говорится в условии задачи, совпадают с центром"
    ],
    "111674": [
        "Отношение площадей треугольников с общим основанием или общей высотой",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Выпуклый четырёхугольник разбит диагоналями  на четыре треугольника, площади которых выражаются целыми числами. Докажите, что произведение этих чисел предвтавляет собой точный квадрат.",
        "Решение: Докажем сначала следующее утверждение: если"
    ],
    "111675": [
        "Отношение площадей треугольников с общим основанием или общей высотой",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Диагонали четырёхугольника",
        "Решение: Докажем сначала следующее утверждение: если"
    ],
    "116296": [
        "Перегруппировка площадей",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Перпендикуляры, опущенные из внутренней точки равностороннего  треугольника, на его стороны, и отрезки, соединяющие эту точку с вершинами, разбивают треугольник на шесть прямоугольных треугольников. Докажите, что сумма площадей трёх из них, взятых через один, равна сумме площадей трёх остальных.",
        "Решение: Пусть"
    ],
    "102371": [
        "Площадь треугольника (через две стороны и угол между ними)",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В треугольнике",
        "Подсказка: Пусть",
        "Решение: Пусть вершины",
        "Ответ: 6.00"
    ],
    "54238": [
        "Вспомогательная площадь. Площадь помогает решить задачу",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что высота прямоугольного треугольника, опущенная на гипотенузу, равна произведению катетов, делённому на гипотенузу.",
        "Подсказка: Данная высота отсекает от треугольника подобный ему треугольник.",
        "Решение: Пусть CD – высота прямоугольного треугольника ABC, AB – гипотенуза."
    ],
    "56748": [
        "Площадь (прочее)",
        "Сложность: 2",
        "Классы: 9",
        "Условие: Многоугольник описан около окружности радиуса"
    ],
    "111642": [
        "Прямые и кривые, делящие фигуры на равновеликие части",
        "Сложность: 5",
        "Классы: 8,9,10,11",
        "Условие: Нарисуйте многоугольник и точку на его границе так, что любая прямая, проходящая через эту точку, делит площадь этого многоугольника пополам.",
        "Решение: Пусть нужная нам точка на границе многоугольника —"
    ],
    "54953": [
        "Отношение площадей подобных треугольников",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Через точки M и N, делящие сторону AB треугольника ABC на три равные части, проведены прямые, параллельные стороне AC.  Найдите площадь части треугольника, заключённой между этими прямыми, если площадь треугольника ABC равна 1.",
        "Подсказка: Площади подобных треугольников относятся, как квадраты соответствующих сторон.",
        "Решение: Пусть AN = NM = MB, точки K и L лежат на стороне BC и MK || NL || AC. Tогда  SMKLN = SBNL – SBMK = 4/9 SABC – 1/9 SABC = 1/3 SABC = 1/3.",
        "Ответ: 1/3."
    ],
    "102393": [
        "Отношение площадей треугольников с общим основанием или общей высотой",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На стороне AC треугольника ABC взята точка A1, а на продолжении стороны BC за точку C взята точка C1, длина отрезка A1C равна 85% длины стороны AC, а длина отрезка BC1 равна 120% длины стороны BC. Сколько процентов площади треугольника ABC составляет площадь треугольника A1BC1?",
        "Решение: SA1BC1 = 1,2 SA1BC = (1,2·0,85)·SABC = 1,02 SABC.",
        "Ответ: 102%."
    ],
    "102394": [
        "Отношение площадей треугольников с общим основанием или общей высотой",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На продолжении стороны KM треугольника KLM за точку K взята точка K1, а на стороне KL взята точка L1, длина отрезка K1M равна 116% длины   стороны KM, а длина отрезка KL1 равна 75% длины стороны KL. Сколько процентов площади треугольника KLM составляет площадь   треугольника K1L1M?",
        "Ответ: 87%."
    ],
    "116469": [
        "Вычисление площадей",
        "Сложность: 3",
        "Классы: 5,6",
        "Условие: Прямоугольник разделён двумя вертикальными и двумя горизонтальными отрезками на девять прямоугольных частей. Площади некоторых из получившихся частей указаны на рисунке. Найдите площадь верхней правой части.",
        "Решение: Нетрудно понять, что если прямоугольник разрезан вертикальным и горизонтальным отрезком на 4 части, то произведения площадей противоположных частей равны. Используя это сображение, последовательно находим площади верхней средней части (30·35 : 21 = 50), правой средней части (8·35 : 10 = 28) и наконец верхней правой части (50·28 : 35 = 40).",
        "Ответ: 40."
    ],
    "56749": [
        "Площадь (прочее)",
        "Сложность: 2",
        "Классы: 9",
        "Условие: Точка"
    ],
    "35527": [
        "Площадь четырехугольника",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: Известно, что середины сторон двух выпуклых четырехугольников    совпадают.    Докажите, что их площади равны.",
        "Подсказка: Какую часть площади четырехугольника составляет площадь    четырехугольника с вершинами в серединах его сторон?",
        "Решение: Пусть  K, L, M, N - середины сторон AB, BC, CD, DA четырехугольника    ABCD. Тогда KL - средняя линия треугольника ABC, поэтому    KL параллельна AС и равна AC/2.    Таким же образом, MN параллельна AС и равна AC/2,    LM параллельна BD и равна BD/2 и    NK параллельна BD и равна BD/2.    Таким образом, KLMN - параллелограмм, стороны которого параллельны    диагоналям четырехугольника ABCD и равны соответственно    половинам этих диагоналей.    По формуле площади четырехугольника площадь четырехугольника    KLMN равна AC*BD*sinX/2, где X - угол между диагоналями AC и BD.    Площадь параллелограмма KLMN равна    KL*LM*sinX = (AC/2)*(BD/2)*sinX = AC*BD*sinX/4.    Таким образом, площадь параллелограмма KLMN вдвое меньше площали    четырехугольника ABCD.    Из доказанного легко следует утверждение задачи:    площади обоих четырехугольников равны удвоенной площади    четырехугольника с вершинами в точках, являющихся их общими    серединами сторон."
    ],
    "53632": [
        "Вспомогательная площадь. Площадь помогает решить задачу",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В треугольнике ABC проведены высоты AA1 и BB1. Найдите AC, если     а) AA1 = 4, BB1 = 5, BC = 6;     б) A1C = 8, B1C = 5, BB1 = 12.",
        "Подсказка: а) Произведение основания на высоту для данного треугольника  постоянно.   б) Треугольники CAA1 и CBB1 подобны.",
        "Решение: а) Из равенства BC·AA1 = AC·BB1 (удвоенная площадь треугольника ABC) находим, что AC = 24/5.",
        "Ответ: а) 4,8;  б) 20,8."
    ],
    "54485": [
        "Формула Герона",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Найдите площадь параллелограмма, если одна из его сторон равна 51, а диагонали равны 40 и 74.",
        "Подсказка: Примените формулу Герона.",
        "Решение: Пусть диагонали AC и BD параллелограмма ABCD пересекаются в точке O. Если AD = 51, AC = 40 и BD = 74, то AO = 20, OD = 37. По формуле Герона  SABCD = 4SAOD = 4 = 4 = 4·9·17·2 = 1224.",
        "Ответ: 1224."
    ],
    "54954": [
        "Отношение площадей треугольников с общим углом",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Через середину M стороны BC параллелограмма ABCD, площадь  которого равна 1, и вершину A проведена прямая, пересекающая диагональ BD в точке O. Найдите площадь четырёхугольника OMCD.",
        "Решение: Согласно задаче 53740  BO : BD = 1 : 3. Значит, SBOM = 1/3· ½ SBCD = 1/12. Следовательно, SOMCD = SBCD – SBOM = ½ – 1/12 = 5/12.",
        "Ответ: 5/12."
    ],
    "56750": [
        "Площадь (прочее)",
        "Сложность: 2",
        "Классы: 9",
        "Условие: Пусть"
    ],
    "55075": [
        "Отношение площадей треугольников с общим углом",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В параллелограмме ABCD на диагонали AC взята точка E,  причём AE : EC = 1 : 3, а на стороне AD взята такая точка F, что AF : FD = 1 : 2. Найдите площадь четырёхугольника ABGE, где G – точка пересечения прямой FE со стороной BC, если известно, что площадь параллелограмма ABCD равна 24.",
        "Ответ: 3."
    ],
    "55205": [
        "Площадь треугольника (через две стороны и угол между ними)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Стороны треугольника не превосходят 1. Докажите, что его площадь не превосходит .",
        "Подсказка: Наименьший угол треугольника не превосходит 60°.",
        "Решение: Пусть α – наименьший угол треугольника. Тогда α ≤ 60°. Если этот угол заключен между сторонами a и b, а S – площадь треугольника, то  S = ½ ab sin α ≤ sin 60° = ."
    ],
    "55274": [
        "Вспомогательная площадь. Площадь помогает решить задачу",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что если",
        "Решение: Пусть"
    ],
    "56494": [
        "Отношение площадей подобных треугольников",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Точка O, лежащая внутри выпуклого четырёхугольника площадиS, отражается симметрично относительно середин его сторон.  Найдите площадь четырёхугольника с вершинами в полученных точках.",
        "Решение: Пусть E, F, G и H – середины сторон четырёхугольника ABCD, точки E1, F1, G1 и H1 симметричны точке O относительно этих точек. Так как EF – средняя линия треугольника E1OF1, то SE1OF1 = 4SEOF. Аналогично SF1OG1 = 4SFOG, SG1OH1 = 4SGOH и SH1OE1 = 4SHOE. Поэтому   SE1F1G1H1 = 4SEFGH. Согласно задаче 56493а)   SABCD = 2SEFGH. Поэтому   SE1F1G1H1 = 2SABCD = 2S."
    ],
    "56752": [
        "Медиана делит площадь пополам",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Дан треугольник",
        "Решение: Из равенства площадей треугольников"
    ],
    "56753": [
        "Медиана делит площадь пополам",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Внутри данного треугольника",
        "Решение: Обозначим точку пересечения прямой"
    ],
    "56754": [
        "Медиана делит площадь пополам",
        "Сложность: 3",
        "Классы: 9",
        "Условие: На продолжениях сторон треугольника",
        "Решение: Так как"
    ],
    "56759": [
        "Площадь треугольника.",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Каждая диагональ выпуклого пятиугольника",
        "Решение: Так как"
    ],
    "56765": [
        "Площадь четырехугольника",
        "Сложность: 3",
        "Классы: 9",
        "Условие: а) Диагонали выпуклого четырехугольника",
        "Решение: а) Так  как"
    ],
    "88005": [
        "Перегруппировка площадей",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Намачте пиратского корабля развевается двухцветный прямоугольный флаг, состоящий изчередующихся чёрных ибелых вертикальных полос одинаковой ширины. Общее число полос равно числу пленных, находящихся вданный момент накорабле. Сначала накорабле было 12пленных, анафлаге— 12полос; затем два пленных сбежали. Как разрезать флаг надве части, азатем сшить их, чтобы площадь флага иширина полос неизменились, ачисло полос стало равным10?",
        "Ответ: См.рисунок."
    ],
    "56769": [
        "Площадь четырехугольника",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Точки",
        "Решение: Если площади параллелограммов"
    ],
    "56776": [
        "Площадь (прочее)",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Даны параллелограмм",
        "Решение: Все три рассматриваемых треугольника имеют общее основание"
    ],
    "56777": [
        "Площадь (прочее)",
        "Сложность: 3",
        "Классы: 9",
        "Условие: На сторонах",
        "Решение: Можно считать, что"
    ],
    "56793": [
        "Площадь четырехугольника",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Диагонали четырехугольника",
        "Решение: Пусть площади треугольников"
    ],
    "56797": [
        "Вспомогательная площадь. Площадь помогает решить задачу",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Докажите, что сумма расстояний от точки, взятой произвольно внутри правильного треугольника, до его сторон постоянна (и равна высоте треугольника).",
        "Решение: Из точки"
    ],
    "56798": [
        "Вспомогательная площадь. Площадь помогает решить задачу",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Докажите, что длина биссектрисы",
        "Решение: Пусть"
    ],
    "56799": [
        "Вспомогательная площадь. Площадь помогает решить задачу",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Внутри треугольника",
        "Решение: а) Пусть расстояния от точек"
    ],
    "56800": [
        "Вспомогательная площадь. Площадь помогает решить задачу",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Даны (2",
        "Решение: Легко проверить, что отношение длин отрезков"
    ],
    "56811": [
        "Перегруппировка площадей",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Докажите, что площадь правильного восьмиугольника равна произведению длин наибольшей и наименьшей его диагоналей.",
        "Решение: Отрежем от правильного восьмиугольника треугольники и переставим их так, как показано на рис. В результате получим прямоугольник, стороны которого равны наибольшей и наименьшей диагоналям восьмиугольника. Тогда"
    ],
    "64505": [
        "Площадь параллелограмма",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: Высота комнаты 3 метра. При её ремонте выяснилось, что на каждую стену уходит краски больше, чем на пол.   Может ли площадь пола этой комнаты быть больше чем 10 квадратных метров?",
        "Решение: Так как на каждую стену уходит краски больше, чем на пол, то площадь пола меньше чем площадь каждой из стен. Это значит, что как длина, так и ширина комнаты меньше её высоты, то есть меньше, чем 3 м. Аналогично и ширина комнаты меньше чем 3 м. Поэтому площадь комнаты даже меньше 9 м².",
        "Ответ: Не может."
    ],
    "88207": [
        "Перегруппировка площадей",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Разрежьте квадрат напять треугольников так, чтобы площадь одного изэтих треугольников равнялась сумме площадей оставшихся.",
        "Подсказка: Попробуйте разрезать квадрат подиагонали.",
        "Решение: Разрежем квадрат подиагонали. Один изтреугольников отложим всторону. Теперь накакиебы треугольники мы ниразрезали второй треугольник, условие задачи будет выполнено. Один извозможных вариантов приведён нарисунке.",
        "Ответ: См.рисунок."
    ],
    "77976": [
        "Перегруппировка площадей",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: A – вершина правильного звёздчатого пятиугольника. Ломаная  AA'BB'CC'DD'EE' является его внешним контуром. Прямые AB и DE  продолжены до пересечения в точке F. Докажите, что многоугольник  ABB'CC'DED' равновелик четырёхугольнику AD'EF.",
        "Решение: Ясно, что AB || EC и AC || EF. Поэтому ACEF – параллелограмм. В частности, SEFA = SACE. Поскольку треугольники AED', ABB' и EDC' равны, имеем SAA'BB'CC'DED' = SACE – SAED' + SABB' + SEDC' = SEFA + SAED' = SAD'EF."
    ],
    "102842": [
        "Отношения площадей",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Сравнение площадей.",
        "Решение: Пусть 4S — площадь квадрата. Тогда площадь каждого из треугольников ABE, ADF, BCF равна S, поэтому площадь треугольника ABF равна 2S. Но треугольник AKB — часть треугольника ABE, поэтому его площадь меньше S, а это означает, что площадь треугольника  AKF больше S. С другой стороны, площадь четырехугольника KECF меньше S, т.к. он составляет часть треугольника  BCF.",
        "Ответ: Площадь треугольника больше."
    ],
    "108607": [
        "Перегруппировка площадей",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В выпуклом шестиугольнике ABCDEF отрезки AB и CF, CD и BE, EF и AD попарно параллельны.   Докажите, что площади треугольников ACE и BFD равны.",
        "Подсказка: Треугольники ABF и ABC, BCD и CED, DEF и AFE попарно равновелики.",
        "Решение: SBDF = SABCDEF – SABF – SBCD – SDEF = SABCDEF – SABC – SCDE – SAEF = SACE."
    ],
    "108901": [
        "Отношение площадей треугольников с общим основанием или общей высотой",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На стороне BC треугольника ABC отмечены такие точки M и N, что CM = MN = NB. К стороне BC в точке N восставлен перпендикуляр, пересекающий сторону AB в точке K. Оказалось, что площадь треугольника AMK в 4,5 раза меньше площади исходного треугольника. Докажите, что треугольник ABC – равнобедренный.",
        "Решение: Заметим, что точка K лежит на серединном перпендикуляре  к отрезку BM, поэтому треугольник BKM – равнобедренный.  Пусть SABC = S. Тогда  SABM = &frac23; S, SBKM = SABM – SAKM = &frac23; S – 2/9 S = 4/3 S = &frac23; SABM. Значит, BK = &frac23; BA.     Поэтому KM || AC, то есть треугольник BAC подобен равнобедренному треугольнику BKM."
    ],
    "56764": [
        "Площадь четырехугольника",
        "Сложность: 2",
        "Классы: 9",
        "Условие: Диагонали четырехугольника",
        "Решение: Если"
    ],
    "108915": [
        "Площадь круга, сектора и сегмента",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На гипотенузе и катетах прямоугольного треугольника построены полуокружности, расположенные так, как показано на рисунке. Докажите, что сумма площадей образовавшихся луночек равна площади данного треугольника.",
        "Решение: Пусть"
    ],
    "110843": [
        "Площадь фигуры равна сумме площадей фигур, на которые она разбита",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Центр окружности, касающейся катетов",
        "Решение: Пусть",
        "Ответ: 3.00"
    ],
    "110844": [
        "Площадь фигуры равна сумме площадей фигур, на которые она разбита",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Окружность с центром на стороне",
        "Решение: Пусть окружность радиуса",
        "Ответ: 2.00"
    ],
    "110845": [
        "Площадь фигуры равна сумме площадей фигур, на которые она разбита",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Центр окружности, касающейся катетов",
        "Ответ: 4.00"
    ],
    "110887": [
        "Площадь трапеции",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Через вершины",
        "Ответ: 66.00"
    ],
    "111492": [
        "Отношение площадей треугольников с общим основанием или общей высотой",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Площадь трапеции равна 84, а основания относятся как 3:4. Найдите площади треугольников, на которые разбивает трапецию её диагональ.",
        "Ответ: 36 Х 48."
    ],
    "88095": [
        "Перегруппировка площадей",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Листок календаря частично закрыт предыдущим оторванным листком (см.рисунок). Вершины",
        "Подсказка: Попробуйте сделать дополнительное построение, как показано на рисунке.",
        "Решение: Площадь открытых участков1', 2' и3' равна площади закрытых участков1, 2 и3 (см.рисунок). Значит, закрытая часть листка больше открытой наплощадь закрытого участка4.",
        "Ответ: Закрытая часть будет больше."
    ],
    "111538": [
        "Площадь трапеции",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Основания равнобедренной трапеции равны 2 и 8, а угол при большем основании равен",
        "Решение: Из вершины",
        "Ответ: 15.00"
    ],
    "111542": [
        "Площадь трапеции",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Боковые стороны прямоугольной трапеции равны 10 и 8. Диагональ трапеции, проведённая из вершины острого угла, делит этот угол пополам.   Найдите площадь трапеции.",
        "Решение: Пусть острый угол при вершине D прямоугольной трапеции ABCD с основаниями AD и BC делится диагональю BD пополам, причём AB = 8 и  CD = 10. Треугольник BCD – равнобедренный, так как ∠CBD = ∠BDA = ∠CDB, поэтому BC= CD = 10. Опустим высоту CH на основание AD. Поскольку ABCH – прямоугольник, CH = AB = 8 и AH = BC = 10. Из прямоугольного треугольника CDH находим, что DH = 6, поэтому  AD = AH + DH = 16. Следовательно, SABCD = ½ (AD + BC)·CH = ½ (16 + 10)·8 = 104.",
        "Ответ: 104."
    ],
    "111543": [
        "Площадь трапеции",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Боковые стороны прямоугольной трапеции равны 6 и 6,25. Диагональ трапеции, проведённая из вершины острого угла, является его биссектрисой. Найдите эту диагональ и площадь трапеции.",
        "Решение: См. решение задачи 111542.",
        "Ответ: 10, 42¾."
    ],
    "111631": [
        "Перегруппировка площадей",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что площадь правильного восьмиугольника равна произведению длин наибольшей и наименьшей диагоналей.",
        "Решение: Отрежем от правильного восьмиугольника треугольники и переставим их так, как показано на рисунке 1. Получим прямоугольник, стороны которого равны наибольшей и наименьшей диагоналям восьмиугольника."
    ],
    "111632": [
        "Перегруппировка площадей",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Четыре вершины правильного двенадцатиугольника расположены в серединах сторон квадрата (см. рис.).",
        "Решение: Пусть сторона квадрата равна 2. Тогда его площадь равна 4. А площадь двенадцатиугольника равна 3 (см. зад. 111633). Значит, площадь оставшейся части (а она состоит из четырех фигур, равных заштрихованной) равна 1. Следовательно, площадь заштрихованной фигуры равна ¼, что и составляет 1/12 площади двенадцатиугольника."
    ],
    "111635": [
        "Площадь четырехугольника",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Четырёхугольник",
        "Решение: Известно, что площадь четырёхугольника равна половине произведения его диагоналей на синус угла между ними, значит,"
    ]
}