{
    "54775": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: Один из четырёх углов, образующихся при пересечении двух прямых, равен 41°. Чему равны три остальных угла?",
        "Ответ: 41°, 139°, 139°."
    ],
    "53427": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Через точку M, лежащую внутри угла с вершиной A, проведены  прямые, параллельные сторонам угла и пересекающие эти стороны в точках B и C. Известно, что ∠ACB = 50°, а угол, смежный с углом ACM, равен 40°. Найдите углы треугольников BCM и ABC.",
        "Ответ: 50°, 90°, 40°;  40°, 90°, 50°."
    ],
    "54061": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Прямая касается двух окружностей в точках A и B. Линия центров  пересекает первую окружность в точках E и C, а вторую – в точках D и F.   Докажите, что прямая AC либо параллельна, либо перпендикулярна BD.",
        "Решение: Пусть O1 и O2 – центры первой и второй окружностей соответственно. Рассмотрим случай, когда точки A и B расположены по одну сторону от линии центров, а точки E, C, D и F последовательно расположены на прямой O1O2 и точка C между точками E и D."
    ],
    "54662": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Даны отрезки a, b и c. С помощью циркуля и линейки постройте отрезок x, для которого x : a = b : c.",
        "Подсказка: Воспользуйтесь теоремой о пропорциональных отрезках.",
        "Решение: На одной стороне угла (не равного 180°) с вершиной O последовательно отложим отрезки OC = c и CB = b (C между O и B), а на второй стороне –  отрезок OA = a. Через точку B проведём прямую, параллельную AC. Пусть эта прямая пересекается с прямой OA в точке D. По теореме о пропорциональных отрезках AD : OA = BC : OC, или AD : a = b : c, то есть OD – искомый отрезок x."
    ],
    "54663": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Даны отрезки a, b, c, d и e. С помощью циркуля и линейки  постройте отрезок, равный abc/de.",
        "Подсказка: Дважды примените построение четвёртого пропорционального.",
        "Решение: Сначала построим отрезок y, для которого y/a = b/d (см. задачу 54662), тогда y = ab/d, а затем – отрезок x, для которого x/c = y/e. При этом  x = yc/e = abc/de."
    ],
    "54740": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В деревне у прямой дороги с интервалами в 50 метров стоят четыре избы  A, B, C и D. В какой точке дороги надо выкопать колодец, чтобы сумма расстояний от колодца до изб была бы наименьшей?",
        "Решение: Рассмотрим сначала две крайние избы A и D. Для них годится любая точка отрезка AD: сумма расстояний от каждой из них до точек A и D равна 150 м.     Рассмотрим теперь отдельно две средние избы B и C. Для них  наименьшую сумму (50 м) даёт каждая точка отрезка BC.     Следовательно, колодец можно копать в любой точке отрезка BC.",
        "Ответ: В любой точке отрезка BC."
    ],
    "54742": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На прямой выбрали четыре точки A, B, C, D и измерили расстояния AB, AC, AD, BC, BD и CD. Могут ли они быть равными (в порядке возрастания)      а) 1, 2, 3, 4, 5, 6;     б) 1, 1, 1, 2, 2, 4.",
        "Решение: а) Пример:",
        "Ответ: а) Могут; б) не могут."
    ],
    "54778": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В полдень минутная и часовая стрелка совпали. Когда они совпадут в следующий раз?",
        "Подсказка: См. задачу 54779.",
        "Ответ: В 13 часов 55/11 минуты, то есть через 13/11 часа."
    ],
    "54779": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Сколько раз в течение суток часовая и минутная стрелки совпадают? Образуют развернутый угол? Образуют прямой угол?",
        "Решение: За сутки минутная стрелка делает 24 оборота, а часовая – 2. Значит, минутная стрелка обгоняет часовую 22 раза. В момент обгона они совпадают. (При этом одна полночь учитывается, а вторая – нет.)     Моменты совпадения стрелок разбивают сутки на 22 равных отрезка. На каждом таком отрезке стрелки один раз образуют развернутый угол и два раза перпендикулярны (когда минутная стрека впереди и когда позади часовой на 90°).",
        "Ответ: 22 раза, 22 раза, 44 раза."
    ],
    "54868": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На стороне AB треугольника ABC взята точка K, а на стороне BC – точки M и N так, что AB = 4AK, CM = BN, MN = 2BN.  Найдите отношения AO : ON и KO : OM, где O — точка пересечения прямых AN и KM.",
        "Подсказка: Докажите, что CM : MN : BN = 1 : 2 : 1. Через точку N проведите прямую, параллельную AC.",
        "Решение: Заметим, что точка M не может лежать на отрезке BN (это противоречило бы условию MN = 2BN).     Итак, точка N лежит на отрезке BM, и, обозначив CM = BN = a, найдём, что MN = 2BN = 2a. Значит, CM : MN : BN = 1 : 2 : 1.    Через точку N проведём прямую, параллельную AC. Пусть P – точка её пересечения со стороной AB. По теореме о пропорциональных отрезках  BP : BK = BN : BM = 1 : 3, AO : ON = AK : KP = 1 : 2.     Из подобия треугольников BNP и BMK находим, что PN = 1/3 KM, а из подобия треугольников AOK и ANP – OK = 1/3 PN. Поэтому OK = 1/9 KM. Следовательно, KO : OM = 1 : 8.",
        "Ответ: 1 : 2; 1 : 8."
    ],
    "54923": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В треугольнике ABC точка D лежит на стороне AC, причём AD = 2DC. Точка E лежит на стороне BC. Площадь треугольника ABD равна 3, площадь треугольника AED равна 1. Отрезки AE и BD пересекаются в точке O. Найдите отношение площадей треугольников ABO и OED.",
        "Решение: Поскольку AC : AD = 3 : 2, то SABC = AC/AD· SADB = 3/2, SAEC = AC/AD SAED = 3/2.     Поэтому CE/DC = SAEC/SABC = 1/3, а так как CD/CA = 1/3 = CE/BC, то DE || AB. Значит, треугольники DOE и AOB подобны с коэффициентом  DE/AO = CD/CA = 1/3.    Следовательно, SOED/SABO = (1/3)² = 1/9.",
        "Ответ: 9 : 1."
    ],
    "54974": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На сторонах AB, BC и AC треугольника ABC взяты  соответственно точки C1, A1 и B1, причём AC1 : C1B = BA1 : A1C = CB1 : B1A = 2 : 1.  Найдите площадь треугольника, вершины которого – попарные пересечения отрезков AA1, BB1, CC1, если площадь треугольника ABC равна 1.",
        "Подсказка: Найдите отношение, в котором делятся точкой пересечения отрезки AA1 и BB1.",
        "Решение: Пусть отрезки AA1 и BB1 пересекаются в точке K, отрезки AA1 и CC1 – в точке M, а отрезки BB1 и CC1 – в точке N. Через точку B1 проведём прямую, параллельную AA1 до пересечения со стороной BC в точке P. По теореме Фалеса PA1 = 1/3 CA1 = 1/6 BA1. Снова по теореме Фалеса KB1 = 1/6 BK = 1/7 BB1. Поэтому SABK = 6/7·1/3 SABC = 2/7.     Аналогично SBMC = SANC = 2/7. Следовательно, SMNK = SABC – SABK – SBMC – SANC = 1 – 6/7 = 1/7.",
        "Ответ: 1/7."
    ],
    "53428": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что расстояние от каждой точки одной из двух параллельных прямых до второй прямой одно и то же.",
        "Решение: Пусть точки A и B лежат на одной из двух параллельных прямых,  а A1 и B1 – их проекции на вторую прямую. Сумма углов AA1B1 и BB1A1 равна 180°, поэтому AA1 || BB1. Далее см. задачу 53430."
    ],
    "55054": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В треугольнике ABC, площадь которого равна 6, на стороне AB   взята точка K, делящая эту сторону в отношении AK : BK = 2 : 3,&nbsp а на стороне AC взята точка L, делящая AC в отношении AL: LC = 5 : 3. Точка Q пересечения прямых CK и BL, отстоит от прямой AB на расстоянии 1,5. Найдите сторону AB.",
        "Решение: Проведём через точку K прямую, параллельную BL, до пересечения в точке M со стороной AC. По теореме Фалеса LM = 3/5 AL = CL. Значит, CQ = KQ.     Поэтому высота CH треугольника ABC в два раза больше расстояния от Q до AB, то есть равна 3, а AB = 2SABC/CH = 4.",
        "Ответ: 4."
    ],
    "55073": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Дан треугольник ABC. На сторонах AB и BC взяты точки M и N соответственно, причём AB = 5AM, BC = 3BN. Отрезки AN и CM пересекаются   в точке O. Найдите отношение площадей треугольников AOC и ABC.",
        "Решение: Через точку A проведём прямую, параллельную BC, до пересечения с прямой CO в точке P. По теореме Фалеса  PN = 1/5 BN = 1/10 BC, CO = 10/11 CM.     Поэтому SAOC = 10/11 SAMC = 10/11·1/5 SABC = 10/11 SABC.",
        "Ответ: 2/11."
    ],
    "55115": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В треугольнике ABC на стороне AB взята точка K, причём  AK : BK = 1 : 2, а на стороне BC взята точка L, причём CL : BL = 2 : 1. Q – точка пересечения прямых AL и CK. Найдите площадь треугольника ABC, если известно, что SBQC = 1.",
        "Решение: Проведём через точку L прямую, параллельную CK, до пересечения в точке M со стороной AB. По теореме Фалеса KM = 2/3 BK = 4/3 AK = 4/7 AM. Следовательно, SABC = AL/QL·SBQC = AM/KM·1 = 7/4.",
        "Ответ: 7/4."
    ],
    "55120": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Пусть E, F, G – такие точки на сторонах соответственно AB,   BC, CA треугольника ABC, для которых AE : EB = BF : FC = CG : GA = k : 1, где 0 < k < 1. Найдите отношение площади треугольника, образованного прямыми AF, BG и CE, к площади треугольника ABC.",
        "Подсказка: См. задачу 54974.",
        "Ответ: ."
    ],
    "55451": [
        "Три точки, лежащие на одной прямой",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите, что во всяком описанном четырёхугольнике середины диагоналей и центр вписанной окружности расположены на одной прямой.",
        "Подсказка: См. задачу 54571.",
        "Решение: Пусть ABCD – описанный четырёхугольник, O – центр вписанной окружности, r – её радиус, N и K – середины диагоналей AC и BD соответственно.     Если ABCD – ромб, то все эти точки совпадают. В противном случае можно считать, что стороны AB и CD не параллельны.      Заметим, что SANB + SDNC = ½ SABC + ½ SADC = ½ SABCD. Аналогично, SAKB + SDKC = ½ SABCD.     Пусть P и L – точки касания вписанной окружности со  сторонами AB и CD. Тогда  SAOB + SCOD = ½ AB·OP + ½ CD·OL = ½ r(AB + CD) = ½ r(AD + BC). Поэтому SAOB + SCOD = ½ SABCD.     Согласно задаче 54571 точки N, O и K лежат на одной прямой."
    ],
    "56458": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: а) Точки",
        "Решение: а) Обозначим точку пересечения отрезков",
        "Ответ: а) (1 + p) : q."
    ],
    "56482": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 9",
        "Условие: Через произвольную точку P стороны AC треугольника ABC параллельно его медианам AK и CL проведены прямые, пересекающие стороны BC и AB в точках E и F соответственно. Докажите, что медианы AK и CL делят отрезокEF на три  равные части.",
        "Решение: Обозначим точку пересечения медиан через O, точки пересечения медианы AK с прямыми FP и FE – через Q и M,  точки пересечения медианы CL с прямыми EP и FE – через R и N соответственно (см. рис.). FM : FE = FQ : FP = LO : LC = 1 : 3, то есть FM = FE/3. Аналогично EN = FE/3."
    ],
    "56483": [
        "Биссектриса угла",
        "Сложность: 3+",
        "Классы: 9",
        "Условие: На биссектрисе угла с вершиной C взята точка P. Прямая, проходящая через точку P, высекает на сторонах угла отрезки длиной a и b.   Докажите, что величина 1/a + 1/b не зависит от выбора этой прямой.",
        "Решение: Пусть A и B – точки пересечения данной прямой со  сторонами угла. Возьмём на отрезках AC и BC точки K и L так, что PK || BC и PL || AC. Так как треугольники AKP и PLB подобны, то AK : KP = PL : LB, то есть (a – p)(b – p) = p², где p = PK = PL. Следовательно,  1/a + 1/b = 1/p."
    ],
    "53430": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Точки A и D лежат на одной из двух параллельных прямых, точки  B и C – на другой, причём прямые AB и CD также параллельны.   Докажите, что AB = CD и AD = BC.",
        "Подсказка: Докажите равенство треугольников ADB и CBD.",
        "Решение: Соединим точки B и D. По свойству параллельных прямых ∠ADB = ∠CBD, ∠ABD = ∠CDB, поэтому треугольники ADB и CBD равны по общей стороне BD и двум прилежащим к ней углам. Следовательно, AB = CD и AD = BC."
    ],
    "66101": [
        "Биссектриса угла",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Из вершины A остроугольного треугольника ABC по биссектрисе угла A выпустили бильярдный шарик, который отразился от стороны BC по закону угол падения равен углу отражения и дальше катился по прямой, уже ни от чего не отражаясь. Докажите, что если ∠A = 60°, то траектория шарика проходит через центр описанной окружности треугольника ABC.",
        "Решение: Отразим относительно BC центр O описанной окружности Ω треугольника ABC. Получим точку O'. Так как   ∠BO'C = ∠BOC = 2∠A = 120° = 180° – ∠A, то O' лежит на Ω. Так как O лежит на серединном перпендикуляре к BC, то O' – середина дуги BC. Значит, биссектриса угла A проходит через O'. Это и значит, что после отражения шарик пройдёт через точку O."
    ],
    "79555": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 9,10",
        "Условие: В треугольнике ABC на сторонах AB, BC и AC взяты соответственно точки M, K и L так, что прямая MK параллельна прямой AC и ML параллельна BC. При этом отрезок BL пересекает отрезок MK в точке P, а AK пересекает ML в точке Q. Докажите, что отрезки PQ и AB параллельны.",
        "Решение: MQ : QL = BK : KC = BP : PL. Поэтому  PQ || BM, а значит, PQ || AB."
    ],
    "108099": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На стороне AB треугольника ABC взята точка P, отличная от точек A и B, а на сторонах BC и AC – точки Q и R соответственно, причём четырёхугольник PQCR – параллелограмм. Пусть отрезки AQ и PR пересекаются в точке M, а отрезки BR и PQ – в точке N. Докажите,  что сумма площадей треугольников AMP и BNP равна площади  треугольника CQR.",
        "Решение: По теореме о пропорциональных отрезках RM : MP = CQ : QB = AP : PB = AR : RC = PN : NQ, поэтому SRMQ = SPNR (эти площади составляют равные доли от SPQR, см. рис.).     Из трапеции ARQP получаем, что SAMP = SRMQ, а из трапеции BQRP – SBMP = SQNR (см. задачу 54961).  Следовательно,  SAMP + SBNP = SRMQ + SQNR = SPNR + SQNR = SPQR = SCQR."
    ],
    "54737": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Точка B лежит на отрезке AC, равном 5. Найдите расстояние между серединами отрезков AB и BC.",
        "Подсказка: Расстояние между серединами данных отрезков равно половине отрезка AC.",
        "Решение: Пусть M и N – середины отрезков AB и BC соответственно. Тогда отрезок MN составлен из половин отрезков AB и BC, а так как AB + BC = 5, то  MN = ½ AB + ½ BC = ½ AC = 5/2.",
        "Ответ: 2,5."
    ],
    "108516": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В треугольнике ABC угол B прямой, точка M лежит на стороне AC, причём AM : MC = 1 : 3,∠ABM = π/6, BM = 6.   Найдите угол BAC и расстояние между центрами описанных окружностей треугольников BCM и BAM.",
        "Подсказка: Центры указанных окружностей лежат на серединном перпендикуляре к отрезку BM. Радиусы окружностей найдите с помощью теоремы синусов.",
        "Решение: Пусть D – проекция точки M на катет AB. Из прямоугольного треугольника BDM находим, что DM = ½ BM = 3, BD = 3.      Поскольку AD : DB = AM : MC = 1 : 3, то AD = 1. Значит, AM = , MC = 3.     Из прямоугольного треугольника ADM находим, что   tg∠BAC = DM/AD = 3.     Пусть O1 и O2 — центры окружностей радиусов R1 и R2, описанных   вокруг треугольников BCM и BAM соответственно. Тогда O1O2 – серединный перпендикуляр к общей стороне BM этих треугольников, причём точки O1 и O2 лежат по разные стороны от прямой BM.     По теореме синусов       Если N – точка пересечения BM и O1O2, то",
        "Ответ: arctg 3, 10."
    ],
    "108517": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В треугольнике ABC угол B прямой, точка M лежит на стороне AC, причём AM : MC =  : 4. Величина угла ABM равна π/3, BM = 8.   Найдите величину угла BAC и расстояние между центрами описанных окружностей треугольников BCM и BAM.",
        "Решение: См. задачу 108516.",
        "Ответ: arctg 4; 17."
    ],
    "108633": [
        "Три точки, лежащие на одной прямой",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В ромбе ABCD на стороне BC нашлась такая точка E, что AE = CD. Отрезок ED пересекается с описанной окружностью треугольника AEB в точке F. Докажите, что точки A, F  и C лежат на одной прямой.",
        "Решение: ∠FEC = ∠BAF, так как четырёхугольник ABEF – вписанный. Поскольку ABC – равнобедренный треугольник, а AECD – равнобедренная трапеция, то   ∠BAC = ∠BCA = ECA = ∠CED = ∠FEC = ∠BAF. Следовательно, точки A, F и C лежат на одной прямой."
    ],
    "109013": [
        "Три прямые, пересекающиеся в одной точке",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На дуге AB есть произвольная точка M. Из середины K отрезка MB опущен перпендикуляр KP на прямую MA.   Доказать, что все прямые PK проходят через одну точку.",
        "Решение: Проведём диаметр AC и точку B соединим с точкой C (см. рис.). Продолжим прямую PK до пересечения с прямой BC в точке H. ∠AMC = 90°, значит,  PH || MC. Отрезок KH проходит через середину стороны MB треугольника MBC параллельно стороне MC, поэтому он является средней линией треугольника BMC, то есть BH = HC. Итак,   все прямые PK проходят через середину фиксированного отрезка BC."
    ],
    "111553": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Точка M расположена на боковой стороне AB трапеции ABCD, причём AM : BM = 2 : 1. Прямая, проходящая через точку  M  параллельно основаниям AD и BC, пересекает боковую сторону CD в точке N. Найдите MN, если AD = 18, BC = 6.",
        "Решение: Проведём диагональ BD. Пусть она пересекается с отрезком MN в точке P. По теореме о пропорциональных отрезках  BP : PD = CN : ND = BM : AM = 1 : 2. Треугольник BMP подобен треугольнику BAD с коэффициентом BM/BA = &frac13;, а треугольник DNP подобен треугольнику DCB с коэффициентом DN/NC = &frac23;, поэтому MP = &frac13; AD = &frac13;·18 = 6, NP = &frac23; BC = 4, MN = MP + NP = 6 + 4 = 10.",
        "Ответ: 10."
    ],
    "115610": [
        "Три точки, лежащие на одной прямой",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Точка O – центр окружности, вписанной в треугольник ABC. На сторонах AC и BC выбрали соответственно точки M и K так, что BK·AB = BO² и AM·AB = AO². Докажите, что точки M, O и K лежат на одной прямой.",
        "Решение: BK : BO = BO : AB, а так как BO –   биссектриса угла ABC, то ∠OBK = ∠ABO,   поэтому треугольники BOK и BAO подобны. Значит, ∠BOK = ∠BAO. Аналогично ∠AOM = ABO, поэтому ∠AOM + ∠AOB + ∠BOK = ∠ABO + (180° – ∠ABO – ∠BAO) + ∠BAO = 180°. Следовательно, точки M, O и K лежат на одной прямой."
    ],
    "115683": [
        "Три точки, лежащие на одной прямой",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Прямая, содержащая сторону AC остроугольного треугольника ABC, симметрично отражается относительно прямых AB и BC. Две полученные прямые пересекаются в точке K. Докажите, что прямая BK проходит через центр O описанной окружности треугольника ABC.",
        "Решение: Биссектрисы внешних углов при вершинах A и C треугольника AKC пересекаются в точке B, значит, KB – биссектриса угла AKC. Далее можно рассуждать по разному."
    ],
    "54745": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: На прямой последовательно отмечаются точки A, B, C и D, причём  AB = BC = CD = 6.  Найдите расстояние между серединами отрезков AB и CD.",
        "Решение: Пусть M и N – середины отрезков AB и CD соответственно. Тогда MN = MB + BC + CN = 3 + 6 + 3 = 12.",
        "Ответ: 12."
    ],
    "35460": [
        "Ломаные",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Докажите, что всякую замкнутую ломаную периметра Р можно заключить в круг, радиус которого не превосходит Р/4.",
        "Подсказка: Рассмотрите две точки, делящие периметр ломаной пополам. Возьмите за центр круга середину отрезка, соединяющего эти точки.",
        "Решение: Рассмотрим на ломаной две точки A и B, делящие периметр ломаной пополам. Рассмотрим некоторую точку C на ломаной. Сумма длин отрезков AC и BC не превосходит периметра одной из двух ломаных с концами A и B, то есть AC + BC ≤ P/2. Отразив точку C симметрично относительно точки O, получим точку C'. Четырёхугольник ACBC' – параллелограмм, поскольку его диагонали делятся точкой O пополам. Значит, BC' = AC, и из треугольника BCC' получаем, что 2CO = CC' ≤ BC + BC' = BC + AC ≤ P/2, и, следовательно, СО ≤ P/4.     Таким образом, каждая точка C ломаной лежит внутри круга радиуса P/4 с центром в точке O."
    ],
    "53788": [
        "Три прямые, пересекающиеся в одной точке",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В треугольник вписана окружность. Точки касания соединены с противоположными вершинами треугольника.   Докажите, что полученные отрезки пересекаются в одной точке (точка Жергона).",
        "Подсказка: Докажите, что два из этих отрезков делят третий в одном и том  же отношении или воспользуйтесь теоремой Чевы.",
        "Решение: Пусть M, N и K – точки касания вписанной в треугольник ABC окружности со сторонами BC, AB и AC соответственно. Обозначим BM = BN = x,  AN = AK = y, CM = CK = z."
    ],
    "53814": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В равнобедренном треугольнике ABC (AC – основание) на  стороне BC находятся точки D и E, причём   DE = EC = 2.   Найдите периметр треугольника ABC, если известно, что AE = 5, AD =  .",
        "Подсказка: См. задачу 53813.",
        "Ответ: 30."
    ],
    "53900": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Некоторая прямая пересекает стороны A1A2, A2A3, ...,   AnA1 (или их продолжения) многоугольника   A1A2...An в точках M1, M2, ..., Mn   соответственно.   Докажите, что",
        "Подсказка: Спроектируйте вершины многоугольника на произвольную прямую параллельно данной прямой и примените теорему о пропорциональных отрезках.",
        "Решение: Проведём прямую l, пересекающую данную прямую в точке N. Пусть прямые, проведённые через вершины A1, A2, ..., An данного многоугольника, пересекают прямую l в точках B1, B2, ..., Bn соответственно. Тогда"
    ],
    "54770": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Даны точки A и B. Для каждой точки M, не совпадающей с точкой B и лежащей на прямой AB, рассмотрим отношение AM : BM.  Где расположены точки, для которых это отношение    а) больше 2,  б) меньше 2?",
        "Решение: Пусть точка M1 лежит на отрезке AB, причём AM1 : M1B = 2. Если M – призвольная точка, лежащая между M1 и B, или M совпадает с B, то  AM > AM1 > 2M1B > 2MB.     Пусть точка M2 лежит на продолжении отрезка AB за точку B, причём B – середина отрезка AM2. Если M – произвольная точка, лежащая между B и M2, то  AB > BM, поэтому AM = AB + BM > 2BM.     Если точка M лежит на отрезке AM1 (но не совпадает с M1), то AM < AM1 = 2M1B < 2BM.     Если точка M лежит на продолжении отрезка AB за точку A, то AM < BM < 2BM.     Если точка M лежит на продолжении отрезка M1M2 за точку M2, то AM = AB + BM < 2BM.",
        "Ответ: Пусть M1 и M2 – точки, в которых указанное отношение равно 2.   а) Все отличные от B точки между M1 и M2;   б) все точки прямой, не лежащие на отрезке M1M2."
    ],
    "55055": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В треугольнике ABC на стороне AC взята точка K, причём   AK = 1, KC = 3, а на стороне AB взята точка L, причём AL : LB = 2 : 3. Пусть Q – точка пересечения прямых BK и CL. Площадь треугольника  AQC равна 1. Найдите высоту треугольника ABC, опущенную из  вершины B.",
        "Решение: Проведём через точку K прямую, параллельную CL, до пересечения со стороной AB в точке M. По теореме Фалеса AM : ML = AK : KC = 1 : 3.  Значит,  ML = ¾ AL = ½ LB. Снова по теореме Фалеса KQ = ½ BQ = 1/3 BK.     Следовательно, SABC = 3SAQC = 3, а искомая высота равна 2SABC/AC = 3/2.",
        "Ответ: 1,5."
    ],
    "54746": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: На прямой последовательно откладываются точки A, B, C, D, E и  F, причём AB = BC = CD = DE = EF.  Найдите отношения AD : DF, AC : AF, BD : CF.",
        "Ответ: 3 : 2, 2 : 5, 2 : 3."
    ],
    "73642": [
        "Три прямые, пересекающиеся в одной точке",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: а) Дан выпуклый многоугольник A1A2...An. На стороне A1A2 взяты точки B1 и D2, на стороне A2A3 – точки B2 и D3, ..., на стороне AnA1 – точки Bn и D1 так, что если построить параллелограммы A1B1C1D1, A2B2C2D2, ..., AnBnCnDn, то прямые A1C1, A2C2, ..., AnCn пересекутся в одной точке. Докажите равенство A1B1·A2B2·...·AnBn = A1D1·A2D2·...·AnDn.",
        "Решение: а) Пусть O – точка пересечения. Запишем равенство, которое нам нужно доказать, так:  = 1.     Теперь заметим, что отношения отрезков    соответственно равны отношениям площадей треугольников   так что нужное нам равенство можно записать так:"
    ],
    "102505": [
        "Три точки, лежащие на одной прямой",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Середины высот треугольника ABC лежат на одной прямой. Наибольшая сторона треугольника AB = 10 см.  Какое максимальное значение может принимать площадь треугольника ABC?",
        "Подсказка: Докажите, что треугольник, удовлетворяющий условию задачи, – прямоугольный. Для этого воспользуйтесь задачей 37549.",
        "Решение: Пусть A1, B1 и C1 – середины сторон соответственно BC, AC и BC данного треугольника ABC (cм. рис.). Тогда середины высот этого треугольника лежат на прямых B1C1, A1C1 и A1B1.",
        "Ответ: 25."
    ],
    "102506": [
        "Три точки, лежащие на одной прямой",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Площадь треугольника ABC равна 10 см². Какое наименьшее  значение может принимать радиус описанной окружности треугольника ABC, если известно, что середины высот этого треугольника лежат на одной прямой?",
        "Решение: Согласно решению задачи 102505, треугольник ABC – прямоугольный. Пусть его катеты равны a и b, гипотенуза – c, а радиус описанной окружности – R. Далее можно рассуждать по-разному.     Первый способ. 4R² = c² = a² + b² ≥ 2ab = 40. Следовательно, R² ≥ 10.     Второй способ. Из решения задачи 102505 видно, что 10 = SABC ≤ R².     Равенство достигается для равнобедренного прямоугольного треугольника.",
        "Ответ: ."
    ],
    "108921": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Высота BN и медиана CM треугольника ABC пересекаются  в точке K. Известно, что ∠A = 60°, CK = 6 и KM = 1. Найдите углы треугольника ABC.",
        "Решение: Пусть AB = 4x, тогда AN = 2x. Опустим перпендикуляр MD из точки M на сторону AC. Тогда D – середина AN. По теореме Фалеса  DN : NC = MK : KC = 1 : 6. Поэтому NC = 6DN = 6x, AC = 8x. Таким образом, в треугольнике ABC известно, что AC = 2AB и ∠A = 60°. Значит, этот треугольник – прямоугольный.",
        "Ответ: ∠B = 90°, ∠C = 30°."
    ],
    "54747": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Точки M, A и B расположены на одной прямой, причём отрезок AM вдвое больше отрезка BM. Найдите AM, если AB = 6.",
        "Подсказка: Рассмотрите все возможные случаи расположения точек A, B и M.",
        "Решение: Если точка M лежит между точками A и B, то   AM = 2/3 AB = 4.     Если точка B лежит между точками A и M, то B – середина AM, поэтому AM = 2AB = 12.     Точка A не может лежать между точками B и M, так как в этом случае отрезок AM меньше отрезка BM.",
        "Ответ: 4 или 12."
    ],
    "115292": [
        "Три точки, лежащие на одной прямой",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Дан остроугольный треугольник ABC. Точки B' и C'   симметричны соответственно вершинам B и C относительно прямых AC и AB. Пусть P – точка пересечения описанных окружностей треугольников ABB' и ACC', отличная от A. Докажите, что центр описанной окружности треугольника ABC лежит на прямой PA.",
        "Решение: Пусть серединный перпендикуляр к стороне AB пересекает прямую AC в точке O1. Тогда O1A = O1B = O1B', значит, O1 – центр описанной окружности треугольника ABB'. Аналогично точка O2 пересечения серединного перпендикуляра к стороне AC с прямой AB – центр описанной окружности треугольника ACC'. Пусть O – центр описанной окружности треугольника ABC. Общая хорда AP описанных окружностей треугольников ABB' и ACC' перпендикулярна их линии центров O1O2, а так как O1O ⊥ AB и O2O ⊥ AC, то O – точка пересечения высот треугольника AO1O2, поэтому AO ⊥ O1O2. Следовательно, точки A, O и P лежат на одной прямой."
    ],
    "115692": [
        "Три точки, лежащие на одной прямой",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Две окружности с центрами O1 и O2   пересекаются в точках A и B. Окружность, проходящая через точки O1, B и O2 пересекает вторую окружность также и в точке P. Докажите, что точки O1, A и P лежат на одной прямой.",
        "Решение: Рассмотрим случай, изображённый на рисунке. Пусть прямая O1A вторично пересекает окружность с центром O2 в точке P'. Тогда   ∠AP'O2 = ∠O2AP' = 180° – O1AO2 = 180° – O1BO2, значит, четырёхугольник O1P'O2B – вписанный, то есть точка P' лежит на окружности, проходящей через точки O1, B и O2. Отсюда следует утверждение задачи."
    ],
    "115909": [
        "Три прямые, пересекающиеся в одной точке",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Докажите, что если перпендикуляры, восставленные из оснований биссектрис соответствующим сторонам треугольника, пересекаются в одной точке, то треугольник равнобедренный.",
        "Решение: Пусть AA1, BB1 и CC1 – биссектрисы треугольника ABC. Обозначим BC = a, AC = b, AB = c. Тогда"
    ],
    "56888": [
        "Три прямые, пересекающиеся в одной точке",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: На сторонах AB и BC остроугольного треугольника ABC   внешним образом построены квадраты ABC1D1 и A2BCD2.   Докажите, что точка пересечения прямых AD2 и CD1 лежит на высоте BH.",
        "Решение: Обозначим через a, b, c длины сторон, а через α, β, γ – соответствующие углы треугольника ABC.  Пусть X – точка пересечения прямых AD2 и CD1; M, E1 и E2 – проекции точек X, D1 и D2 на прямую AC. Тогда   CE2 = a sin γ и AE1 = c sin α. Так как a sin γ = c sin α, то CE2 = AE1 = q. Поэтому    и  .     Следовательно, AM : CM = c cos α : a cos γ. Высота BH делит сторону AC в таком же отношении."
    ],
    "57396": [
        "Ломаные",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: В некотором лесу расстояние между каждыми двумя деревьями не превосходит разности их высот. Все деревья имеют высоту меньше 100 м.   Докажите, что этот лес можно огородить забором длиной 200 м.",
        "Решение: Пусть деревья высотой a1 > a2 > ... > an растут в точках A1, ..., An. Тогда по условию A1A2 ≤ a1 – a2, ..., An–1An ≤ an–1 – an. Следовательно, длина ломаной A1A2...An не превосходит  (a1 – a2) + (a2 – a3) + ... + (an–1 – an) = a1 – an < 100 м. Эту ломаную можно огородить забором, длина которого не превосходит   200 м (см. рис.)."
    ],
    "54748": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Точка M – середина отрезка AB, а точка N – середина отрезка MB. Найдите отношения AM : MN, BN : AM и MN : AB.",
        "Ответ: 2 : 1, 1 : 2, 1 : 4."
    ],
    "108172": [
        "Ломаные",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Ломаная разбивает круг на две равновеликие части. Докажите, что кратчайшая такая ломаная – это диаметр.",
        "Решение: Допустим, что ломаная, отличная от диаметра, делит площадь круга пополам. Можно считать, что ломаная имеет общую точку с окружностью (иначе сделаем параллельный перенос ломаной). Пусть A и B – концы этой ломаной (которые могут и совпадать). Рассмотрим ломаную с концами A' и B', центрально-симметричную исходной ломаной относительно центра  круга. Эти две ломаные обязаны пересечься, поскольку каждая из них отсекает половину площади круга. Возьмём ближайшую к точке A точку C пересечения ломаных (расстояния отсчитываются вдоль ломаной от A к B). Центрально-симметричная её точка C' также является точкой  пересечения этих ломаных. Среди частей ломаной AC и B'C выберем кратчайший (пусть это AC). Тогда ломаная ACC'A' центрально-симметрична. Следовательно, она делит площадь круга пополам. С другой стороны, она короче (или равна) исходной ломаной. Но диаметр AA' ещё короче (или равен) ломаной ACC'A', причём равенство достигается только тогда, когда исходная ломаная – диаметр."
    ],
    "108194": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Хорда CD окружности с центром O перпендикулярна её диаметру AB, а хорда AE делит пополам радиус OC.   Докажите, что хорда DE делит пополам хорду BC.",
        "Подсказка: Если хорда AE пересекает радиус OC в точке M, а хорда DE – хорду BC в точке N, то точки M, N, E и C лежат на одной окружности.",
        "Решение: Докажем более общее утверждение: если хорда AE пересекает   радиус OC в точке M, а хорда DE – хорду BC в точке N, то MN || OB.     Заметим, что дуги AC и AD, не содержащие точку B, симметричны относительно прямой AB и, следовательно, равны. Поэтому равны и углы AEC и AED, вписанные в окружность и опирающиеся на эти дуги. Углы AEC и ABC равны как вписанные, опирающиеся на одну и ту же дугу, а углы ABC и OCB равны, так как треугольник OCB – равнобедренный. Следовательно, ∠AED = ∠OCB, то есть ∠MEN = ∠MCN, а это означает, что точки M, N, E и C лежат на одной окружности. Поэтому ∠MNC = MEC = ∠OBC. Значит, MN || OB.     В нашей задаче M – середина OC. Следовательно, N – середина BC."
    ],
    "108672": [
        "Три прямые, пересекающиеся в одной точке",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Окружность, проходящая через вершины A и C треугольника ABC, пересекает сторону AB в её середине D, а сторону BC – в точке E. Окружность, проходящая через точку E и касающаяся в точке C прямой AC, пересекает прямую DE в точке F. K – точка пересечения прямых AC и DE.  Докажите, что прямые CF, AE и BK пересекаются в одной точке.",
        "Решение: Из теоремы об угле между касательной и хордой ∠CFE = ∠ACE, а так как четырёхугольник ADEC – вписанный, то ∠BDE = ∠ACE = ∠CFE. Значит,  CF || AB. Пусть G – точка пересечения прямых CF и BK. Поскольку DK – медиана треугольника ABK и CG || AB, то FG = CF. Пусть G1 – точка пересечения AE и CF. Аналогично  FG1 = CF. Значит, точки G и G1 совпадают."
    ],
    "108945": [
        "Три точки, лежащие на одной прямой",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Одна из вневписанных окружностей треугольника ABC касается стороны AB и продолжений сторон CA и CB в точках C1, B1 и A1 соответственно.  Другая вневписанная окружность касается стороны  AC  и продолжений сторон BA и BC в точках B2, C2   и A2 соответственно. Прямые A1B1 и A2B2 пересекаются в точке P, прямые A1C1 и A2C2 – в точке Q. Докажите, что точки A, P и Q лежат на одной прямой.",
        "Решение: Из решения задачи 55404 следует, что середина D отрезка A1A2 является также серединой стороны BC."
    ],
    "110803": [
        "Три точки, лежащие на одной прямой",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Высоты AA1, BB1 и CC1  остроугольного треугольника ABC пересекаются в точке H; точки A2, B2 и C2 –   середины отрезков AH, BH и CH соответственно. Рассмотрим  шестиугольник, образованный пересечением треугольников A1B1C1 и A2B2C2. Докажите, что его диагонали, соединяющие  противоположные вершины, пересекаются в одной точке.",
        "Решение: Пусть M – точка пересечения отрезков B1C1 и A2C2, а   N – отрезков A1C1 и B2C2. Если мы докажем, что ∠MHB1 = NHB2, это будет означать, что диагональ MN указанного шестиугольника проходит через точку H.     Обозначим ∠MHB1 = α, ∠NHA1 = β. Отрезок A2C2 – средняя линия треугольника AHC, поэтому A2C2 – серединный перпендикуляр к отрезку HB1, значит, треугольник HMB1 –   равнобедренный, а так как высота BB1 треугольника ABC делит пополам угол его ортотреугольника (см. задачу 52866), то ∠BB1A1 = ∠MB1H = ∠MHB1 = α. Точки A1 и B1 лежат на окружности с диаметром AB, поэтому ∠BAA1 = ∠BB1A1 = α. Тогда ∠B2A2A1 = ∠BB1A1 = α. Аналогично ∠A2B2B1 = ∠NHA = β. По теореме о внешнем угле треугольника ∠A1HB2 = α + β, значит,   ∠NHB2 = ∠A1HB2 – ∠NHA1 = (α + β) – β =   α = ∠MHB1, что и требовалось.     Аналогично доказывается, что и две остальные большие диагонали шестиугольника проходят через точку H."
    ],
    "54749": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Точка K отрезка AB, равного 12, расположена на 5 ближе к  A, чем к B. Найдите AK и BK.",
        "Решение: Рассмотрим на AB такую точку M, что MB = 5. Тогда AM = 7, а K – середина AM.",
        "Ответ: 7/2, 17/2."
    ],
    "111595": [
        "Три прямые, пересекающиеся в одной точке",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Отрезки AB и CD не параллельны и не пересекаются. Точка P   лежит на отрезке AB, а точка Q – на отрезке CD. Точки  K, L, M и N – середины отрезков AQ, BQ, CP и DP  соответственно. Докажите, что отрезки KL, MN и PQ пересекаются в одной точке.",
        "Решение: Отрезок KL – средняя линия треугольника AQB, значит, KL || AB.  Поэтому прямая KL содержит среднюю линию треугольника AQP, то есть проходит через середину отрезка PQ. Аналогично докажем, что отрезок MN также проходит через середину PQ. Таким образом, отрезки KL, MN и PQ пересекаются в середине отрезка PQ."
    ],
    "115343": [
        "Три прямые, пересекающиеся в одной точке",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Пусть I и IA – соответственно центры вписанной и вневписанной окружностей треугольника ABC. Прямая lA проходит через ортоцентры треугольников BIC и BIAC. Аналогичным образом определяются прямые lB и lC . Докажите, что прямые lA, lB и lC пересекаются в одной точке.",
        "Решение: Пусть A1 – середина стороны BC, HA – ортоцентр треугольника BIC, GA – ортоцентр треугольника BIAC. Угол между биссектрисами смежных углов – прямой, поэтому ∠IBIA = ∠ICIA = 90°. Прямые BI и CGA перпендикулярны прямой BIA, поэтому они параллельны. Аналогично параллельны прямые CI и BGA, значит, четырёхугольник BICGA – параллелограмм. Точка A1 – его центр, то есть точки I и GA симметричны относительно точки A1.   Аналогично точки IA и HA симметричны относительно точки A1. Таким образом, при симметрии относительно точки A1 прямая lA   (то есть HAGA) переходит в прямую IAI, то есть в прямую, содержащую биссектрису угла A треугольника ABC. Аналогично прямые lB и lC симметричны биссектрисам углов B и C относительно середин сторон AC и AB соответственно.     Через вершины треугольника ABC проведём прямые, параллельные  противолежащим сторонам. Обозначим вершины треугольника, образованного пересечениями этих прямых через A2, B2   и C2 соответственно (A2B2 || AB, A2C2 || AC и B2C2 || BC). Четырёхугольник ABA2C – параллелограмм, поэтому прямая lA, симметричная AI относительно точки A1, содержит биссектрису угла A2 треугольника A2B2C2. Аналогично, прямые lB и lC   содержат  биссектрисы углов соответственно B2 и C2 этого треугольника, а значит, прямые lA, lB и lC пересекаются в одной точке."
    ],
    "115609": [
        "Три прямые, пересекающиеся в одной точке",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Дан выпуклый шестиугольник, каждая диагональ которого, соединяющая противоположные вершины, делит его площадь пополам.   Докажите, что эти диагонали пересекаются  в одной точке.",
        "Решение: Пусть диагональ AD выпуклого шестиугольника ABCDEF пересекается с диагоналями BE и CF в точках X и Y соответственно, а диагонали BE и CF пересекаются в точке Z, причём точка X лежит между A и Y, а Z – между E и X. Тогда SABX = SXDE, SBCZ = SZEF, SCDY = SYAF (например, площадь каждого из треугольников ABX и XDE равна разности половины площади данного шестиугольника и четырёхугольника BCDX). Поэтому  AX·BX = DX·EX > DY·EZ, FZ·EZ = CZ·BZ > BX·CY, CY·DY = AY·FY > AX·FZ, значит, AX·BX·FZ· EZ·CY·DY > DY·EZ·BX·CY·AX·FZ, что невозможно. Следовательно, отрезки AD, BE и CF пересекаются в одной точке.     Аналогично разбираются остальные случаи."
    ],
    "54750": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: На прямой выбраны три точки A, B и C, причём AB = 1, BC = 3. Чему может быть равно AC?",
        "Подсказка: Рассмотрите два случая.",
        "Ответ: 4 или 2."
    ],
    "32038": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Можно ли провести из одной точки на плоскости пять лучей так, чтобы среди образованных ими углов было ровно четыре острых?   Рассматриваются углы не только между соседними, но и между любыми двумя лучами.",
        "Решение: Пример требуемого расположения приведён на рисунке:",
        "Ответ: Можно."
    ],
    "54753": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Прямой угол разделен двумя лучами на три угла. Один из них на 10° больше другого и на 10° меньше третьего. Найдите эти углы.",
        "Ответ: 30°, 20°, 40°."
    ],
    "54774": [
        "Необычные построения  (прочее)",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Имеется угольник с углом в 40°. Как с его помощью построить угол, равный:  а) 80°;  б) 160°;  в) 20°?",
        "Подсказка: 20° = 180° – 160°."
    ],
    "35080": [
        "Построения (прочее)",
        "Сложность: 2",
        "Классы: 8",
        "Условие: Разделите с помощью линейки и циркуля данный отрезок на n  равных частей.",
        "Подсказка: Отложите n равных отрезков подряд на некоторой прямой и  используйте подобие.",
        "Решение: Пусть дан отрезок AB. Проведем некоторый луч   AX (не лежащий на прямой AB) с началом в точке   A. Последовательно отложим на луче AX n равных отрезков   AA"
    ],
    "35633": [
        "Свойства симметрий и осей симметрии",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Сколько осей симметрии может быть у треугольника?",
        "Подсказка: Ось симметрии должна проходить через вершину треугольника.",
        "Решение: По обе стороны от оси симметрии должно быть одинаковое количество вершин треугольника, поэтому ось симметрии должна проходить через одну из вершин. Кроме того, эта ось симметрии должна быть одновременно высотой и биссектрисой, так как остальные две вершины должны быть симметричны относительно оси.       Итак, имеются три возможности: если треугольник разносторонний, то ни одна из высот не является осью симметрии; если треугольник равнобедренный, но не равносторонний, то ровно одна из высот – ось симметрии; в равностороннем треугольнике каждая из трёх высот является его осью симметрии.",
        "Ответ: 0, 1 или 3 оси."
    ],
    "53417": [
        "Равные треугольники. Признаки равенства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Отрезки AB и CD пересекаются в точке O и делятся этой точкой пополам. Докажите, что AC || BD и AD || BC.",
        "Подсказка: Докажите, что ∠OAC = ∠OBD.",
        "Решение: Треугольники AOC и BOD равны по двум сторонам и углу между  ними (AO = BO и CO = DO по условию, а углы AOC и BOD равны как вертикальные), поэтому ∠OAC = ∠OBD. Прямая AB пересекает прямые AC и BD, причём накрест лежащие углы OAC и OBD равны. Следовательно, прямые AC и BD параллельны. Аналогично, AD || BC."
    ],
    "53420": [
        "Элементарные (основные) построения циркулем и линейкой",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Через точку, не лежащую на данной прямой, проведите с помощью циркуля и линейки прямую, параллельную данной.",
        "Подсказка: Воспользуйтесь построением угла, равного данному.",
        "Решение: Пусть M – данная точка, расположенная вне данной прямой l. Возьмём на прямой l произвольные точки A и B. Отложим от луча MA в полуплоскости, не содержащей точку B, угол AMN, равный углу MAB. По признаку параллельности прямых прямая MN параллельна данной прямой l.     Единственность проведённой прямой следует из аксиомы параллельных."
    ],
    "53730": [
        "Вневписанные окружности",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что прямая, проходящая через центры вневписанных окружностей треугольника ABC, касающихся сторон AB и AC, перпендикулярна прямой, проходящей через центр вписанной окружности и вершину A.",
        "Решение: Пусть O1 и O2 – центры вневписанных окружностей треугольника ABC, касающихся сторон AB и AC. Точки O1 и O2 лежат на биссектрисе внешнего угла A, которая перпендикулярна биссектрисе угла A, проходящей через центр вписанной окружности."
    ],
    "53958": [
        "Признаки и свойства касательной",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что касательные к окружности, проведённые через концы диаметра, параллельны.",
        "Подсказка: Касательная к окружности перпендикулярна радиусу, проведённому в точку касания.",
        "Решение: Пусть AB – диаметр окружности. Касательные, проведённые к   окружности в точках A и B, перпендикулярны прямой AB.  Следовательно, они параллельны."
    ],
    "54754": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Точка M расположена на отрезке AN, а точка N – на отрезке BM. Известно, что AB = 18 и AM : MN : NB = 1 : 2 : 3. Найдите MN.",
        "Решение: Разделим 18 на 1 + 2 + 3 = 6 равных частей. Тогда на одну часть приходится 18 : 6 = 3. Значит, MN = 2·6 = 12.",
        "Ответ: 6."
    ],
    "56472": [
        "Отношение, в котором биссектриса делит сторону",
        "Сложность: 2+",
        "Классы: 9",
        "Условие: а) В треугольнике ABC проведена биссектриса BD  внутреннего или внешнего угла. Докажите, что AD : DC = AB : BC.",
        "Решение: а) Первый способ. Докажем утверждение для биссектрисы внутреннего угла. Проведём через точку C прямую, параллельную BD, до пересечения с прямой AB в точке E. Так как ∠BEC = ∠ABD = ∠CBD = ∠BCE, то треугольник CBE – равнобедренный (BC = BE). По теореме Фалеса AD : DC = AB : BE = AB : BC."
    ],
    "86488": [
        "Признаки и свойства равнобедренного треугольника.",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Через вершины А и С треугольника АВС проведены прямые, перпендикулярные биссектрисе угла АВС. Они пересекают прямые СВ и ВА в точках К и М соответственно. Найдите длину АВ, если ВМ = 8 см, KC = 1 см и АВ > ВС.",
        "Решение: См. задачу",
        "Ответ: 9 см."
    ],
    "102816": [
        "Элементарные (основные) построения циркулем и линейкой",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Опустить из данной точки A вне прямой l перпендикуляр на эту прямую, проведя не более трёх линий? (Третьей линией должен быть перпендикуляр.)",
        "Решение: См. рисунок."
    ],
    "116143": [
        "Прямоугольный треугольник с углом в $30^\\circ$",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: В окружности провели диаметр AB и параллельную ему хорду CD, так, что расстояние между ними равно половине радиуса этой окружности (см. рис.). Найдите угол CAB.",
        "Решение: Пусть O – центр данной окружности, а K –   основание перпендикуляра, опущенного из O на CD (см. рис.).   Тогда в прямоугольном треугольнике OCK катет OK вдвое меньше гипотенузы OC, следовательно, ∠OCK = 30°. Поскольку CD || AB, то ∠AOC =   ∠OCK = 30°. Треугольник AOC – равнобедренный, поэтому ∠CAO = ∠ACO = (180° – 30°) : 2 = 75°.",
        "Ответ: 75°."
    ],
    "116335": [
        "Прямоугольники и квадраты. Признаки и свойства",
        "Сложность: 2+",
        "Классы: 8,9,10",
        "Условие: Две вершины квадрата расположены на гипотенузе равнобедренного прямоугольного треугольника, а две другие – на катетах.   Найдите сторону квадрата, если гипотенуза равна a.",
        "Подсказка: Пусть вершины L и M квадрата KLMN лежат на гипотенузе AB прямоугольного треугольника ABC, а вершины K и N – соответственно на катетах BC и AC. Тогда BL = KL = ML и AM = MN = ML.",
        "Решение: Пусть вершины L и M квадрата KLMN лежат на гипотенузе AB прямоугольного треугольника ABC, а вершины K и N соответственно на катетах BC и AC. Тогда AMN и BLK – также равнобедренные прямоугольные треугольники, поэтому BL = KL = ML, AM = MN = ML. Следовательно, ML = &frac13; AB.",
        "Ответ: a/3."
    ],
    "30307": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: На прямой отмечено 45 точек, лежащих вне отрезка AB. Докажите, что сумма расстояний от этих точек до точки A не равна сумме расстояний от этих точек до точки B.",
        "Решение: Примем длину отрезка AB за 1. Для каждой точки разность между расстоянием от неё до A и расстоянием от неё до AB равна ±1. Разность между указанными суммами расстояний равна сумме этих 45 разностей. Но сумма нечётного количества чисел ±1 нечётна, то есть не равна нулю."
    ],
    "53387": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Дан угол с вершиной A. От точки A отложен на стороне отрезок AB; из точки B проведена прямая, параллельная второй стороне данного  угла; на этой прямой отложен внутри угла отрезок BD, равный BA.  Докажите, что прямая AD делит данный угол пополам.",
        "Подсказка: AD – секущая при параллельных прямых.",
        "Решение: Пусть M – точка на второй стороне угла, отличная от A. Тогда ∠MAD = ∠ADB (внутренние накрест лежащие углы при параллельных прямых AM и BD и секущей AD). Поскольку ∠ADB = ∠BAD (треугольник ABD – равнобедренный), то ∠MAD = ∠BAD."
    ],
    "53910": [
        "Пересекающиеся окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Две окружности пересекаются в точках A и B; AM и AN – диаметры окружностей. Докажите, что точки M, N и B лежат на одной прямой.",
        "Решение: ∠ABM = ∠ABN = 90°. Следовательно, точки M и N лежат на прямой, перпендикулярной AB и проходящей через точку B."
    ],
    "54043": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Прямая, проведённая через вершину C треугольника ABC параллельно его биссектрисе BD, пересекает продолжение стороны AB в точке M.   Найдите углы треугольника MBC, если ∠ABC = 110°.",
        "Подсказка: Воспользуйтесь теоремой об углах, образованных параллельными прямыми и секущей.",
        "Решение: Поскольку MC || BD, то по свойству параллельных прямых  ∠BMC = ∠ABD = 55°, ∠BCM = ∠DBC = 55°.",
        "Ответ: 55°, 70°, 55°."
    ],
    "54755": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: На прямой взяты точки A, O и B. Точки A1 и B1 симметричны соответственно точкам A и B относительно точки O.   Найдите A1B, если AB1 = 2.",
        "Решение: Отрезок A1B симметричен отрезку AB1 относительно точки O, поэтому A1B = AB1.",
        "Ответ: 2."
    ],
    "54765": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Луч света, пущенный из точки M, зеркально отразившись от прямой AB в точке C, попал в точку N.   Докажите, что биссектриса угла MCN перпендикулярна прямой AB. (Угол падения равен углу отражения.)",
        "Подсказка: Равные смежные углы равны по 90°."
    ],
    "78475": [
        "Принцип Дирихле (углы и длины)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На плоскости даны 7 прямых, никакие две из которых не параллельны. Доказать,  что найдутся две из них, угол между которыми меньше 26°.",
        "Решение: Возьмём на плоскости произвольную точку A и проведём через неё 7 прямых, параллельных прямым данной системы. Углы между построенными прямыми будут равны соответствующим углам между прямыми исходной системы. Но через точку A у нас проходит 7 прямых, которые делят угол в 360° на 14 частей.   Значит, один из этих углов не больше 360° : 14 = 255/7° < 26°."
    ],
    "102704": [
        "Метод координат на плоскости",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Даны точки A(–1, 5) и B(3, –7). Найдите расстояние от начала координат до середины отрезка AB.",
        "Решение: Координаты середины M отрезка AB равны x0 = ½ (– 1 + 3) = 1, y0 =  ½ (5 – 7) = 1. Следовательно, OM – диагональ единичного квадрата (O – начало координат).",
        "Ответ: ."
    ],
    "108734": [
        "Разрезания на части, обладающие специальными свойствами",
        "Сложность: 3",
        "Классы: 6,7,8,9",
        "Условие: Есть три треугольника: остроугольный, прямоугольный и тупоугольный. Саша взял  себе один треугольник, а Боря – два оставшихся. Оказалось, что Боря может приложить (без наложения) один из своих треугольников к другому, и получить треугольник, равный Сашиному. Какой из этих треугольников взял Саша?",
        "Решение: Саша может разрезать одной прямой свой треугольник на два, равных Бориным. При этом один из концов разреза расположен в вершине Сашиного треугольника, а другой – на противоположной стороне.     Посмотрим на сторону, которую пересёк разрез. Разрез не перпендикулярен этой стороне (иначе получится два прямоугольных треугольника, что противоречит условию). Значит, получится один тупоугольный треугольник и один остроугольный или прямоугольный.     В первом случае Сашин треугольник – прямоугольный. Пример приведён на рисунке.",
        "Ответ: Прямоугольный."
    ],
    "108538": [
        "Метод координат на плоскости",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что прямые y = k1x + l1 и y = k2x + l2 параллельны тогда и только тогда, когда   k1 = k2 и l1 ≠ l2.",
        "Подсказка: Прямые параллельны тогда и только тогда, когда система    не имеет решений."
    ],
    "30285": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: Может ли прямая, не содержащая вершин замкнутой 11-звенной ломаной, пересекать все её звенья?",
        "Решение: Прямая делит плоскость на две полуплоскости. Будем двигаться по ломаной. При каждом пересечении звена ломаной с прямой мы переходим из одной полуплоскости в другую. Но после обхода по всем звеньям мы вернулись в исходную точку, то есть в ту же полуплоскость. Значит, прямая пересеклась с чётным числом звеньев.",
        "Ответ: Не может."
    ],
    "30288": [
        "Четность и нечетность",
        "Сложность: 3",
        "Классы: 5,6,7",
        "Условие: Можно ли нарисовать девятизвенную замкнутую ломаную, каждое звено которой пересекается ровно с одним из остальных звеньев?",
        "Решение: Если ломаная пересекает каждое свое звено один раз, то её звенья разбиваются на пары (в пару входят звенья, пересекающие друг друга). Значит, их число чётно, что противоречит условию.",
        "Ответ: Нельзя."
    ],
    "37549": [
        "Принцип Дирихле (конечное число точек, прямых и т. д.)",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Докажите, что никакая прямая не может пересечь все три стороны треугольника (в точках, отличных от вершин).",
        "Решение: Прямая делит плоскость на две полуплоскости. По принципу Дирихле найдутся две вершины, лежащие в одной полуплоскости. Сторона, соединяющая эти вершины, не пересекает прямую."
    ],
    "53411": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Через данную точку проведите прямую, пересекающую две данные прямые под равными углами.",
        "Решение: Если данные прямые параллельны, то годится любая не параллельная им прямая, проходящая через данную точку.   В противном случае две искомые прямые параллельны биссектрисам углов, образованных данными прямыми."
    ],
    "54756": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Точки A, B, C последовательно расположены на одной прямой и   AB : BC = 3 : 4. Найдите отношения AB : AC и BC : AC.",
        "Решение: На отрезок AC приходится 3 + 4 = 7 частей. На отрезок AB приходится три части, а на отрезок BC – четыре.   Следовательно, AB : AC = 3 : 7, BC : AC = 4 : 7.",
        "Ответ: 3 : 7, 4 : 7."
    ],
    "53412": [
        "Свойства биссектрис, конкуррентность",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что биссектрисы треугольника пересекаются в одной точке.",
        "Подсказка: Точка пересечения двух биссектрис треугольника равноудалена от всех сторон треугольника.",
        "Решение: Пусть O – точка пересечения биссектрис треугольника ABC,  проведённых из вершин B и C. Поскольку точка O лежит на биссектрисе угла B, то она равноудалена от прямых AB и BC. В то же время точка O лежит на биссектрисе угла C, поэтому она равноудалена от прямых AC и BC. Значит, точка O равноудалена от прямых AB и AC. Так как она находится внутри треугольника ABC, то лежит и на биссектрисе угла A."
    ],
    "53413": [
        "Свойства биссектрис, конкуррентность",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Биссектрисы BB1 и CC1 треугольника ABC пересекаются в точке M, биссектрисы B1B2 и C1C2 треугольника   AB1C1 пересекаются в точке N.   Докажите, что точки A, M и N лежат на одной прямой.",
        "Решение: Поскольку биссектрисы треугольника пересекаются в одной точке, точки M и N лежат на биссектрисе угла A."
    ],
    "53414": [
        "Серединный перпендикуляр к отрезку (ГМТ)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что серединные перпендикуляры к сторонам треугольника пересекаются в одной точке.",
        "Подсказка: Точка пересечения серединных перпендикуляров, проведённых к двум сторонам треугольника, равноудалена от всех вершин треугольника.",
        "Решение: Проведём серединные перпендикуляры к сторонам AB и AC  треугольника ABC. Они пересекаются, так как перпендикулярные им прямые AB и AC пересекаются.     Пусть O – точка пересечения серединных перпендикуляров к  сторонам AB и AC. Тогда по свойству серединного перпендикуляра к  отрезку OA = OB и  OA = OC, поэтому OB = OC. Значит, точка O лежит на серединном перпендикуляре к отрезку BC, то есть серединный перпендикуляр к стороне BC также проходит через точку O."
    ],
    "53418": [
        "Биссектриса угла",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Две параллельные прямые пересечены третьей. Найдите угол между биссектрисами внутренних односторонних углов.",
        "Подсказка: Воспользуйтесь теоремой о сумме углов треугольника.",
        "Решение: Пусть прямые l и m параллельны, а третья прямая пересекает их соответственно в точках A и B. Возьмём на прямой l точку C, а на прямой m – точку D так, чтобы эти точки лежали по одну сторону от прямой AB. Тогда углы BAC и ABD – внутренние односторонние. По свойству параллельных прямых   ∠BAC + ∠ABD = 180°. Пусть биссектрисы этих углов пересекаются в точке O. Тогда ∠OAB + ∠OBA = ½ ∠BAC + ½ ∠ABD = ½ 180° = 90°. Следовательно, треугольник AOB – прямоугольный.",
        "Ответ: 90°."
    ],
    "53433": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Некоторая прямая пересекает параллельные прямые a и b в точках  A и B соответственно. Биссектриса одного из образовавшихся углов с  вершиной B пересекает прямую a в точке C. Найдите AC, если AB = 1.",
        "Подсказка: Докажите, что треугольник ABC – равнобедренный.",
        "Решение: Пусть D – точка на прямой b, лежащая с точкой C по одну сторону от прямой AB. Тогда ∠ACB = ∠DBC = ∠ABC, поэтому треугольник ABC – равнобедренный. Следовательно, AC = AB.",
        "Ответ: 1."
    ],
    "53564": [
        "Сумма внутренних и внешних углов многоугольника",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что у выпуклого многоугольника может быть не более трёх острых углов.",
        "Подсказка: Найдите сумму внешних углов выпуклого n-угольника.",
        "Решение: Если у выпуклого многоугольника более трёх острых внутренних углов, то среди его внешних углов более трёх тупых, что невозможно, поскольку сумма всех его внешних углов равна 360°."
    ],
    "53641": [
        "Признаки и свойства равнобедренного треугольника.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Пусть AE и CD – биссектрисы равнобедренного треугольника ABC (AB = BC). Докажите, что ∠BED = 2∠AED.",
        "Решение: Треугольники ABE и CBD равны по стороне и двум углам. Следовательно, треугольник DBE – равнобедренный и ∠BED = ∠C. Поэтому DE || AC и   ∠AED = ∠CAE = ½ ∠C."
    ],
    "53662": [
        "Признаки и свойства равнобедренного треугольника.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Через вершины A и C треугольника ABC проведены прямые, перпендикулярные биссектрисе угла ABC и пересекающие прямые CB и BA в точках K и M соответственно. Найдите AB, если BM = 8, KC = 1.",
        "Решение: Пусть точка K расположена на стороне BC треугольника ABC. Треугольники ABK и MBC – равнобедренные (биссектриса, проведённая из вершины B, является высотой), поэтому AB = BK = BC – CK = 8 – 1 = 7.     Если точка K расположена на продолжении отрезка BC за точку  C, то аналогично находим, что AB = 9.",
        "Ответ: 7 или 9."
    ],
    "53712": [
        "Признаки и свойства касательной",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Из конца A диаметра AC окружности опущен перпендикуляр AP на касательную, проведённую через лежащую на окружности точку B, отличную от A и C. Докажите, что AB – биссектриса угла PAC.",
        "Подсказка: Соедините точку B с центром окружности.",
        "Решение: Пусть O – центр окружности. Тогда ∠BAO = ∠ABO = 90° – ABP = ∠PAB."
    ],
    "53965": [
        "Окружность, вписанная в угол",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Окружность касается двух параллельных прямых и их секущей.   Докажите, что отрезок секущей, заключённый между параллельными прямыми, виден из центра окружности под прямым углом.",
        "Подсказка: Центр окружности, вписанной в угол, лежит на биссектрисе угла.",
        "Решение: Обозначим через A и B точки пересечения прямой c с  параллельными прямыми a и b соответственно. Пусть окружность с  центром O касается прямых a и b соответственно в точках M и N. Тогда AO – биссектриса угла BAM, а BO – биссектриса угла ABN. Поскольку ∠BAM + ∠ABN = 180°, то   ∠BAO + ∠ABO = ½ ∠BAM + ½ ∠ABN = ½ (∠BAM + ∠ABN) = 90°. Следовательно, ∠AOB = 180° – (∠BAO + ∠ABO) = 90°."
    ],
    "54762": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Один из двух смежных углов на 30° больше другого. Найдите эти углы.",
        "Решение: Удвоенный меньший угол равен 180° – 30° = 150°. Следовательно, меньший угол равен 75°.",
        "Ответ: 105°, 75&deg."
    ],
    "53993": [
        "Общая касательная к двум окружностям",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Прямая, проходящая через центры двух окружностей называется их линией центров.   Докажите, что общие внешние (внутренние) касательные к двум окружностям пересекаются на линии центров этих окружностей.",
        "Подсказка: Центр окружности, вписанной в угол, лежит на биссектрисе этого  угла.",
        "Решение: Пусть общие внешние касательные к двум окружностям разного радиуса пересекаются в точке M. Поскольку эти окружности вписаны в угол с вершиной M, то их центры лежат на биссектрисе этого угла, а так как через две различные точки (в данном случае – центры окружностей) проходит только одна прямая, то линия центров лежит на указанной биссектрисе.     Аналогично доказывается утверждение для общих внутренних касательных (в этом случае радиусы окружностей могут быть равными)."
    ],
    "54095": [
        "Признаки и свойства параллелограмма",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что отрезок, соединяющий середины противоположных сторон параллелограмма, проходит через его центр.",
        "Подсказка: Пусть M и N – середины сторон BC и AD параллелограмма ABCD. Диагональ MN параллелограмма AMCN  проходит через середину его диагонали AC.",
        "Решение: Пусть M и N – середины сторон соответственно BC и AD параллелограмма ABCD. Тогда противоположные стороны MC и AN четырёхугольника AMCN равны и параллельны, следовательно, это  параллелограмм. Его диагональ MN проходит через середину диагонали AC, то есть через центр параллелограмма ABCD."
    ],
    "54626": [
        "Подобные треугольники и гомотетия (построения)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: С помощью циркуля и линейки через точку внутри угла проведите прямую, отсекающую от сторон этого угла отрезки, отношение которых равно данному.",
        "Подсказка: Примените метод подобия.",
        "Решение: Пусть M – точка внутри данного угла AOB, а искомая прямая пересекает стороны OA и OB этого угла в точках X и Y так, что OX : OY = m : n. Тогда любая параллельная ей прямая, пересекающая стороны этого угла, отсекает отрезки с тем же отношением."
    ],
    "54771": [
        "Необычные построения  (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Имеется угольник с углом в 70°. Как построить с его помощью угол в 40°?",
        "Решение: Первый способ. 40° = 180° – 2·70°."
    ],
    "54780": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Из точки O на плоскости выходят 4 луча, следующие друг за другом по часовой стрелке: OA, OB, OC и OD. Известно, что сумма углов AOB и COD равна 180°. Докажите, что биссектрисы углов AOC и BOD перпендикулярны.",
        "Решение: Положим ∠AOB = 2α, ∠BOC = 2β, ∠COD = 2γ. По условию 2α + 2γ = 180°. Пусть K и M – точки на биссектрисах углов AOC и BOD соответственно. Тогда ∠KOC = α + β, ∠BOM = β + γ. Следовательно, ∠KOM = ∠KOC + ∠BOM – ∠BOC = (α + β) + (β + γ) – 2β = α + γ = 90°."
    ],
    "55715": [
        "Поворот (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Пусть две прямые пересекаются под углом α. Докажите, что при повороте на угол α (в одном из направлений) относительно произвольной точки одна из этих прямых перейдёт в прямую, параллельную другой.",
        "Решение: Пусть M – точка пересечения прямых l1 и l2, α – угол между этими прямыми, l – образ прямой l2 при повороте относительно точки O на угол α против часовой стрелки. Тогда прямая l пересекает прямую l2 под углом α. Следовательно, l || l1."
    ],
    "56463": [
        "Признаки и свойства параллелограмма",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На диагонали BD параллелограмма ABCD взята точка K. Прямая AK пересекает прямые BC и CD в точках L и M. Докажите, что AK² = LK·KM.",
        "Решение: Ясно, что AK : KM = BK : KD = LK : AK, то есть AK² = LK·KM."
    ],
    "56465": [
        "Отрезки, заключенные между параллельными прямыми",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На основании AD трапецииABCD взята точка E так, что AE = BC. Отрезки CA и CE пересекают диагональ BD в точках O и P соответственно.   Докажите, что если BO = PD, то AD² = BC² + AD·BC.",
        "Решение: Так как BO = PD, то BC : AD = BO : OD = DP : PB = DE : EA. Поскольку EA = BC, то BC² = DE·AD = (AD – BC)AD = AD² – BC·AD."
    ],
    "56514": [
        "Треугольник, образованный основаниями двух высот и вершиной",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В остроугольном треугольнике ABC проведены высоты AA1,  BB1 и CC1. Докажите, что если A1B1 || AB и B1C1 || BC, то A1C1 || AC.",
        "Решение: Согласно задаче 52357 б)   B1A1C = ∠A. Так как A1B1 || AB, то ∠B1A1C = ∠B. Поэтому  ∠A = ∠B.    Аналогично ∠B = ∠C. Поэтому треугольникABC равносторонний и A1C1 || AC."
    ],
    "56528": [
        "Подобные треугольники (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На прямой l даны точки A, B, C и D. Через точки A и  B, а также через точки C и D проводятся параллельные прямые.  Докажите, что диагонали полученных таким образом параллелограммов (или их  продолжения) пересекают прямую l в двух фиксированных точках.",
        "Решение: Рассмотрим случай, когда точки A, B, C, D расположены именно в таком порядке. Пусть после проведения пар параллельных прямых образовался параллелограмм KLMN (см. рис.), причём прямая KM пересекает l в точке T. Проведём через точку K прямую m || l, пересекающую прямые AM и DM в точках P и Q соотвественно. Тогда точка T делит отрезок AD в отношении PK : KQ = AB : CD."
    ],
    "54763": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Один из двух смежных углов в 3 раза меньше другого. Найдите эти углы.",
        "Решение: Сумма этих углов равна 180° и в 4 раза больше меньшего угла. Значит, меньший угол равен 45&deg.",
        "Ответ: 45°, 135°."
    ],
    "56530": [
        "Признаки и свойства параллелограмма",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На сторонах AD и CD параллелограммаABCD  взяты точки M и N так, что MN || AC. Докажите, что SABM = SCBN.",
        "Решение: SABM : SABD = AM : AD = CN : CD = SBCN : SBCD = SBCN : SABD."
    ],
    "56531": [
        "Признаки и свойства параллелограмма",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На диагоналиAC параллелограммаABCD взяты точки P и Q так, что AP = CQ. Точка M такова, что PM || AD и QM || AB.  Докажите, что точка M лежит на диагонали BD.",
        "Решение: Пусть O – центр параллелограмма ABCD Можно считать, что AP < AO. Как прямая PM, так и прямая QM пересекают диагональ BD в точке, которая делит отрезок OD в отношении AP : AO. Значит, эта точка совпадает с M."
    ],
    "64938": [
        "Системы точек и отрезков. Примеры и контрпримеры",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: Соедините точки А и В (см. рисунок) ломаной из четырёх отрезков одинаковой длины так, чтобы выполнялись следующие условия:    1) концами отрезков могут быть только какие-то из отмеченных точек;    2) внутри отрезков не должно быть отмеченных точек;    3) соседние отрезки не должны лежать на одной прямой.",
        "Ответ: См. рис."
    ],
    "65216": [
        "Задачи на движение",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: В некоторый момент угол между часовой и минутной стрелками равен α. Через час он опять равен α. Найдите все возможные значения α.",
        "Решение: По прошествии часа минутная стрелка вернется в исходное положение, а часовая пройдёт 1/12 часть окружности, то есть повернётся на угол, равный 30°. Равенство углов, указанное в условии, означает, что минутная стрелка является либо биссектрисой угла между двумя положениями часовой стрелки (рис. слева), либо лучом, дополнительным к этой биссектрисе (рис. справа). В первом случае α = 30° : 2 = 15°, а во втором   α = (360° – 30°) : 2 = 165°.",
        "Ответ: 15° или 165°."
    ],
    "76512": [
        "Параллелограммы (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Сторона AD параллелограмма ABCD разделена на n равных частей. Первая точка деления P соединена с вершиной B.   Доказать, что прямая BP отсекает на диагонали AC часть AQ, которая равна 1/n+1 части диагонали: AQ = AC/n+1.",
        "Решение: Разделим сторону BC тоже на n равных частей и проведём через точки деления прямые, параллельные прямой BP. Они разделят диагональ AC на  n + 1 равных частей."
    ],
    "77969": [
        "Построения с помощью прямого угла",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Разделить отрезок пополам с помощью угольника. (С помощью угольника можно  проводить прямые и восстанавливать перпендикуляры, опускать перпендикуляры  нельзя.)",
        "Решение: Восставим перпендикуляр l к AB в точке A; отметим на нём точки C и D. Восставим далее перпендикуляр l' к AB в точке B, а затем проведём перпендикуляры к прямой l в точках C и D до их пересечения с l' соответственно в точках C' и D'. Обозначим через X точку пересечения прямых AD' и BD и через Y – точку пересечения прямых AC' и BC. Тогда прямая XY пересекает отрезок AB в его середине."
    ],
    "86932": [
        "Тетраэдр и пирамида",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Дана треугольная призма ABCA1B1C1. Точки M, N и K – середины рёбер BC, AC и AB соответственно.   Докажите, что прямые MA1, NB1 и KC1 пересекаются в одной точке.",
        "Решение: Поскольку MN – средняя линия треугольника ABC, MN || AB и MN = ½ AB, поэтому MN || A1B1 и MN = ½ A1B1. Проведём плоскость через параллельные прямые MN и A1B1. Эта плоскость пересекает данную призму по трапеции A1B1MN, у которой основание A1B1 вдвое больше основания MN, поэтому диагонали A1M и B1N делятся точкой O их пересечения в одном и том же отношении: MO : OA1 = NO : OB1 = 1 : 2.     Аналогично докажем, что отрезок KC1 пересекается с каждым из отрезков MA1 и NB1 и делится ими в том же отношении. Следовательно, все три указанных отрезка проходят через точку O."
    ],
    "54766": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Точка M лежит внутри угла AOB, OC – биссектриса этого угла.  Докажите, что угол MOC равен модулю полуразности углов AOM и BOM.",
        "Решение: Пусть точка M лежит внутри угла BOC. Тогда ∠  MOC = ∠AOM – ∠AOC = ∠AOM – ½ (∠AOM + ∠BOM) = ½ (∠AOM – ∠BOM).     Если же точка M лежит внутри угла AOC, то, аналогично,   ∠MOC = ½ (∠BOM – ∠AOM).     Если точка M лежит на биссектрисе OC, то утверждение задачи  очевидно."
    ],
    "108544": [
        "Метод координат на плоскости",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Даны точки A(-6, 1) и B(4, 6). Найдите координаты точки C, делящей отрезок AB в отношении 2 : 3, считая от точки A.",
        "Решение: Если точка C(x0, y0) делит отрезок с концами в точках  A(x1, y1) и B(x2, y2) в отношении 2 : 3, считая от точки A, то по теореме о пропорциональных отрезках проекция точки C на ось OX делит проекцию отрезка AB на эту ось в том же отношении, то есть  = &frac23;. Отсюда находим, что  x0 = &frac15; (3x1 + 2x2) = (3·(–6) + 2·4) : 5 = –2.    Аналогично y0 = &frac15; (3y1 + 2y2) = (3·1 + 2·6) : 5 = 3.",
        "Ответ: (–2, 3)."
    ],
    "108694": [
        "Признаки и свойства параллелограмма",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Точки K и L – середины сторон AB и BC   четырёхугольника ABCD. На стороне CD выбрана такая точка M, что CM : DM = 2 : 1. Известно, что DK || BM и  AL || CD. Докажите, что четырёхугольник ABCD – трапеция.",
        "Решение: Пусть  MD = a. Тогда CM = 2a, а прямая AL пересекает отрезки DK и BM в точках P и Q соответственно. DPQM – параллелограмм, поэтому  PQ = DM = a, а так как K – середина AB, то AP = PQ = a. Кроме того, LQ – средняя линия треугольника BCM, поэтому QL = ½ CM = a. Значит,  AL = 3a = CD. Следовательно,  ALCD – параллелограмм, а ABCD – трапеция."
    ],
    "108901": [
        "Отношение площадей треугольников с общим основанием или общей высотой",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На стороне BC треугольника ABC отмечены такие точки M и N, что CM = MN = NB. К стороне BC в точке N восставлен перпендикуляр, пересекающий сторону AB в точке K. Оказалось, что площадь треугольника AMK в 4,5 раза меньше площади исходного треугольника. Докажите, что треугольник ABC – равнобедренный.",
        "Решение: Заметим, что точка K лежит на серединном перпендикуляре  к отрезку BM, поэтому треугольник BKM – равнобедренный.  Пусть SABC = S. Тогда  SABM = &frac23; S, SBKM = SABM – SAKM = &frac23; S – 2/9 S = 4/3 S = &frac23; SABM. Значит, BK = &frac23; BA.     Поэтому KM || AC, то есть треугольник BAC подобен равнобедренному треугольнику BKM."
    ],
    "111468": [
        "Вспомогательные подобные треугольники",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В треугольнике ABC биссектриса AD делит сторону BC в отношении BD : DC = 2 : 1. В каком отношении медиана CE делит эту биссектрису?",
        "Решение: Пусть медиана CE и биссектриса AD пересекаются в точке M.",
        "Ответ: 3 : 1, считая от вершины A."
    ],
    "115574": [
        "Вписанный угол, опирающийся на диаметр",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На катетах прямоугольного треугольника как на диаметрах построены окружности. Найдите их общую хорду, если катеты равны 3 и 4.",
        "Решение: Пусть CD – общая хорда окружностей, построенных на катетах AC = 3 и BC = 4 прямоугольного   треугольника ABC как на диаметрах. Тогда   ∠ADC = ∠BDC = 90° как вписанные углы, опирающиеся на диаметр. Значит, точка D лежит на гипотенузе AB, а CD – высота прямоугольного треугольника ABC, проведённая из вершины прямого угла.     По теореме Пифагора AB = 5, а так как 2 SABC = AC·BC = AB·CD, то CD = 3·4 : 5.",
        "Ответ: 2,4."
    ],
    "116095": [
        "Радикальная ось",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Расстояние между центрами окружностей больше суммы их радиусов.   Докажите, что середины отрезков четырёх общих касательных этих окружностей лежат на одной прямой.",
        "Решение: Поскольку расстояние между центрами окружностей больше суммы их радиусов, окружности расположены одна вне другой, поэтому у них есть две внешние и две внутренние  общие касательные.     Пусть прямая касается данных окружностей в точках A и B, а M – середина отрезка AB. Тогда MA = MB, то есть отрезки касательных, проведённых к окружностям из точки M, равны. Значит, точка M лежит на радикальной оси данных окружностей.     То же верно для середин отрезков остальных трёх касательных."
    ],
    "64558": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Диагональ BD параллелограмма ABCD образует углы по 45° со стороной BC и высотой, проведённой из вершины D к стороне АВ.   Найдите угол АСD.",
        "Решение: Из условия следует, что указанная высота параллельна стороне ВС, следовательно, эта высота совпадает со стороной DA, значит, ABCD  – прямоугольник (см. рис.). Так как ∠АВD = ∠CВD = 45°, то BD – биссектриса угла В этого прямоугольника, значит, ABCD  – квадрат. Следовательно, СА – биссектриса угла С квадрата, то есть ∠АСD = 45°.",
        "Ответ: 45°."
    ],
    "116332": [
        "Признаки подобия",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: На сторонах AB и BC параллелограмма ABCD расположены точки N и M соответственно, причём AN : NB = 3 : 2, BM : MC = 2 : 5. Прямые AM и DN пересекаются в точке O. Найдите отношения OM : OA и ON : OD.",
        "Подсказка: Продолжите DN до пересечения с прямой BC и рассмотрите две пары подобных треугольников.",
        "Решение: Продолжим DN до пересечения с прямой BC в точке T. Положим BM = 6a, CM = 15a. Из подобия треугольников TNB и DNA (коэффициент &frac23;) находим, что TB = &frac23; AD = &frac23; BC = 14a, а из подобия треугольников TOM и DOA – OM : OA = TM : AD = 20a : 21a.    Аналогично находим, что ON : OD = 6 : 35.",
        "Ответ: 20 : 21; 6 : 35."
    ],
    "34925": [
        "Подсчет двумя способами",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На плоскости дана несамопересекающаяся замкнутая ломаная, никакие три вершины которой не лежат на одной прямой. Назовём пару несоседних звеньев особой, если продолжение одного из них пересекает другое звено. Докажите, что число особых пар чётно.",
        "Подсказка: Можно использовать следующее соображение: ломаная заходит в некоторую область столько же раз, сколько выходит.",
        "Решение: Рассмотрим два соседних звена ломаной AB и BC. Продолжим эти звенья за вершину B и получим лучи BM и BN, которые образуют угол MBN (точки M и N выбираются достаточно далеко на сторонах угла). Так как точки A и C лежат вне этого угла, ломаная пересекает стороны угла чётное число раз: сколько раз она зайдёт в него, столько же раз и выйдет. Образуем подобные углы при всех вершинах. Суммарное число пересечений сторон этих углов со звеньями ломаной будет чётным, а оно, очевидно, равно числу особых пар звеньев."
    ],
    "35586": [
        "Системы точек и отрезков (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На плоскости нарисовано несколько точек. Докажите, что можно провести прямую так, чтобы расстояния от всех точек до неё были различными.",
        "Подсказка: Если расстояния от двух точек до прямой одинаковы, то эта прямая либо параллельна прямой, соединяющей эти две точки, либо проходит через середину отрезка, соединяющего данные точки.",
        "Решение: Рассмотрим две из данных точек A и B. Пусть некоторая прямая l обладает тем свойством, что расстояния до неё от точек A и B равны. Если точки A и B лежат по одну сторону от прямой l, то прямая l параллельна прямой B. Если же точки A и B лежат по разные стороны от прямой l, то как нетрудно видеть, прямая l проходит через середину отрезка AB. Итак, если расстояния от двух точек до прямой одинаковы, то эта прямая либо параллельна прямой, соединяющей данные точки, либо она проходит через середину отрезка, соединяющего данные точки.     Рассмотрим все прямые, проходящие через всевозможные пары данных точек. Эти прямые образуют конечное множество L. Рассмотрим также середины всевозможных отрезков, соединяющих пары данных точек. Эти точки образуют конечное множество P. Выберем теперь прямую, не параллельную никакой прямой из множества L и не проходящую ни через одну из точек множества P (это возможно ввиду конечности множеств L и P)."
    ],
    "35651": [
        "Покрытия",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Дано бесконечное число углов. Докажите, что этими углами можно покрыть   плоскость.",
        "Подсказка: Заметьте, что любым углом можно покрыть любой круг.",
        "Решение: Рассмотрим бесконечное семейство концентрических кругов с радиусами 1, 2,   3, ... Объединение этих кругов покрывает всю плоскость. Покроем круг радиуса 1 первым углом, круг радиуса 2 – вторым углом, и т.д. до бесконечности. В результате вся плоскость будет покрыта данными углами."
    ],
    "52339": [
        "Вписанный угол равен половине центрального",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите, что вписанный угол равен половине соответствующего центрального угла (или дуги) окружности.",
        "Подсказка: Разберите три случая: центр окружности лежит на стороне угла, внутри угла, вне угла.",
        "Решение: Пусть центр O окружности лежит на стороне AB вписанного угла BAC (рис. слева). Поскольку BOC – внешний угол равнобедренного треугольника AOC, то ∠BOC = ∠BAC + ∠ACO = 2∠BAC. Следовательно,  ∠BAC = ½ ∠BOC, то есть вписанный угол BAC равен половине центрального угла BOC, или половине дуги BC, не содержащей точки A."
    ],
    "52579": [
        "Касающиеся окружности",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Через точку касания двух окружностей проведена секущая. Докажите, что радиусы и касательные, проведённые через концы образовавшихся хорд, параллельны.",
        "Подсказка: Докажите равенство углов, образованных соответствующими радиусами с секущей. Не забудьте рассмотреть оба возможных случая: внешнего и внутреннего касания окружностей.",
        "Решение: Рассмотрим случай внешнего касания. Пусть O1 и O2 – центры окружностей, M – точка касания, A1 и A2 — соответственно точки  пересечения окружностей с секущей. Тогда ∠O1A1M = ∠O1MA1 = ∠O2MA2 = ∠O2A2M. Поскольку накрест лежащие углы равны, то прямые O1A1 и O2A2 параллельны. Следовательно, параллельны и перпендикулярные им касательные.     Аналогичное доказательство проходит и для случая внутреннего касания окружностей."
    ],
    "64942": [
        "Три прямые, пересекающиеся в одной точке",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Графики трёх функций y = ax + a, y = bx + b и y = cx + d имеют общую точку, причём a ≠ b. Обязательно ли c = d?",
        "Решение: Ясно, что точка (–1, 0) принадлежит первым двум прямым. Так как a ≠ b, то эти прямые различны, значит, другой общей точки у них нет. Следовательно, точка (–1, 0) принадлежит и  графику третьей функции, то есть 0 = – c + d.",
        "Ответ: Обязательно."
    ],
    "53389": [
        "Сумма углов треугольника. Теорема о внешнем угле.",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Биссектрисы углов A и B треугольника ABC одинаково наклонены к сторонам BC и AC. Найдите зависимость между углами A и B.",
        "Подсказка: Рассмотрите два случая. Воспользуйтесь теоремой о внешнем угле треугольника.",
        "Решение: Пусть AK и BM – биссектрисы треугольника ABC, P – точка их пересечения, ∠A = α, ∠B = β.     Из условия следует, что ∠AKC = ∠BMC или ∠AKC + ∠BMC = 180°. В первом случае  ∠AKC = ∠KAB + ∠KBA = α/2 + β,  ∠BMC = ∠MBA + ∠MAB = α + β/2.     Тогда α/2 + β = α + β/2. Следовательно, α = β.     Во втором случае аналогично получим, что α + β = 120°.",
        "Ответ: ∠A = ∠B или ∠A + ∠B = 120°."
    ],
    "53415": [
        "Серединный перпендикуляр к отрезку (ГМТ)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите, что около любого треугольника можно описать окружность, притом единственную.",
        "Подсказка: См. замечание к задаче 53414.",
        "Решение: Центр описанной окружности равноудален от всех вершин треугольника. Такая точка должна лежать на серединном перпендикуляре к каждой стороне треугольника и, следовательно, единственна. Существование такой точки доказано в задаче 53414."
    ],
    "53526": [
        "Средняя линия трапеции",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Найдите отношение оснований трапеции, если известно, что её средняя линия делится диагоналями на три равные части.",
        "Решение: Пусть AD = a, BC = b – основания трапеции ABCD (a > b), M и N – середины сторон AB и CD соответственно, K – точка пересечения средней линии MN с диагональю AC. Тогда   MK = ½ BC = b/2 как средняя линия треугольника ABC.     По условию MN = ½ (a + b) = 3b/2. Отсюда  a = 2b.",
        "Ответ: 1 : 2."
    ],
    "53538": [
        "Прямоугольники и квадраты. Признаки и свойства",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В прямоугольнике ABCD AB = 3, BD = 6. На продолжении биссектрисы BL треугольника ABD взята точка N, причём точка L делит отрезок BN в отношении 10 : 3, считая от точки B. Что больше: BN или CL?",
        "Решение: Поскольку BL – биссектриса, то AL : LD = 1 : 2.     Пусть M – проекция точки N на AD. Тогда AM : DM = 13/10 : (3 – 13/10) = 13 : 17, то есть AM < DM.     Значит, и BN < CL.",
        "Ответ: BN < CL."
    ],
    "53642": [
        "Признаки и свойства равнобедренного треугольника.",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Пусть AE и CD – биссектрисы треугольника ABC, ∠BED = 2∠AED и ∠BDE = 2∠EDC. Докажите, что треугольник ABC – равнобедренный.",
        "Подсказка: Пусть M – точка пересечения биссектрис треугольника ABC, N – точка пересечения биссектрис треугольника BDE.   Докажите, что прямая BN перпендикулярна DE.",
        "Решение: Пусть M – точка пересечения биссектрис треугольника ABC, N – точка пересечения биссектрис треугольника BDE (см. рис.). Обозначим   ∠EDC = ∠BDN = ∠EDN = α, ∠DEA = ∠BEN = ∠DEN = β."
    ],
    "53739": [
        "Трапеции (прочее)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Каждая из боковых сторон AB и CD трапеции ABCD разделена на пять равных частей. Пусть M и N – вторые точки деления на боковых сторонах, считая от вершин B и C соответственно. Найдите MN, если основания AD = a и BC = b.",
        "Подсказка: Проведите диагональ трапеции.",
        "Решение: Проведём через точку M прямую, параллельную основаниям. Пусть N1 – точка её пересечения с CD. Из теоремы Фалеса следует, что CN1 = 2/5 CD = CN. Поэтому точка N1 совпадает с N. Следовательно, MN || AD.",
        "Ответ: 1/5 (2a + 3b)."
    ],
    "53778": [
        "Признаки подобия",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Диагонали четырёхугольника ABCD пересекаются в точке O.  Докажите, что AO·BO = CO·DO тогда и только тогда, когда BC || AD.",
        "Подсказка: Примените признаки подобия треугольников.",
        "Решение: Если BC || AD, то треугольники BOC и DOA подобны по двум углам. Поэтому BO : OD = CO : OA. Следовательно, AO·BO = CO·DO."
    ],
    "53783": [
        "Средняя линия треугольника",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В четырёхугольнике ABCD точка E – середина AB, F – середина CD.   Докажите, что середины отрезков AF, CE, BF и DE являются вершинами параллелограмма.",
        "Подсказка: Четырёхугольник, диагонали которого точкой пересечения делятся пополам, – параллелограмм.",
        "Решение: Пусть точки M, N, K и L – середины отрезков AF, CE, BF и DE соответственно. Средняя линия LN треугольника DEC пересекает медиану EF этого треугольника в её середине – точке O, а средняя линия MK треугольника AFB пересекает медиану FE этого треугольника также в её середине, то есть также в точке O. При этом точка O – середина LN и середина MK.  Следовательно, MNKL – параллелограмм."
    ],
    "53880": [
        "Отношение, в котором биссектриса делит сторону",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Биссектриса внешнего угла A треугольника ABC пересекает  продолжение стороны BC и точке M. Докажите, что   BM : MC = AB : AC.",
        "Решение: Через вершину B проведём прямую, параллельную AM. Пусть  эта прямая пересекает сторону AC в точке P. Отметим точку Q на продолжении стороны AC за точку A. Тогда   ∠APB = ∠QAM = ∠MAB = ∠ABP,   значит, треугольник APB – равнобедренный, PA = AB.      Из теоремы о пропорциональных отрезках следует, что  BM : MC = PA : AC = AB : AC."
    ],
    "53887": [
        "Замечательное свойство трапеции",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Дана трапеция ABCD (BC || AD). Точки P, M,   Q, N являются серединами сторон AB, BC, CD и DA   соответственно.  Докажите, что отрезки AQ, PD и MN пересекаются   в одной точке.",
        "Подсказка: Примените замечательное свойство трапеции (см. задачу 53749).",
        "Решение: Поскольку четырёхугольник PMQN – параллелограмм (см. задачу 53475), то точка F  пересечения отрезков PQ и MN – середина отрезка PQ.   В трапеции APQD точка пересечения диагоналей AQ и DP лежит на прямой, проходящей через середины F и N оснований PQ и AD (см. задачу 53749)."
    ],
    "65213": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: В четырёхугольнике ABCD биссектрисы АЕ и СF углов A и C параллельны (см. рисунок). Докажите, что углы B и D равны.",
        "Решение: Из условия и равенства соответственных углов при параллельных прямых следует, что ∠СFD = ∠EAD = ∠EAB и что ∠BEA = ∠BCF = ∠DCF (см. рис.). Значит, два угла треугольника АВЕ соответственно равны двум углам треугольника СDF. Следовательно, равны и третьи углы этих треугольников: ∠АВЕ = ∠СDF."
    ],
    "53994": [
        "Касающиеся окружности",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите, что линия центров двух касающихся окружностей проходит через точку их  касания.",
        "Подсказка: Окружность симметрична относительно каждого своего диаметра.",
        "Решение: Окружность симметрична относительно каждого своего диаметра. Поскольку линия центров проходит через центры обеих окружностей, то фигура, состоящая из этих окружностей, симметрична относительно линии центров. Предположим, что точка касания не лежит на линии центров. Тогда точка, симметричная ей относительно линии центров, также принадлежит обеим окружностям, что противоречит условию."
    ],
    "54053": [
        "Касающиеся окружности",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Две окружности с центрами O1 и O2 касаются внешним образом, а также касаются некоторой прямой соответственно в точках A и B. На продолжении за точку A радиуса O1A меньшей окружности отложен отрезок AK, равный O2B. Докажите, что O2K – биссектриса   угла O1O2B.",
        "Подсказка: Треугольник KO1O2 – равнобедренный.",
        "Решение: Отрезки O1K и O1O2 равны, так как каждый из них равен сумме радиусов окружностей. Углы O1KO2 и KO2B равны, так как O1K || O2B. Поэтому   ∠O1O2K = ∠O1KO2 = ∠KO2B."
    ],
    "54135": [
        "Средняя линия треугольника",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Сторона треугольника равна a. Найдите отрезок, соединяющий середины медиан, проведённых к двум другим сторонам.",
        "Подсказка: Воспользуйтесь теоремой о средней линии треугольника.",
        "Решение: Пусть K и L – середины медиан соответственно BM и CN треугольника ABC со стороной BC, равной a.",
        "Ответ: a/4."
    ],
    "54772": [
        "Необычные построения  (прочее)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Имеется угольник с углом в 19°. Как построить с его помощью угол в 1°?",
        "Подсказка: 1° = 19·19° – 360&deg."
    ],
    "55021": [
        "Отношение площадей треугольников с общим углом",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В треугольнике ABC из точки E стороны BC проведена прямая,  параллельная высоте BD и пересекающая сторону AC в точке F.  Отрезок EF делит треугольник ABC на две равновеликие фигуры.  Найдите EF, если BD = 6, AD : DC = 2 : 7.",
        "Подсказка: SCEF/SCBA = CE/CB·CF/AC.",
        "Решение: По условию    Отсюда CE/CB·CF/CD = 9/14.     По теореме Фалеса CE : CB = CF : CD. Поэтому (CE/CB)2 = 9/14, EF = BD·CE/CB = 9 .",
        "Ответ: 9 ."
    ],
    "55202": [
        "Трапеции (прочее)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Отрезок, соединяющий середины двух противоположных сторон выпуклого четырёхугольника, равен полусумме двух других сторон.   Докажите, что этот четырёхугольник – трапеция или параллелограмм.",
        "Решение: Пусть M и N – середины сторон AB и CD выпуклого четырёхугольника ABCD и MN = ½ (AD + BC). На продолжении отрезка BN за точку N отложим отрезок NK, равный BN. Из равенства треугольников BCN и KDN (по двум сторонам и углу между ними) следует, что DK = BC и DK || BC."
    ],
    "55458": [
        "Вписанные четырехугольники (прочее)",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите, что биссектрисы углов выпуклого четырёхугольника образуют вписанный четырёхугольник.",
        "Подсказка: Выразите противоположенные углы полученного четырёхугольника через углы данного.",
        "Решение: Обозначим углы данного четырёхугольника ABCD через 2α,   2β, 2γ, 2δ соответственно. Пусть биссектрисы углов A и B пересекаются в точке M, углов B и C –   в точке N, углов C и D – в точке K, углов A и D – в точке L.     Рассмотрим случай, когда четырёхугольник, образованный этими биссектрисами, – это четырёхугольник KNML (см. рис.)."
    ],
    "55513": [
        "Ортогональная (прямоугольная) проекция",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Прямая l пересекает окружность с диаметром AB в точках C и D, отличных от A и B. Из точек A и B к прямой l проведены перпендикуляры AE и BF соответственно. Докажите, что CE = DF.",
        "Подсказка: Рассмотрите проекцию центра окружности на прямую l.",
        "Решение: Пусть M – проекция центра O данной окружности на прямую l. Тогда точка M — середина хорды CD. Поскольку отрезок EF – проекция диаметра AB на прямую l, то M – середина отрезка EF. Следовательно, CE = DE."
    ],
    "55762": [
        "Гомотетия помогает решить задачу",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На каждом из оснований AD и BC трапеции ABCD построены вне  трапеции равносторонние треугольники.   Докажите, что отрезок, соединяющий третьи вершины этих треугольников, проходит через точку пересечения диагоналей трапеции.",
        "Подсказка: Рассмотрите гомотетию относительно точки пересечения диагоналей трапеции,  переводящую точку A в точку C.",
        "Решение: Пусть BMC и DNA – указанные равносторонние треугольники, O – точка пересечения диагоналей AC и BD трапеции ABCD.     При гомотетии относительно точки O, переводящей точку A в  точку C, точка D перейдёт в точку B, отрезок AD – в отрезок CB, луч AN – в луч CM (так как прямые AN и CM параллельны), а луч DN – в луч BM. Поэтому точка N перейдёт в точку M.     Следовательно, прямая MN проходит через центр рассматриваемой гомотетии, то есть через точку O."
    ],
    "55763": [
        "Гомотетия помогает решить задачу",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На основаниях трапеции как на сторонах построены во внешнюю сторону два квадрата. Докажите, что отрезок, соединяющий центры квадратов, проходит через точку пересечения диагоналей трапеции.",
        "Подсказка: См. задачу 55762."
    ],
    "53930": [
        "Биссектриса угла",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Биссектрисы внутреннего и внешнего углов при вершине A треугольника ABC пересекают прямую BC в точках P и Q.   Докажите, что окружность, построенная на отрезке PQ как на диаметре, проходит через точку A.",
        "Подсказка: Биссектрисы смежных углов взаимно перпендикулярны."
    ],
    "88138": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 2+",
        "Классы: 5,6,7",
        "Условие: На линейке длиной 9 см нет делений.   Нанесите на неё три промежуточных деления так, чтобы ею можно было измерять расстояние от 1 до 9 см с точностью до 1 см.",
        "Решение: Достаточно нанести промежуточные деления в точках 1 см, 4 см, 7 см. Тогда у нас образуются 4 отрезка: 1 см, 3 см, 3 см и 2 см. Нетрудно убедиться, что такой линейкой можно отмерить любое целое расстояние от 1 до 9 см."
    ],
    "55765": [
        "Гомотетия помогает решить задачу",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Медианы AA1, BB1 и CC1 треугольника ABC пересекаются в точке M; P – произвольная точка. Прямая la проходит через точку A параллельно прямой PA1, прямые lb и lc определяются аналогично. Докажите, что     а) прямые la, lb и lc пересекаются в одной точке (обозначим её через Q);     б) точка M лежит на отрезке PQ, причём PM : MQ = 1 : 2.",
        "Подсказка: Рассмотрите гомотетию с центром в точке M и коэффициентом –2.",
        "Решение: При гомотетии относительно точки M с коэффициентом –2 точки A1, B1 и C1 перейдут соответственно в точки A, B и C, а прямые A1P, B1P и C1P – соответственно в прямые la, lb и lc. Поэтому прямые la, lb, lc пересекаются в точке Q, гомотетичной точке P. Следовательно, точка M лежит на отрезке PQ и PM : MQ = 1 : 2."
    ],
    "53424": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Через вершину B треугольника ABC проведена прямая, параллельная прямой AC. Образовавшиеся при этом три угла с вершиной B относятся как 3 : 10 : 5.  Найдите углы треугольника ABC.",
        "Ответ: 30°, 100°, 50°."
    ],
    "53385": [
        "Биссектриса угла",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В треугольнике ABC из вершины C проведены биссектрисы внутреннего и внешнего углов. Первая биссектриса образует со стороной AB угол, равный 40°. Какой угол образует с продолжением стороны AB вторая биссектриса?",
        "Подсказка: Угол между биссектрисами смежных углов равен 90°.",
        "Решение: Пусть указанные биссектрисы пересекают луч AB в точках K и  M соответственно. Тогда ∠MCK = ½ ∠ACB +   ½ (180° – ∠ACB) = 90°. Поэтому   ∠KMC = 90° – ∠MKC = 90° – 40° = 50°.",
        "Ответ: 50°."
    ],
    "53423": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Точки A и D лежат на одной из двух параллельных прямых, точки  B и C – на другой, причём прямые AB и CD также параллельны.   Докажите, что противоположные углы четырёхугольника ABCD равны  между собой.",
        "Подсказка: Воспользуйтесь свойством параллельных прямых.",
        "Решение: ABC и DAB – внутренние односторонние углы при параллельных прямых AD и BC и секущей AB, поэтому ∠ABC + ∠DAB = 180°. Аналогично   ∠DAB + ∠ADC = 180°. Следовательно, ∠ABC = ∠ADC. Аналогично докажем, что ∠BAD = ∠BCD"
    ],
    "53425": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Через середину M отрезка с концами на двух параллельных прямых проведена прямая, пересекающая эти прямые в точках A и B.  Докажите, что M также середина AB.",
        "Подсказка: Воспользуйтесь признаком равенства треугольников по стороне и двум прилежащим к ней углам.",
        "Решение: Пусть точки A и P лежат на прямой a, а точки B и Q – на параллельной ей прямой b, причём M – середина отрезка PQ, а прямая AB проходит через точку M. Тогда углы APM и BQM – внутренние накрест лежащие при пересечении параллельных прямых a и b секущей PQ. Значит, ∠APM = ∠BQM. Кроме того, ∠AMP = ∠BMQ как вертикальные углы, а MP = MQ по условию. Следовательно, треугольники APM и BQM равны по стороне и двум прилежащим к ней углам. Поэтому AM = BM."
    ],
    "53559": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Известно, что при пересечении прямых a и b третьей прямой  образовалось 8 углов. Четыре из этих углов равны 80°, а четыре других   равны 100°.   Следует ли из этого, что прямые a и b параллельны?",
        "Подсказка: Эти три прямые могут образовывать равнобедренный треугольник, боковые стороны которого лежат на прямых a и b.",
        "Ответ: Не следует."
    ],
    "53939": [
        "Три точки, лежащие на одной прямой",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что отличная от A точка пересечения окружностей, построенных на сторонах AB и AC треугольника ABC как на диаметрах,  лежит на прямой BC.",
        "Подсказка: Указанная точка – основание высоты, проведённой из вершины A.",
        "Решение: Пусть AH – высота треугольника. Тогда ∠AHB = ∠AHC =  90&deg. Значит, точка H принадлежит обеим окружностям, то есть является их точкой пересечения."
    ],
    "54040": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Равнобедренный треугольник ABC с основанием BC повернули  вокруг точки C так, что его вершина A оказалась в точке A1 на прямой BC. При этом вершина B перешла в некоторую точку B1, лежащую с точкой A по одну сторону от прямой BC. Докажите, что прямые AB и B1C параллельны.",
        "Подсказка: ∠A1CB1 = ∠CBA."
    ],
    "54059": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Через вершину A остроугольного треугольника ABC проведена  прямая, параллельная стороне BC, равной a, и пересекающая   окружности, построенные на сторонах AB и AC как на диаметрах, в  точках M и N, отличных от A. Найдите MN.",
        "Подсказка: ∠AMB = ∠ANC = 90°.",
        "Решение: Поскольку точка M лежит на окружности с диаметром AB, то   ∠AMB = 90°. Аналогично, ∠ANC = 90°. Значит, противоположные стороны четырёхугольника BMNC попарно параллельны. Следовательно, MN = BC = a.",
        "Ответ: a."
    ],
    "54751": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: На линейке отмечены три деления: 0, 2 и 5. Как отложить с её помощью отрезок, равный 6?",
        "Решение: 5 – 2 = 3, поэтому можно отложить отрезок длины 3. Два таких отрезка дают отрезок, равный 6."
    ],
    "54734": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На прямой выбраны три точки A, B и C, причём AB = 3, BC = 5. Чему может быть равно AC?",
        "Подсказка: Рассмотрите два случая.",
        "Решение: Если точка B расположена между точками A и C, то   AC = AB + BC = 3 + 5 = 8.   Если точка B расположена вне отрезка AC, то   AC = BC – AB = 5 – 3 = 2.",
        "Ответ: 8 или 2."
    ],
    "54735": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На прямой выбраны четыре точки A, B, C и D, причём AB = 1, BC = 2, CD = 4. Чему может быть равно AD?",
        "Подсказка: Рассмотрите все возможные случаи расположения данных точек.",
        "Решение: Сначала выясним, чему может быть равно расстояние между точками A и C. Если точка B расположена на отрезке AC, то AC = 3. Если же точка B вне AC, то AC = 1.     Теперь мы получаем две задачи: в одной из них AC = 3 и CD = 4, в другой – AC = 1 и CD = 4. Каждая из них дает две возможности, поэтому получается всего четыре возможности: 4 + 3 = 7, 4 – 3 = 1, 4 + 1 = 5, 4 – 1 = 3.",
        "Ответ: 1, 3, 5 или 7."
    ],
    "54743": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На прямой даны точки A, B и C. Известно, что AB = 5, а отрезок AC длиннее BC на 1. Найдите AC и BC.",
        "Подсказка: Рассмотрите все возможные случаи расположения точек A, B и C.",
        "Решение: Если точка лежит вне отрезка AB, то AC и BC отличаются на 5, что противоречит условию.     Пусть точка C лежит между A и B. Тогда AC + BC = AB, или 2BC + 1 = 5. Отсюда BC = 2, AC = 3.",
        "Ответ: BC = 2, AC = 3."
    ],
    "54760": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Даны точки A и B. Где на прямой AB расположены точки,  расстояние от которых до точки B больше, чем до точки A?",
        "Решение: Пусть M – середина отрезка AB. Докажем, что расстояние от любой точки X луча MA (отличной от M) до точки B больше, чем расстояние от X до точки A. Действительно, если точка X лежит на отрезке MA, то XB > MB = MA > XA.     Если точка X лежит на луче MA, но вне отрезка MA, то XB = XA + AB > XA.      Аналогично, расстояние от любой точки Y луча MB до точки B меньше, чем расстояние от Y до A.",
        "Ответ: На луче MA без точки M (M – середина отрезка AB)."
    ],
    "54767": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Точка M лежит вне угла AOB, OC – биссектриса этого угла. Докажите, что угол MOC равен полусумме углов AOM и BOM.",
        "Решение: Пусть точка M лежит внутри угла, смежного с углом BOA. Тогда либо   ∠MOC = ∠AOM – ∠AOC = ∠AOM – ½ (∠AOM – ∠BOM) = ½ (∠AOM + ∠BOM), либо   ∠MOC = ∠BOM – ∠BOC = ∠BOM – ½ (∠BOM – ∠AOM) = ½ (∠BOM + ∠AOM).     Если точка M лежит внутри угла, вертикального с углом AOC, и мы допускаем углы, большие развернутого, то аналогично докажем, что и в этом случае ∠MOC = ½ (∠BOM + ∠AOM)."
    ],
    "116337": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: На сторонах AD и CD параллелограмма ABCD расположены точки M и N соответственно, причём AM : MD = 2 : 7, CN : ND = 3 : 5. Прямые CM и BN пересекаются в точке O. Найдите отношения ON : OB и OC : OM.",
        "Подсказка: Продолжите CM до пересечения с прямой AB и рассмотрите две пары подобных треугольников.",
        "Решение: См. решение задачи 116332.",
        "Ответ: 7 : 24; 9 : 22."
    ],
    "116340": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: На стороне BC и на продолжении стороны AB за вершину B треугольника ABC расположены точки M и K соответственно, причём BM : MC = 4 : 5 и BK : AB = 1 : 5. Прямая KM пересекает сторону AC в точке N. Найдите отношение CN : AN.",
        "Подсказка: Проведите через вершину C прямую, параллельную стороне AB, и рассмотрите две пары подобных треугольников.",
        "Решение: Через точку C проведём прямую, параллельную AB. Пусть прямая KM пересекает её в точке T.     Положим BK = a, AB = 5a. Из подобия треугольников CMT и BMK (коэффициент 5/4) находим, что CT = 5/4 BK = 5/4 a, а из подобия треугольников CNT и ANK – CN : NA = CT : AK = 5/4 a : (5a + a) = 5:24.",
        "Ответ: 5 : 24."
    ],
    "116341": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Точка M расположена на стороне BC параллелограмма ABCD, причём BM : MC = 3 : 2. Отрезки AM и BD пересекаются в точке K. Известно, что площадь параллелограмма равна 1. Найдите площадь четырёхугольника CMKD.",
        "Подсказка: Найдите отношение BK : KD.",
        "Решение: Из подобия треугольников BKM и DKA находим, что BK : KD = BM : AD = BM : MC = 3 : 5. Поэтому BK : BD = 3 : 8, а    Следовательно, SCMKD = SBCD – SBKM = ½ – 9/80 = 31/80.",
        "Ответ: 31/80."
    ],
    "116477": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: На стороне AB треугольника ABC отмечена точка K. Отрезок CK пересекает медиану AM треугольника в точке P. Оказалось, что AK = AP.   Найдите отношение BK : PM.",
        "Решение: Первый способ. Проведём через точку M прямую, параллельную CK, которая пересечет AB в точке D (рис. слева).   По теореме Фалеса BD = KD. По теореме о пропорциональных отрезках PM = KD = ½ BK.",
        "Ответ: BK : PM  = 2."
    ],
    "53432": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что прямая, проходящая через середины боковых сторон равнобедренного треугольника, параллельна основанию.",
        "Подсказка: Воспользуйтесь признаком параллельности прямых.",
        "Решение: Пусть M и N – середины боковых сторон соответственно AB и AC равнобедренного треугольника ABC. Тогда AM = AN, поэтому треугольник AMN также равнобедренный, значит, ∠AMN = 90° – ½∠A = ∠ABC. Следовательно, MN || BC."
    ],
    "88215": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Как, не имея никаких измерительных средств, отмерить 50 см от шнурка, длина которого &frac23; метра?",
        "Подсказка: Попробуйте отрезать четверть шнурка.",
        "Решение: Если от шнурка отрезать четверть (для этого нужно дважды сложить его пополам), останется как раз 50 см. Действительно, ¾·&frac23; = ½."
    ],
    "53446": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что биссектриса внешнего угла при вершине равнобедренного треугольника параллельна основанию. Верно ли обратное?",
        "Подсказка: Воспользуйтесь свойствами и признаками параллельности прямых.",
        "Решение: Пусть CD – биссектриса угла BCM, смежного с углом при вершине C равнобедренного треугольника ABC (см. рис.). Тогда ∠BCM = ∠A + ∠B = 2∠B, а ∠BCD = ½ ∠BCM = ∠B.     Углы BCD и ABC – накрест лежащие при прямых AB и CD и секущей CB. Поскольку они равны, то прямые AB и CD параллельны.",
        "Ответ: Верно."
    ],
    "53463": [
        "Три прямые, пересекающиеся в одной точке",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что биссектрисы двух внешних углов и третьего внутреннего угла треугольника пересекаются в одной точке.",
        "Подсказка: Биссектриса угла есть геометрическое место внутренних точек угла, равноудалённых от его сторон.",
        "Решение: Рассмотрим точку O пересечения биссектрис внешних углов CBM  и BCN при вершинах B и C треугольника ABC. Поскольку точка O лежит на биссектрисе угла CBM, то она равноудалена от прямых BC и AB; поскольку точка O лежит на биссектрисе угла BCN, она равноудалена от прямых BC и AC. Поэтому точка O равноудалена от сторон угла BAC. Следовательно, она лежит на биссектрисе угла BAC."
    ],
    "54041": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Равнобедренный треугольник ABC с основанием BC повернули  вокруг точки C так, что его вершина A оказалась в точке A1 на прямой BC. При этом вершина B перешла в некоторую точку B1, лежащую с точкой A по одну сторону от прямой BC. Полученный таким образом равнобедренный треугольник A1B1C повернули вокруг точки A1 так, что вершина B1 перешла в точку B2 на прямой BC. При этом вершина C перешла в некоторую точку C2, также лежащую с точкой A по одну сторону от прямой BC. Докажите, что C2B2 || AC.",
        "Подсказка: ∠C2B2A1 = ∠ACB."
    ],
    "54096": [
        "Три прямые, пересекающиеся в одной точке",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Противоположные стороны шестиугольника попарно равны и параллельны.   Докажите, что отрезки, соединяющие противоположные вершины, пересекаются в одной точке.",
        "Подсказка: Докажите, что середины этих отрезков совпадают.",
        "Решение: Пусть ABCDEF – шестиугольник, в котором AB = DE и AB || DE, BC = EF и BC || EF, CD = AF и CD || AF. Противоположные стороны AB и DE четырёхугольника ABDE равны и параллельны, поэтому ABDE – параллелограмм. Его диагональ AD проходит через середину O диагонали BE. Аналогично докажем, что диагональ FC параллелограмма BCEF также проходит через точку O."
    ],
    "54658": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: С помощью циркуля и линейки разделите данный отрезок на n  равных частей.",
        "Подсказка: На произвольном луче с началом в конце данного отрезка отложите n равных отрезков.",
        "Решение: Пусть AB – данный отрезок. Возьмём произвольную точку C вне прямой AB. На луче AC отложим последовательно n равных отрезков. Конец D последного из них соединим с точкой B. Через концы отложенных отрезков проведём прямые, параллельные DB. По теореме  Фалеса эти прямые разделят отрезок AB также на n равных отрезков."
    ],
    "54736": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На деревянной линейке отмечены три деления: 0, 7 и 11 сантиметров. Как отложить с её помощью отрезок, равный: а) 8 см; б) 5 см?",
        "Решение: а) Используя деления 7 и 11 можно отложить 4 см. Сделав это дважды, получим отрезок в 8 см."
    ],
    "54738": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В деревне у прямой дороги стоят две избы A и B на расстоянии  50 метров друг от друга.   В какой точке дороги надо выкопать колодец, чтобы сумма расстояний от колодца до изб была бы наименьшей?",
        "Решение: Любая точка X на участке дороги между A и B одинаково хороша, поскольку в сумме отрезки AX и BX составляют 50 м. Если же взять точку вне этого отрезка, то сумма расстояний от неё до точек A и B будет больше 50 м.",
        "Ответ: В любой точке отрезка AB."
    ],
    "54739": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В деревне у прямой дороги с интервалами в 50 метров стоят три избы A, B и C.   В какой точке дороги надо выкопать колодец, чтобы сумма расстояний от колодца до изб была бы наименьшей?",
        "Решение: Пусть точка B расположена между A и C. Если бы точки B не было, то колодец можно было бы выкопать в любой точке отрезка AC (см. задачу 54738).    Добавим теперь точку B. Теперь ясно, что колодец следует копать у избы B.",
        "Ответ: У средней избы."
    ],
    "54741": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В деревне A живет 100 школьников, в деревне B живет 50  школьников. Расстояние между деревнями 3 километра.   В какой точке дороги из A в B надо построить школу, чтобы суммарное расстояние, проходимое всеми школьниками, было бы как можно меньше?",
        "Решение: Забудем временно о 50 школьниках из A. Тогда школу можно строить в любой точке отрезка AB: каждая пара школьников из A и B в сумме проходит 3 км. Но для оставшихся 50 школьников из A суммарное расстояние минимально, когда школа находится в A.",
        "Ответ: В деревне A."
    ],
    "54744": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На прямой даны точки A, B и C. Известно, что AB = 5, а отрезок AC длиннее BC в полтора раза. Найдите отрезки AC и BC.",
        "Подсказка: Рассмотрите все возможные случаи расположения точек A, B и C.",
        "Решение: Пусть точка B лежит на отрезке AC. Тогда 3/2 BC = AC = AB + BC = 5 + BC, откуда BC = 10, AC = 15.    Точка A не может лежать между точками B и C, так как в этом случае AC < BC.     Пусть точка C лежит между A и B. Тогда 5/2 BC = AC + BC = AB = 5, откуда BC = 2, AC = 3.",
        "Ответ: BC = 10, AC = 15 или BC = 2, AC = 3."
    ],
    "36912": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 2+",
        "Классы: 7",
        "Условие: В треугольнике ABC угол С в три раза больше угла A. На стороне AB взята такая точка D, что BD = BC. Найдите CD, если AD = 4.",
        "Решение: Пусть ∠A = α, ∠ACD = φ, тогда ∠C = 3α, ∠BCD = α + φ. Поэтому φ + (α + φ) = 3α, то есть φ = α.     Таким образом, треугольник АDC – равнобедренный с основанием АС. Следовательно, СD = AD = 4.",
        "Ответ: CD = 4."
    ],
    "54752": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Точка C – середина отрезка AB. На отрезках AC и BC взяты точки M и N, причём AM : MC = CN : NB.   Докажите, что отрезок MN равен половине отрезка AB.",
        "Решение: Поскольку равные отрезки AC и CB разделены в равных отношениях, то AM = CN. Следовательно, MN = MC + CN = MC + AM = AC = ½ AB."
    ],
    "54757": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Точки A, B и C расположены на одной прямой и AC : BC = 2 : 5. Найдите отношения AC : AB и BC : AB.",
        "Решение: Поскольку AC < BC, точка B не может лежать на отрезке AC.     Пусть точка C расположена между A и B. На отрезок AB приходится 2 + 5 = 7 частей, на отрезок AC – две части, на отрезок BC – пять частей. Следовательно,   AC : AB = 2 : 7, BC : AB = 5 : 7.     Пусть точка A расположена между B и C. Тогда на отрезок BC приходится 5 частей, на отрезок AC – 2 части, на отрезок AB – 5 – 2 = 3 части. Следовательно,   AC : AB = 2 : 3, BC : AB = 5 : 3.",
        "Ответ: 2 : 7 и 5 : 7 или 2 : 3 и 5 : 3."
    ],
    "54758": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Точки A, B и C расположены на одной прямой, причём   AC : BC = m : n (m и n – натуральные). Найдите отношения AC : AB и BC : AB.",
        "Подсказка: Рассмотрите все три случая взаимного расположения точек A, B и  C.",
        "Решение: Пусть точка C расположена между A и B. На отрезок AC приходится m частей, на отрезок BC – n частей, на отрезок AB – m + n частей. Следовательно,  AC : AB = m : (m + n), BC : AB = n : (m + n).     Пусть точка A расположена между B и C. Тогда AC < BC, поэтому m < n. На отрезок BC приходится n частей, на отрезок AC – m частей,  на отрезок AB – n – m частей. Следовательно, AC : AB = m : (n – m), BC : AB = n : (n – m).     Пусть точка B расположена между A и C. Тогда BC < AC, поэтому m > n. На отрезок BC приходится n частей, на отрезок AC – m   частей,   на отрезок AB – m – n частей. Следовательно, AC : AB = m : (m – n), BC : AB = n : (m – n).",
        "Ответ: Если m < n, то AC : AB = m : (m + n), BC : AB = n : (m + n) или AC : AB = m : (n – m), BC : AB = n : (n – m).   Если m > n, то AC : AB = m : (m + n), BC : AB = n : (m + n) или AC : AB = m: (m – n), BC : AB = n : (m – n).   Если m = n, то оба отношения равны ½."
    ],
    "54759": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Точка B делит отрезок AC в отношении AB : BC = 2 : 1. Точка D делит отрезок AB в отношении AD : DB = 3 : 2.   В каком отношении делит точка D отрезок AC?",
        "Подсказка: Разбейте отрезок AC на 15 равных частей.",
        "Решение: Разобьём отрезок AC на 15 равных частей. Тогда на отрезок BC  приходится 5 частей, на отрезок AB – 10 частей, на отрезок AD   – 6 частей, на отрезок BD – 4 части, на отрезок DC – 4 + 5 = 9 частей. Следовательно, AD : DC = 6 : 9 = 2 : 3.",
        "Ответ: AD : DC = 2 : 3."
    ],
    "54761": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Точки C, E и D делят отрезок AB в отношениях 1 : 2, 1 : 3 и 1 : 4 соответственно (считая от точки A).   В каком отношении точка E делит отрезок DC?",
        "Подсказка: Разбейте отрезок AB на 60 равных частей.",
        "Решение: Разобьём отрезок AB на 60 равных частей. Тогда на отрезок AC  приходится 60 : 3 = 20 частей, на отрезок AE –   60 : 4 = 15 частей, на отрезок AD –   60 : 5 = 12 частей. Поэтому на отрезок EC приходится 20 – 15 = 5 частей, а на отрезок DE – 15 – 12 = 3 части. Следовательно, DE : EC = 3 : 5.",
        "Ответ: DE : EC = 3 : 5."
    ],
    "54764": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Один из углов, образованных пересекающимися прямыми a и b,  равен 15°. Прямая a1 симметрична прямой a относительно прямой b, а прямая b1 симметрична прямой b относительно a. Найдите углы, образованные прямыми a1 и b1.",
        "Решение: Возьмём на прямых a и b, пересекающихся в точке O,  соответственно точки A и B, отличные от O. Пусть ∠AOB = 15°. Точка A1, симметричная точке A относительно прямой b, лежит на прямой   a1, причём ∠A1OB = ∠AOB = 15°.     Точка B1, симметричная точке B относительно прямой a, лежит на прямой b1, причём ∠B1OA = ∠BOA = 15°.     Поскольку луч OB лежит между лучами OA1 и OA, а луч OA – между OB и OB1, то  ∠A1OB1 = ∠A1OB + ∠AOB + ∠AOB1 = 15° + 15° + 15° = 45°.",
        "Ответ: 45°, 45°, 135°, 135°."
    ],
    "54768": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Из точки на листе бумаги провели четыре луча, делящих плоскость на четыре угла. Затем лист разрезали по биссектрисам этих углов на четыре части (которые также являются углами). Докажите, что два из этих углов образуют в сумме 180°, и два других – тоже.",
        "Подсказка: Сумма четырёх данных углов равна 360°. Сумма двух противоположных из четырёх полученных после разрезания углов вдвое меньше."
    ],
    "54769": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Даны точки A и B. Где на прямой AB расположены точки,  расстояние от которых до точки A     а) вдвое больше, чем до точки B;     б) втрое меньше, чем до точки B?",
        "Подсказка: Рассмотрите все возможные случаи расположения данной точки относительно отрезка AB.",
        "Решение: а) Пусть точка M лежит на отрезке AB. Поскольку AM = 2AB, то AM : MB = 2 : 1.     Пусть точка M лежит вне отрезка AB. Тогда точка B лежит между A и M (в противном случае расстояние от точки M до точки A было бы меньше, чем до точки B). Поскольку AM = 2AB, точка B – середина отрезка AM."
    ],
    "54773": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Через точку на плоскости провели 10 прямых, после чего плоскость разрезали по этим прямым на углы.   Докажите, что хотя бы один из этих углов меньше 20°.",
        "Подсказка: Предположите, что каждый из полученных углов не меньше 20°.",
        "Решение: Десять прямых, проведённых через одну точку, разбивают плоскость на 20 углов. Если все они не меньше 20°, то их сумма не меньше   20·20° = 400° > 360°. Противоречие."
    ],
    "54776": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На сколько градусов поворачивается за минуту минутная стрелка? Часовая стрелка?",
        "Решение: За час минутная стрелка делает полный оборот. Значит, за минуту она поворачивается на 1/60 часть угла в 360°, то есть на 6°.     Часовая стрелка за час проходит 1/12 часть круга, то есть движется в 12 раз медленнее минутной. За минуту она поворачивается на 0,5°.",
        "Ответ: 6°; 0,5°."
    ],
    "53421": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что две прямые, параллельные третьей, параллельны между собой.",
        "Подсказка: Воспользуйтесь аксиомой параллельных.",
        "Решение: Пусть прямые a и b параллельны прямой c. Предположим, что  прямые a и b пересекаются в некоторой точке M. Тогда через точку M проходят две прямые a и b, параллельные прямой c, что противоречит аксиоме параллельных."
    ],
    "54777": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Какой угол образуют минутная и часовая стрелка в 3 часа 05 минут?",
        "Решение: В 3 часа стрелки перпендикулярны.  За 5 минут, пошедших после 3 часов, минутная стрелка повернётся на 30°, а часовая – на 2,5° (см. задачу 57776). Следовательно, искомый угол равен 90° + 2,5° – 30° = 62,5°.",
        "Ответ: 62,5°."
    ],
    "65588": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Высота АН треугольника АВС равна его медиане ВМ. На продолжении стороны АВ за точку В отложена точка D так, что BD = AB. Найдите угол BCD.",
        "Решение: Из точки М опустим перпендикуляр МЕ на сторону ВС. МЕ || АН, значит, МЕ – средняя линия треугольника АНС (см. рис.). Следовательно,  МЕ = ½ АН = ½ BM.    В прямоугольном треугольнике ВМЕ катет МЕ равен половине гипотенузы ВМ, поэтому ∠MBE = 30°. Кроме того, ВМ – средняя линия треугольника ACD, поэтому BM || CD. Значит, ∠BCD = ∠MBC = 30°.",
        "Ответ: 30°."
    ],
    "65657": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: На стороне ВС треугольника АВС отмечена точка E, а на биссектрисе BD – точка F таким образом, что EF || AC и AF = AD. Докажите, что AВ = ВЕ.",
        "Решение: Так как AF = AD, то ∠АFD = ∠  АDF, а из параллельности EF и AC следует, что ∠АDF = ∠ЕFD (см. рис.). Следовательно, ∠АFD = ∠ЕFD, тогда равны и углы, смежные с ними: ∠АFB = ∠ЕFB. Учитывая, что ∠  АВF = ∠ЕВF, получим, что треугольники АВF и ЕВF равны по стороне и двум углам. Значит, AВ = ВЕ."
    ],
    "78062": [
        "Ломаные",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Имеется замкнутая самопересекающаяся ломаная. Известно, что она пересекает  каждое свое звено ровно один раз. Докажите, что число звеньев чётно.",
        "Решение: Через точку самопересечения проходят ровно два звена ломаной (если бы проходили  три звена, то каждое из них ломаная пересекала бы по крайней мере два раза).  Кроме того, на каждом звене лежит ровно одна точка самопересечения. Поэтому,   сопоставив точке самопересечения пару пересекающихся в ней звеньев, мы получим   разбиение звеньев на пары."
    ],
    "102223": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Определите величину угла между часовой и минутной стрелками часов, показывающими 1 час 10 минут при условии, что обе стрелки движутся с постоянными скоростями.",
        "Решение: В 1:00 минутная стрелка отставала от часовой на 30°. За 10 минут, прошедших после этого момента, часовая стрелка пройдёт 5°, а минутная – 60° (см. задачу 54776), поэтому угол между ними равен 60° – 30° – 5° = 25°.",
        "Ответ: 25°."
    ],
    "102224": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Определите величину угла между часовой и минутной стрелками часов,   показывающими 4 часа 10 минут при условии, что обе стрелки движутся с постоянными скоростями.",
        "Решение: В 4:00 минутная стрелка отставала от часовой на 120°. За 10 минут, прошедших после этого момента, часовая стрелка пройдёт 5°, а минутная  – 60° (см. задачу 54776), поэтому угол между ними равен 120° + 5 – 60° = 65°.",
        "Ответ: 65°."
    ],
    "103957": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Дан угольник, у которого есть ровно один угол в 19°, а про остальные углы ничего не известно. Можно ли с его помощью отложить угол в 75°?",
        "Решение: Нарисуем на плоскости произвольный луч OA и 4 раза отложим от него в одну и ту же сторону угол в 19°. Получим луч OB, образующий угол в 76° с лучом OA. Теперь от луча OB 19 раз отложим в противоположную сторону угол в 19°; поскольку 19·19° = 361°, то получившийся луч OC лежит между лучами OA и OB и образует с лучом OB угол в 1°. Значит, угол между лучами OA и OC равен 75°.",
        "Ответ: Можно."
    ],
    "108666": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Точка D – середина стороны AC треугольника ABC. На  стороне BC выбрана такая точка E, что ∠BEA = ∠CED. Найдите отношение AE : DE.",
        "Подсказка: Через точку D проведите прямую, параллельную стороне BC.",
        "Решение: Проведём среднюю линию DF треугольника CAE, параллельную стороне CE. Треугольник DEF – равнобедренный, так как   ∠DFE = ∠BEF = ∠DEC = ∠FDE. Следовательно, AE : DE = AE : FE = 2.",
        "Ответ: 2 : 1."
    ],
    "53422": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что прямая, пересекающая одну из двух параллельных прямых, пересекает и другую.",
        "Подсказка: Воспользуйтесь аксиомой параллельных.",
        "Решение: Первый способ. Пусть a и b – параллельные прямые, а прямая c пересекает прямую a в точке M. Если прямая c не пересекает прямую b, то она ей параллельна. Тогда через точку M, не лежащую на прямой b, проходят две прямые, параллельные прямой b, что противоречит аксиоме параллельных."
    ],
    "108924": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На сторонах AB и BC треугольника ABC взяты точки D  и E соответственно, причём AD/DB = BE/EC = 2 и ∠C = 2∠DEB.  Докажите, что треугольник ABC – равнобедренный.",
        "Решение: Пусть BD = 2x и ∠BED = α. Тогда AD = 4x и ∠C = 2α. Через вершину C проведём прямую, параллельную DE. Если проведённая прямая пересекает сторону AC в точке M, то по теореме о пропорциональных отрезках DM = ½ BD = x, BM = 3x = AM, то есть CM – медиана треугольника ABC. С другой стороны, так как ∠BCM = ∠BED = ½ ∠C, то CM – биссектриса треугольника ABC. Следовательно, треугольник ABC – равнобедренный: AC = BC."
    ],
    "115653": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В треугольнике ABC точка M – середина стороны AC,   точка P лежит на стороне BC. Отрезок AP пересекает BM в  точке O. Оказалось, что BO = BP.  Найдите отношение OM : PC.",
        "Решение: Проведём среднюю линию MN треугольника APC, параллельную AP. По теореме Фалеса OM = PN = NC.",
        "Ответ: 1 : 2."
    ],
    "115931": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На медиане AM треугольника ABC взята точка K, причём  AK : KM = 1 : 3.   Найдите отношение, в котором прямая, проходящая через точку K параллельно стороне AC, делит сторону BC.",
        "Решение: Пусть прямая, о которой говорится в условии задачи, пересекает сторону BC в точке N. По теореме о пропорциональных отрезках  MN : NC = MK : KA = 3 : 1, значит, MN = 3NC, BN = BM + MN = CM + MN = 7NC.",
        "Ответ: 1 : 7."
    ],
    "116489": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: На сторонах AC и BC треугольника ABC выбраны точки M и N соответственно так, что MN || AB. На стороне AC отмечена точка K так, что CK = AM. Отрезки AN и BK пересекаются в точке F. Докажите, что площади треугольника ABF и четырёхугольника KFNC равны.",
        "Решение: Пусть SABC = S. Тогда   SABN : S = BN : BC = AM : AC = CK : AC = SBKC : S (см. рис.)."
    ],
    "116791": [
        "Прямые, лучи, отрезки и углы (прочее)",
        "Сложность: 3",
        "Классы: 5,6,7",
        "Условие: Внутри угла AOB, равного 120°, проведены лучи OC и OD   так, что каждый из них является биссектрисой какого-то из углов, получившихся на чертеже. Найдите величину угла AOC, указав все возможные варианты.",
        "Решение: Возможные расположения лучей показаны на рисунках.",
        "Ответ: 30°, 40°, 60°, 80° или 90°."
    ],
    "53426": [
        "Параллельные прямые, свойства и признаки. Секущие",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Внешние углы треугольника ABC при вершинах A и C равны 115° и 140°. Прямая, параллельная прямой AC пересекает стороны AB и AC в точках M и N.   Найдите углы треугольника BMN.",
        "Подсказка: Примените теорему о сумме углов треугольника.",
        "Ответ: 75°, 40°, 65°."
    ],
    "35249": [
        "Измерение длин отрезков и мер углов. Смежные углы.",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На плоскости даны 2004 точки. Запишем все попарные расстояния между ними.   Докажите, что среди записанных чисел не менее тридцати различных.",
        "Подсказка: В противном случае все точки, кроме одной,  расположены на 29 окружностях.",
        "Решение: Предположим, что имеется контрпример. Выберем одну из данных точек – A. Поскольку расстояние от точки A до любой другой точки принимает менее 30 различных значений, то оставшиеся 2003 точки лежат на 29 окружностях с центром A. Поскольку 69·29 = 2001 < 2003, на одной из этих окружностей расположено не менее 70 точек.  Рассмотрим только точки на этой окружности (назовём её S) и выберем одну из точек – B. Оставшиеся 69 точек расположены на 29 окружностях с центром B. Однако каждая из этих окружностей имеет не более двух общих точек с окружностью S, а 2·29 < 69. Противоречие."
    ],
    "52763": [
        "Биссектриса угла",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На плоскости дан угол величины 60°. Окружность касается одной стороны этого угла, пересекает другую сторону в точках A и B и пересекает биссектрису угла в точках C и D. AB = CD = . Найдите площадь круга, ограниченного этой окружностью.",
        "Решение: Пусть K – вершина угла, O – центр окружности, R – её радиус, М – точка касания со стороной угла, L – середина хорды CD.     Из условия ясно, что KO – биссектриса угла AOC, то есть ∠OKC = 15°. Значит, ∠OKM = 45°, OM = R,  или R²(1 – cos 30°) = R² – 3/2, откуда",
        "Ответ: π."
    ],
    "53565": [
        "Биссектриса угла",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Биссектриса угла, смежного с углом C треугольника ABC, пересекает продолжение стороны AB за точку B в точке D, а  биссектриса угла, смежного с углом A, пересекает продолжение BC за  точку C в точке E. Известно, что DC = CA = AE. Найдите углы треугольника ABC.",
        "Подсказка: Обозначьте ∠BAC = α и составьте уравнение относительно α.",
        "Решение: Пусть ∠BAC = ∠ADC = α. Внешний угол равнобедренного треугольника ACD при вершине C равен 2α. Тогда внешний угол треугольника ABC при вершине C равен 4α. Значит, ∠CAE = 180° – 8α. Внешний угол трегольника ABC при вершине A вдвое больше угла CAE, поэтому  ∠BAC = 180° – 2(180° – 8α) = 16α – 180°. Из уравнения 16α – 180° = α находим, что α = 12°. Тогда ∠ACB = 180° – 4α = 132°,   ∠ABC = 180° – (12° + 132°) = 36°.",
        "Ответ: 12°, 36°, 132°."
    ],
    "53580": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На стороне CB треугольника ABC взята точка M, а на стороне CA – точка P. Известно, что CP : CA = 2CM : CB. Через точку M проведена прямая, параллельная CA, а через P – прямая параллельная AB. Докажите, что построенные прямые пересекаются на медиане CN.",
        "Подсказка: Пусть прямая, проведённая через точку P параллельно AB,   пересекает вторую проведённую прямую в точке K, а сторону BC –  в точке L. Докажите, что MK – средняя линия треугольника CLP.",
        "Решение: Пусть прямая, проведённая через точку P параллельно AB,  пересекает вторую проведённую прямую в точке K, а сторону BC – в точке L. Тогда  CM+CL/CB = CP/CA = 2CM/CB, поэтому CM = ML. Значит, MK – средняя линия треугольника CLP. Следовательно, прямая CK – медиана этого треугольника, а значит, и гомотетичного треугольника CBA."
    ],
    "53644": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Через точку на стороне четырёхугольника проведена прямая, параллельная диагонали, до пересечения с соседней стороной четырёхугольника. Через полученную точку проведена прямая, параллельная другой диагонали, и т.д. Докажите, что пятая точка, полученная таким способом, совпадет с исходной.",
        "Подсказка: Примените теорему о пропорциональных отрезках.",
        "Решение: Пусть M1 – точка на стороне AB четырёхугольника ABCD; прямая, проведённая через M1 параллельно диагонали AC, пересекает сторону BC в точке M2; точки M3, M4 и M5 получены указанным  в условии способом. Если AM1 : M1B = x : y, то по теореме о пропорциональных отрезках BM2 : M2C = y : x, CM3 : M3D = x : y, DM4 : M4A = y : x, AM5 : M5B = x : y = AM1 : M1B. Следовательно, точка M5 совпадает с точкой M1."
    ],
    "53645": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Через точку на стороне треугольника проведена прямая, параллельная другой стороне, до пересечения с третьей стороной треугольника. Через полученную точку проведена прямая, параллельная первой стороне треугольника и т.д. Докажите, что    а) если исходная точка сопадает с серединой стороны треугольника, то четвёртая точка, полученная таким способом, совпадёт с исходной;     б) если исходная точка отлична от середины стороны треугольника, то седьмая точка, полученная таким способом, совпадёт с исходной.",
        "Решение: а) В этом случае проведённые прямые проходят через середины  сторон треугольника."
    ],
    "53848": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В треугольнике ABC точка K на стороне AB и точка M на стороне AC расположены так, что AK : KB = 3 : 2, а AM : NC = 4 : 5.   Найдите отношение, в котором прямая, проходящая через точку K параллельно стороне BC, делит отрезок BM.",
        "Подсказка: Проведите через вершину B прямую, параллельную AC.",
        "Решение: Пусть F – точка пересечения указанной прямой со стороной AC, P – точка пересечения BM и KF. Проведём через вершину B прямую, параллельную AC.   Пусть T – точка пересечения этой прямой с прямой KF (см. рис.). Из теоремы о пропорциональных отрезках следует, что FC = 2/5 AC.",
        "Ответ: 18 : 7."
    ],
    "53849": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В треугольнике ABC точка M лежит на стороне AC, а точка L на стороне BC расположена так, что BL : LC = 2 : 5. Прямая, проходящая через точку L параллельно стороне AB, пересекает отрезок BM в точке O, причём BO : OM = 7 : 4. Найдите отношение, в котором точка M делит сторону AC.",
        "Ответ: 22 : 27."
    ],
    "53861": [
        "Теорема Фалеса и теорема о пропорциональных отрезках",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На диагонали BD параллелограмма ABCD взята точка K. Прямая  AK пересекает прямые BC и CD в точках L и M. Докажите, что AK² = LK·KM.",
        "Решение: По теореме Фалеса AK : MK = BK : KD и BK : KD = LK : AK. Поэтому AK : MK = LK : AK, то есть AK² = LK·KM."
    ]
}