{
    "88117": [
        "https://www.problems.ru/view_problem_details_new.php?id=88117",
        "Турниры и турнирные таблицы",
        "Сложность: 2",
        "Классы: 5,6,7,8",
        "Условие: В турнире участвовали шесть шахматистов. Каждые два участника турнира сыграли между собой по одной партии. Сколько всего было сыграно партий? Сколько партий сыграл каждый участник? Сколько очков набрали шахматисты все вместе? \n",
        "Решение: См. задачу 30347. ",
        "Ответ: 15 партий; 5 партий; 15 очков. \n"
    ],
    "88158": [
        "https://www.problems.ru/view_problem_details_new.php?id=88158",
        "Задачи на проценты и отношения",
        "Сложность: 2",
        "Классы: 5,6,7,8",
        "Условие: \"То\" да \"это\", да половина \"того\" да \"этого\" – сколько это будет процентов от трёх четвертей \"того\" да \"этого\"? \n",
        "Подсказка: Заметьте, \"то\" да \"это\" плюс половина \"того\" да \"этого\" получится полтора \"того\" да \"этого\".  ",
        "Решение: Полтора \"того\" да \"этого\" в 2 раза больше трёх четвертей \"того\" да \"этого\". \n",
        "Ответ: 200%. \n"
    ],
    "35346": [
        "https://www.problems.ru/view_problem_details_new.php?id=35346",
        "Задачи на проценты и отношения",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Два торговца купили в городе одинаковое количество товара по одной и той же цене и увезли каждый в свою деревню продавать. Первый продавал товар в два раза дороже закупочной цены. Второй сначала поднял цену на 60% и продал четвёртую часть товара, затем поднял цену еще на 40% и продал остальную часть товара. Кто из них выручил больше? ",
        "Решение:    Пусть каждый купец заплатил за товар x рублей. Тогда прибыль первого купца составляет тоже x руб. \r\n   Второй купец сначала поднял цену на 60% и продал по ней четверть товара. За это он получил  ¼·1,6x = 0,4x.  Затем он поднял цену еще на 40%, то есть до  1,4·1,6x = 2,24x,  и продал по ней 3/4 товара, за что получил  2,24x·3/4 = 1,68x.  Итого, он продал товар за \r\n0,4x + 1,68x = 2,08x  руб., а прибыль составила 1,08x руб. ",
        "Ответ: Второй купец. "
    ],
    "66284": [
        "https://www.problems.ru/view_problem_details_new.php?id=66284",
        "Текстовые задачи (прочее)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Саша спускался по лестнице из своей квартиры к другу Коле, который живет на первом этаже. Когда он спустился на несколько этажей, оказалось, что он прошёл треть пути. Когда он спустился ещё на один этаж, ему осталось пройти половину пути. На каком этаже живёт Саша? ",
        "Решение: Один этаж составляет  ½ – &frac13; = &frac16;  часть пути Саши. Следовательно, весь путь – 6 этажей. ",
        "Ответ: На седьмом этаже. ",
        "Замечания:  6 баллов \n"
    ],
    "87983": [
        "https://www.problems.ru/view_problem_details_new.php?id=87983",
        "Задачи на проценты и отношения",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Три брата получили в наследство от отца 17 верблюдов. Старшему отец \r\nзавещал половину стада, среднему – треть, а младшему – девятую\r\nчасть. Братья пытались поделить наследство и выяснили, что старшему брату \r\nпридётся взять 8 верблюдов и кусок верблюда, среднему – 5 верблюдов и кусок верблюда, а младшему – верблюда и кусок верблюда. Естественно, разрезать верблюдов не хотелось никому, и братья решили попросить помощи у Мудреца, проезжавшего мимо них на верблюде. Мудрец спешился и присоединил своего верблюда к стаду братьев. От нового стада из 18 верблюдов Мудрец отделил половину – 9 верблюдов для старшего брата, затем треть – 6 верблюдов для среднего брата, и наконец девятую часть – двух верблюдов для младшего брата. После успешной делёжки Мудрец сел на своего верблюда и продолжил путь. А братья стали думать, почему же каждый из них получил больше верблюдов, чем полагалось. Сможете ли вы объяснить, что же произошло? ",
        "Подсказка: Заметьте,  ½ + &frac13; + 1/9 < 1. ",
        "Решение: Всё дело в том, что наследники с самого начала не заметили: завещанные им доли в сумме составляют вовсе не 100% наследства (как это бывает обычно), а всего 17/18 от общего количества. Так что даже если бы они решились, во имя буквального исполнения доли завещателя, резать верблюдов на части, то и тогда у них осталась бы лишней 1/18 доля наследства, то есть лишних\r\n17/18 верблюда. \n",
        "Замечания:  Эта задача насчитывает много сотен лет. \n"
    ],
    "103801": [
        "https://www.problems.ru/view_problem_details_new.php?id=103801",
        "Задачи на проценты и отношения",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Автор: Шарыгин И.Ф.\nАлик, Боря и Вася собирали грибы. Боря собрал грибов на 20% больше, чем Алик, но на 20% меньше, чем Вася. \r\nНа сколько процентов больше Алика собрал грибов Вася? ",
        "Решение: Пусть Боря собрал x грибов. Тогда Алик собрал 0,8x, а Вася &dash; 1,2x грибов.Таким образом, Вася собрал грибов в  1,2 : 0,8 = 1,5  раза больше, чем Алик. ",
        "Ответ: На 50%. "
    ],
    "107618": [
        "https://www.problems.ru/view_problem_details_new.php?id=107618",
        "Задачи на работу",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Из горячего крана ванна заполняется за 23 минуты, из холодного – за 17 минут. Маша открыла сначала горячий кран. Через сколько минут она должна открыть холодный, чтобы к моменту наполнения ванны горячей воды налилось в 1,5 раза больше, чем холодной? \n",
        "Решение: Чтобы горячей воды в ванне оказалось в 1,5 раза больше, чем холодной, холодный кран должен наполнить 2/5 ванны, а холодный – &frac35;. Но тогда горячий кран должен быть открыт всего  &frac35;·23 = 69/5  минуты, а холодный –  &frac25;·17 = 34/5  минуты. Значит, холодный кран нужно открыть через  69/5 – 34/5 = 7 минут. \n",
        "Ответ: Через 7 минут. "
    ],
    "111252": [
        "https://www.problems.ru/view_problem_details_new.php?id=111252",
        "Числовые таблицы и их свойства",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: В таблицу 4×4 записали натуральные числа. Могло ли оказаться так, что сумма чисел в каждой следующей строке на 2 больше, чем в предыдущей, а сумма чисел в каждом следующем столбце на 3 больше, чем в предыдущем? \n",
        "Решение: Предположим, что такое возможно. Пусть сумма чисел в первой строке равна a, а сумма чисел в первом столбце равна b. Тогда сумма всех чисел в таблице равна  a + (a + 2) + (a + 4) + (a + 6) = 4a + 12,  то есть кратна 4. С другой стороны, она же равна  b + (b + 3) + (b + 6) + (b + 9) = 4b + 18,  то есть не кратна 4. Противоречие. \n",
        "Ответ: Не могло. \n"
    ],
    "116853": [
        "https://www.problems.ru/view_problem_details_new.php?id=116853",
        "Текстовые задачи (прочее)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: В формулу линейной функции  y = kx + b  вместо букв k и b впишите числа от 1 до 20 (каждое по одному разу) так, чтобы получилось 10 функций, графики которых проходят через одну и ту же точку.",
        "Ответ: Например,  y = 1x + 20,  y = 2x + \r\n19,  ...,  y = 10x + 11  или  y = 1x + 2,  y = 3x + 4,  ...,  y = 19x + 20.",
        "Замечания:  В первом случае график каждой функции пройдёт через точку  (1, 21),  а во втором – через точку  (–1, 1).\r\nВозможны и другие примеры. \n"
    ],
    "86504": [
        "https://www.problems.ru/view_problem_details_new.php?id=86504",
        "Задачи на работу",
        "Сложность: 3-",
        "Классы: 7,8,9",
        "Условие: Трое рабочих копают яму. Они работают по очереди, причём каждый из них работает столько времени, сколько нужно двум другим, чтобы вырыть половину ямы. Работая таким образом, они выкопали яму. Во сколько раз быстрее трое рабочих выкопают такую же яму, если будут работать одновременно? \n",
        "Решение: Пусть во время, когда один из рабочих роет основную яму, двое остальных роют дополнительные ямы. Тогда к концу работы над основной ямой будут вырыты еще  3·0,5 = 1,5  дополнительных ямы. Таким образом, когда все работают одновременно, они за тоже время выроют 2,5 ямы. \n",
        "Ответ: В 2,5 раза. "
    ],
    "103012": [
        "https://www.problems.ru/view_problem_details_new.php?id=103012",
        "Задачи на смеси и концентрации",
        "Сложность: 3-",
        "Классы: 5,6,7,8,9",
        "Условие: Винни-Пух решил позавтракать. Он налил себе стакан чая и добавил сливок из большого кувшина. Но как только он перемешал сливки и чай, то понял, что хочет пить чай без сливок. Недолго думая, он вылил из стакана в кувшин столько же чая со сливками, сколько сначала взял оттуда сливок. Конечно же, при переливании чай от сливок не отделился, и у Винни-Пуха образовались две смеси чая и сливок \r\n– в стакане и в кувшине. Тогда Винни-Пух задумался: чего же получилось больше – чая в кувшине со сливками или сливок в стакане чая? А как думаете вы? ",
        "Решение: См. задачу 30274. \n",
        "Ответ: Поровну. "
    ],
    "111357": [
        "https://www.problems.ru/view_problem_details_new.php?id=111357",
        "Числовые таблицы и их свойства",
        "Сложность: 3-",
        "Классы: 8,9",
        "Условие: Автор: Шаповалов А.В.\nКакое наибольшее число белых и чёрных фишек можно расставить на шахматной доске так, чтобы на каждой горизонтали и на каждой вертикали белых фишек было ровно в два раза больше, чем чёрных? ",
        "Решение:    Оценка. Число фишек на каждой вертикали кратно 3, значит, их не больше 6, а на всей доске – не более 48. \r\n   Пример: 32 белые фишки ставим на белые поля, а 16 чёрных - вдоль главной \"чёрной\" диагонали и вдоль двух параллельных диагоналей \"длины\" 4. ",
        "Ответ: 48 фишек. ",
        "Замечания:  1. Пример получен \"учетверением\" примера для доски 4×4. Тот же пример можно \"раздуть\", заменив каждую клетку квадратом 2×2 с теми же фишками. \n2. 3 балла. \n"
    ],
    "116797": [
        "https://www.problems.ru/view_problem_details_new.php?id=116797",
        "Задачи на проценты и отношения",
        "Сложность: 3-",
        "Классы: 8,9,10",
        "Условие: Автор: Фольклор\nТри фирмы А, В и С решили совместно построить дорогу длиной 16 км, договорившись финансировать этот проект поровну. В итоге, А построила 6 км дороги, В построила 10 км, а С внесла свою долю деньгами – 16 миллионов рублей. Каким образом фирмы А и В должны разделить эти деньги между собой?\n",
        "Решение: Каждая фирма должна была построить 5&frac13; км дороги. Вместо фирмы С фирма А построила  6 – 5&frac13; = &frac23;  км дороги, а фирма В построила \r\n10 – 5&frac13; = 14/3  км. Поэтому 16 миллионов рублей надо разделить между ними в отношении  2 : 14.",
        "Ответ: Фирме А – 2 миллиона, а фирме В – 14 миллионов рублей.\n"
    ],
    "32055": [
        "https://www.problems.ru/view_problem_details_new.php?id=32055",
        "Задачи с неравенствами. Разбор случаев",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: В классе каждый мальчик дружит ровно с двумя\tдевочками, а каждая девочка — ровно с тремя мальчиками. Еще известно, что в классе 31 пионер и 19 парт. Сколько человек в этом \tклассе? ",
        "Решение: Количество \"дружеских связей\" в классе в 3 раза больше числа девочек и в два раза больше числа мальчиков. Значит, число мальчиков относится к числу девочек, как  3 : 2,  а общее число учеников делится на 5. С другой стороны, в классе не меньше 31 и не больше 38 учеников. Следовательно, их 35.",
        "Ответ: 35 человек. "
    ],
    "32050": [
        "https://www.problems.ru/view_problem_details_new.php?id=32050",
        "Турниры и турнирные таблицы",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: В турнире по олимпийской системе (проигравший выбывает) участвует 50 боксеров. Какое наименьшее количество боев надо провести, чтобы выявить победителя?\n",
        "Решение: После каждого боя из соревнований выбывает один боксер – проигравший в этом бою. Поскольку всего к концу соревнований выбыть должны все, кроме победителя, всего должно быть 49 боев, независимо от того, как составляется расписание. \n",
        "Ответ: 49 боев. .",
        "Замечания:  Источник решения: книга В.О. Бугаенко \"Турниры им. Ломоносова. \r\nКонкурсы по математике\". МЦНМО-ЧеРо. 1998. \n"
    ],
    "88194": [
        "https://www.problems.ru/view_problem_details_new.php?id=88194",
        "Задачи с неравенствами. Разбор случаев",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: У Володи было больше орехов, чем у Павлика. Если бы Володя отдал Павлику столько же орехов, сколько у того было, то у обоих мальчиков\r\nорехов стало бы поровну. Но вместо этого Володя дал Павлику совсем\r\nнемного орехов (не больше пяти), а остальные поровну разделил между\r\nтремя белками. Сколько орехов Володя дал Павлику?\n",
        "Подсказка: Первоначально орехов у Володи было в 3 раза больше, чем у Павлика. \n",
        "Решение: Из условия следует, что у Володи было в 3 раза больше орехов, чем у Павлика. После того, как он отдал часть орехов Павлику, число его орехов всё равно осталось кратно 3 – иначе он не смог бы их разделить между тремя белками. Единственное число, кратное 3 и меньшее 5, – это 3. Значит, Володя отдал Павлику 3 ореха.\n",
        "Ответ: \n       3 ореха.\n      "
    ],
    "31345": [
        "https://www.problems.ru/view_problem_details_new.php?id=31345",
        "Задачи с неравенствами. Разбор случаев",
        "Сложность: 2+",
        "Классы: 5,6,7,8",
        "Условие: 10 книг стоят больше 11 рублей, а 9 книг стоят меньше 10 рублей. Сколько стоит одна книга?\n",
        "Решение: См. задачу 32035.\n",
        "Ответ: 1 руб. 11 коп. "
    ],
    "35526": [
        "https://www.problems.ru/view_problem_details_new.php?id=35526",
        "Задачи на проценты и отношения",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Под какой процент выгоднее положить деньги в банк на год: 6% в год или 0,5% в месяц? \n",
        "Подсказка: Если бы 0,5% каждый месяц начислялись от суммы, положенной в банк в начале года, то в конце года сумма увеличилась бы на 6%. \n",
        "Решение: Пусть в банке начисляется 0,5% в месяц. Если бы эти проценты каждый месяц начислялись от суммы, положенной в банк в начале года, то в конце года (через 12 месяцев) сумма увеличилась бы как раз на 6%. Однако, начиная со второго месяца 0,5% будет начисляться от  большей суммы. Поэтому в конце года сумма окажется больше 6%.  ",
        "Ответ: Выгоднее второй вариант. \n",
        "Замечания:  Здесь иллюстрируется частный случай неравенства Бернулли:  (1 + x)12 > 1 + 12x. \n"
    ],
    "88020": [
        "https://www.problems.ru/view_problem_details_new.php?id=88020",
        "Числовые таблицы и их свойства",
        "Сложность: 2+",
        "Классы: 5,6,7,8",
        "Условие: В каждой клетке шахматной доски стоит оловянный солдатик. Все 64 солдатика разной величины. Среди каждых восьми солдатиков, составляющих горизонтальный\r\nряд, выбирают самого большого. После этого из отобранных восьми больших\r\nсолдатиков выбирают самого маленького. Затем среди каждых восьми солдатиков, составляющих вертикальный ряд, выбирают самого маленького. После этого из отобранных восьми маленьких солдатиков выбирают самого большого. Какой солдатик больше: самый маленький из больших или самый большой из маленьких? \n",
        "Подсказка: Подумайте, что можно сказать о величине того солдатика, который стоит на одной горизонтали с самым маленьким из больших и на одной вертикали с самым большим из маленьких. \n",
        "Решение: См. задачу 77964. \n",
        "Ответ: Самый маленький из больших (если они не совпадают). \n"
    ],
    "103956": [
        "https://www.problems.ru/view_problem_details_new.php?id=103956",
        "Задачи на движение",
        "Сложность: 2+",
        "Классы: 5,6,7,8",
        "Условие: Улитке нужно забраться на дерево высотой 10 метров. За день она поднимается на 4 метра, а за ночь сползает на 3. \r\nКогда она доползет до цели, если стартовала улитка утром в понедельник? \n",
        "Решение: За сутки улитка перемещается на метр вверх, поэтому утром в воскресенье она окажется на высоте 6 метров. Значит, вечером этого же дня улитка достигнет своей цели. ",
        "Ответ: В воскресенье вечером. \n"
    ],
    "107705": [
        "https://www.problems.ru/view_problem_details_new.php?id=107705",
        "Задачи с неравенствами. Разбор случаев",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Лёша и Ира живут в доме, на каждом этаже которого 9 квартир (в доме один подъезд). Номер этажа Лёши равен номеру квартиры Иры, а сумма номеров  их квартир равна 329. Каков номер квартиры Лёши?\n",
        "Решение: Пусть К – номер квартиры Иры (и этажа Лёши). Тогда номер квартиры Лёши – между  9К – 8  и 9К, а значит, сумма номеров квартир ребят – от  10К – 8  до 10К. Система неравенств  10К – 8 ≤ 329 ≤ 10К  имеет единственное решение:  К = 33.  А Лёша живёт в квартире с номером  329 – 33 = 296.\n",
        "Ответ: 296."
    ],
    "115471": [
        "https://www.problems.ru/view_problem_details_new.php?id=115471",
        "Задачи на проценты и отношения",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Карлсону подарили пакет с конфетами: шоколадными и карамельками. За первые 10 минут Карлсон съел 20% всех конфет, причем 25% из них составляли карамельки. После этого Карлсон съел еще три шоколадные конфеты, и доля карамелек среди съеденных Карлсоном конфет понизилась до 20%. Сколько конфет было в подаренном Карлсону пакете? \n",
        "Решение: В первой порции съеденных конфет шоколадных было в 3 раза больше, чем карамелек, а потом их стало в 4 раза больше. Значит, число дополнительно съеденных шоколадных конфет равно числу карамелек. Таким образом, в начале Карлсон съел 3 карамельки и 9 шоколадных конфет, и эти 12 конфет составляют 20% всех конфет. Следовательно, всего в пакете было 60 конфет. \n",
        "Ответ:  60  конфет."
    ],
    "115498": [
        "https://www.problems.ru/view_problem_details_new.php?id=115498",
        "Задачи с неравенствами. Разбор случаев",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Автор: Раскина И.В.\nСъев на пустой желудок трёх поросят и семерых козлят, Серый Волк всё ещё страдал от голода. Зато в другой раз он съел на пустой желудок семь поросят и козлёнка и страдал уже от обжорства. От чего пострадает Волк, если съест на пустой желудок 11 козлят? \n",
        "Решение: Обозначим \"сытность\" поросёнка через p, а козлёнка – через k. По условию  3p + 7k < 7p + k,  откуда  6k < 4p,  а стало быть,  4k < 8/3 p < 3p.  Значит, \r\n11k = 4k + 7k < 3p + 7k,  то есть Волк после поедания 11 козлят будет страдать от голода.\n",
        "Ответ: От голода. \n"
    ],
    "88299": [
        "https://www.problems.ru/view_problem_details_new.php?id=88299",
        "Задачи с неравенствами. Разбор случаев",
        "Сложность: 3-",
        "Классы: 7,8",
        "Условие: Давным-давно девять одинаковых книг стоили 11 рублей с копейками, а тринадцать таких книг стоили 15 рублей с копейками. \r\nСколько стоила одна книга? ",
        "Решение: Из первого условия следует, что одна книга стоила больше чем  11/9 = 1,222...  рубля, а из второго – что она стоила меньше, чем  16/15 = 1,2307...  рубля. ",
        "Ответ: 1 руб. 23 коп. "
    ],
    "104077": [
        "https://www.problems.ru/view_problem_details_new.php?id=104077",
        "Задачи на работу",
        "Сложность: 3-",
        "Классы: 6,7,8,9",
        "Условие: Чтобы испечь сто блинов, маме требуется 30 минут, а Ане – 40 минут. Андрюша готов съесть 100 блинов за час. Мама с Аней пекут блины без остановки, а Андрюша непрерывно их поедает. Через какое время после начала этого процесса на столе окажется ровно сто блинов? ",
        "Решение:    Первый способ. Мама печёт сто блинов за полчаса, значит, за два часа она испечёт 400 блинов. Аня печёт сто блинов за сорок минут, поэтому за два часа она испечёт 300 блинов. Андрюша за эти два часа съест двести блинов. Поэтому, что через два часа на столе окажется  400 + 300 – 200 = 500  блинов. Следовательно, для того, чтобы на столе оказалось сто блинов, потребуется времени в пять раз меньше, то есть  120 : 5 = 24  минуты. \n   Второй способ. Производительность мамы равна  100/30 = 3&frac13;  блина в минуту. Производительность Ани равна  100/40 = 2½  блина в минуту. Производительность Андрюши при поедании блинов равна  100/60 = 1&frac23;  блина в минуту. За каждую минуту стараниями мамы, Ани и Андрюши на столе появляется  3&frac13; + 2½ – 1&frac23; = 4&frac16;  блина. Следовательно, сто блинов появятся на столе за  100 : 4&frac16; = 24  минуты. \n",
        "Ответ: Через 24 минуты. \n",
        "Замечания:  Приведённое решение не совсем точно. На самом деле Андрюша может начать есть только после того, как будет испечён первый блин, то есть через 0,3 минуты после начала процесса. Поэтому через 24 минуты на столе действительно будет сто блинов, но при этом в руках у Андрюши останется ещё недоеденная половина блина. \n"
    ],
    "111895": [
        "https://www.problems.ru/view_problem_details_new.php?id=111895",
        "Задачи на проценты и отношения",
        "Сложность: 3-",
        "Классы: 6,7,8",
        "Условие: Автор: Шноль Д.Э.\nВ парке росли липы и клены. Кленов среди них было 60%. Весной в парке посадили липы, после чего кленов стало 20%. А осенью посадили клены, и кленов стало снова 60%. Во сколько раз увеличилось количество деревьев в парке за год? \n",
        "Решение:    Сначала лип было в 1,5 раза меньше, чем клёнов, а летом стало в 4 раза больше. При этом количество клёнов не изменилось. Значит, лип стало в  1,5·4 = 6  раз больше. \r\n   К концу года отношение числа лип к количеству всех деревьев стало таким же, как было в начале. Но осенью количество лип не менялось, значит, количество всех деревьев (по сравнению с исходным) увеличилось в шесть раз. \n",
        "Ответ: В 6 раз. \n"
    ],
    "116919": [
        "https://www.problems.ru/view_problem_details_new.php?id=116919",
        "Текстовые задачи (прочее)",
        "Сложность: 3-",
        "Классы: 8,9",
        "Условие: Автор: Фольклор\nВаня пошел с папой в тир. Уговор был такой: Ване даются 10 патронов, и за каждое попадание в цель он получает ещё три патрона. Ваня сделал 14 выстрелов и ровно в половине из них он попал в цель. Сколько патронов осталось у Вани? ",
        "Решение: Ваня попал в цель 7 раз, поэтому получил 21 дополнительный патрон. Так как изначально у него было 10 патронов, то всего патронов в его распоряжении оказалось 31. Выстрелов Ваня сделал 14, значит, 17 патронов у него осталось.",
        "Ответ: 17 патронов. "
    ],
    "32830": [
        "https://www.problems.ru/view_problem_details_new.php?id=32830",
        "Задачи на проценты и отношения",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: В течение года цены на штрюдели два раза поднимали на 50%, а перед Новым Годом их стали продавать за полцены. \r\nСколько стоит сейчас один штрюдель, если в начале года он стоил 80 рублей? \n",
        "Решение: После первого повышения цен штрюдель стал стоить  80·1,5 = 120  рублей; после второго повышения цен –  120·1,5 = 180  рублей; наконец, после двукратного снижения цены он стал стоить  180 : 2 = 90  рублей. ",
        "Ответ: 90 рублей. ",
        "Замечания:  Задача предлагалась школьникам 30 декабря.\n"
    ],
    "97977": [
        "https://www.problems.ru/view_problem_details_new.php?id=97977",
        "Задачи на смеси и концентрации",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Автор: Фольклор\nИзвестно, что доля блондинов среди голубоглазых больше чем доля блондинов\r\nсреди всех людей. \r\nЧто больше: доля голубоглазых среди блондинов или доля голубоглазых среди всех людей? ",
        "Решение: Пусть l – число всех людей, g – число голубоглазых, b – число блондинов, a – число голубоглазых блондинов. По условию  a/g > b/l.  Умножив это неравенство на g/b, получим  a/b > g/l. ",
        "Ответ: Доля голубоглазых среди блондинов.  ",
        "Замечания:  3 балла \n"
    ],
    "31360": [
        "https://www.problems.ru/view_problem_details_new.php?id=31360",
        "Турниры и турнирные таблицы",
        "Сложность: 2+",
        "Классы: 5,6,7,8",
        "Условие: 30 команд сыграли турнир по олимпийской системе. Сколько всего было сыграно матчей? ",
        "Решение: Столько же, сколько выбывших команд. ",
        "Ответ: 29 матчей. "
    ],
    "35549": [
        "https://www.problems.ru/view_problem_details_new.php?id=35549",
        "Задачи на проценты и отношения",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Экологи запротестовали против большого объема лесозаготовки. Председатель леспромхоза успокоил их следующим образом: \"В лесу 99% сосен. Будут вырубаться только сосны, и после вырубок процент сосен останется почти неизменным – сосен будет 98%\". Какая часть леса отведена под вырубки? \n",
        "Подсказка: Количество \"не сосен\" остается постоянным, а доля \"не сосен\" увеличилась с одного процента до двух... \n",
        "Решение: Будем деревья, не являющиеся соснами, называть дубами. До вырубки дубы составляют 1% всех деревьев, а после вырубки будут составлять 2%. Это значит, что общее число деревьев уменьшится в два раза.  ",
        "Ответ: Половина. \n",
        "Замечания:  Ср. с задачей 88279. \n"
    ],
    "77964": [
        "https://www.problems.ru/view_problem_details_new.php?id=77964",
        "Числовые таблицы и их свойства",
        "Сложность: 2+",
        "Классы: 6,7,8,9",
        "Условие: 200 учеников выстроены прямоугольником по 10 человек в каждом поперечном\r\nряду и по 20 человек в каждом продольном ряду. В каждом продольном ряду выбран самый высокий ученик, а затем из отобранных 10 человек выбран самый низкий. С другой стороны, в каждом поперечном ряду выбран самый низкий ученик, а затем среди отобранных 20 выбран самый высокий. Кто из двоих окажется выше? \n",
        "Решение: Пусть A – самый низкий среди высоких, B – самый высокий среди низких, а C стоит на пересечении продольного ряда, в котором стоит A, и поперечного ряда, в котором стоит B. Тогда A не ниже C и C не ниже B, поэтому A не ниже B. \n",
        "Ответ: Самый низкий среди высоких (если они разного роста). "
    ],
    "88122": [
        "https://www.problems.ru/view_problem_details_new.php?id=88122",
        "Числовые таблицы и их свойства",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: В клетках таблицы 5×5 стоят ненулевые цифры. В каждой строке и в каждом столбце из всех стоящих там цифр составлены десять пятизначных чисел. Может ли оказаться, что из всех этих чисел ровно одно не делится на 3? \n",
        "Подсказка: Вспомните признак делимости на 3. \n",
        "Решение: Если число делится на 3, то сумма его цифр делится на 3. Пусть, для определённости, не делящееся на 3 число стоит в верхней строке. Тогда сумма всех цифр в каждом столбце делится на 3. Значит, сумма всех цифр в таблице делится на 3. Вычтем из этой суммы сумму цифр четырёх чисел, стоящих в строках 2-5. Результат делится на 3, поскольку все вычитаемые делятся на 3. Но, с другой стороны, это и есть сумма цифр, стоящих в верхней строке. Противоречие. \n",
        "Ответ: Не может. \n"
    ],
    "104053": [
        "https://www.problems.ru/view_problem_details_new.php?id=104053",
        "Задачи на смеси и концентрации",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: У купца есть два сорта чая: цейлонский по 10 рублей за фунт и индийский по 6 рублей за фунт. Чтобы увеличить прибыль, купец решил смешать два сорта, а продавать смесь по-прежнему по 10 рублей за фунт. В какой пропорции следует ему их смешать, чтобы получать по 3 рубля за фунт сверх положенной прибыли? ",
        "Решение: Если бы купец продавал чистый индийский чай по цене цейлонского, он получил бы 4 рубля лишней прибыли. Значит, чтобы получить 3 рубля, ему надо в фунте смеси иметь ¾ фунта индийского чая. \n",
        "Ответ: 1 : 3."
    ],
    "107737": [
        "https://www.problems.ru/view_problem_details_new.php?id=107737",
        "Задачи на проценты и отношения",
        "Сложность: 2+",
        "Классы: 6,7,8,9",
        "Условие: Царь выделял на содержание писарского приказа 1000 рублей в год (все писари получали поровну). Царю посоветовали сократить численность писарей на 50%, а оставшимся писарям повысить жалование на 50%. На сколько изменятся при этом затраты царя на писарский приказ?  \n",
        "Решение: Пусть царь сначала сократит половину писарей. Тогда его затраты уменьшатся вдвое. После повышения зарплаты они увеличатся в 1,5 раза. В результате они составят  1,5·0,5 = 0,75  прежней величины, то есть уменьшатся на 25%. \n",
        "Ответ: Уменьшатся на 25%. "
    ],
    "116476": [
        "https://www.problems.ru/view_problem_details_new.php?id=116476",
        "Текстовые задачи (прочее)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: На столе белой стороной кверху лежали 100 карточек, у каждой из которых одна сторона белая, а другая чёрная. Костя перевернул 50 карточек, затем Таня перевернула 60 карточек, а после этого Оля – 70 карточек. В результате все 100 карточек оказались лежащими чёрной стороной вверх. Сколько карточек было перевернуто трижды?",
        "Решение: Так как все карточки в итоге оказались перевернуты, то каждую из них переворачивали либо один раз, либо три раза. Всего было сделано 180 переворачиваний: 100 из них потребовалось, чтобы перевернуть каждую карточку один раз; остальные 80 – чтобы какие-то карточки перевернуть ещё по два раза. Значит, по три раза перевернули 40 карточек.\r\n",
        "Ответ: 40 карточек."
    ],
    "21994": [
        "https://www.problems.ru/view_problem_details_new.php?id=21994",
        "Числовые таблицы и их свойства",
        "Сложность: 3-",
        "Классы: 7,8",
        "Условие: В таблице 10×10 расставлены целые числа, причём каждые два числа в соседних клетках отличаются не более чем на 5. \r\nДокажите, что среди этих чисел есть два равных.",
        "Решение: Поскольку от каждой клетки до любой другой можно добраться, не более 19 раз сдвинувшись в соседнюю клетку, то все числа находятся между числами a и \na + 95,  где a – минимальное из всех расставленных чисел. Значит, среди этих чисел не более 96 различных."
    ],
    "97829": [
        "https://www.problems.ru/view_problem_details_new.php?id=97829",
        "Задачи с неравенствами. Разбор случаев",
        "Сложность: 3-",
        "Классы: 8,9",
        "Условие: Автор: Фомин С.В.\n175 шалтаев стоят дороже, чем 125 болтаев, но дешевле, чем 126 болтаев. Доказать, что на покупку трёх шалтаев и одного болтая не хватит:\r\n   а)  80 коп.;\r\n   б)  одного рубля.",
        "Решение: Обозначим цену (в копейках) шалтая s, цену болтая – b. \nа) По условию  b > 175s – 125b > 0.   Число  175s – 125b  кратно 25, следовательно,  b ≥  26. \r\nЗначит,  s > 5/7 b > 126/7 = 18,   то есть  s ≥ 19,  и  3s + b ≥ 83.\nб)  126b – 175s  кратно 7, поэтому  b = (126b – 175s) + (175s – 125b) ≥ 7 + 25 = 32,  откуда  s > 160/7 > 22,  то есть  s ≥ 23,  \r\nи  3s + b ≥ 69 + 32 = 101.\n",
        "Замечания:  В 7-8 кл. предлагался только п. а) (3 балла), в 9-10 кл. – оба пункта (2 + 3 балла). \nПункт б) предлагался также на 50-й Ленинградской математической олимпиаде (1984, 6 кл., зад. 4). \n"
    ],
    "104082": [
        "https://www.problems.ru/view_problem_details_new.php?id=104082",
        "Числовые таблицы и их свойства",
        "Сложность: 3-",
        "Классы: 6,7,8",
        "Условие: В магическом квадрате суммы чисел в каждой строке, в каждом столбце и на обеих диагоналях равны. \r\nМожно ли составить магический квадрат 3×3 из первых девяти простых чисел? \n",
        "Решение: Пусть первые девять простых чисел как-то расставлены в клетках квадрата. Среди них есть ровно одно чётное число − 2. Сумма чисел в строке, содержащей двойку, чётна (сумма двух нечётных и одного чётного чисел). В строках, не содержащих двойку, сумма чисел нечётна, следовательно, суммы чисел в каких-то двух строках разные, и получить магический квадрат нельзя. ",
        "Ответ: Нельзя. \n"
    ],
    "115464": [
        "https://www.problems.ru/view_problem_details_new.php?id=115464",
        "Турниры и турнирные таблицы",
        "Сложность: 3-",
        "Классы: 7,8,9",
        "Условие: Школьный чемпионат по настольному теннису проводили по олимпийской системе. Победитель выиграл шесть партий. Сколько участников турнира выиграло игр больше, чем проиграло? (На турнире по олимпийской системе участников разбивают на пары. Те, кто проиграл игру в первом туре, выбывают. Тех, кто выиграл в первом туре, снова разбивают на пары. Те, кто проиграл во втором туре, выбывают и т. д. В каждом туре для каждого участника нашлась пара.) \n",
        "Решение:    Так как в каждом туре для каждого игрока нашлась пара и в каждой паре один из игроков выбывал, то общее количество игроков после каждого тура уменьшалось в два раза. Победитель участвовал в каждом туре и побеждал, значит, всего туров было шесть. Следовательно, всего участников было \r\n26 = 64.  Проигравшие в первом туре имеют одно поражение и ноль побед, проигравшие во втором туре имеют одну победу и одно поражение. \r\n   Все вышедшие в третий тур будут иметь по итогам турнира не менее двух побед и не более одного поражения (после которого они выбыли), то есть у них количество побед больше количества поражений. Так как после каждого тура количество участников уменьшалось в два раза, то в третий тур вышло 16 участников.\r\n\n",
        "Ответ: 16 участников.\n"
    ],
    "116921": [
        "https://www.problems.ru/view_problem_details_new.php?id=116921",
        "Задачи с неравенствами. Разбор случаев",
        "Сложность: 3-",
        "Классы: 8,9",
        "Условие: Автор: Фольклор\nВ классе – 17 человек. Известно, что среди любых десяти есть хотя бы одна девочка, а мальчиков больше, чем девочек. Сколько девочек в этом классе?",
        "Решение: Так как мальчиков в классе больше, чем девочек, то мальчиков – не менее девяти. Если мальчиков больше девяти, то не будет выполняться условие: среди любых десяти человек есть хотя бы одна девочка. Значит, мальчиков – ровно 9, а девочек – 8.",
        "Ответ: 8. "
    ],
    "32781": [
        "https://www.problems.ru/view_problem_details_new.php?id=32781",
        "Задачи на движение",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Двое лыжников шли с постоянной скоростью 6 км/ч на расстоянии 200 метров друг от друга. Потом они стали подниматься в большую горку, и скорость упала до 4 км/ч. Потом оба лыжника съехали с горки со скоростью 7 км/ч и попали в глубокий снег, где их скорость стала всего 3 км/ч. \r\nКаким стало расстояние между ними? \n",
        "Решение:    Когда первый лыжник подошел к основанию горки, второй отставал отставал от него на 200 м. За время, которое потребовалось второму на эти \r\n200 м, первый прошел только 200·4/6 м, то есть начальное расстояние умножилось на отношение скоростей. \r\n   Рассуждая аналогично, получим, что в конце расстояние между лыжниками равно  200·4/6·7/4·3/7 = 100 м. ",
        "Ответ: 100 м. "
    ],
    "32838": [
        "https://www.problems.ru/view_problem_details_new.php?id=32838",
        "Задачи на движение",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: Вадим и Лёша спускались с горы. Вадим шёл пешком, а Лёша съезжал на лыжах в семь раз быстрее Вадима. На полпути Лёша упал, сломал лыжи и ногу и пошёл в два раза медленней Вадима. Кто первым спустится с горы? ",
        "Решение: Леша шёл пешком с половины горы столько же времени, сколько Вадим спускался с вершины. ",
        "Ответ: Вадим. ",
        "Замечания:  1. На самом деле Вадим догонит Лёшу и поможет ему, так что придут они вместе. \n2. Ср. с задачами 36043, 36044, 88128. \n"
    ],
    "102877": [
        "https://www.problems.ru/view_problem_details_new.php?id=102877",
        "Шахматные доски и шахматные фигуры",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Сколькими способами можно расставить чёрную и белую ладьи на шахматной доске так, чтобы они не били друг друга? ",
        "Решение:  Белую ладью можно поставить на любое из 64 полей доски, причём с каждого из них она бьёт 15 полей (включая поле, на котором стоит). Остаётся 49 полей, на которые можно поставить чёрную ладью. Итак, белую и чёрную ладью можно расставить  64·49 = 3136  способами. ",
        "Ответ: 3136 способами."
    ],
    "32020": [
        "https://www.problems.ru/view_problem_details_new.php?id=32020",
        "Задачи на проценты и отношения",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Цены снижены на 20%. На сколько процентов больше можно купить товаров на ту же зарплату?\n",
        "Решение: Понижение цен на 20% означает, что новая цена товара равна старой, умноженной на 0.8. Значит, на прежнюю зарплату можно купить товаров в \r\n1 : 0,8 = 1,25  раз больше, то есть на 25% больше.\n",
        "Ответ: На 25%. ",
        "Замечания:  1. Источник решения: книга В.О.Бугаенко \"Турниры им. Ломоносова. Конкурсы по математике\". МЦНМО-ЧеРо. 1998. \n2. Ср. с задачей 88285. \n"
    ],
    "35776": [
        "https://www.problems.ru/view_problem_details_new.php?id=35776",
        "Задачи на проценты и отношения",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Один раз рыбак забросил в пруд сеть и вытащил 30 рыб. Пометив каждую рыбу меткой, он выпустил улов обратно в пруд. На следующий день рыбак снова забросил сеть и вытащил 40 рыб, среди которых были две помеченные. Как по этим данным приблизительно вычислить число рыб в пруду? \n",
        "Подсказка: Разумно предположить, что среди пойманных и не пойманных во второй раз рыб \r\nпомеченные рыбы распределились одинаково. ",
        "Решение: Если предположить, что среди пойманных и непойманных во второй раз рыб помеченные рыбы распределились одинаково, то доля помеченных рыб в пруду составляет  2/40 = 1/20.  Всего в пруду 30 помеченных рыб, значит, общее количество рыб в 20 раз больше.  "
    ],
    "78726": [
        "https://www.problems.ru/view_problem_details_new.php?id=78726",
        "Шахматные доски и шахматные фигуры",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: На бесконечной шахматной доске на двух соседних по диагонали чёрных полях\r\nстоят две чёрные шашки. Можно ли дополнительно поставить на эту доску \r\nнекоторое число чёрных шашек и одну белую таким образом, чтобы белая \r\nодним ходом взяла все чёрные шашки, включая две первоначально\r\nстоявшие? ",
        "Решение: При каждом взятии чёрной шашки белая шашка перемещается на чётное число вертикалей. Поэтому после того как белая шашка взяла первую чёрную, она всегда будет отстоять от второй чёрной шашки на чётное число вертикалей. Следовательно, она не сможет её взять. \n",
        "Ответ: Нельзя. "
    ],
    "88166": [
        "https://www.problems.ru/view_problem_details_new.php?id=88166",
        "Задачи с неравенствами. Разбор случаев",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Дети держат в руках флажки. Тех, у кого в обеих руках поровну флажков, в 5 раз меньше, чем тех, у кого не поровну. Когда каждый ребёнок переложил по одному флажку из одной руки в другую, тех, у кого в обеих руках поровну флажков, стало в 2 раза меньше, чем тех, у кого не поровну. Могло ли быть так, что в начале более чем у половины детей в одной руке было ровно на один флажок меньше, чем\r\nв другой? \n",
        "Подсказка: Если у ребёнка было поровну флажков в обеих руках, то после перекладывания у этого ребёнка флажков станет не поровну. \n",
        "Решение: Дети, у которых после перекладывания в руках было поровну флажков составляют ровно &frac13; от общего числа. Еще у &frac16; детей было в руках поровну флажков до перекладывания (мы их не сосчитали раньше, поскольку после перекладывания у них в руках флажков уже не поровну). Итого не менее половины детей держит чётное число флажков. А у каждого из ребят, у которых в одной руке на один флажок меньше, чем в другой, число флажков нечётно. Следовательно, их не больше половины.\n",
        "Ответ: Не могло. \n"
    ],
    "104054": [
        "https://www.problems.ru/view_problem_details_new.php?id=104054",
        "Задачи на проценты и отношения",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: В дремучем Муромском лесу растут дубы и осины. Известно, что дубы составляют 99% всех деревьев. Илья Муромец вырубил часть дубов, так что в лесу стало 98% дубов. Какую (в процентах) часть леса вырубил Илья Муромец? ",
        "Решение: См. задачу 35549. ",
        "Ответ: 50%. "
    ],
    "107748": [
        "https://www.problems.ru/view_problem_details_new.php?id=107748",
        "Задачи на смеси и концентрации",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Автор: Ященко И.В.\nКооператив получает яблочный и виноградный сок в одинаковых бидонах и выпускает яблочно-виноградный напиток в одинаковых банках. Одного бидона яблочного сока хватает ровно на 6 банок напитка, а одного бидона виноградного – ровно на 10. Когда рецептуру напитка изменили, одного бидона яблочного сока стало хватать ровно на 5 банок напитка. На сколько банок напитка хватит теперь одного бидона виноградного сока? (Напиток водой не разбавляется.) ",
        "Решение: Первый способ. На банку напитка уходит &frac16; бидона яблочного и 1/10 бидона виноградного сока, значит, объем банки равен  &frac16; + 1/10  объема бидона. После изменения рецептуры на банку напитка уходит &frac15; бидона яблочного сока и  4/15 – &frac15; = 1/15  бидона виноградного сока. \nВторой способ. На 30 банок напитка было затрачено пять бидонов яблочного и три бидона виноградного сока, то есть всего 8 бидонов. По новой рецептуре на 30 банок затратят 6 бидонов яблочного сока. Значит, виноградного сока затратят два бидона. Итак, бидона виноградного сока хватит на 15 банок. ",
        "Ответ: На 15 банок. "
    ],
    "32799": [
        "https://www.problems.ru/view_problem_details_new.php?id=32799",
        "Задачи на движение",
        "Сложность: 3-",
        "Классы: 7,8",
        "Условие: После того, как Клайв собрал и завел свои часы (см. задачу 32798), поставив их\r\nпо дедушкиным, они стали идти в обратную сторону. Сколько раз в сутки\r\nони покажут правильное время? \n",
        "Решение: Первый раз часовые стрелки на часах Клайва и на правильных часах \"совпадут\" в момент установки \"правильного\" времени. В следующий раз это произойдет через 6 часов после установки, когда каждая из них сделает по полоборота. Разумеется, тогда совпадут и минутные стрелки. И так далее.  ",
        "Ответ: 4 раза. ",
        "Замечания:  В решении предполагалось, что Клайв часовую стрелка насадил на часовую ось, а минутную – на минутную. Но согласно условию задачи 32798, он мог часовую стрелку насадить на минутную ось, а минутную на часовую. Тогда ответ изменится. Например, если часы были \"запущены\" в 12 часов, то вопрос сводится к такому: сколько раз в сутки направления часовой и минутной стрелки (на нормальных часах) симметричны относительно \"вертикальной\" прямой. Это происходит 26 раз: по разу в течение каждого часа плюс в полночь и в полдень. \n"
    ],
    "98378": [
        "https://www.problems.ru/view_problem_details_new.php?id=98378",
        "Шахматные доски и шахматные фигуры",
        "Сложность: 3-",
        "Классы: 6,7,8",
        "Условие: Автор: Произволов В.В.\nШахматный король обошёл всю доску 8×8, побывав на каждой клетке по одному\r\nразу, вернувшись последним ходом в исходную клетку. \r\nДокажите, что он сделал чётное число диагональных ходов. ",
        "Решение: При каждом недиагональном ходе меняется цвет поля, на котором стоит король; при диагональном – не меняется. Поскольку король обошёл всю доску и вернулся обратно, то цвет поля менялся с белого на чёрный столько же раз, сколько с чёрного на белый, значит, недиагональных ходов король сделал чётное число. Число диагональных ходов равно 64 минус число недиагональных ходов – тоже чётное число. \n",
        "Замечания:  3 балла \n"
    ],
    "105120": [
        "https://www.problems.ru/view_problem_details_new.php?id=105120",
        "Задачи на проценты и отношения",
        "Сложность: 3-",
        "Классы: 7,8,9",
        "Условие: Автор: Гуровиц В.М.\nНа острове &frac23; всех мужчин женаты и &frac35; всех женщин замужем. Какая доля населения острова состоит в браке? \n",
        "Решение: Пусть число супружеских пар на острове равно N. По условию на острове 5/3 N женщин и 3/2 N мужчин. Всего на острове  5/3 N + 3/2 N = 19/6 N  жителей, а в браке состоит 2N. Искомая доля равна  2 : 19/6 = 12/19. \n",
        "Ответ: 12/19. "
    ],
    "116432": [
        "https://www.problems.ru/view_problem_details_new.php?id=116432",
        "Числовые таблицы и их свойства",
        "Сложность: 3-",
        "Классы: 9,10,11",
        "Условие: Автор: Фольклор\nВ клетках квадратной таблицы 10×10 стоят ненулевые цифры. В каждой \r\nстрочке и в каждом столбце из всех стоящих там цифр произвольным образом составлено десятизначное число. Может ли оказаться так, что из двадцати получившихся чисел ровно одно не делится на 3?",
        "Решение:    Предположим, что найдётся ровно одно число, которое не делится на 3, и оно образовано цифрами какого-то из столбцов. Тогда сумма цифр этого числа также не делится на 3. Во всех остальных столбцах числа делятся на 3,и суммы их цифр делятся на 3. Следовательно, сумма всех чисел в таблице не делится на 3. \r\n   С другой стороны, число в каждой строке делится на 3, значит, сумма цифр числа в каждой строке делится на 3, то есть сумма всех чисел таблицы кратна 3. Противоречие. ",
        "Ответ: Не может. \t\t"
    ],
    "30755": [
        "https://www.problems.ru/view_problem_details_new.php?id=30755",
        "Таблицы и турниры (прочее)",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: В таблице 8×8 одна из клеток закрашена чёрным цветом, все остальные – белым. Докажите, что с помощью перекрашивания строк и столбцов нельзя добиться того, чтобы все клетки стали белыми. Под перекрашиванием строки или столбца понимается изменение цвета всех клеток в строке или столбце.",
        "Решение: При перекрашивании строки или столбца чётность количества чёрных клеток в таблице не изменяется, а сначала их количество нечётно.",
        "Замечания:  Ср. с задачами 30756, 30757, 58170, 88187. \n"
    ],
    "32791": [
        "https://www.problems.ru/view_problem_details_new.php?id=32791",
        "Задачи на проценты и отношения",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Трое сумасшедших маляров принялись красить пол каждый в свой цвет. Один успел закрасить красным 75% пола, другой зелёным – 70%, третий синим – 65%. Какая часть пола заведомо закрашена всеми тремя красками? \n",
        "Решение:    Оценка. Красным цветом не закрашено 25% пола, зелёным цветом не закрашено 30% пола, синим цветом не закрашено 35% пола. 25 + 30 + 35 = 90.  Отсюда следует, что всеми тремя красками закрашено не менее 10%. \r\n   Пример, когда тремя красками закрашено ровно 10%, ясен из оценки: 25% пола закрашено в два цвета: синий и зелёный, 30% – в красный и зелёный, 35% – в красный и синий. ",
        "Ответ: 10%. "
    ],
    "88033": [
        "https://www.problems.ru/view_problem_details_new.php?id=88033",
        "Задачи на проценты и отношения",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Богатый сенатор, умирая, оставил жену в ожидании ребёнка. После смерти\r\nсенатора выяснилось, что на своё имущество, равное 210 талантам, он \r\nсоставил следующее завещание: \"В случае рождения сына отдать мальчику две трети состояния, а остальную треть – матери; в случае же рождения дочери отдать девочке одну треть состояния, а остальные две трети – матери\". У вдовы сенатора родились близнецы – мальчик и девочка. Такой возможности завещатель не предусмотрел. Как можно разделить имущество между тремя наследниками с наилучшим приближением к условию завещания? \n",
        "Подсказка: Поскольку все требования завещателя выполнить невозможно, придётся выполнять только часть из них. В зависимости от того, какую именно часть вы выполните, будет принят тот или иной способ дележа. \n",
        "Решение:    Все требования завещателя выполнить невозможно, придётся выполнять только часть из них. В зависимости от того, какую именно часть мы выполним, получим тот или иной ответ. Вариантов много. Разберём некоторые из них. \r\n   1) Из первого условия завещания следует, что сын должен получить &frac23; состояния, а из второго – что дочь должна получить в два раза меньше матери. Тогда сын получит 140 талантов, дочь – 23&frac13;, а мать – 46&frac23;. \r\n   2) Из первого условия завещания следует, что доля матери в два раза меньше доли сына, а из второго – что эта доля в два раза больше доли дочери. Тогда сын получит 120 талантов, мать – 60, а дочь – 30. \r\n   3) Доля матери не меньше &frac13;, а доля сына в 4 раза больше доли дочери. Тогда мать получит сын получит 70 талантов, дочь – 28, а сын – 112.\r\n   Можно предложить и другие варианты. ",
        "Замечания:  Эта задача возникла из практики. Такой случай действительно произошёл\r\nв Древнем Риме. Там суд разделил наследство так, как предложено во втором варианте. \n"
    ],
    "104103": [
        "https://www.problems.ru/view_problem_details_new.php?id=104103",
        "Задачи на проценты и отношения",
        "Сложность: 2",
        "Классы: 7,8,9",
        "Условие: Остап Бендер и Киса Воробьянинов разделили между собой выручку от продажи слонов населению. Остап подумал: если бы я взял денег на 40% больше, то доля Кисы уменьшилась бы на 60%. А как изменилась бы доля Воробьянинова, если бы Остап взял себе денег на 50% больше? ",
        "Решение: 40% от денег Остапа равны 60% от денег Кисы, поэтому у Остапа денег в 1,5 раза больше. Следовательно, увеличение доли Остапа на n %, уменьшает долю Кисы на 1,5n %. \n",
        "Ответ: Уменьшилась бы на 75%. "
    ],
    "32823": [
        "https://www.problems.ru/view_problem_details_new.php?id=32823",
        "Турниры и турнирные таблицы",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: В чемпионате России по футболу участвуют 16 команд. Каждая команда играет с каждой из остальных по 2 матча. \r\n   а) Сколько матчей за сезон должен сыграть \"Уралан\"? \r\n   б) Сколько всего матчей играется за один сезон? \n",
        "Решение:    а) \"Уралан\" должен сыграть по два раза с каждой из оставшихся 15 команд, следовательно, за сезон он должен провести  2·15 = 30  матчей. \n   б) Первый способ. Каждая из 16 команд должна сыграть по 30 матчей. При этом каждый матч мы посчитали два раза, следовательно, общее число сыгранных матчей за сезон равно  16·30 : 2 = 240.  \r\n   Второй способ. Каждая из 16 команд должна сыграть по 15 матчей на своём поле. Следовательно, общее число матчей равно  16·15 = 240. \n",
        "Ответ: а) 30 матчей;  б) 240 матчей. \n"
    ],
    "64188": [
        "https://www.problems.ru/view_problem_details_new.php?id=64188",
        "Задачи на проценты и отношения",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Для сборки автомобиля Лёше потребовалось купить несколько винтиков и шпунтиков. Когда он подошёл к кассе, выяснилось, что в этот день магазин проводит рекламную акцию, предлагая покупателям или 15-процентную скидку на всю покупку или 50-процентную скидку на шпунтики. Оказалось, что стоимость покупки со скидкой не зависит от выбранного варианта скидки. Сколько денег Лёша первоначально собирался потратить на покупку шпунтиков, если на покупку винтиков он собирался потратить 7 рублей? ",
        "Решение: По условию 15% стоимости всей покупки составляет 50% стоимости шпунтиков. Значит, стоимость шпунтиков составляет 30% стоимости всей покупки. Следовательно, (запланированные) стоимости винтиков и шпунтиков относятся как  7 : 3.\n",
        "Ответ: 3 рубля. "
    ],
    "86489": [
        "https://www.problems.ru/view_problem_details_new.php?id=86489",
        "Числовые таблицы и их свойства",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: В клетках шахматной доски записаны в произвольном порядке натуральные числа от 1 до 64 (в каждой клетке записано ровно одно число и каждое число записано ровно один раз). Может ли в ходе шахматной партии сложиться ситуация, когда сумма чисел, записанных в клетках, занятых фигурами, ровно вдвое меньше суммы чисел, записанных в клетках, свободных от фигур? ",
        "Решение: Рассмотрим сумму всех чисел:  1 + 2 + ... + 63 + 64 = 65·32.  Для того чтобы выполнялось условие задачи, необходимо, чтобы эта сумма была кратна 3, но это невозможно, так как ни 65, ни 32 не делится на 3. \n",
        "Ответ: Не может. "
    ],
    "88279": [
        "https://www.problems.ru/view_problem_details_new.php?id=88279",
        "Задачи на проценты и отношения",
        "Сложность: 2+",
        "Классы: 6,7,8,9",
        "Условие: На складе хранилось 100 кг ягод, содержание воды в которых составляло 99%. От долгого хранения содержание воды в ягодах сократилось до 98%. Сколько теперь весят ягоды? \n",
        "Подсказка: Заметьте, вначале в ягодах содержался 1 кг \"сухого вещества\". \n",
        "Решение: В начале хранения в ягодах был 1% сухого вещества. В конце хранения этот же вес составлял уже 2% от всех ягод. Значит, вес ягод уменьшился вдвое. \n",
        "Ответ: \n       50 кг.\n      ",
        "Замечания:  Ср. с задачей 35549. \n"
    ],
    "104073": [
        "https://www.problems.ru/view_problem_details_new.php?id=104073",
        "Текстовые задачи (прочее)",
        "Сложность: 2+",
        "Классы: 5,6,7,8",
        "Условие: В забеге от Воробьёвых гор до Красной площади приняли участие три спортсмена. Сначала стартовал Гриша, затем – Саша, и последней – Лена. После финиша выяснилось, что во время забега Гриша обгонял других 10 раз, Лена – 6 раз, Саша – 4 раза, причём все трое ни разу не оказывались в одной точке одновременно. В каком порядке финишировали спортсмены, если известно, что они пришли к финишу в разное время? ",
        "Решение: Гриша стартовал первым. Чтобы он смог совершить 10 обгонов, необходимо чтобы Саша и Лена обогнали его хотя бы 10 раз. Так как общее количество обгонов Саши и Лены равно  6 + 4 = 10,  то они обгоняли только Гришу и не обгоняли друг друга. После того, как Гриша совершил все 10 обгонов, он опять оказался первым. Значит, спортсмены финишировали в том же порядке, в котором и стартовали. \n",
        "Ответ: Первым финишировал Гриша, затем – Саша, и последней – Лена. \n"
    ],
    "108965": [
        "https://www.problems.ru/view_problem_details_new.php?id=108965",
        "Задачи на движение",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Моторная лодка в 9 часов отправилась вверх по течению реки, и в момент\r\nеё отправления с лодки был брошен в реку мяч. В 9:15 лодка повернула и поплыла по течению. В котором часу лодка догонит мяч, если известно, что её собственная скорость оставалась неизменной? \n",
        "Решение: Скорость течения реки можно не учитывать, так как она одинаково влияет как на\r\nдвижение лодки, так и на движение мяча. Поэтому расстояние между лодкой и мячом изменяется только со скоростью самой лодки. Поскольку лодка 15 минут удалялась от мяча, то она догонит его через 15 минут после того, как она повернула назад. \n",
        "Ответ: В 9:30. \n"
    ],
    "32825": [
        "https://www.problems.ru/view_problem_details_new.php?id=32825",
        "Турниры и турнирные таблицы",
        "Сложность: 3-",
        "Классы: 7,8,9",
        "Условие: Сборная России по футболу выиграла у сборной Туниса со счетом  9 : 5.  Докажите, что по ходу матча был момент, когда сборной России оставалось\r\nзабить столько голов, сколько уже забила сборная Туниса. \n",
        "Решение: Рассмотрим тот момент матча, когда всего было забито 9 голов. Пусть сборная России к этому моменту забила n мячей; тогда Тунис забил \r\n9 – n  мячей. Но России осталось забить как раз  9 – n  мячей, что и требовалось доказать. \n",
        "Замечания:  Ср. с задачей 35323. \n"
    ],
    "107821": [
        "https://www.problems.ru/view_problem_details_new.php?id=107821",
        "Шахматные доски и шахматные фигуры",
        "Сложность: 3-",
        "Классы: 7,8,9",
        "Условие: Автор: Произволов В.В.\nВ некоторых клетках шахматной доски стоят фигуры. Известно, что на каждой\r\nгоризонтали стоит хотя бы одна фигура, причём в разных горизонталях –\r\nразное число фигур. Докажите, что всегда можно отметить 8 фигур так, чтобы в\r\nкаждой вертикали и каждой горизонтали стояла ровно одна отмеченная фигура. \n",
        "Решение:    На горизонтали может стоять от одной до восьми фигур. Так как на разных\r\nгоризонталях – разное число фигур, на некоторой горизонтали стоит ровно\r\nодна фигура, на некоторой другой – две фигуры, ..., наконец, некоторая\r\nгоризонталь заполнена восемью фигурами. Пронумеруем горизонтали в\r\nсоответствии с количеством стоящих на них фигур. \r\n   Отметим на первой горизонтали ее единственную фигуру. Поскольку на второй\r\nгоризонтали две фигуры, хотя бы одну из них можно отметить. Поскольку на\r\nтретьей горизонтали три фигуры, хотя бы одну из них можно отметить, и так\r\nдалее. \n"
    ],
    "32019": [
        "https://www.problems.ru/view_problem_details_new.php?id=32019",
        "Задачи с неравенствами. Разбор случаев",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Несколько ящиков вместе весят 10 тонн, причём каждый из них весит не более одной тонны. \r\nСколько трёхтонок заведомо достаточно, чтобы увезти этот груз? \t\n",
        "Решение:    Будем грузить машины ящиками в любом порядке, следя лишь за тем, чтобы не наступила \"перегрузка\" машины. В результате на каждую машину будет погружено более 2 т. Значит, пяти машин заведомо хватит.\r\n   Четырёх машин может не хватить. Пусть, например, у нас есть 13 ящиков весом 10/13 т каждый. Тогда одна машина может увезти не более трёх таких ящиков (4 ящика весят больше 3 т), а все четыре машины увезут не более 12 ящиков.\n",
        "Ответ: 5 трёхтонок. "
    ],
    "32797": [
        "https://www.problems.ru/view_problem_details_new.php?id=32797",
        "Задачи на движение",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Клайв прокрутил минутную стрелку, так же как в задаче 32796.)\r\n   а) Сколько раз за это время минутная стрелка совпала с часовой? \r\n   б) В какие моменты это происходило? \n",
        "Решение: Можно считать, что Клайв крутит стрелку ровно 12 часов. За это время минутная стрелка сделала 12 оборотов, а часовая – один. Значит, минутная стрелка обогнала часовую ровно 11 раз. Если бы Клайв начал крутить стрелку не в 12:05, а в 12:00, то моменты обгона разделили бы 12 часов на 11 равных частей. Поэтому в каждом промежутке по 12/11 часа, то есть 1 час и 55/11 минуты. ",
        "Ответ:    а) 11 раз. \r\n   б) Первый раз это произошло, когда часы показывали 1 час 55/11 минуты. После этого часовая и минутная стрелки совмещались (по показаниям часов) каждые 1 час 60/11 минуты. "
    ],
    "88078": [
        "https://www.problems.ru/view_problem_details_new.php?id=88078",
        "Задачи на проценты и отношения",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Перед началом Олимпиады хоккейные шайбы подорожали на 10%, а после окончания Олимпиады подешевели на 10%. \r\nКогда шайбы стоили дороже – до подорожания или после удешевления? \n",
        "Решение: 0,9·1,1 = 0,99.  Значит, до подорожания шайбы стоили дороже. \n",
        "Ответ: До подорожания. \n"
    ],
    "108731": [
        "https://www.problems.ru/view_problem_details_new.php?id=108731",
        "Задачи на проценты и отношения",
        "Сложность: 2",
        "Классы: 7,8,9",
        "Условие: Посевной участок под рожь имеет прямоугольную форму. В рамках реструктуризации\r\nколхозных земель одну сторону участка увеличили на 20%, а другую уменьшили на\r\n20%. Изменится ли в результате урожай ржи, и если изменится, то на сколько? \n",
        "Решение: Пусть a и b – исходные стороны прямоугольника. Новая площадь равна  1,2a·0,8b = 0,96ab,  то есть площадь уменьшилась на 4%. \n",
        "Ответ: Уменьшится на 4%. \n"
    ],
    "35045": [
        "https://www.problems.ru/view_problem_details_new.php?id=35045",
        "Задачи на смеси и концентрации",
        "Сложность: 2+",
        "Классы: 6,7,8,9",
        "Условие: В одном стакане было молоко, а в другом – столько же кофе. Из стакана молока перелили одну ложку в стакан с кофе и размешали. Затем такую же ложку смеси перелили обратно в стакан с молоком. Чего теперь больше: кофе в стакане с молоком или молока в стакане с кофе? ",
        "Решение: См. задачу 30274. ",
        "Ответ: Поровну. \n"
    ],
    "86507": [
        "https://www.problems.ru/view_problem_details_new.php?id=86507",
        "Задачи на движение",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Рассмотрим все моменты времени, когда часовая и минутная стрелки часов лежат на одной прямой, образуя развёрнутый угол. \r\nНайдутся ли среди таких прямых две взаимно перпендикулярные? \n",
        "Решение: Предположим, что такие прямые найдутся. Тогда в эти моменты времени часовые стрелки перпендикулярны. Значит, между ними прошло целое количество часов (а именно  6n + 3,  где n – целое число). Тогда положение минутных стрелок в эти моменты времени одинаково, и угла в 90° они образовать не могут, что противоречит нашему предположению. \n",
        "Ответ: Не найдутся. "
    ],
    "89955": [
        "https://www.problems.ru/view_problem_details_new.php?id=89955",
        "Текстовые задачи (прочее)",
        "Сложность: 2+",
        "Классы: 5,6,7,8",
        "Условие: Летела стая гусей, а навстречу им летит один гусь и говорит: \"Здравствуйте, сто гусей!\" Вожак стаи отвечает ему: \"Нет, нас не сто гусей! Вот, если бы нас было столько, сколько есть, да еще столько, да еще полстолька, де еще четверть столька, да ты, гусь, с нами, вот тогда нас было бы сто гусей, а так...\" Сколько же гусей было в стае? ",
        "Подсказка: Попробуйте решить эту задачу с помощью \"частей\". ",
        "Решение: Пусть \"столько\" составляет 4 части. Тогда \"столько да еще столько, да еще полстолько, да еще четверть столько\" составит  4 + 4 + 2 + 1 = 11  частей. Это же количество составляют 99 гусей. Значит, одна часть – 9 гусей, а всего в стае было 36 гусей. ",
        "Ответ: 36 гусей. "
    ],
    "104086": [
        "https://www.problems.ru/view_problem_details_new.php?id=104086",
        "Текстовые задачи (прочее)",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: На вопрос о возрасте его детей математик ответил: \r\n– У нас с женой трое детей. Когда родился наш первенец, суммарный возраст членов семьи был равен 45 годам, год назад, когда родился третий ребёнок – 70 годам, а сейчас суммарный возраст детей – 14 лет. \r\nСколько лет каждому ребенку, если известно, что у всех членов семьи дни рождения в один и тот же день? ",
        "Решение: Год назад суммарный возраст детей был 11 лет, значит, родителям в сумме было 59 лет. А в день рождения первенца эта сумма равнялась 45. Значит, между этими двумя событиями прошло  (59 – 45) : 2 = 7  лет. Следовательно, первому ребенку год назад было 7 лет, а второму – 4. ",
        "Ответ: 8 лет, 5 лет, 1 год. "
    ],
    "108999": [
        "https://www.problems.ru/view_problem_details_new.php?id=108999",
        "Задачи на движение",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Найти скорость и длину поезда, если известно, что он проходит мимо\r\nнеподвижного наблюдателя в течение 7 секунд и затратил 25 секунд, чтобы\r\nпроехать вдоль платформы длиной в 378 м. \n",
        "Решение: На 378 м поезду потребовалось  25 – 7 = 18  секунд.  Следовательно, его скорость равна  378 : 18 = 21 м/с,  а длина  21·7 = 147 м. \n",
        "Ответ: 21 м/с, 147 м. \n",
        "Замечания:  См. также задачу 76417. \n"
    ],
    "116846": [
        "https://www.problems.ru/view_problem_details_new.php?id=116846",
        "Числовые таблицы и их свойства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: На некоторые клетки квадратной доски 4×4 выкладывают стопкой золотые монеты, а на остальные клетки – серебряные. Можно ли положить монеты так, чтобы в каждом квадрате 3×3 серебряных монет было больше, чем золотых, а на всей доске золотых было больше, чем серебряных? ",
        "Решение: Положим, на одну из клеток центрального квадрата 2×2 стопку из девяти серебряных монет, а на остальные клетки доски – по одной золотой монете. \r\nТогда в каждом квадрате 3×3 будет 9 серебряных монет и 8 золотых, а на всей доске – 15 золотых и 9 серебряных.\n",
        "Ответ: Можно. ",
        "Замечания:  Существует и много других примеров. \n"
    ],
    "35026": [
        "https://www.problems.ru/view_problem_details_new.php?id=35026",
        "Задачи на движение",
        "Сложность: 3-",
        "Классы: 6,7,8,9",
        "Условие: Много лет каждый день в полдень из Гавра в Нью-Йорк отправляется почтовый пароход и в то же время из Нью-Йорка отходит идущий в Гавр пароход той же компании. Каждый из этих пароходов находится в пути ровно семь суток, и идут они по одному и тому же пути. \r\nСколько пароходов своей компании встретит на своём пути  пароход, идущий из Гавра в Нью-Йорк? \n",
        "Подсказка: В то время, как пароход из Гавра отходит, в Гавр прибывает пароход, который вышел из Нью-Йорка 7 суток назад. \n",
        "Решение: Примем время отправления некоторого парохода П из Гавра за начальное и отметим все пароходы, которые он встречает. В то время, как пароход П отходит из Гавра, в Гавр прибывает пароход, который вышел из Нью-Йорка семь суток назад. В момент прибытия парохода П в Нью-Йорк с начального момента прошло семь суток, и в этот момент из Нью-Йорка выходит пароход – последний, который пароход П встречает на своем пути. Таким образом, пароход П встретит все пароходы, которые выходили из Нью-Йорка, начиная с семи суток до начального времени и заканчивая семью сутками после начального времени – всего 15 пароходов (если считать, что пароходы встречаются, когда в один и тот же момент один из них отходит, а другой – прибывает). \n",
        "Ответ: 15 пароходов. ",
        "Замечания:  Для решения не требуется, чтобы пароходы плыли с постоянной скоростью. \n"
    ],
    "102802": [
        "https://www.problems.ru/view_problem_details_new.php?id=102802",
        "Задачи на работу",
        "Сложность: 3-",
        "Классы: 7,8",
        "Условие: 48 кузнецов должны подковать 60 лошадей. Какое наименьшее время они затратят на работу, если каждый кузнец тратит на одну подкову 5 минут? ",
        "Подсказка: Заметьте, что четыре кузнеца не могут одновременно подковывать одну лошадь. ",
        "Решение:    Потребуется не меньше  60·4·5 : 48 = 25  минут. Но для этого надо, чтобы никто из кузнецов не простаивал.\r\n   Достаточно показать, что четыре кузнеца могут подковать пять лошадей за 25 минут. Для этого расположим пять лошадей по кругу. Четыре кузнеца подходят к четырём первым лошадям и подковывают (за 5 минут) по одному копыту. Затем каждый переходит к следующей по часовой стрелке лошади и т. д. \n",
        "Замечания:  Ср. с задачей 102990. \n"
    ],
    "116600": [
        "https://www.problems.ru/view_problem_details_new.php?id=116600",
        "Турниры и турнирные таблицы",
        "Сложность: 3-",
        "Классы: 8,9,10",
        "Условие: Автор: Агаханов Н.Х.\nВ волейбольном турнире с участием 73 команд каждая команда сыграла с каждой по одному разу. В конце турнира все команды разделили на две непустые группы так, \r\nчто каждая команда первой группы одержала ровно n побед, а каждая команда второй группы – ровно m побед. Могло ли оказаться, что  m ≠ n?  ",
        "Решение: Всего в турнире с участием 73 команд проводится  73·72 : 2  игр. Пусть x команд одержали по n побед, а остальные  73 – x  команд – по m побед. Тогда \nxn + (73 – x)m = 36·73,  откуда \r\n x(n – m)  кратно 73. Число 73 – \r\nпростое, поэтому на него делится либо x, либо  n – m.  Первое невозможно, так как \nx < 73.  А второе возможно только при  m = n  (так как и m и n меньше 73).",
        "Ответ: Не могло."
    ],
    "32801": [
        "https://www.problems.ru/view_problem_details_new.php?id=32801",
        "Задачи на движение",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Когда Клайв поступил в математическую школу, ему подарили новые часы, на которых была ещё секундная стрелка. \r\nСколько раз за сутки все три стрелки на таких часах совпадут? ",
        "Решение:    За 12 часов часовая стрелка делает один оборот, а минутная – 12, то есть минутная обгоняет часовую на 11 оборотов. Значит, минутная и часовая стрелки совпадают каждые 12/11 часа (за это время минутная обгоняет часовую на 1 оборот). Аналогично, минутная и секундная стрелки совпадают каждые 12/59 часа. \r\n   Назовём мигом 1/59·11 часа. Все три стрелки совпадают через число мигов, кратное как 12·59, так и 11, то есть через 12·59·11 мигов, что равно 12 часам. \n",
        "Ответ: Дважды: в полдень и в полночь. ",
        "Замечания:  Это – продолжение задачи 32796. \n"
    ],
    "88136": [
        "https://www.problems.ru/view_problem_details_new.php?id=88136",
        "Задачи с неравенствами. Разбор случаев",
        "Сложность: 2",
        "Классы: 5,6,7,8",
        "Условие: Одним пакетиком чая можно заварить два или три стакана чая. Мила и Таня разделили коробку чайных пакетиков поровну. Мила заварила 57 стаканов чая, а Таня – 83 стакана. Сколько пакетиков могло быть в коробке?\n",
        "Подсказка: Обратите внимание: для того, чтобы заварить 57 стаканов, необходимо иметь не меньше чем  57 : 3  и не больше чем  57 : 2  пакетиков.\n",
        "Решение: Мила заварила 57 стаканов, значит, у неё было не больше чем  57 : 2 = 28,5  пакетиков. Таня заварила 83 стакана, поэтому у неё было не меньше чем \r\n83 : 3 = 27&frac23;  пакетика. Поскольку пакетиков было одинаковое количество (причём целое), единственная возможность – у каждой девочки было по 28 пакетиков.\n",
        "Ответ: 56 пакетиков. \n"
    ],
    "116142": [
        "https://www.problems.ru/view_problem_details_new.php?id=116142",
        "Текстовые задачи (прочее)",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Автор: Фольклор\nВ стаде, состоящем из лошадей, двугорбых и одногорбых верблюдов, в общей сложности 200 горбов. \r\nСколько животных в стаде, если количество лошадей равно количеству двугорбых верблюдов? .",
        "Решение: Пусть каждый двугорбый верблюд “поделится” горбом с лошадью. Тогда у каждого животного будет по одному горбу, следовательно, количество горбов равно количеству животных в стаде.\n",
        "Ответ: 200.\t"
    ],
    "35195": [
        "https://www.problems.ru/view_problem_details_new.php?id=35195",
        "Задачи на смеси и концентрации",
        "Сложность: 2+",
        "Классы: 10",
        "Условие: По случаю празднования дня Смеха Джон и Иван приготовили себе по коктейлю. Джон смешал виски с ликёром, а Иван – водку с пивом. Известно, что виски крепче водки, а ликёр крепче пива. Можно ли утверждать, что Джон пьёт более крепкий коктейль? \n",
        "Подсказка: Коктейль Ивана может состоять почти целиком из водки, а коктейль Джона - почти целиком из ликёра. \n",
        "Решение: Приведём контрпример. Пусть процент содержания спирта в пиве – 5%, в ликёре – 10%, в  водке – 40%, а в виски – 50%. Пусть Иван смешал 400 г водки и 100 г пива, а Джон – 400 г ликера и 100 г виски. Тогда у каждого по 500 г коктейля. В коктейле Ивана  400·0,4 + 100·0,05 = 165 г  спирта, а в коктейле Джона всего  400·0,1 + 100·0,5 = 90 г  спирта. \n",
        "Ответ: Нельзя. \n"
    ],
    "66043": [
        "https://www.problems.ru/view_problem_details_new.php?id=66043",
        "Задачи на смеси и концентрации",
        "Сложность: 2+",
        "Классы: 6,7,8,9",
        "Условие: В красном ящике 100 красных шаров, а в зелёном ящике – 100 зелёных шаров. Восемь красных шаров переложили в зелёный ящик, а потом столько же шаров переложили из зелёного ящика в красный. Шары в ящиках хорошенько перемешали. Что теперь больше: вероятность вытащить наудачу из красного ящика зелёный шар или из зелёного ящика красный? ",
        "Подсказка: См. задачу 30274. ",
        "Ответ: Вероятности равны. ",
        "Замечания:  1 балл \n"
    ],
    "86558": [
        "https://www.problems.ru/view_problem_details_new.php?id=86558",
        "Задачи на проценты и отношения",
        "Сложность: 2+",
        "Классы: 6,7,8,9",
        "Условие: За весну Обломов похудел на 25%, затем за лето прибавил в весе 20%, за осень похудел на 10%, а за зиму прибавил 20%. \r\nПохудел ли он или поправился за год? ",
        "Решение: 1,2·0,9·1,2·0,75 = 0,972. Значит, в итоге  Обломов похудел на 2,8%. ",
        "Ответ: Похудел. "
    ],
    "103782": [
        "https://www.problems.ru/view_problem_details_new.php?id=103782",
        "Задачи на проценты и отношения",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Автор: Спивак А.В.\nЗа два года завод снизил объём выпускаемой продукции на 51%. При этом каждый год объём выпускаемой продукции снижался на одно и то же число процентов. На сколько? ",
        "Подсказка: Если объём выпускаемой продукции снизился на 51%, значит, он составил 49% от исходного, а  49 = 72. \n",
        "Решение: Пусть за год выпуск снижался на x %. Приняв исходный объём выпуска продукции за 1, получим, что через год выпуск продукции составил \r\nα = 1 – x/100,  а через два года – α². Отсюда  α² = 1 – 0,51 = 0,49,  то есть  α = 0,7. ",
        "Ответ: На 30%. \n"
    ],
    "104096": [
        "https://www.problems.ru/view_problem_details_new.php?id=104096",
        "Текстовые задачи (прочее)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Один градус шкалы Цельсия равен 1,8 градусов шкалы Фаренгейта, при этом 0° по Цельсию соответствует 32° по шкале Фаренгейта. \r\nМожет ли температура выражаться одинаковым числом градусов как по Цельсию, так и по Фаренгейту? ",
        "Решение: Из условия следует, что температура по Фаренгейту выражается через температуру по Цельсию следующим образом:  TF = 1,8TC + 32°.\r\nЕсли  TF = TC,  то  0,8TC + 32 = 0,  то есть,  TC = – 40. ",
        "Ответ: Может.",
        "Замечания:  Корень уравнения можно и не находить. Достаточно заметить, что графики линейных функций с неравными угловыми коэффициентами пересекаются. \n"
    ],
    "111238": [
        "https://www.problems.ru/view_problem_details_new.php?id=111238",
        "Задачи на работу",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Треть роты осталась в лагере, а остальные бойцы уехали на стрельбы. Оставшиеся в лагере съели за обедом четверть приготовленной похлёбки, а вернувшиеся вечером со стрельб получили порции в полтора раза большие, чем давали за обедом. Сколько похлебки осталось для ротной собаки Найды? \n",
        "Решение: На стрельбы уехало &frac23; роты, что в два раза больше, чем осталось в лагере. Если бы они получили такие же порции, какие давали за обедом, то они съели бы в два раза больше, чем было съедено за обедом, то есть половину приготовленной похлебки. Так как на самом деле их порции были в полтора раза больше, то они съели ¾ всей похлебки. А поскольку ¼ похлёбки уже была съедена за обедом, то ничего не осталось. \n",
        "Ответ: Ничего не осталось.  \n"
    ],
    "116847": [
        "https://www.problems.ru/view_problem_details_new.php?id=116847",
        "Задачи на проценты и отношения",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие:  Купец купил в Твери несколько мешков соли и продал их в Москве с прибылью в 100 рублей. На все вырученные деньги он снова купил в Твери соль (по тверской цене) и продал в Москве (по московской цене). На этот раз прибыль составила 120 рублей. Сколько денег он потратил на первую покупку?",
        "Решение: Дополнительно потраченные во второй раз 100 рублей принесли купцу дополнительные 20 рублей прибыли. Значит, в первый раз, чтобы получить  5·20 = 100  рублей прибыли, купец должен был заплатить  5·100 = 500 рублей.",
        "Ответ: 500 рублей. "
    ],
    "35323": [
        "https://www.problems.ru/view_problem_details_new.php?id=35323",
        "Турниры и турнирные таблицы",
        "Сложность: 3-",
        "Классы: 7,8",
        "Условие: Матч Бавария – Спартак окончился со счетом  5 : 8.  Докажите, что в матче был такой момент, когда Спартаку оставалось забить столько мячей, сколько Бавария уже забила к этому времени. \n",
        "Подсказка: Учтите, что в начале игры счёт  0 : 0,  а в конце –  5 : 8. ",
        "Решение: См. задачу 32825. \n"
    ],
    "116733": [
        "https://www.problems.ru/view_problem_details_new.php?id=116733",
        "Турниры и турнирные таблицы",
        "Сложность: 3-",
        "Классы: 7,8,9",
        "Условие: Автор: Фольклор\nШахматист сыграл в турнире 20 партий и набрал 12,5 очков. На сколько партий больше он выиграл, чем проиграл? ",
        "Решение:  Если бы у шахматиста было одинаковое количество побед и поражений, то он набрал бы 10 очков (столько же, как если бы он все 20 партий сыграл вничью). Так как в действительности он набрал на 2,5 очка больше, то пять ничьих надо заменить пятью победами, то есть у шахматиста побед на 5 больше чем поражений.\n",
        "Ответ: На 5 партий."
    ],
    "32053": [
        "https://www.problems.ru/view_problem_details_new.php?id=32053",
        "Текстовые задачи (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Передние покрышки автомобиля \"Антилопа Гну\" выходят из строя через 25000 км, а задние – через 15000 км. Когда О. Бендер должен поменять их местами, чтобы машина прошла максимальное расстояние? Чему равно это расстояние? \n",
        "Решение:    Первый способ. На восьми парах покрышек (3 парах передних и 5 парах задних) можно проехать 75000 км. Значит, на двух парах покрышек можно проехать максимум четверть этого расстояния – 18750 км. Чтобы при этом обе пары покрышек \"отработали\" полностью (то есть были в одинаковом положении), их надо сменить на середине пути. \n   Второй способ. Чтобы покрышки сносились полностью одновременно (это, очевидно, самый выгодный вариант), их надо поменять на середине пути. При этом каждая износится на 3/8 в качестве передней и на 5/8 в качестве задней  (25000 : 15000 = 5 : 3).   Следовательно, эта половина пути составляет  5/8·15000 = 9375 км. ",
        "Ответ: Через 9375 км. 18750 км. ",
        "Замечания:  Максимальное расстояние равно среднему гармоническому между 25000 и 15000. \n"
    ],
    "32824": [
        "https://www.problems.ru/view_problem_details_new.php?id=32824",
        "Турниры и турнирные таблицы",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Трое друзей играли в шашки. Один из них сыграл 25 игр, а другой – 17 игр. Мог ли третий участник сыграть   а) 34;   б) 35;   в) 56 игр? \n",
        "Решение:    а) Например, первый с третьим сыграли 21 игру, второй с третьим – 13 игр, а первый со вторым – 4 игры. \r\n   б) Пусть это произошло. Тогда общее число игр было бы равно  (25 + 17 + 35) : 2 = 38.5  игр – не целое число. Противоречие. \r\n   в) Третий игрок не может сыграть больше партий, чем первый и второй вместе взятые. Не играл же он сам с собой! \n",
        "Ответ: а) Мог;  б)-в) не мог. \n"
    ],
    "33081": [
        "https://www.problems.ru/view_problem_details_new.php?id=33081",
        "Задачи на движение",
        "Сложность: 3",
        "Классы: 8",
        "Условие: Вася шёл от дома до автобусной остановки пешком со скоростью 4 км/ч, затем ехал на автобусе до школы со скоростью 30 км/ч и затратил на весь путь 1 час.\r\nОбратно из школы он ехал на автобусе со скоростью 36 км/ч и шёл пешком от остановки до дома со скоростью 3 км/ч. На обратную дорогу он потратил 1 час 5 мин. Найти путь, который Вася проехал на автобусе, и расстояние от дома до\r\nостановки. ",
        "Решение: Когда Вася шёл в школу, он проходил километр за 15 минут, а когда возвращался обратно – за 20 минут. Если бы он не уменьшил скорость, а увеличил бы её в  36/30 = 6/5  раза (то есть проходил бы километр за  5/6·15 = 12,5  минут, то он потратил бы на всю дорогу 5/6 часа, то есть 50 минут, что на 15 минут быстрее, чем на самом деле. Поскольку на километр от тратил на  20 – 12,5 = 7,5  минут больше, то расстояние до остановки равно 2 км. По дороге в школу он прошёл его за полчаса. Значит, и на автобусе он ехал полчаса, то есть проехал 15 км.\n",
        "Ответ: 15 км; 2 км. ",
        "Замечания:  Разумеется, можно составить уравнение или систему, например,  \r\n4/3 t + 5/6 (1 – t) = 11/12. \n"
    ]
}