{
    "30434": [
        "https://www.problems.ru/view_problem_details_new.php?id=30434",
        "Игры-шутки",
        "Сложность: 2",
        "Классы: 6,7,8",
        "Условие: Имеется три кучки камней: в первой – 10, во второй – 15, в третьей – 20. За ход разрешается разбить любую кучку на две меньшие. Проигрывает тот, кто не сможет сделать ход. Кто выиграет?",
        "Решение: После каждого хода количество кучек увеличивается на 1. Сначала их было 3, в конце – 45. Таким образом, всего будет сделано 42 хода. Последний выигрывающий 42-й ход сделает второй игрок.",
        "Ответ: Второй. "
    ],
    "30435": [
        "https://www.problems.ru/view_problem_details_new.php?id=30435",
        "Игры-шутки",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Числа от 1 до 20 выписаны в строчку. Игроки по очереди расставляют между ними плюсы и минусы. После того, как все места заполнены, подсчитывается результат.  Если он чётен, то выигрывает первый игрок, если нечётен, то второй. Кто выиграет?",
        "Решение: Чётность результата не зависит от расстановки плюсов и минусов, а зависит только от количества нечётных чисел в первоначальном наборе. Так как в данном случае их 10 (то есть чётное число), то выигрывает первый игрок.",
        "Ответ: Первый."
    ],
    "35563": [
        "https://www.problems.ru/view_problem_details_new.php?id=35563",
        "Теория алгоритмов (прочее)",
        "Сложность: 2+",
        "Классы: 6,7,8,9",
        "Условие: Каждую из трех котлет нужно пожарить на сковороде         с двух сторон в течение пяти минут каждую сторону.         На сковороде умещается только две котлеты.         Можно ли сжарить все три котлеты         быстрее, чем за 20 минут (временем на переворачивание и перекладывание         котлет пренебрегаем)?                  ",
        "Подсказка: Не обязательно поджаренную с одной стороны котлету сразу жарить          и с другой стороны.",
        "Решение: За первые 5 минут поджарим первые две котлеты с одной стороны.         Затем переворачиваем первую котлету, а вторую убираем и кладем         третью. Жарим еще 5 минут. Теперь первая котлета готова, а вторая          и третья поджарены с одной стороны. В течение следующих пяти минут          жарим вторую и третью котлеты с еще не поджаренной стороны.",
        "Ответ: 15 минут.      "
    ],
    "88013": [
        "https://www.problems.ru/view_problem_details_new.php?id=88013",
        "Взвешивания",
        "Сложность: 2+",
        "Классы: 5,6,7,8",
        "Условие:  Имеютсячашечные весы без гирь и3 одинаковые повнешнему виду монеты. Однаизмонет фальшивая, причём неизвестно, легче она настоящих монет илитяжелее (настоящие монеты одного веса). Сколько надо взвешиваний, чтобыопределить фальшивую монету? Решите туже задачу вслучаях, когдаимеется 4 монеты и9 монет.      ",
        "Подсказка:       Обратите внимание: требуется определить фальшивую монету,при этом вовсе нетребуется указывать, легче она, чем настоящие, илитяжелее.      ",
        "Решение:       Если унас 3монеты, достаточно двух взвешиваний. Кладёмнакаждую чашку весов поодной монете. Если весы невравновесии,значит, та монета, которая осталась,— настоящая. Кладём её навесыслюбой изостальных исразу определяем, какая изних фальшивая. Еслижевесы вравновесии, значит, фальшивая монета та, которая осталась,ивторым взвешиванием можно даже определить, легче она или тяжелее, чемнастоящие.Если унас 4монеты, опять достаточно двух взвешиваний. Разделим нашимонеты надве кучки по2монеты иположим одну изкучек навесы—помонете накаждую чашку. Если весы вравновесии, тообе монеты нанихнастоящие. Если весы невравновесии, тообе монеты настоле настоящие.Итак, теперь мы знаем, вкакой кучке лежит фальшивая монета. Положимнаодну чашку весов монету изкучки, где обе настоящие, навторую—монету изкучки, где фальшивая. Если при этом весы будут вравновесии,значит, фальшивая монета осталась настоле, аесли невравновесии,значит, мы положили её навесы (вэтом случае мы даже узнаем, легче онаили тяжелее).Если унас монет 9, потребуется три взвешивания. Делим монеты натрикучки по3монеты икладём две изэтих троек надве чашки весов. Есливесы вравновесии— воставшейся кучке находится фальшивая монета,изадва взвешивания (как это показано вслучае1 настоящей задачи) мыопределим фальшивую монету. Итак, всего нам понадобится три взвешивания.Пусть теперь весы небудут вравновесии, значит, одна изкучекнавесах— сфальшивой монетой, автой кучке, которая осталась,только настоящие. Кладём навесы эту кучку илюбую изпервых двух. Такмы найдём непросто кучку сфальшивой монетой, ноисразу определим,легче эта монета или тяжелее настоящих. Мы проделали два взвешивания,нозато теперь уже только одним взвешиванием (как показано вслучае1задачи49) можем определить фальшивую монету. Итак, всегонам понадобится три взвешивания.      ",
        "Ответ:       2; 2; 3;4.       "
    ],
    "31362": [
        "https://www.problems.ru/view_problem_details_new.php?id=31362",
        "Теория алгоритмов (прочее)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Некто А загадал число от 1 до 15. Некто В задает  вопросы  накоторые можно отвечать ``да' или ``нет'. Может ли В отгадать число,задав a) 4 вопроса; б) 3 вопроса.",
        "Решение: "
    ],
    "35177": [
        "https://www.problems.ru/view_problem_details_new.php?id=35177",
        "Теория игр (прочее)",
        "Сложность: 2+",
        "Классы: 9,10",
        "Условие: На плоскости расположены 100 точек-овец и одна точка-волк.  За один ход волк передвигается на расстояние не больше 1,  после этого одна из овец передвигается на расстояние не больше 1,  после этого снова ходит волк и т.д.  При любом ли начальном расположении точек волк сможет поймать одну  из овец?",
        "Подсказка: Овцы могут ходить по достаточно удаленным друг от друга  параллельным прямым.",
        "Решение: Введем на плоскости систему координат. Пусть k-ая овца  имеет координаты (4k;0), k=1,2,...,100,  а начальное положение волка таково, что  за один ход он не может достичь ни одной овцы.  Опишем стратегию овец.  Овцы будут ходить только по прямым x=4k.  Пусть перед ходом овец  волк находится в точке (x;y) одной из  вертикальных полос |x-4k|<2 (эти полосы не пересекаются).  Тогда ходит овца с номером k,  причем если эта овца находится в точке (4k;z), то она  перемещается в точку (4k;z+1) если z>y и  в точку (4k;z-1) если z не больше y  (т.е. k-ая овца удаляется от волка на 1 вдоль оси Oy).  Ясно, что после этого волк за один ход снова не может поймать  ни одной овцы. Если волк перед ходом овец находится  вне полос |x-4k|<2, то овцы могут сделать любой ход.  Придерживаясь этой стратегии, овцы смогут добиться того, что  ни одна из них не будет поймана.",
        "Ответ: нет.  "
    ],
    "104060": [
        "https://www.problems.ru/view_problem_details_new.php?id=104060",
        "Теория алгоритмов (прочее)",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Таня стоит на берегу речки. У неё есть два глиняных кувшина: один  на 5 литров, а про второй Таня помнит лишь то, что он вмещает то ли 3, то ли 4 литра. Помогите Тане определить ёмкость второго кувшина. (Заглядывая в кувшин, нельзя понять, сколько в нём воды.)      ",
        "Решение: Первый способ. Пусть Таня нальёт из полного малого кувшина речную воду в большой, а затем наполнит малый и из него дольёт большой доверху. Далее Тане надо опорожнить большой сосуд и вылить в него остаток из малого. Если малый был на 3 литра, то сейчас в большом 1 литр, иначе  3 литра. Теперь пусть Таня снова попытается перелить воду из полного малого кувшина в большой. Если это ей удастся, то малый был трёхлитровым, если вода польётся через край,  четырёхлитровым. Второй способ. Если бы у Тани большой кувшин вмещал 10 литров, то достаточно было бы попытаться налить в него воду из малого трижды. Если вода польётся через край, то малый на 4 литра, если нет, то на 3. С пятилитровым кувшином такая проверка возможна, если Таня опорожнит пятилитровый кувшин, когда тот заполнится.      "
    ],
    "88001": [
        "https://www.problems.ru/view_problem_details_new.php?id=88001",
        "Теория алгоритмов (прочее)",
        "Сложность: 3-",
        "Классы: 6,7,8",
        "Условие:  Путешественник, сняв вгостиницекомнату нанеделю, предложил хозяину вуплату цепочку изсеми серебряныхколец— покольцу задень, стем, однако, условием, что будетрассчитываться ежедневно. Хозяин согласился, оговорив сосвоей стороны,что можно распилить только одно кольцо. Как путешественнику удалосьрасплатиться схозяином гостиницы?      ",
        "Подсказка:       Путешественник может отдать несколько скованных колец,получив при этом сдачу кольцами.      ",
        "Решение:       Путешественник должен распилить 3е кольцо. Тогдаонполучит три звена: первое— изодного кольца, второе— издвух,третье— изчетырех. Впервый день путешественник даст хозяинугостиницы 1кольцо. Вовторой— даст 2кольца, заберёт1. Втретий—даст 1кольцо. Вчетвёртый— даст 4, заберёт2 и1кольцо. Впятый—даст 1кольцо. Вшестой— даст 2кольца, заберёт1. Впоследний(седьмой) день даст 1кольцо.      ",
        "Ответ:       Распилив третье кольцо, путешественник получит1кольцо, 2 и4. Каждый день он будет либо давать 1кольцо; либодавать2, забирать1; либо давать4, забирать2и1.      "
    ],
    "30447": [
        "https://www.problems.ru/view_problem_details_new.php?id=30447",
        "Симметричная стратегия",
        "Сложность: 3-",
        "Классы: 6,7,8",
        "Условие: В каждой клетке доски 11 × 11 стоит шашка.  За ход разрешается снять с доски любое количество подряд идущих шашек либо из одного вертикального, либо из одного горизонтального ряда.  Выигрывает снявший последнюю шашку.",
        "Решение: Выигрывает первый.  Первым ходом он снимает центральнуюшашку, а потом играет центрально-симметрично."
    ],
    "86556": [
        "https://www.problems.ru/view_problem_details_new.php?id=86556",
        "Теория игр (прочее)",
        "Сложность: 3-",
        "Классы: 6,7,8",
        "Условие: Игра с тремя кучками камней. Имеется три кучки камней: в первой — 10, во второй  — 15, в третьей  — 20. За ход разрешается разбить любую кучку на две меньшие части; проигрывает тот, кто не сможет сделать хода.",
        "Решение: Всего имеется 45 камней. В итоге мы получим 45 кучек по одному камню. Для того, чтобы первую кучку разложить по одному камню, надо 9 ходов, для второй кучки понадобиться 14 ходов, для третьей — 19 ((число ходов не зависит от того, отделяем по одному камню или по несколько). Итак, число ходов 9+14+19=42 и это число не зависит от того какие ходы делают партнеры. Последний, четный ход делает второй и выигрывает."
    ],
    "30451": [
        "https://www.problems.ru/view_problem_details_new.php?id=30451",
        "Симметричная стратегия",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Дан прямоугольный параллелепипед размерами а) 4×4×4; б) 4×4×3; в) 4×3×3, составленный из единичных кубиков.  За ход разрешается проткнуть спицей любой ряд, если в нем есть хотя бы один непроткнутый кубик.  Проигрывает тот, кто не может сделать ход.",
        "Решение: а) и б) - выигрывает второй. Центральная симметрия. в) Выигрывает первый.  Первым ходом он протыкает ряд, состоящий из центральных кубиков четырех слоев 3×3.  Дальше - центральная симметрия."
    ],
    "35038": [
        "https://www.problems.ru/view_problem_details_new.php?id=35038",
        "Теория алгоритмов (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Даны два бикфордова шнура, каждый из которых горит ровно минуту, если его поджечь с одного конца (но сгорать может неравномерно). Как с помощью этих шнуров отмерить 45 секунд? (Поджигать шнур можно с любого из двух концов.) ",
        "Подсказка: Можно поджигать один шнур в момент, когда другой полностью догорит. ",
        "Решение: Подожжём одновременно первый шнур с двух концов, а второй – с одного конца. Подожжённый с двух концов шнур сгорит в два раза быстрее, то есть за 30 секунд. В момент полного сгорания первого шнура поджигаем второй шнур со второго конца. Если бы мы не сделали этого, то второй шнур горел бы еще 30 секунд. Поэтому после того, как его подожгли со второго конца, ему осталось гореть 15 секунд. Итого с начального момента до момента полного сгорания второго шнура проходит 30 + 15 = 45 секунд. "
    ],
    "35584": [
        "https://www.problems.ru/view_problem_details_new.php?id=35584",
        "Теория игр (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В одной куче 18 конфет, а в другой – 23. Двое играют в игру: одним ходом можно съесть одну кучу конфет, а другую разделить на две кучи. Проигравшим считается тот, кто не может сделать ход, то есть перед ходом которого имеются две кучи из одной конфеты. Кто выиграет при правильной игре? ",
        "Подсказка: Надо заставить соперника делить все время кучу с нечётным числом конфет. ",
        "Решение: Первым ходом первому нужно съесть кучу из 23 конфет, а кучу из 18 конфет разделить на две кучи с нечётным числом конфет. После этого второй съест одну из куч, а другую кучу разделит на две кучи, в одной из которых чётное число конфет, а в другой – нечётное. Теперь перед первым игроком ситуация, аналогичная начальной – имеются две кучи, в одной из которых чётное число конфет, а в другой – нечётное. Первый снова должен съесть 'нечётную' кучу, а 'чётную' кучу поделить на две нечётных, и т.д. Как бы ни ходил второй, после его хода остаётся две кучи, одна из которых имеет чётное (а, следовательно, большее 1) число конфет. Поэтому после хода второго первый может сделать свой ход. ",
        "Ответ: Первый. "
    ],
    "35710": [
        "https://www.problems.ru/view_problem_details_new.php?id=35710",
        "Теория алгоритмов (прочее)",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Трое друзей решают жребием, кто идет за соком. У них есть одна монета. Как им устроить жребий, чтобы все имели равные шансы бежать?",
        "Подсказка: Выпадение некоторой комбинации может иметь значение 'повторить жребий'.",
        "Решение: Один из возможных путей таков. Вначале бросаем монету два раза. Если оба раза выпал орел, то идет первый, если первый раз выпал орел, а второй раз - решка, то идет второй, если же первый раз выпала решка, а второй раз - орел, то идет третий, если оба раза выпала решка, то проводим второй раунд жребия, аналогичный первому, т.е. снова бросаем монету два раза, и т.д.  Ясно, что в каждом раунде вероятность проигрыша каждого из трех друзей равна 1/4, и еще с вероятностью 1/4 придется провести новый раунд. Теоретически возможно, что все время выпадают решки, и этот процесс не закончится. Но вероятность этого события равна 0. Действительно, вероятность того, что после n раундов жребий не закончен, равна 1/22n (во всех 2n бросаниях выпала решка); но 1/22n стремится к нулю, если n стремится к бесконечности."
    ],
    "60895": [
        "https://www.problems.ru/view_problem_details_new.php?id=60895",
        "Взвешивания",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие:  Дан мешок сахарного песка, чашечные весы игирька в 1 г. Можно ли за 10 взвешиваний отмерить 1 кгсахара?",
        "Ответ: Да. Причем меньшим числом взвешиваний обойтисьнельзя."
    ],
    "78669": [
        "https://www.problems.ru/view_problem_details_new.php?id=78669",
        "Симметричная стратегия",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На плоскости отмечено 1968 точек, являющихся вершинами правильного1968-угольника. Двое играют в следующую игру: каждый по очереди соединяет двевершины многоугольника отрезком, соблюдая следующие правила: нельзя соединятьдве точки, хотя бы одна из которых уже соединена с чем-то, и нельзя пересекатьуже проведённые отрезки. Проигрывает тот, кто не может сделать очередного ходасогласно этим правилам. Как нужно играть, чтобы выиграть?Кто выигрывает при правильной игре?      ",
        "Решение: Первым ходом начинающий проводит диагональ через центрмногоугольника. Затем после каждого хода второго игрока начинающий проводитотрезок, симметричный относительно этой диагонали.      ",
        "Ответ: начинающий. "
    ],
    "103817": [
        "https://www.problems.ru/view_problem_details_new.php?id=103817",
        "Теория алгоритмов (прочее)",
        "Сложность: 3",
        "Классы: 5,6,7,8",
        "Условие: Семья ночью подошла к мосту. Папа может перейти его за 1 минуту, мама – за 2, малыш – за 5, а бабушка – за 10 минут. У них есть один фонарик. Мост выдерживает только двоих. Как им перейти мост за 17 минут? (Если переходят двое, то они идут с меньшей из их скоростей. Двигаться по мосту без фонарика нельзя. Светить издали нельзя. Носить друг друга на руках нельзя.)",
        "Решение: Вот искомый алгоритм:  папа с мамой – 2 мин,   папа обратно с фонариком – 1 мин,   малыш с бабушкой – 10 мин,   мама обратно с фонариком – 2 мин,   папа с мамой – 2 мин. Всего 17 минут!",
        "Замечания:  Идеология. Надо освободиться от догмы, что фонарик обратно должен носить самый быстрый, то есть папа. Тогда уже нетрудно догадаться, чтонадо пустить вместе бабушку и малыша. "
    ],
    "116239": [
        "https://www.problems.ru/view_problem_details_new.php?id=116239",
        "Взвешивания",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Автор: Произволов В.В.Есть 40 гирек массой  1 г, 2 г, ..., 40 г. Из них выбрали 10 гирь чётной массы и положили на левую чашу весов. Затем выбрали 10 гирь нечётной массы и положили на правую чашу весов. Весы оказались в равновесии. Докажите, что на какой-нибудь чаше есть две гири с разностью масс в 20 г.",
        "Решение: Разобьём гирьки на пары с разностью 20 г: (1, 21), (2, 22), ..., (20, 40). Если на весах окажется ровно по одной гирьке из каждой пары, тогда (независимо от выбора гирек в парах) вес нечётной чашки сравним с нулем по модулю 20, а вес чётной сравним с 10 по модулю 20. Противоречие.",
        "Замечания:  4 балла"
    ],
    "35245": [
        "https://www.problems.ru/view_problem_details_new.php?id=35245",
        "Теория алгоритмов (прочее)",
        "Сложность: 2",
        "Классы: 7,8,9",
        "Условие: В гости пришло 10 гостей и каждый оставил в коридоре пару калош.  Все пары калош имеют разные размеры.  Гости начали расходиться по одному, одевая любую пару калош,  в которые они могли влезть (т.е. каждый гость мог надеть пару калош,  не меньшую, чем его собственные).  В какой-то момент обнаружилось, что ни один из оставшихся гостей  не может найти себе пару калош, чтобы уйти.  Какое максимальное число гостей могло остаться?",
        "Подсказка: Если осталось больше пяти гостей, то гость, имеющий самый  маленький размер калош среди оставшихся гостей, может надеть самые  большие из оставшихся калош.",
        "Решение: Пронумеруем гостей и их пары калош числами от 1 до 10 в порядке  возрастания размера калош.  Предположим, что осталось 6 гостей (и соответственно 6 пар калош).  Тогда наименьший номер оставшегося гостя не больше 5, а наибольший  номер оставшихся пар калош не меньше 6, поэтому гость с наименьшим  номером сможет надеть калоши с наибольшим номером. Противоречие.  С другой стороны, если последовательно уходили гости с номерами 1,  2, 3, 4, 5, и надевали соответственно калоши с номерами 10, 9, 8,  7, 6, то ни один из оставшихся пяти гостей не сможет надеть ни  одну пару оставшихся калош.",
        "Ответ: 5.00"
    ],
    "30436": [
        "https://www.problems.ru/view_problem_details_new.php?id=30436",
        "Игры-шутки",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Двое по очереди ставят ладей на шахматную доску так, чтобы ладьи не били друг друга. Проигрывает тот, кто не может сделать ход. Кто выиграет? ",
        "Решение: См. задачу 32045. ",
        "Ответ: Второй. "
    ],
    "35662": [
        "https://www.problems.ru/view_problem_details_new.php?id=35662",
        "Взвешивания",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Какие веса могут иметь три гири для того, чтобы с их помощью можно было взвесить любое целое число килограммов от 1 до 10 на чашечных весах (гири можно ставить на обе чашки)? Приведите пример. ",
        "Решение: Возьмём, например, гири веса 3, 4 и 9 кг: 1 = 4 – 3, 2 = 9 – 3 – 4, 5 = 9 – 4, 6 = 9 – 3, 7 = 3 + 4, 8 = 3 + 9 – 4, 10 = 4 + 9 – 3. ",
        "Ответ: Например, гири 3, 4 и 9 кг. ",
        "Замечания:  Стандартный набор 1, 3 и 9 кг позволяет взвесить любой целый вес от 1 до 13 кг. "
    ],
    "88198": [
        "https://www.problems.ru/view_problem_details_new.php?id=88198",
        "Взвешивания",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Какие восемь монет нужно взять, чтобы с их помощью можно было бы без сдачи заплатить любую сумму от 1 коп. до 1 руб.? (В хождении были монеты в 1, 3, 5, 10, 20 и 50 коп.) ",
        "Подсказка: Попробуйте разбить эту задачу на две: сначала найдите монеты, при помощи которых можно заплатить любую сумму от 1 до 10 коп., затем – монеты, при помощи которых можно заплатить 10, 20, ..., 90 коп. ",
        "Решение: Возьмём монеты достоинством 1, 1, 3, 5, 10, 10, 20, 50 коп. Нетрудно проверить, что первые четыре монеты позволяют выплатить любую сумму от 1 до 9 коп., а последние четыре – любую кратную 10 сумму от 10 до 100 коп. Следовательно, располагая указанным набором монет, можно заплатить любую сумму от 1 коп. до 100 коп.      ",
        "Ответ: 1, 1, 3, 5, 10, 10, 20, 50 коп.       "
    ],
    "35428": [
        "https://www.problems.ru/view_problem_details_new.php?id=35428",
        "Симметричная стратегия",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: На доске написано число 1.   Два игрока по очереди прибавляют   любое число от 1 до 5   к числу на доске и записывают   вместо него сумму. Выигрывает игрок,   который первый запишет на доске   число тридцать. Укажите выигрышную   стратегию для второго игрока.",
        "Подсказка: Такую стратегию указать   нельзя",
        "Решение: Выигрышная ситуация есть   у первого игрока. Первым ходом он   может дописать пять, т.е. записать   сумму шесть. Какое бы число не   дописал второй, у первого всегда   есть возможность довести сумму до   числа кратного шести, т.е. после   ходов первого сумма будет равна 6   , 12 , 18 , 24   , а затем сколько бы ни дописал   второй, первый может взять все   оставшееся, так как останется не   больше пяти и первым запишет 30 ."
    ],
    "35474": [
        "https://www.problems.ru/view_problem_details_new.php?id=35474",
        "Теория алгоритмов (прочее)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: В компанию из N человек пришел журналист. Ему известно, что в этой       компании есть человек Z, который знает всех остальных членов компании,       но его не знает никто. Журналист может к каждому члену компании обратиться       с вопросом: 'Знаете ли вы такого-то?'      Найдите наименьшее количество вопросов, достаточное для того, чтобы       наверняка найти Z.       (Все отвечают на вопросы правдиво. Одному человеку можно задавать       несколько вопросов.) ",
        "Подсказка: Можно ли что-нибудь сказать про членов компании А и В, если А знает В       (если А не знает В)?",
        "Решение: Для того, чтобы прямо определить что данный человек  Z, надо       задать 2*(N-1) вопросов: N-1 ему самому (знает ли он каждого члена       компании) и N-1 остальным членам компании (знают ли они его). Ясно,       что такой путь вряд ли оптимальный.            Рассмотрим метод исключения. Очевидно, что Z в компании может быть       только один.      Пусть журналист спросил А, знает ли он В. Тогда если А не знает В,       то А - не Z, если А знает В, то В  не Z. Таким образом, с каждым       вопросом вне зависимости от ответа журналист сокращает перебор на       одного человека. Ясно, что он уложится за N-1 вопросов, так как       достаточно отмести N-1 человека, а оставшийся будет Z.      "
    ],
    "104083": [
        "https://www.problems.ru/view_problem_details_new.php?id=104083",
        "Взвешивания",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: На физическом кружке учитель поставил следующий эксперимент. Он разложил на чашечные весы 16 гирек массами 1, 2, 3, ..., 16 грамм так, что одна из чаш перевесила. Пятнадцать учеников по очереди выходили из класса и забирали с собой по одной гирьке, причем после выхода каждого ученика весы меняли свое положение и перевешивала противоположная чаша весов. Какая гирька могла остаться на весах?      ",
        "Решение: Поскольку в каждый момент времени массы на чашах весов отличались хотя бы на 1 грамм, то для того, чтобы перевесила противоположная чаша, необходимо забрать гирю массой не менее двух грамм. Следовательно, выходя из класса, ни один ученик не мог забрать гирю массой 1 грамм.      ",
        "Ответ: На весах осталась гиря массой 1 грамм.      "
    ],
    "30449": [
        "https://www.problems.ru/view_problem_details_new.php?id=30449",
        "Симметричная стратегия",
        "Сложность: 3-",
        "Классы: 6,7,8",
        "Условие: На окружности расставлено 20 точек.  За ходразрешается соединить любые две из них отрезком, не пересекающимотрезков, проведенных ранее.  Проигрывает тот, кто не можетсделать ход.",
        "Решение: Выигрывает первый.  Первым ходом он проводит хорду, пообе стороны от которой расположено по 9 вершин.  После этого, накаждый ход второго он отвечает аналогичным ходом по другуюсторону от этой хорды."
    ],
    "97956": [
        "https://www.problems.ru/view_problem_details_new.php?id=97956",
        "Симметричная стратегия",
        "Сложность: 3-",
        "Классы: 7,8,9",
        "Условие: Автор: Иванов В.  а) Вершины правильного 10-угольника закрашены чёрной и белой краской через одну. Двое играют в следующую игру. Каждый по очереди проводит отрезок, соединяющий вершины одинакового цвета. Эти отрезки не должны иметь общих точек (даже концов) с проведенными ранее. Побеждает тот, кто сделал последний ход. Кто выигрывает при правильной игре: начинающий игру или его партнер?   б) Тот же вопрос для 12-угольника. ",
        "Решение: а) Второй игрок может применять симметричную стратегию: каждый раз проводить отрезок, центрально симметричный отрезку, проведённому первым. При этом у него всегда будет ход, следовательно, он проиграть не может. б) Здесь симметричную стратегию может применить начинающий: сначала он соединяет противоположные вершины, а далее действует по стратегии, описанной в а). ",
        "Ответ: а) Партнёр; б) начинающий. ",
        "Замечания:  1. В а) начинающий не мог так действовать: противоположные вершины – разного цвета. 2. В б) вместо центральной симметрии можно воспользоваться осевой (относительно первой проведённой диагонали). "
    ],
    "30443": [
        "https://www.problems.ru/view_problem_details_new.php?id=30443",
        "Симметричная стратегия",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Двое по очереди ставят коней в клетки шахматной доскитак, чтобы кони не били друг друга.  Проигрывает тот, кто неможет сделать ход.",
        "Решение: Выигрывает второй.  Можно использовать и центральную, иосевую симметрию."
    ],
    "30453": [
        "https://www.problems.ru/view_problem_details_new.php?id=30453",
        "Симметричная стратегия",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Двое по очереди ставят крестики и нолики в клетки доски 9×9. Начинающий ставит крестики, его соперник - нолики. В конце подсчитывается, сколько имеется строчек и столбцов, в которых крестиков больше, чем ноликов - это очки, набранные первым игроком.  Количество строчек и столбцов, где ноликов больше - очки второго.  Тот из игроков, кто наберет больше очков, побеждает.",
        "Решение: Выигрывает первый.  Первым ходом он ставит крестик вцентральную клетку.  Затем после каждого хода второго игрокапервый ставит крестик в центрально-симметричную клетку."
    ],
    "35049": [
        "https://www.problems.ru/view_problem_details_new.php?id=35049",
        "Выигрышные и проигрышные позиции",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Игровое поле представляет собой горизонтальную полоску размером 1×100 клеток. В самой левой клетке стоит фишка. Двое по очереди двигают фишку вправо, причём за один ход разрешается сдвинуть фишку вправо на расстояние от 1 до 10  клеток. Проигрывает тот, кто не может сделать ход (то есть перед его ходом фишка находится в самой правой клетке). Кто выиграет  при правильной игре? ",
        "Подсказка: Второй игрок может играть таким образом, что после его хода количество свободных клеток справа от фишки будет кратно 11. ",
        "Решение: Выигрышная стратегия второго игрока такова: после каждого хода первого игрока на k клеток вправо сдвигать фишку на 11 – k клеток. Таким образом, после пары ходов, которые сделали первый и второй игроки, фишка сдвинется вправо на 11 клеток. В начальном положении справа от фишки было 99 пустых клеток. Поэтому через 9 пар ходов первого и второго игроков фишка будет находиться в самой правой клетке.",
        "Ответ: Второй."
    ],
    "35603": [
        "https://www.problems.ru/view_problem_details_new.php?id=35603",
        "Теория алгоритмов (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Есть три бидона емкостью 14 л, 9 л и 5 л.      В большем бидоне 14 литров молока, остальные бидоны пусты.      Как с помощью этих сосудов разлить молоко пополам?      ",
        "Подсказка: Получите сначала 1 литр, а затем 2 литра в 9-литровом бидоне.      ",
        "Решение: Приведем схему разливания молока (первое число - сколько      литров в 14-литровом бидоне, второе - сколько в 9-литровом,      третье - сколько в 5-литровом):            14  0  0 -        9  0  5 -       9  5  0 -        4  5  5 -       4  9  1 -      13  0  1 -       13  1  0 -       8  1  5  -      8  6  0  -      3  6  5  -      3  9  2  -     12  0  2 -      12  2  0 -       7  2  5  -      7  7  0 ."
    ],
    "35715": [
        "https://www.problems.ru/view_problem_details_new.php?id=35715",
        "Выигрышные и проигрышные позиции",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Король стоит на поле a1 шахматной доски. За ход разрешается  сдвинуть его на одну клетку вправо, или на одну клетку вверх,  или на одну клетку вправо-вверх.  Выигрывает тот, кто поставит короля на клетку h8.  Кто выигрывает при правильной игре?",
        "Подсказка: Отметьте те клетки, из которых за один ход можно попасть на h8.  Назовем их выигрышными (т.е. если  король стоит на выигрышной клетке, то первый ходящий выигрывает).  Отметьте далее те клетки, из которых  можно попасть только на выигрышные. Назовем их проигрышными  (т.е. если  король стоит на проигрышной клетке, то первый ходящий проигрывает).  Так постепенно отмечая выигрышные и проигрышные клетки,  Вы сможете определить, какова клетка a1 - выигрышная или  проигрышная.",
        "Решение: Раскрасим доску в два цвета, как показано на картинке.  Вначале король стоит на желтой клетке.  Его выигрышная стратегия - ходить всегда на зеленую клетку.  Он может придерживаться этой стратегии. Действительно, с зеленой клетки второй игрок  может пойти только на желтую, а с любой желтой клетки всегда есть возможность пойти  снова на зеленую. Так как на клетку h8 можно попасть только с  желтой клетки, то выигрывает первый игрок.",
        "Ответ: первый.  "
    ],
    "60898": [
        "https://www.problems.ru/view_problem_details_new.php?id=60898",
        "Взвешивания",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие:   Вы имеете право сделать 4 гири любого веса.Какие это должны быть гири, чтобы на весах из предыдущей задачиможно было взвесить грузы от 1 до 40 кг?",
        "Ответ: 1, 3, 9 и 27 кг."
    ],
    "78695": [
        "https://www.problems.ru/view_problem_details_new.php?id=78695",
        "Теория игр (прочее)",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Белая ладья преследует чёрного коня на доске 3×1969 клеток (они ходятпо очереди по обычным правилам). Как должна играть ладья, чтобы взять коня?Первый ход делают белые.      ",
        "Решение: Первым ходом ладья встаёт на произвольную клетку средней линии, идущей вдольдоски. Затем она каждый раз становится по диагонали от коня так,чтобы он был вынужден отходить в одном  и том же направлении.      "
    ],
    "88292": [
        "https://www.problems.ru/view_problem_details_new.php?id=88292",
        "Взвешивания",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: У продавца имеются чашечные весы с неравными плечами и гири. Сначала он взвешивает товар на одной чашке, затем – на другой и берёт средний вес. Не обманывает ли он? ",
        "Решение: Пусть мы на левую чашку весов положили товар весом в 1 кг, а на другую чашу для равновесия – гири весом в a кг, то есть в a раз больше. Если мы переложим товар на правую чашку, то для равновесия слева придется положить вес в a раз меньший, то есть 1/a кг. Таким образом, продавец возьмёт деньги за ½ (a + 1/a) кг, что, согласно неравенству Коши, больше 1 кг. ",
        "Ответ: Обманывает."
    ],
    "103819": [
        "https://www.problems.ru/view_problem_details_new.php?id=103819",
        "Теория алгоритмов (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Автор: Ященко И.В.В Мексике экологи добились принятия закона, по которому каждый автомобиль хотя бы один день в неделю не должен ездить (владелец сообщает полиции номер автомобиля и 'выходной' день недели этого автомобиля). В некоторой семье все взрослые желают ездить ежедневно (каждый – по своим делам!). Сколько автомобилей (как минимум) должно быть в семье, если взрослых в ней   а) 5 человек? б) 8 человек? ",
        "Подсказка: б) Если каждый день 'отдыхает' не более одного автомобиля, то всего автомобилей не более 7. ",
        "Решение:   а) Пяти автомобилей не хватит, так как в день, когда один из автомобилей 'отдыхает', кому-то не на чем будет ехать. Шести, очевидно, хватает.   б) Если каждый день 'отдыхает' не более одного автомобиля, то всего автомобилей не больше, чем дней недели, то есть семи. Но этого, очевидно, недостаточно. Значит, в какой-то день отдыхает два автомобиля, и в этот день нужно ещё как минимум 8 автомобилей. Итого 10. Мы доказали, что меньше, чем десятью автомобилями обойтись нельзя.   Десяти автомобилей достаточно: например, каждый рабочий день отдыхают по два автомобиля. ",
        "Ответ:  а) 6;  б) 10 автомобилей. ",
        "Замечания:  Ср. с задачей 109918. "
    ],
    "116849": [
        "https://www.problems.ru/view_problem_details_new.php?id=116849",
        "Теория игр (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Под ёлкой лежат 2012 шишек. Винни-Пух и ослик Иа-Иа играют в игру: по очереди берут себе шишки. Своим ходом Винни-Пух берёт одну или четыре шишки, а Иа-Иа – одну или три. Первым ходит Пух. Проигравшим считается тот, у кого нет хода. Кто из игроков сможет гарантированно победить, как бы ни играл соперник?",
        "Решение: Первым ходом Винни может взять четыре шишки, а в дальнейшем брать каждый раз одну шишку. В этом случае, после каждого хода ослика под ёлкой будет оставаться нечётное количество шишек. Так как количество шишек под ёлкой постепенно будет уменьшаться, то неизбежно настанет момент, когда под ёлкой останется одна шишка. Взяв её, Пух выиграет.",
        "Ответ: Винни-Пух. "
    ],
    "103955": [
        "https://www.problems.ru/view_problem_details_new.php?id=103955",
        "Выигрышные и проигрышные позиции",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: Фили и Кили играют в шахматы. Кроме шахматной доски у них есть одна ладья, которую они поставили в правый нижний угол, и делают ей ходы по очереди, причем ходить разрешается только вверх или влево (на любое количество клеток). Кто не может сделать хода, тот проиграл. Кили ходит первым. Кто выиграет при правильной игре?      ",
        "Решение: Выиграет тот, кто ходит вторым, то есть Фили. Для этого ему нужно после каждого хода Кили ходить так, чтобы ладья возвращалась на главную диагональ, ведущую из правого нижнего угла в левый верхний. В таком случае после каждого хода Фили ладья будет стоять на этой диагонали, причем выше, чем после предыдущего хода Фили. Это означает, что рано или поздно после хода Фили ладья окажется в левом верхнем углу, а значит, Кили будет некуда ходить.      ",
        "Ответ: выиграет Фили.      "
    ],
    "30437": [
        "https://www.problems.ru/view_problem_details_new.php?id=30437",
        "Игры-шутки",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: На доске написаны 10 единиц и 10 двоек. За ход разрешается стереть две любые цифры и, если они были одинаковыми, написать двойку, а если разными – единицу. Если последняя оставшаяся на доске цифра – единица, то выиграл первый игрок, если двойка – то второй.",
        "Решение: Чётность числа единиц на доске после каждого хода неменяется. Поскольку сначала единиц было чётное число, то после последнего хода на доске не может оставаться одна (нечётное число!) единица. ",
        "Ответ: Второй."
    ],
    "35703": [
        "https://www.problems.ru/view_problem_details_new.php?id=35703",
        "Теория алгоритмов (прочее)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: У Вани работает 10 сотрудников. Каждый месяц Ваня повышает зарплату на 1 рубль  ровно девятерым (по своему выбору). Как Ване повышать зарплаты, чтобы сделать их одинаковыми? (Зарплата – целое число рублей.) ",
        "Подсказка: Тот, кому не добавили рубль, относительно других сотрудников этот рубль теряет.  ",
        "Решение: Не будем доплачивать сотруднику с самой большой зарплатой до тех пор, пока его зарплата не сравняется с той, которая была самой маленькой (если сотрудников с наибольшей зарплатой несколько, то выберем любого из них). Таким образом, наименьшую зарплату будут иметь по крайней мере двое сотрудников. Затем, снова выберем сотрудника с самой большой зарплатой и не будем ему доплачивать, пока его зарплата не сравняется с той, которая была самой маленькой, и получим не менее трёх сотрудников с одинаковой зарплатой. Проделав такую операцию не более 9 раз, Ваня сможет уравнять все зарплаты. "
    ],
    "88201": [
        "https://www.problems.ru/view_problem_details_new.php?id=88201",
        "Взвешивания",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие:  Известно,что 'медные' монеты достоинством в1, 2, 3, 5коп. весятсоответственно1, 2, 3, 5г. Среди четырех 'медных' монет (пооднойкаждого достоинства) есть одна бракованная, отличающаяся весомотнормальной. Как спомощью взвешиваний начашечных весах без гирьопределить бракованную монету?      Также доступны документы в формате TeX",
        "Подсказка:       Попробуйте сделать два взвешивания: при первом наоднучашку весов положите монеты достоинством в2 и3коп., анадругую—в5коп.; при втором наодну чашку весов положите монеты в1 и2коп.,анадругую— в3коп.      ",
        "Решение:       Делаем два взвешивания. Первое— наодной чашке весов монетыв2коп. и3коп., надругой— в5коп. Второе— наодной чашкевесов монеты в1коп. и2коп., надругой— в3коп. При этом возможнычетыре варианта.Если вдруг все монеты небракованные— весы оба раза будутвравновесии.Если бракованной окажется монета в1коп.— при первомвзвешивании весы будут вравновесии, при втором—нет.Если бракованной окажется монета в5коп.— второй раз весыбудут вравновесии, первый раз—нет.Если оба раза весы небудут вравновесии, тобракованной окажетсямонета либо в2коп., либо в3коп. Тогда результат первого взвешиванияпокажет нам, тяжелее или легче бракованная монета, чем настоящие,арезультат второго взвешивания определит эту монету."
    ],
    "35429": [
        "https://www.problems.ru/view_problem_details_new.php?id=35429",
        "Симметричная стратегия",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: На столе лежат две стопки монет: в   одной из них 30 монет, а в   другой - 20. За ход   разрешается взять любое количество   монет из одной стопки. Проигрывает   тот, кто не сможет сделать ход. Кто   из игроков выигрывает при   правильной игре? ",
        "Подсказка: Сведите к возможности   делать симметричные хода.",
        "Решение: Выигрывает первый игрок.   Первым ходом он делает стопки   равными, по 20 монет, а   затем как бы ни шел второй игрок, у   первого есть возможность из другой   кучки взять столько же монет (есть   возможность делать симметричные   хода) ",
        "Ответ: При правильной игре выигрывает первый игрок."
    ],
    "35592": [
        "https://www.problems.ru/view_problem_details_new.php?id=35592",
        "Теория алгоритмов (прочее)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Нужно узнать пятизначный номер телефона, задавая вопросы, на      которые возможен ответ 'да' или 'нет'.      За какое наименьшее число вопросов это гарантированно можно сделать (при условии,      что на вопросы даются правильные ответы)?            ",
        "Подсказка: Надо задавать вопросы так, чтобы каждый последующий вопрос уменьшал      примерно вдвое количество остающихся возможных вариантов.",
        "Решение: Вначале, когда мы ничего не знаем о номере телефона, имеется      105=100000 возможных вариантов для телефонного номера.      Мы задаем вопрос: 'Верно ли, что номер больше 50000?'.      Вне зависимости от ответа, мы уменьшаем вдвое количество      оставшихся возможных вариантов. Итак, после первого вопроса      остается не более 50000 возможных вариантов для телефона.      Если ответ на первый вопрос - 'да', то      задаем вопрос: 'Верно ли, что номер больше 75000?'.      После ответа на этот вопрос останется не более      2500 вариантов.      И так далее - если после n-го вопроса осталось k возможных      вариантов, то можно задать (n+1)-ый вопрос таким образом, чтобы      после ответа на него осталось не более [k/2]+1      возможных вариантов.            Тем самым, получаем следующую зависимость количества      оставшихся возможных вариантов от количества заданных вопросов:                  После первого вопроса - 50000 вариантов, после 2-го - 25000,      3 - 12500, 4 - 6250, 5 - 3125, 6 - 1563, 7 - 782,      8 - 391, 9 - 196, 10 - 98, 11 - 59, 12 - 30, 13 - 15, 14 - 8, 15 -      4, 16 - 2, 17 - 1.                  Итак, после 17-ти вопросов останется один вариант, т.е. можно      будет угадать телефон.            С другой стороны, за 16 вопросов угадать номер нельзя.      Действительно, после 16-ти вопросов имеется      216<100000 последовательностей ответов на вопросы.      Значит, какой-то из последовательностей ответов соответствует по      крайней мере два варианта номера телефона. Таким образом,      если искомый номер - любой из этих двух номеров, то      последовательности ответов на вопросы будут одинаковыми,      т.е. однозначно определить номер не удастся.",
        "Ответ: 17 вопросов.     "
    ],
    "35427": [
        "https://www.problems.ru/view_problem_details_new.php?id=35427",
        "Симметричная стратегия",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: У ромашки а) 12 лепестков; б)   11 лепестков. За ход   разрешается сорвать либо один   лепесток, либо два рядом растущих   лепестка. Проигрывает игрок,   который не сможет сделать ход. Как   действовать второму игроку, чтобы   выиграть независимо от ходов первого игрока?",
        "Подсказка: У второго всегда есть   возможность делать симметричные   ходы.",
        "Решение: а) Занумеруем лепестки   по кругу. Разобьем их на пары 1 с   7, 2 с 8, 3   с 9, 4 с 10,   5 с 11, 6 с 12.   А теперь замечаем: парные лепестки   не соседние, т.е. их не может сорвать   один игрок, и какие бы лепестки не   оторвал первый, у второго есть   возможность оторвать парные с ним   или с ними.    б) Опять нумеруем лепестки с 1 по   11. Возможны два случая.    Первый случай. Первый отрывает один   лепесток, например, первый, тогда   второй отрывает два лепестка   шестой и седьмой, а затем лепестки   разбиваем на пары: 2 с 8,   3 с 9, 4 с 10,   5 с 11, а дальше   второй отрывает парные лепестки.   Второй случай. Первый срывает два   лепестка, например, 1 и 2,   тогда второй срывает седьмой и   опять, разбивая лепестки на пары и   срывая парные, второй выигрывает.   "
    ],
    "32808": [
        "https://www.problems.ru/view_problem_details_new.php?id=32808",
        "Теория игр (прочее)",
        "Сложность: 3-",
        "Классы: 7,8,9",
        "Условие: Докажите, что в игре в 'крестики-нолики' на поле 3*3 приправильной игре первого игрока второй игрок выиграть не сможет.",
        "Решение: Пусть первый игрок первым ходом ставит крестик в центр поля. У второго игрока есть две различные возможности: поставить нолик в угол или в середину боковой стороны. Как несложно проверить перебором, в каждом из этих случаев первый игрок может не допустить победы второго."
    ],
    "102818": [
        "https://www.problems.ru/view_problem_details_new.php?id=102818",
        "Симметричная стратегия",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Игра со спичками. На столе лежит 37 спичек. Разрешается по очереди брать не более 5 спичек. Выигрывает тот, кто возьмет последнюю. Кто выигрывает при правильной игре?",
        "Решение: Начинающий первым ходом берет одну спичку, а затем каждый раз  дополняет число спичек, взятых соперником, до 6 (докажите, что так можно!) и выигрывает."
    ],
    "30444": [
        "https://www.problems.ru/view_problem_details_new.php?id=30444",
        "Симметричная стратегия",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Двое по очереди ставят королей в клетки доски 9×9 так, чтобы короли не били друг друга.  Проигрывает тот, кто не может сделать ход.",
        "Решение: Выигрывает первый.  Первый ход в центр доски, а затем -центральная симметрия."
    ],
    "30454": [
        "https://www.problems.ru/view_problem_details_new.php?id=30454",
        "Выигрышные и проигрышные позиции",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Ладья стоит на поле a1.  За ход разрешается сдвинуть ее на любое число клеток вправо или на любое число клеток вверх. Выигрывает тот, кто поставит ладью на поле h8.",
        "Решение: В этой игре побеждает второй игрок.  Его стратегия очень проста: каждым своим ходом он возвращает ладью на большую диагональ a1-h8.  Объясним, почему, играя так, второй игрок выигрывает.  Дело в том, что первый игрок каждый раз вынужден будет уводить ладью с этой диагонали, а второй игрок после этого будет иметь возможность вернуть ладью на линию a1-h8.  Так как поле h8 принадлежит диагонали, то на него сумеет встать именно второй игрок."
    ],
    "35170": [
        "https://www.problems.ru/view_problem_details_new.php?id=35170",
        "Симметричная стратегия",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: На доске размером 8×8 двое по очереди закрашивают клетки так, чтобы не появлялось закрашенных уголков из трёх клеток. Проигрывает тот, кто не может сделать ход. Кто выигрывает при правильной игре? ",
        "Подсказка: Примените симметричную стратегию. ",
        "Решение: Второй игрок может всегда ходить симметрично первому (относительно центра доски). Тогда при его ходе не может появиться закрашенный уголок – иначе он появился бы на предыдущем ходу. Значит, он выиграет. ",
        "Ответ: Второй. "
    ],
    "35613": [
        "https://www.problems.ru/view_problem_details_new.php?id=35613",
        "Теория алгоритмов (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Неуловимый Джо никогда не проигрывает на рулетке больше четырех раз   подряд и никогда не ставит больше 10 долларов. Как ему выиграть   1000 долларов? (В случае выигрыша на рулетке возвращается   удвоенная ставка; вначале Джо имеет 100 долларов.)         ",
        "Подсказка: Вроде бы Джо невезучий, если он выигрывает только одну ставку из   пяти.      Но можно ставить так, чтобы выигрыши приходились на ставки,   размеры которых больше размеров предыдущих проигрышей.   Для этого нужно увеличивать ставку после проигрыша.",
        "Решение: Пусть Джо поставит вначале 50 центов. Если выиграет,   пусть он скажет 'хорошо' и снова поставит 50 центов.   Если проиграет, то в следующей ставке   он ставит 1 доллар. Если он выигрывает, то его выигрыш покроет   предыдущий проигрыш, и по сумме двух ставок он выиграет 50 центов.   После этого пусть Джо снова скажет 'хорошо' и в новой ставке   ставит 50 центов.   Если он проиграет и во второй раз, в третий раз он поставит 2   доллара, чтобы в случае выигрыша покрыть предыдущие проигрыши.   Если проигрывает в третий раз, то в четвертый раз ставит 4   доллара, если проигрывает и в четвертый, то в пятый раз ставит 8   долларов. По условию он не проигрывает пяти раз подряд, значит   играя таким образом до первого выигрыша, он заработает 50 центов   не более, чем за 5 ставок. После этого он скажет 'хорошо'   и будет ставить также, как вначале.   Итак, после 2000 'хорошо' Джо выиграет 1000 долларов. Для этого   ему потребуется сделать не более 10000 ставок.   "
    ],
    "35751": [
        "https://www.problems.ru/view_problem_details_new.php?id=35751",
        "Теория алгоритмов (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Вам пришло зашифрованное сообщение:  Ф В М Ё Ж Т И В Ф Ю  Найдите исходное сообщение, если известно,  что шифрпреобразование заключалось в следующем.  Пусть x1, x2 - корни трехчлена  x2+3x+1.  К порядковому номеру каждой буквы в стандартном русском алфавите  (33 буквы) прибавлялось значение многочлена  f(x)=x6+3x5+x4+x3+4x2+4x+3,  вычисленное либо при x=x1, либо при  x=x2 (в неизвестном нам порядке),  а затем полученное число заменялось соответствующей ему буквой.   (Задача с сайта www.cryptography.ru.)",
        "Подсказка: Поделите f(x) на x2+3x+1 с оcтатком. ",
        "Решение: Легко видеть, что  f(x)=(x2+3x+1)(x4+x+1)+2.  Отсюда f(x1)=f(x2)=2, где  x1, x2 - корни многочлена  x2+3x+1. Получаем   Буква с.ш.ФВМЁЖТИВФЮНомер 22 3 14 7 8 20 10 3 22 32Номер - 220 1 12 5 6 18 8 1 20 30 Буква о.с.ТАКДЕРЖАТЬ  Ответ: ТАКДЕРЖАТЬ "
    ],
    "60903": [
        "https://www.problems.ru/view_problem_details_new.php?id=60903",
        "Теория алгоритмов (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие:  Пусть l (n)— наименьшее число умножений,необходимое для нахождения xn. На примере чисел n = 15 иn = 63 покажите, что бинарный метод возведения в степень (смотри задачу 5.64) невсегда оптимален, то есть для некоторых n выполняетсянеравенство l (n) < b(n).",
        "Решение: b(15) = 6, но l (15) = 5: x1 = x2,x2 = x1 . x = x3,x3 = x1 . x2 = x5,x4 = x32 = x10,x5 = x3 . x4 = x15. Аналогично l (63) = 8 < 10 = b(63)."
    ],
    "78729": [
        "https://www.problems.ru/view_problem_details_new.php?id=78729",
        "Взвешивания",
        "Сложность: 3",
        "Классы: 8",
        "Условие: В наборе имеется 100 гирь, каждые две из которых отличаются по массе не болеечем на 20 г. Доказать, что эти гири можно положить на две чашки весов, по 50штук на каждую, так, чтобы одна чашка весов была легче другой не более чем на20 г.      ",
        "Решение: Разобьём гири на пары произвольным образом. Первую пару положим на разныечашки весов произвольно. Затем будем последовательно класть пары гирь, кладякаждый раз более тяжёлую гирю на более лёгкую чашку. Предположим, что начашках лежат грузы a и a + α, где 0 ≤ α ≤ 20, и мы положили гири b + β и b, где 0 ≤ β ≤ 20. Тогда разность весов грузов, лежащих на чашках, равна |α − β| ≤ 20."
    ],
    "97860": [
        "https://www.problems.ru/view_problem_details_new.php?id=97860",
        "Взвешивания",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Автор: Фомин С.В.Имеется 68 монет, причём известно, что любые две монеты различаются по весу. За 100 взвешиваний на двухчашечных весах без гирь найти самую тяжелую и самуюлёгкую монеты. ",
        "Решение:   Разобьём монеты на 34 пары. За 34 взвешивания сравним монеты внутри пар и более тяжёлые отложим в одну кучу, а более лёгкие – в другую.   Из 'тяжёлой' кучи за 33 взвешивания выделим самую тяжёлую монету (при каждом взвешивании сравниваем две монеты, лёгкую отбрасываем, а тяжёлую сравниваем со следующей). Точно так же за 33 взвешивания из 'лёгкой' кучи выделим самую лёгкую монету. 34 + 33 + 33 = 100.  ",
        "Замечания:  1. 5 баллов. 2. Задача предлагалась также на 51-й Ленинградской математической олимпиаде (1985, 6 кл., зад. 5). 3. Ср. с задачей М936 из Задачника 'Кванта'. "
    ],
    "103967": [
        "https://www.problems.ru/view_problem_details_new.php?id=103967",
        "Симметричная стратегия",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Есть прямоугольный стол. Два игрока начинают по очереди класть на него по одному евро так, чтобы эти монеты не перекрывали друг друга. Кто не может сделать ход - проигрывает. Кто выиграет при правильной игре?      ",
        "Решение: Покажем, как должен действовать первый игрок, чтобы выигрывать независимо от действий второго игрока. Первым своим ходом он должен положить монету точно в середину стола. После этого на любой ход второго игрока первый игрок должен отвечать симметричным относительно центра стола ходом. Такой ход возможен, так как после любого хода первого игрока расположение монет на столе симметрично относительно центра стола. Значит, если найдется свободное место для монеты второго игрока, то свободным будет и симметричное ему место.",
        "Ответ: При правильной игре выиграет первый игрок."
    ],
    "32807": [
        "https://www.problems.ru/view_problem_details_new.php?id=32807",
        "Выигрышные и проигрышные позиции",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: В нижнем левом углу шахматной доски 8 на 8 стоит фишка. Двоепо очереди передвигают её на одну клетку вверх, вправо или вправо-вверхпо диагонали. Выигрывает тот, кто поставит фишку в правый верхнийугол. Кто победит при правильной игре?",
        "Ответ: Назовем клетку доски выигрышной, если игрок, который ходит из этой клетки, выигрывает при правильной игре. Остальные клетки назовем проигрышными.Будем обозначать выигрышные клетки знаком '+', а проигрышные - знаком '-'. Начнем заполнять доску. Клетки g7, g8 и h7 - очевидно, выигрышные, так как из них можно первым же ходом попасть в h8. Далее, клетки f8 и h6 - проигрышные, потому что из них можно попасть только в выигрышные клетки. Продолжая таким образом заполнять доску, увидим, что в клетке a1 стоит '+'. Значит, при правилльной игре побеждает первый игрок."
    ],
    "35253": [
        "https://www.problems.ru/view_problem_details_new.php?id=35253",
        "Теория алгоритмов (прочее)",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Как отмерить 15 минут, пользуясь песочными часами на 7 минут и на 11 минут?",
        "Подсказка: Можно переворачивать часы в тот момент, когда еще не весь песок высыпался.",
        "Решение: Пусть первые часы – на 7 минут, а вторые – на 11 минут. Запустим и те и другие часы.Первый способ. Через 7 минут первые часы перевернём, а еще через 4 минуты, то есть когда во вторых часах весь песок уйдёт вниз, вновь перевернём первые часы. В этот момент в первых часах внизу будет песок на 4 минуты, а вверху – на 3  минуты. Значит, при перевороте первых часов мы сможем отмерить еще 4  минуты. Второй способ. Спустя 7 минут, то есть когда на первых часах весь песок уйдёт вниз, на вторых часах останется вверху песок на 4 минуты. С этого моментаначинаем отсчёт. Как только на вторых часах весь песок уйдёт вниз, перевернём их и отмерим еще 11 минут. "
    ],
    "98363": [
        "https://www.problems.ru/view_problem_details_new.php?id=98363",
        "Теория алгоритмов (прочее)",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Автор: Шаповалов А.В.Первоначально на каждом поле доски 1×n стоит шашка. Первым ходом разрешается переставить любую шашку на соседнюю клетку (одну из двух, если шашка не с краю), так что образуется столбик из двух шашек. Далее очередным ходом каждый столбик можно передвинуть в любую сторону на столько клеток, сколько в нём шашек (в пределах доски); если столбик попал на непустую клетку, он ставится на стоящий там столбик и объединяется с ним. Докажите, что за n – 1 ход можно собрать все шашки на одной клетке. ",
        "Решение: Выберем центральную шашку (одну из двух, если n чётно). Каждым очередным ходом будем двигать тот столбик, в котором эта шашка оказалась, по направлению к наиболее удалённому краю доски. (Если n нечётно, то первый ход можно делать в любом направлении.) После каждого хода количество шашек в столбике, который мы двигаем, увеличивается на 1. Значит, после (n – 1)-го хода в нём будет 1 + (n – 1) = n шашек.",
        "Замечания:  5 баллов "
    ],
    "35669": [
        "https://www.problems.ru/view_problem_details_new.php?id=35669",
        "Теория игр (прочее)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Ладья стоит на поле a1 шахматной доски. За ход разрешается сдвинуть ее на любое число клеток вправо или вверх. Выигрывает тот, кто поставит ладью на клетку h8. Кто выигрывает при правильной игре?",
        "Подсказка: Каждым своим ходом второй игрок может возвратить ладью на диагональ a1-h8.",
        "Решение: Опишем выигрышную стратегию второго игрока. Своим первым ходом первый игрок обязан убрать ладью с диагонали a1-h8. Своим ходом второй игрок может возвратить ладью на диагональ. Мы приходим к ситуации, аналогичной начальной. Отличие лишь в том, что ладья стала ближе к полю h8.  Придерживаясь такой стратегии, второй игрок первым придет на поле h8.",
        "Ответ: выигрывает второй.  "
    ],
    "35797": [
        "https://www.problems.ru/view_problem_details_new.php?id=35797",
        "Теория алгоритмов (прочее)",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: В одной урне лежат два белых шара, в другой два черных, в третьей - один белый и один черный. На каждой урне висела табличка, указывающее ее содержимое: ББ, ЧЧ, БЧ. Некто перевесил таблички так, что теперь каждая  табличка указывает содержимое урны неправильно. Разрешается вынуть шар из любой урны, не заглядывая  в нее. Какое наименьшее число извлечений потребуется, чтобы определить состав всех трех урн?",
        "Подсказка: Существенно используйте условие, что НИ ОДНА из табличек не указывает содержимое правильно.",
        "Решение: Вынем шар из урны с табличкой БЧ. Если мы вынули белый шар, то в этой урне два белых шара (иначе табличка указывала бы на содержимое правильно). Далее определяем, что в урне с табличкой ЧЧ может быть только один белый и один черный шар (иначе табличка указывала бы на содержимое правильно). Осталась единственная возможность -  в урне с табличкой ББ находятся два черных шара.  Если же мы вынули из урны с табличкой БЧ черный шар, то аналогичным образом определяем, что в ней два черных шара,  в урне с табличкой ББ находится один белый и один черный шар,  а в урне с табличкой ЧЧ находятся два белых шара.",
        "Ответ: достаточно одного извлечения!  "
    ],
    "86557": [
        "https://www.problems.ru/view_problem_details_new.php?id=86557",
        "Симметричная стратегия",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: В первой кучке лежит 100 конфет, а во второй — 200 конфет. За ход можно взять любое количество конфет из любой кучки. Выигрывает взявший последнюю. Кто выигрывает при правильной игре? ",
        "Решение: Первый берет из второй кучки 100 конфет, а затем повторяет ходы второго, беря столько же конфет, сколько и второй, но из другой кучки.",
        "Ответ: Выигрывает первый игрок."
    ],
    "109482": [
        "https://www.problems.ru/view_problem_details_new.php?id=109482",
        "Взвешивания",
        "Сложность: 3-",
        "Классы: 5,6,7,8",
        "Условие: На столе в ряд лежат четыре монеты. Среди них обязательно есть как настоящие, так и фальшивые (которые легче настоящих). Известно, что любая настоящая монета лежит левее любой фальшивой. Как за одно взвешивание на чашечных весах без гирь определить тип каждой монеты, лежащей на столе? ",
        "Решение: Пронумеруем монеты слева направо. Так как среди монет есть обязательно настоящая и фальшивая, то первая монета настоящая, а четвертая– фальшивая. Необходимо определить вид второй и третьей монет. Настоящие монеты лежат левее фальшивых, значит возможны следующие случаи:1)настоящая, настоящая, настоящая, фальшивая;2)настоящая, настоящая, фальшивая, фальшивая;3)настоящая, фальшивая, фальшивая, фальшивая.Положим на левую чашу весов первую и четвертую монеты, а на правую чашу весов– вторую и третью монеты.1) Если правая чаша перевесила, то на ней лежат только настоящие монеты, т.е. вторая и третья монеты– настоящие. 2) Если весы находятся в равновесии, то на каждой чаше лежат настоящая и фальшивая монеты, т.е. вторая монета– настоящая, а третья– фальшивая.3) Если левая чаша перевесила, то на правой чаше лежат только фальшивые монеты, т.е. вторая и третья монеты– фальшивые. ",
        "Ответ: "
    ],
    "35430": [
        "https://www.problems.ru/view_problem_details_new.php?id=35430",
        "Теория игр (прочее)",
        "Сложность: 3-",
        "Классы: 7,8",
        "Условие: Дана клетчатая доска размером а) 10×12; б) 9×10; в) 9×11. За ход разрешается вычеркнуть любую строку или любой столбец, если там есть хотя бы одна не вычеркнутая клетка. Проигрывает тот, кто не может сделать ход. Есть ли у кого-нибудь выигрышная стратегия? ",
        "Подсказка: Следите за чётностью количества строк и столбцов.",
        "Решение: а) Стратегия второго: всегда оставлять чётное число невычеркнутых строк и чётное число невычеркнутых столбцов. При этом у него всегда есть ход. б) Стратегия первого: первым ходом оставить таблицу 8×10, а затем играть по стратегии п. а).в) Стратегия второго: после любого хода первого игрока оставить 8×10, а затем  играть по стратегии п. а) ",
        "Ответ: а), в) У второго;  б) у первого. "
    ],
    "30438": [
        "https://www.problems.ru/view_problem_details_new.php?id=30438",
        "Игры-шутки",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: На доске написаны числа 25 и 36.  За ход разрешаетсядописать еще одно натуральное число - разность любых двухимеющихся на доске чисел, если она еще не встречалась.Проигрывает тот, кто не может сделать ход.",
        "Решение: В процессе игры (сравните с алгоритмом Евклида)обязательно будет выписан наибольший общий делитель исходных чисел.Следовательно, будут выписаны и все числа, кратные ему, непревосходящие большего из исходных чисел.  В нашем случае НОДравен 1.  Поэтому будут выписаны все числа от 1 до 36.  Такимобразом игра будет продолжаться 34 хода (два числа были написанысначала), и выигрывает второй игрок."
    ],
    "30446": [
        "https://www.problems.ru/view_problem_details_new.php?id=30446",
        "Симметричная стратегия",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Дана клетчатая доска 10 × 10. За ход разрешается покрыть любые 2 соседние клетки доминошкой (прямоугольником 1×2) так, чтобы доминошки не перекрывались.  Проигрывает тот, кто не может сделать ход.",
        "Решение: Выигрывает второй.  Центральная симметрия."
    ],
    "32819": [
        "https://www.problems.ru/view_problem_details_new.php?id=32819",
        "Взвешивания",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Фальшивомонетчик Вася изготовил четыре монеты достоинством1, 3, 4, 7 квача, которые должны весить 1, 3, 4, 7 граммов соответственно.Но одну из этих монет он сделал некачественно – с неправильным весом.Как за два взвешивания на чашечных весах без гирек определить 'неправильную'монету?",
        "Решение: Сначала положим на одну чашу монеты в 1 квач и 3 квача, а на другую - монету в 4 квача; затем на одну чашу положим монеты в 3 квача и 4 квача, а на другую - монету в 7 квачей.Если при одном из взвешиваний весы показали равенство, то некачественная монета - та, которая в этом взвешивании не участвовала. Если при обоих взвешиваниях тяжелее оказалась одна и та же чаша весов, то некачественная монета - достоинством в 3 квача, иначе - достоинством в 4 квача."
    ],
    "35198": [
        "https://www.problems.ru/view_problem_details_new.php?id=35198",
        "Теория алгоритмов (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Дана клетчатая таблица 99×99, каждая клетка которой окрашена в чёрный или в белый цвет. Разрешается одновременно перекрасить все клетки некоторого столбца или некоторой строки в тот цвет, клеток которого в этом столбце или в этой строке до перекрашивания было больше. Всегда ли можно добиться того, чтобы все клетки таблицы стали покрашены в один цвет? ",
        "Решение: Вначале применим описанное в условии перекрашивание к каждой строке таблицы. После этого каждая из строк состоит из клеток одного цвета. Это, в частности, означает, что в каждом из столбцов стало по одинаковому числу чёрных (белых) клеток. Теперь достаточно перекрасить каждый из столбцов – после этого все столбцы станут одноцветными, причём все они будут окрашены в один и тот же цвет. ",
        "Ответ: Всегда. "
    ],
    "35673": [
        "https://www.problems.ru/view_problem_details_new.php?id=35673",
        "Игры-шутки",
        "Сложность: 3",
        "Классы: 7,8,9,10",
        "Условие: Двое играют в двойные шахматы: все фигуры ходят как обычно, но каждый делает по два шахматных хода подряд. Докажите, что первый может как минимум сделать ничью.",
        "Подсказка: Предположите, что второй имеет выигрышную стратегию и покажите, что первый может применить эту стратегию.",
        "Решение: Предположим, противное, т.е. второй игрок имеет выигрышную стратегию. Это означает, что у второго есть правило П ответа на любые возможные ходы первого такое, что если второй ему следует, то независимо от ходов первого второй игрок побеждает. Пусть первый игрок первые два хода подряд сделал конем - первым ходом вывел коня, а вторым - поставил его обратно. Тогда позиция такая же как вначале, а очередь хода - у второго игрока. Таким образом, в этот момент первый игрок может воспользоваться стратегией П, чтобы наверняка выиграть. Но это противоречие тому, что у второго игрока имеется выигрышная стратегия."
    ],
    "35786": [
        "https://www.problems.ru/view_problem_details_new.php?id=35786",
        "Теория алгоритмов (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Для передачи сообщений по телеграфу каждая буква русского алфавита (Е и Ё отождествлены) представляется в виде пятизначной комбинации из нулей и единиц, соответствующих двоичной записи номера данной буквы в алфавите (нумерация букв начинается с нуля). Например, буква А представляется в виде 00000, буква Б - 00001, буква Ч – 10111, буква Я – 11111. Передача пятизначной комбинации производится по кабелю, содержащему пять проводов. Каждый двоичный разряд передается по отдельному проводу. При приеме сообщения Криптоша перепутал провода, поэтому вместо переданного слова получен набор букв ЭАВЩОЩИ. Найдите переданное слово. ",
        "Подсказка: Обратите внимание, что в результате 'перепутывания' проводов не меняется количество единиц в представлении передаваемой буквы – это поможет сильно сократить число вариантов переданного слова. ",
        "Решение: Выпишем под каждой буквой полученного текста ЭАВЩОЩИ все буквы, в представлении которых то же количество единиц, что и в исходной. Далее пробуем 'прочитать' осмысленный текст, выбирая из каждого столбца полученной таблицы по одной букве.  Единственным вариантом оказывается слово ПАРОХОД. ",
        "Ответ: ПАРОХОД. "
    ],
    "77901": [
        "https://www.problems.ru/view_problem_details_new.php?id=77901",
        "Взвешивания",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Имеется 555 гирь весом: 1 г, 2 г, 3 г, 4 г,...555 г. Разложитьих на 3 равные по весу кучи.      ",
        "Решение: Девять гирь весом n, n + 1, ..., n + 8 можно разложить на три равные повесу кучи: 1) n, n + 4, n + 8; 2) n + 1, n + 5, n + 6; 3) n + 2, n + 3,n + 7. Это позволяет разложить на три равные по весу кучи гири весом1, 2, ..., 549 = 61 . 9. Оставшиеся шесть гирь весом 550, 551, ..., 555 можно разложить на три равные по весу кучи следующим образом: 1) 550 и 555; 2) 551 и 554; 3) 552 и 553.        "
    ],
    "79408": [
        "https://www.problems.ru/view_problem_details_new.php?id=79408",
        "Теория алгоритмов (прочее)",
        "Сложность: 3",
        "Классы: 8",
        "Условие: Петя приобрёл в магазине вычислительный автомат, который за 5 к. умножаетлюбое введённое в него число на 3, а за 2 к. прибавляет к любому числу 4. Петяхочет, начиная с единицы, которую можно ввести бесплатно, набрать на автоматечисло 1981 и затратить наименьшую сумму денег. Во сколько обойдутся емувычисления? А что будет, если он захочет набрать число 1982?      ",
        "Решение: Заметим сначала, что на автомате нельзя набрать чётное число. Следовательно, уПети не получится набрать число1982.Лемма. После первого умножения на3 невыгодно прибавлять4 более двух раз подряд.Доказательство леммы.  Заменив последовательность действий ×3, + 4, + 4, + 4 на +4, ×3, мы уменьшим затраты.Теперь можно восстановить последовательность действий Пети, начиная споследнего: если число не делится на3, то оно было получено прибавлениемчетвёрки, а если делится, то либо оно было получено умножением на3, либо при его получении были использованы только прибавления четвёрки. Таким образомполучаем, что оптимальная для Пети последовательность действий имеет вид:+4, + 4, + 4, + 4, + 4, ×3, + 4, + 4, ×3, + 4, ×3, + 4, + 4, ×3, + 4."
    ],
    "103969": [
        "https://www.problems.ru/view_problem_details_new.php?id=103969",
        "Выигрышные и проигрышные позиции",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: а) Двое играют в такую игру: на столе лежат 7 монет по два фунта и 7 монет по одному фунту. За ход разрешается взять монет на сумму не более трех фунтов. Забравший последнюю монету выигрывает. Кто победит при правильной игре?б) Тот же вопрос, если и тех, и других монет - по 12.      ",
        "Решение: В пункте б) второй игрок должен всяким своим ходом делать сумму, лежащую на столе, кратной четырем фунтам. Другими словами, если первый игрок берет один фунт, то второй берет три фунта, если первый берет два, то и второй два, если первый берет три, то второй один. Нетрудно проверить, что всякий раз взять со стола требуемую сумму возможно. Таким образом, перед каждым ходом первого игрокана столе находится не менее четырех фунтов, и он не может этим ходом выиграть.Заметим, что эта стратегия позволяет второму игроку выиграть, если в начале игры на столе лежит любая сумма, кратная четырем фунтам.В пункте а) первый игрок должен первым ходом взять два фунта, после чего сумма станет равна 12 фунтам. Дальше он должен действовать как второй игрок в решениипункта б).",
        "Ответ: а)первый; б)второй."
    ],
    "35524": [
        "https://www.problems.ru/view_problem_details_new.php?id=35524",
        "Взвешивания",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Из 11 шаров 2 радиоактивны. Про любой набор шаров за одну проверку можно    узнать, имеется ли в нем хотя бы один радиоактивный шар (но нельзя узнать,    сколько их). Можно ли за 7 проверок найти оба радиоактивных шара?",
        "Подсказка: Разбейте шары на несколько групп.",
        "Решение: Можно. Разобьем шары на 5 групп по 2 шара и еще один шар. Проверим эти 5    групп. Если две из них радиоактивные, то из каждой радиоактивный шар    выделяется за одну проверку. Если радиоактивна только одна группа, проверяем    оба шара в ней. "
    ],
    "35347": [
        "https://www.problems.ru/view_problem_details_new.php?id=35347",
        "Взвешивания",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: В корзине лежат 13 яблок. Имеются весы, с помощью которых можно узнать суммарный вес любых двух яблок. Придумайте способ выяснить за 8 взвешиваний суммарный вес всех яблок. ",
        "Подсказка: Попробуйте за три взвешивания найти суммарный вес трёх яблок. ",
        "Решение: Занумеруем яблоки. Взвесим первое яблоко со вторым, второе с третьим и третье с первым, затем сложим полученные веса и получим удвоенный вес трёх яблок. Итак, за три взвешивания мы узнали суммарный вес первых трёх яблок. Осталось пять взвешиваний и десять яблок, которые взвешиваем попарно. Суммируя все данные, получим вес 13 яблок. "
    ],
    "88012": [
        "https://www.problems.ru/view_problem_details_new.php?id=88012",
        "Взвешивания",
        "Сложность: 2+",
        "Классы: 5,6,7,8",
        "Условие:  Имеютсячашечные весы без гирь и3одинаковые повнешнему виду монеты, однаизкоторых фальшивая: она легче настоящих (настоящие монеты одноговеса). Сколько надо взвешиваний, чтобы определить фальшивую монету?Решите туже задачу вслучаях, когда имеется 4монеты и9монет.      ",
        "Подсказка:       При поиске фальшивой монеты среди трех монет попробуйтеположить накаждую чашку весов поодной монете, среди 4— подве,асреди 9— потри монеты.      ",
        "Решение:       Если унас 3монеты, достаточно одного взвешивания. Кладёмнакаждую чашку весов поодной монете, при этом если одна изчашеклегче, значит, фальшивая монета наней. Еслиже весы вравновесии,тофальшивая монета та, которую неположили навесы.Если унас 4монеты, топотребуется два взвешивания: при первом кладёмнакаждую чашку весов по2монеты, при втором берём те2монеты, которыеоказались легче, икладём их поодной накаждую чашку. Та монета,которая легче,— фальшивая.Если унас монет 9, снова потребуется два взвешивания. Делим монетынатри группы по3монеты икладём две изэтих троек надве чашки весов.Если весы вравновесии— рассматриваем те3монеты, которые мынеклали навесы. Если весы невравновесии— рассматриваемте3монеты, которые легче. Теперь задача свелась ксамой первой: 'есть3монеты, одна изних фальшивая'. Как мы уже знаем, вэтом случае дляопределения фальшивой монеты требуется только одно взвешивание.      ",
        "Ответ:       1; 2; 2.      "
    ],
    "30440": [
        "https://www.problems.ru/view_problem_details_new.php?id=30440",
        "Симметричная стратегия",
        "Сложность: 2+",
        "Классы: 6,7,8",
        "Условие: Двое по очереди кладут пятаки на круглый стол, причемтак, чтобы они не накладывались друг на друга.  Проигрывает тот,кто не может сделать ход.",
        "Решение: В этой игре выигрывает первый, независимо от размеровстола!  Первым ходом он кладет пятак так, чтобы центры монеты истола совпали.  После этого на каждый ход второго игроканачинающий отвечает симметрично относительно центра стола.Отметим, что при такой стратегии после каждого хода первогоигрока позиция симметрична.  Поэтому если возможен очередной ходвторого игрока, то возможен и симметричный ему ответный ходпервого.  Следовательно, он побеждает."
    ],
    "78689": [
        "https://www.problems.ru/view_problem_details_new.php?id=78689",
        "Теория игр (прочее)",
        "Сложность: 2+",
        "Классы: 8",
        "Условие: Белая ладья преследует чёрного слона на доске 3×1969 клеток (они ходятпо очереди по обычным правилам). Как должна играть ладья, чтобы взять слона?Первый ход делают белые.      ",
        "Решение: Первым ходом ладья встаёт на произвольную клетку средней линии, идущей вдольдоски. Затем она движется в одном направлении, отставая от слона на ход коня.      "
    ],
    "35714": [
        "https://www.problems.ru/view_problem_details_new.php?id=35714",
        "Теория алгоритмов (прочее)",
        "Сложность: 3-",
        "Классы: 7,8,9",
        "Условие: На столе стоят восемь стаканов с водой. Разрешается взять любые два стакана и уравнять в них количества воды, перелив часть воды из одного стакана в другой. Докажите, что с помощью таких операций можно добиться того, чтобы во всех стаканах было поровну воды.",
        "Подсказка: 8 - это степень двойки. Решите эту задачу сначала для четырех стаканов, а затем - для восьми.",
        "Решение: Разделим стаканы на пары A - A', B - B', C - C', D - D', и уравняем количества воды в каждой паре стаканов. Теперь у нас две совершенно одинаковые четверки: A, B, C, D и A', B', C', D'. Уравняем количество воды в первой четверке, а затем точно таким же способом - во второй четверке. Итак, мы свели нашу задачу к той же самой задаче, но уже для четырех стаканов. Точно также разделим четыре стакана по парам и, уравняв количества воды в этих парах, сведем задачу к случаю двух стаканов. Но в двух стаканов количества воды можно уравнять по условию."
    ],
    "30442": [
        "https://www.problems.ru/view_problem_details_new.php?id=30442",
        "Симметричная стратегия",
        "Сложность: 3-",
        "Классы: 7,8",
        "Условие: Имеется две кучки камней - по 7 в каждой.  За ходразрешается взять любое количество камней, но только из однойкучки.  Проигрывает тот, кому нечего брать.",
        "Решение: В этой игре второй игрок побеждает при помощисимметричной стратегии:  каждым своим ходом он должен братьстолько же камней, сколько предыдущим ходом взял первый игрок, ноиз другой кучки.  Таким образом, у второго игрока всегда естьход."
    ],
    "35733": [
        "https://www.problems.ru/view_problem_details_new.php?id=35733",
        "Теория алгоритмов (прочее)",
        "Сложность: 3-",
        "Классы: 7,8,9",
        "Условие: Сломанный калькулятор выполняет только одну операцию 'звездочка': a&star;b = 1 – a : b. Докажите, что с помощью этого калькулятора все же возможно выполнить любое из четырёх арифметических действий. ",
        "Подсказка: Начните с деления. ",
        "Решение: Деление: (a&star;b)&star;1 = 1 – ((a&star;b) : 1) = 1 – (1 – a : b) = a : b. Умножение: ab = a : (1 : b) = a : ((1&star;b)&star;1) = (a&star;((1&star;b)&star;1))&star;1. Вычитание: a – b = (b&star;a)·a = ((b&star;a)&star;((1&star;a)&star;1))&star;1. Сложение: a + b = a – (0 – b). "
    ],
    "30439": [
        "https://www.problems.ru/view_problem_details_new.php?id=30439",
        "Игры-шутки",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Дана клетчатая доска размерамиа) 9×10;б) 10×12;в) 9×11.За ход разрешается вычеркнуть любую горизонталь или любую вертикаль, если в ней к моменту хода есть хотя бы одна невычеркнутая клетка.  Проигрывает тот, кто не может сделать ход.",
        "Решение: Эта игра - не совсем шутка.  В ней выигрывающий, допустив ошибку, может проиграть.  Эта ошибка состоит в том, что он после своего хода оставляет невычеркнутые клетки только в одном столбце или только в одной строке, предоставляя противнику возможность выиграть в один ход.  Проигравшим в этой игре является, тем самым, тот, кто сделает этот роковой ход.  Заметим, что оставшуюся после вычеркивания горизонтали часть клетчатой доски m×n можно представить себе как доску (m-1)×n.  Аналогично, после вычеркивания вертикали остается доска m×(n-1). Ситуация, в которой каждый ход является 'роковым', только одна - это доска 2×2.  Таким образом, выигрывает игрок, после хода которого она возникла.  Однако, как мы видели, при каждом ходе суммарное количество горизонталей и вертикалей на доске уменьшается на 1.  Поэтому четность этой суммы в начале игры определяет победителя.  В пункте а) выигрывает первый игрок, а в пунктах б) и  в) - второй. Заметим, что в пункте б) решающим соображением может быть и симметричная стратегия второго игрока."
    ],
    "30448": [
        "https://www.problems.ru/view_problem_details_new.php?id=30448",
        "Симметричная стратегия",
        "Сложность: 3",
        "Классы: 6,7,8",
        "Условие: Имеются две кучки камней: в одной - 30, в другой -20.  За ход разрешается брать любое количество камней, нотолько из одной кучки.  Проигрывает тот, кому нечего брать.",
        "Решение: Выигрывает первый.  Первым ходом он уравниваетколичество камней в кучках, после чего играет как в задаче 10."
    ],
    "32820": [
        "https://www.problems.ru/view_problem_details_new.php?id=32820",
        "Взвешивания",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Известно, что среди нескольких монет имеется ровно одна фальшивая(отличается по весу от настоящих). С помощью двух взвешиваний на чашечныхвесах без гирь определите, легче или тяжелее фальшивая монета настоящей(находить ее не надо), если монет а) 100; б) 99; в) 98?",
        "Решение: а) Положим сначала на каждую чашу по 50 монет. Затем возьмем более тяжелую часть, разобьем ее на кучки по 25 монет и взвесим их. Если их массы равны, то фальшивая монета легче остальных, иначе - тяжелее остальных.б) Разделим монеты на 3 кучки по 33 монеты и взвесим любые две из них. Если их массы равны, то сравним любую из них с третьей; если третья кучка легче, то и фальшивая монета легче остальных, иначе фальшивая монета тяжелее остальных.Если же массы первых двух кучек различны, то взвесим более тяжелую из них с третьей. Если их массы окажутся равны, то фальшивая монета легче остальных, если же третья окажется легче, то фальшивая монета тяжелее остальных.в) Отложим сначала две монеты в сторону, а остальные разобьем на 2 части по 48 монет и взвесим их. Если их массы равны, то взвесим две отложенные монеты с любыми двумя другими; если отложенные монеты окажутся легче, то и фальшивая монета легче остальных, иначе - тяжелее.Если же массы первых двух кучек различны, то аналогично пункту а) разобьем более тяжелую на 2 части по 24 монеты и взвесим их. Если весы покажут равенство, то фальшивая монета легче остальных, иначе - тяжелее."
    ],
    "35384": [
        "https://www.problems.ru/view_problem_details_new.php?id=35384",
        "Теория алгоритмов (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Вычислительная машина умеет выполнять только одну операцию:       a*b=1-a/b. Как выполнить с помощью этой машины все четыре       арифметических действия?       ",
        "Подсказка: Машина запоминает числа, с которыми она работает.      Поймите как можно получить 0, 1.",
        "Решение: Даны два числа a, b.      1) Еcли взять пару (a;a), то машина    поставит ей в соответствие  число 0.   2)    Еcли взять пару (0;b), то машина    поставит ей в соответствие  число 1.   3)   Еcли взять пару (1-a:b;1), то машина    поставит ей в соответствие  число a:b.   Действительно указанной паре машина сопоставит число   1-(1-a:b):1=a:b. Итак, мы НАУЧИЛИСЬ    ДЕЛИТЬ известные нам числа.   4)Так как мы научились уже делить, то можем получить    число  1:b, а затем можем получить число   a:(1:b)=a*b. Мы НАУЧИЛИСЬ УМНОЖАТЬ.    5)Разделив число 1-a:b на 1:b, получим    число b-a. Нашли разность.    6)Вычитая числа b-a и b, получим число   -a. Осталось от числа b отнять число   -a, т.е. записать b-(-a)=b+a.  Нашли    сумму двух чисел."
    ],
    "60681": [
        "https://www.problems.ru/view_problem_details_new.php?id=60681",
        "Теория игр (прочее)",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Имеется 100 камней. Два игрока берут по очереди от 1 до 5 камней. Проигрывает тот, кто берет последний камень. Определите выигрышную стратегию первого игрока. ",
        "Подсказка: Первый игрок должен следить за тем, чтобы количество камней, оставшихся после его хода, давало остаток 1 при делении на 6. "
    ],
    "86553": [
        "https://www.problems.ru/view_problem_details_new.php?id=86553",
        "Симметричная стратегия",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Игра с 25-ю  монетами. В ряд лежат 25 монет. За ход разрешается брать одну или две рядом лежащие монеты. Проигрывает тот, кому нечего брать.",
        "Решение: Первый берет среднюю 13-ую монету. Если второй берет k монету, то первый берет 26−k монету; если второй берет две монеты, то и первый берет две монеты по ранее написанному правилу и выигрывает (симметрия ходов относительно средней монеты)."
    ],
    "111360": [
        "https://www.problems.ru/view_problem_details_new.php?id=111360",
        "Кооперативные алгоритмы",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Автор: Толпыго А.К.Фокусник с завязанными глазами выдаёт зрителю пять карточек с номерами от 1 до 5. Зритель прячет две карточки, а три отдаёт ассистенту фокусника. Ассистент указывает зрителю на две из них, и зритель называет номера этих карточек фокуснику (в том порядке, в каком захочет). После этого фокусник угадывает номера карточек, спрятанных у зрителя. Как фокуснику и ассистенту договориться, чтобы фокус всегда удавался? ",
        "Решение: Занумеруем вершины правильного пятиугольника числами от 1 до 5. Отрезками назовём его стороны и диагонали. Пара карточек, спрятанных зрителем, соответствует одному из отрезков. Среди трёх карточек у ассистента есть пара, соответствующая параллельному отрезку. Её он и называет фокуснику. ",
        "Замечания:  1. Ср. с задачей 111355. 2. 5 баллов. "
    ],
    "60900": [
        "https://www.problems.ru/view_problem_details_new.php?id=60900",
        "Теория алгоритмов (прочее)",
        "Сложность: 3",
        "Классы: 6,7,8,9",
        "Условие:  а) У одного человека был подвал, освещавшийсятремя электрическими лампочками. Выключатели этих лампочекнаходились вне подвала, так что включив любой из выключателей,хозяин должен был спуститься в подвал, чтобы увидеть, какаяименно лампочка зажглась. Однажды он придумал способ, какопределить для каждого выключателя, какую именно лампочку онвключает, сходив в подвал ровно один раз. Какой это способ?б) Сколько лампочек и выключателей можно идентифицировать друг сдругом, если разрешается 2 раза спуститься в подвал?",
        "Решение: а) Лампочка может находится в трех состояниях—включенном, выключенном и в нагретом. б) 9."
    ]
}