{
    "56826": [
        "https://www.problems.ru/view_problem_details_new.php?id=56826",
        "Треугольники (прочее)",
        "Сложность: 2-",
        "Классы: 7,8"
    ],
    "56827": [
        "https://www.problems.ru/view_problem_details_new.php?id=56827",
        "Треугольники (прочее)",
        "Сложность: 2-",
        "Классы: 7,8"
    ],
    "56828": [
        "https://www.problems.ru/view_problem_details_new.php?id=56828",
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 2-",
        "Классы: 7,8",
        "Условие: На высоте AH треугольника ABC взята точка M. Докажите, что AB² – AC² = MB² – MC². ",
        "Решение: См. задачу 53602. "
    ],
    "53431": [
        "https://www.problems.ru/view_problem_details_new.php?id=53431",
        "Сумма углов треугольника. Теорема о внешнем угле.",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Углы треугольника относятся как 2 : 3 : 4. Найдите отношение внешних углов треугольника. ",
        "Решение: Так как внешний угол равен сумме двух внутренних, то внешние углы относятся как (2 + 3) : (2 + 4) : (3 + 4). ",
        "Ответ: 5 : 6 : 7. "
    ],
    "53435": [
        "https://www.problems.ru/view_problem_details_new.php?id=53435",
        "Сумма углов треугольника. Теорема о внешнем угле.",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Угол треугольника равен сумме двух других его углов. Докажите, что треугольник прямоугольный. ",
        "Подсказка: Воспользуйтесь теоремой о сумме углов треугольника. ",
        "Решение: Пусть α, β и α + β – углы треугольника. Тогда α + β + (α + β) = 180°,  откуда α + β = 90°.  "
    ],
    "53455": [
        "https://www.problems.ru/view_problem_details_new.php?id=53455",
        "Правильный (равносторонний) треугольник",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Докажите, что биссектрисы равностороннего треугольника делятся точкой пересечения в отношении 2 : 1, считая от вершины треугольника. ",
        "Подсказка: Эти биссектрисы являются и медианами. "
    ],
    "53917": [
        "https://www.problems.ru/view_problem_details_new.php?id=53917",
        "Сумма углов треугольника. Теорема о внешнем угле.",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Через точку  A , лежащую на окружности с центром O, проведены диаметр AB и хорда AC. Докажите, что угол BAC вдвое меньше угла BOC. ",
        "Решение: BOC – внешний угол равнобедренного треугольника AOC. По теореме о внешнем угле треугольника ∠BOC = ∠OAC + ∠OCA = 2∠OAC = 2∠BAC. "
    ],
    "56451": [
        "https://www.problems.ru/view_problem_details_new.php?id=56451",
        "Треугольник, образованный основаниями двух высот и вершиной",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: В остроугольном треугольнике ABC проведены высоты AA1 и BB1. Докажите, что A1C·BC = B1C·AC.  ",
        "Подсказка: См. задачу 52357 б). "
    ],
    "56508": [
        "https://www.problems.ru/view_problem_details_new.php?id=56508",
        "Треугольник, образованный основаниями двух высот и вершиной",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Пусть AA1 и BB1 – высоты треугольника ABC. Докажите, что треугольники A1B1C и ABC подобны. Чему равен коэффициент подобия? ",
        "Решение: См. задачу 52357. "
    ],
    "56859": [
        "https://www.problems.ru/view_problem_details_new.php?id=56859",
        "Правильный (равносторонний) треугольник",
        "Сложность: 2",
        "Классы: 8",
        "Условие: Окружность делит каждую из сторон треугольника на три равные части. Докажите, что этот треугольник правильный. ",
        "Решение: ПустьA иB,C иD,E иF— точки пересечения окружности со сторонамиPQ, QR, RP треугольникаPQR. Рассмотрим медиануPS. Она соединяет середины параллельных хордFA иDC и поэтому перпендикулярна им. Следовательно,PS является высотой треугольникаPQR, а значитPQ = PR. АналогичноPQ = QR. "
    ],
    "57583": [
        "https://www.problems.ru/view_problem_details_new.php?id=57583",
        "Теорема синусов",
        "Сложность: 2",
        "Классы: 9",
        "Условие: ТочкаD лежит на основанииAC равнобедренного треугольникаABC. Докажите, что радиусы описанных окружностей треугольниковABD иCBD равны. ",
        "Решение: Радиусы описанных окружностей треугольников ABD и CBD равны AB/2 sinADB и  BC/2 sinBDC. Остается заметить, что AB = BC и sinADB = sinBDC. "
    ],
    "34919": [
        "https://www.problems.ru/view_problem_details_new.php?id=34919",
        "Вписанные и описанные окружности",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Обязательно ли равны два равнобедренных треугольника, у которых равны  боковые стороны и радиусы вписанных окружностей? ",
        "Подсказка: Рассмотрите \"вытянутый по горизонтали\"  и \"вытянутый по вертикали\" треугольники. ",
        "Решение: Зафиксируем некоторую окружность радиуса r и будем рассматривать  равнобедренные треугольники, описанные около этой окружности.  Такие треугольники однозначно задаются длиной высоты,  опущенной на основание равнобедренного треугольника.  Длина этой высоты может принимать любые значение из интервала  от 2r до бесконечности, причем длина боковой стороны треугольника  непрерывно зависит от длины высоты.  Если высота, опущенная на основание треугольника,  достаточно велика, то достаточно велика и боковая сторона.  Если высота достаточно мала (т.е. она \"чуть больше\", чем 2r),  то боковая сторона также достаточно велика.  Поэтому если непрерывно изменять значение высоты от 2r до  бесконечности, то фиксированное достаточно большое значение длины  боковой стороны будет достигаться при двух разных   значениях длины высоты. ",
        "Ответ: не обязательно. "
    ],
    "35601": [
        "https://www.problems.ru/view_problem_details_new.php?id=35601",
        "Конкуррентность высот. Углы между высотами.",
        "Сложность: 2",
        "Классы: 8",
        "Условие: Дан прямоугольный треугольник.    Впишите в него прямоугольник с общим прямым углом, у которого    диагональ минимальна.         ",
        "Подсказка: Диагональ не меньше высоты, опущенной из вершины прямого угла на    гипотенузу. ",
        "Решение: Диагональ прямоугольника является наклонной, проведенной     из вершины прямого угла к    гипотенузе.    Следовательно, диагональ не меньше высоты, опущенной из вершины прямого угла на    гипотенузу, и наименьшее значение длины диагонали    достигается тогда, когда одна из диагоналей совпадает с высотой   треугольника. "
    ],
    "52625": [
        "https://www.problems.ru/view_problem_details_new.php?id=52625",
        "Вписанные и описанные окружности",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Около данного круга  опишите  равнобедренный  прямоугольный треугольник. ",
        "Подсказка: Вершина прямого угла искомого  треугольника,  центр  данной окружности  и  точки  касания  с  катетами  являются   вершинами квадрата. ",
        "Решение: Проведем  два  взаимно  перпендикулярных   радиуса   данной окружности. Получим точки касания с катетами.  Разделим  пополам большую из двух образовавшихся  дуг.  Получим  точку  касания  с гипотенузой. "
    ],
    "35695": [
        "https://www.problems.ru/view_problem_details_new.php?id=35695",
        "Теорема синусов",
        "Сложность: 2+",
        "Классы: 9",
        "Условие: В окружность вписаны две равнобедренные трапеции с соответственно параллельными сторонами. Докажите, что диагональ одной из них равна диагонали другой трапеции. ",
        "Подсказка: Примените формулу a = 2R sin α. ",
        "Решение: Пусть боковая сторона трапеции образует с меньшим основанием угол, равный α. Для обеих трапеций этот угол один и тот же, а диагональ равна произведению диаметра окружности на синус этого угла. "
    ],
    "53327": [
        "https://www.problems.ru/view_problem_details_new.php?id=53327",
        "Равные треугольники. Признаки равенства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Два отрезка AB и CD пересекаются в точке O, которая является серединой каждого из них. Докажите равенство треугольников ACD и BDC. ",
        "Подсказка: См. решение задачи 53305.  "
    ],
    "53396": [
        "https://www.problems.ru/view_problem_details_new.php?id=53396",
        "Равные треугольники. Признаки равенства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: На сторонах BC и B1C1 равных треугольников ABC и A1B1C1 взяты соответственно точки M и M1,  причём BM : MC = B1M1 : M1C1. Докажите, что AM = A1M1. ",
        "Подсказка: Докажите равенство треугольников ABM и A1B1M1. ",
        "Решение: Из равенства треугольников ABC и A1B1C1 следует, что ∠B = ∠B1 и AB = A1B1. Отрезки BM и B1M1 составляют одну и ту же часть соответственно от отрезков BC и B1C1, поэтому они равны. Значит, треугольники ABM и  A1B1M1 равны по двум сторонам и углу между ними. Следовательно, AM = A1M1. "
    ],
    "53417": [
        "https://www.problems.ru/view_problem_details_new.php?id=53417",
        "Равные треугольники. Признаки равенства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Отрезки AB и CD пересекаются в точке O и делятся этой точкой пополам. Докажите, что AC || BD и AD || BC. ",
        "Подсказка: Докажите, что ∠OAC = ∠OBD.  ",
        "Решение: Треугольники AOC и BOD равны по двум сторонам и углу между ними (AO = BO и CO = DO по условию, а углы AOC и BOD равны как вертикальные), поэтому ∠OAC = ∠OBD. Прямая AB пересекает прямые AC и BD, причём накрест лежащие углы OAC и OBD равны. Следовательно, прямые AC и BD параллельны. Аналогично, AD || BC.  "
    ],
    "53444": [
        "https://www.problems.ru/view_problem_details_new.php?id=53444",
        "Сумма углов треугольника. Теорема о внешнем угле.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: BK – биссектриса треугольника ABC. Известно, что ∠AKB : ∠CKB = 4 : 5. Найдите разность углов A и C треугольника ABC. ",
        "Подсказка: Найдите углы AKB и CKB и воспользуйтесь теоремой о внешнем угле треугольника. ",
        "Решение:   Поскольку ∠AKB + ∠CKB = 180°, то ∠AKB = 80°, ∠CKB = 100°.    Пусть ∠ABK = ∠CBK = β. По теореме о внешнем угле треугольника 80° = ∠C + β, 100° = ∠A + β, ∠A – ∠C = 20°.  ",
        "Ответ: 20°. "
    ],
    "53730": [
        "https://www.problems.ru/view_problem_details_new.php?id=53730",
        "Вневписанные окружности",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что прямая, проходящая через центры вневписанных окружностей треугольника ABC, касающихся сторон AB и AC, перпендикулярна прямой, проходящей через центр вписанной окружности и вершину A. ",
        "Решение: Пусть O1 и O2 – центры вневписанных окружностей треугольника ABC, касающихся сторон AB и AC. Точки O1 и O2 лежат на биссектрисе внешнего угла A, которая перпендикулярна биссектрисе угла A, проходящей через центр вписанной окружности. "
    ],
    "53737": [
        "https://www.problems.ru/view_problem_details_new.php?id=53737",
        "Признаки подобия",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Каждая из двух сторон треугольника разделена на семь равных частей; соответствующие точки деления соединены отрезками.  Найдите эти отрезки, если третья сторона треугольника равна 28.",
        "Подсказка: См. задачу 53736. ",
        "Ответ: 4, 8, 12, 16, 20, 24. "
    ],
    "53908": [
        "https://www.problems.ru/view_problem_details_new.php?id=53908",
        "Признаки и свойства равнобедренного треугольника.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что равные хорды удалены от центра окружности на равные расстояния.  ",
        "Подсказка: Опустите перпендикуляры из центра окружности на данные хорды. ",
        "Решение:   Пусть AB и A1B1 – равные хорды окружности с центром O, не являющиеся диаметрами. Расстояния от центра окружности до этих хорд равны перпендикулярам OM и OM1, опущенным на хорды из центра окружности. Поскольку M и M1 – середины хорд, то AM = ½ AB = ½ A1B1 = A1M1.    Значит, прямоугольные треугольники AMO и A1M1O равны по катету и гипотенузе (радиус окружности). Следовательно, OM = OM1.    Если AB и A1B1 – диаметры, то утверждение очевидно. "
    ],
    "54189": [
        "https://www.problems.ru/view_problem_details_new.php?id=54189",
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Найдите диагональ прямоугольника со сторонами 5 и 12. ",
        "Ответ: 13."
    ],
    "54193": [
        "https://www.problems.ru/view_problem_details_new.php?id=54193",
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Найдите расстояние от центра окружности радиуса 10 до хорды, равной 12.  ",
        "Ответ: 8. "
    ],
    "54304": [
        "https://www.problems.ru/view_problem_details_new.php?id=54304",
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Один из катетов прямоугольного треугольника на 10 больше другого и на 10 меньше гипотенузы. Найдите гипотенузу этого треугольника. ",
        "Решение: Пусть первый катет равен x. Тогда второй катет равен x – 10, а гипотенуза равна x + 10. По теореме Пифагора (x + 10)² = x² + (x – 10)², откуда x = 40. Следовательно, x + 10 = 50. ",
        "Ответ: 50. "
    ],
    "54656": [
        "https://www.problems.ru/view_problem_details_new.php?id=54656",
        "Отношения линейных элементов подобных треугольников",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что отношение периметров подобных треугольников равно коэффициенту подобия. ",
        "Решение: Пусть треугольник A1B1C1 подобен треугольнику ABC с коэффициентом k. Тогда A1B1 = kAB, A1C1 = kA, B1C1 = kBC, поэтому  A1B1 + A1C1 + B1C1 = kAB + kAC + kBC = k(AB + AC + BC).  "
    ],
    "56457": [
        "https://www.problems.ru/view_problem_details_new.php?id=56457",
        "Средняя линия треугольника",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что середины сторон произвольного четырёхугольника – вершины параллелограмма.  Для каких четырёхугольников этот параллелограмм является  прямоугольником, для каких – ромбом, для каких – квадратом? ",
        "Решение:   Пусть K, L, M и N – середины сторон AB, BC, CD и DA соответственно четырёхугольника ABCD. Тогда KL = MN = AC/2 и отрезок KL параллелен MN, то есть KLMN – параллелограмм.    Теперь ясно, что KLMN – прямоугольник, если диагонали AC и BD перпендикулярны; ромб, если AC = BD; квадрат, если диагонали AC и BD равны по длине и перпендикулярны. "
    ],
    "56510": [
        "https://www.problems.ru/view_problem_details_new.php?id=56510",
        "Треугольник, образованный основаниями двух высот и вершиной",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: В треугольнике ABC проведены высоты BB1 и CC1. Докажите, что   а) касательная в точке A к описанной окружности параллельна прямой B1C1;    б) B1C1 ⊥ OA, где O – центр описанной окружности. ",
        "Решение: а) Пусть l – касательная в точке A к описанной окружности.  Тогда ∠(l, AB) = ∠(AC, CB) = ∠(C1B1, AC1), а значит, l || B1C1.  "
    ],
    "61195": [
        "https://www.problems.ru/view_problem_details_new.php?id=61195",
        "Свойства медиан. Центр тяжести треугольника.",
        "Сложность: 2+",
        "Классы: 10,11",
        "Условие: Докажите, что точка m = 1/3 (a1 + a2 + a3) является точкой пересечения медиан треугольника a1a2a3. "
    ],
    "76424": [
        "https://www.problems.ru/view_problem_details_new.php?id=76424",
        "Отношения линейных элементов подобных треугольников",
        "Сложность: 2+",
        "Классы: 9",
        "Условие: В треугольнике ABC из произвольной точки D на стороне AB проведены две прямые, параллельные сторонам AC и BC, пересекающие BC и AC соответственно в точках F и G. Доказать, что сумма длин описанных окружностей треугольников ADG и BDF равна длине описанной окружности треугольника ABC.  ",
        "Решение: Радиусы (а значит, и длины) описанных окружностей подобных треугольников ADG, DBF и ABC пропорциональны соответственным сторонам, поэтому все следует из равенства AD + DB = AB. "
    ],
    "86488": [
        "https://www.problems.ru/view_problem_details_new.php?id=86488",
        "Признаки и свойства равнобедренного треугольника.",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Через вершины А и С треугольника АВС проведены прямые, перпендикулярные биссектрисе угла АВС. Они пересекают прямые СВ и ВА в точках К и М соответственно. Найдите длину АВ, если ВМ = 8 см, KC = 1 см и АВ > ВС. ",
        "Решение: См. задачу 53662. ",
        "Ответ: 9 см. "
    ]
}