{
    "56451": [
        "Треугольник, образованный основаниями двух высот и вершиной",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: В остроугольном треугольнике ABC проведены высоты AA1 и BB1. Докажите, что A1C·BC = B1C·AC.",
        "Подсказка: См. задачу 52357 б)."
    ],
    "53562": [
        "Вписанные и описанные окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Стороны треугольника ABC касаются вписанной окружности в точках K, P и M, причём точка M расположена на стороне BC. Найдите угол KMP, если ∠A = 2α.",
        "Решение: ∠KMP = ∠AKP = ∠APK = 90° – α.",
        "Ответ: 90° – α."
    ],
    "76421": [
        "Вписанная, описанная и вневписанная окружности; их радиусы",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Доказать: если стороны треугольника образуют арифметическую прогрессию, то радиус вписанного круга равен",
        "Решение: Пусть"
    ],
    "56508": [
        "Треугольник, образованный основаниями двух высот и вершиной",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Пусть AA1 и BB1 – высоты треугольника ABC. Докажите, что треугольники A1B1C и ABC подобны. Чему равен коэффициент подобия?",
        "Решение: См. задачу 52357."
    ],
    "35607": [
        "Теорема синусов",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: Существует ли невырожденный треугольник АВС, для углов которого     выполняется равенство: sinA + sinB = sinC?",
        "Подсказка: Попробуйте умножить каждую часть равенства на выражение 2*R,     где R  радиус окружности, описанной около треугольника АВС.",
        "Решение: Нет. Предположим, что такой треугольник существует. Тогда, умножив каждую часть равенства на выражение      2*R, где R  радиус окружности, описанной около треугольника      АВС, получим равенство ВС + АС = АВ, которое противоречит      неравенству треугольника.",
        "Ответ: не существует."
    ],
    "52956": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Найдите сторону квадрата, вписанного в окружность, если известно, что хорда этой окружности, равная 2, удалена от её центра на расстояние, равное 3.",
        "Ответ: 2."
    ],
    "53331": [
        "Равные треугольники. Признаки равенства",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Равные отрезки AB и CD пересекаются в точке O, причём  AO = OD. Докажите равенство треугольников ABC и DCB.",
        "Решение: Поскольку AB = CD и AO = OD, то OC = OB. Поэтому треугольники AOC и DOB равны. Следовательно, AC = BD. Значит, треугольники ABC и DCB равны по трём сторонам."
    ],
    "53333": [
        "Равные треугольники. Признаки равенства",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите равенство треугольников по стороне, медиане, проведённой к этой стороне, и углам, которые образует медиана с этой стороной.",
        "Решение: Пусть BM и B1M1 – медианы треугольников ABC и A1B1C1, BM = B1M1, AC = A1C1, ∠BMC = ∠B1M1C1.     Поскольку MC = M1C1, то треугольники BMC и B1M1C1 равны по двум сторонам и углу между ними. Следовательно,   ∠ACB = ∠A1C1B1, BC = B1C1.     Поэтому треугольники ABC и A1B1C1 равны по двум сторонам и  углу между ними: BC = B1C1, AC = A1C1 и ∠C = ∠C1."
    ],
    "56859": [
        "Правильный (равносторонний) треугольник",
        "Сложность: 2",
        "Классы: 8",
        "Условие: Окружность делит каждую из сторон треугольника на три равные части. Докажите, что этот треугольник правильный.",
        "Решение: Пусть"
    ],
    "53743": [
        "Признаки подобия",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Основания трапеции равны 1,8 и 1,2; боковые стороны, равные 1,5 и 1,2, продолжены до взаимного пересечения.   Найдите, насколько продолжены боковые стороны.",
        "Подсказка: Найдите коэффициент подобия образовавшихся треугольников.",
        "Решение: Пусть AD и BC основания данной трапеции ABCD,   AD = 1,8, BC = 1,2, AB = 1,5, CD = 1,2.     Если M – точка пересечения продолжений боковых сторон AB и DC, то треугольники MBC и MAD подобны с коэффициентом 2/3 (BC : AD = 2 : 3). Поэтому MB = 2/3 MA. Следовательно, MB = 2AB = 3. Аналогично находим, что MC = 2,4.",
        "Ответ: 3 и 2,4."
    ],
    "54243": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Из одной точки проведены к данной прямой перпендикуляр и две наклонные.   Найдите длину перпендикуляра, если наклонные равны 41 и 50, а их проекции на данную прямую относятся как 3 : 10.",
        "Подсказка: Выразите искомый перпендикуляр по теореме Пифагора из двух прямоугольных треугольников и решите получившееся уравнение.",
        "Решение: Пусть AB = 50 и AC = 41 – наклонные, AD – перпендикуляр, BD = 10x, CD = 3x. Тогда 50² – (10x)² = AD²  = 41² – 9x²,   или 91x² = 91·9, откуда x = 3,  BD = 30, AD² = 50² – 30² = 40².",
        "Ответ: 40."
    ],
    "54249": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что в прямоугольной трапеции разность квадратов диагоналей равна разности квадратов оснований.",
        "Подсказка: Меньшая боковая сторона трапеции – общий катет двух прямоугольных треугольников.",
        "Решение: Первый способ. Пусть BC – меньшее основание трапеции, AB – меньшая боковая сторона, AD – большее основание. По теореме Пифагора  AC² – BC² = AB² = BD² – AD², то есть BD² – AC² = AD² – BC²."
    ],
    "54258": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В прямоугольном треугольнике медианы, проведённые из вершин острых углов, равны  и . Найдите гипотенузу треугольника.",
        "Решение: Обозначим катеты через x и y. Тогда по теореме Пифагора x² + y²/4 = 52, y² + x²/4 = 73.     Сложив эти уравнения, получим 5/4 (x² + y²) = 125 ⇒ x² + y² = 100.",
        "Ответ: 10."
    ],
    "57582": [
        "Теорема синусов",
        "Сложность: 2",
        "Классы: 9",
        "Условие: Докажите, что площадь",
        "Решение: По теореме синусов"
    ],
    "60629": [
        "Целочисленные треугольники",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: В прямоугольном треугольнике длины сторон – натуральные взаимно простые числа.   Докажите, что длина гипотенузы – нечётное число, а длины катетов имеют разную чётность.",
        "Подсказка: Если a и b – нечётные числа, то равенство   a² + b² = c² невозможно, поскольку c² не может давать остаток 2 при делении на 4."
    ],
    "78469": [
        "Вспомогательные равные треугольники",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Из вершины B произвольного треугольника ABC проведены вне треугольника прямые BM и BN, так что ∠ABM = ∠CBN. Точки A' и C' симметричны точкам A и C относительно прямых BM и BN (соответственно). Доказать, что AC' = A'C.",
        "Решение: Треугольники ABC' и A'BC равны, поскольку AB = A'B, BC' = BC и ∠ABC' – ∠A'BC = ∠CBC' – ∠A'BA = 2∠CBN – 2∠ABM = 0."
    ],
    "78614": [
        "Правильный (равносторонний) треугольник",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В треугольнике",
        "Решение: Треугольники"
    ],
    "115924": [
        "Треугольник, образованный основаниями двух высот и вершиной",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Сторона треугольника равна  ,  углы, прилежащие к ней, равны 75° и 60°.   Найдите отрезок, соединяющий основания высот, проведённых из вершин этих углов.",
        "Решение: Пусть BM и CN – высоты треугольника ABC,   BC =  ,  ∠B = 75°, ∠C = 60°. Тогда ∠A = 45°.     Треугольник AMN подобен треугольнику ABC с коэффициентом подобия cos 45°. Следовательно, MN = BC·cos 45° = 1.",
        "Ответ: 1."
    ],
    "116336": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Найдите радиусы вписанной и вневписанных окружностей треугольника со сторонами 5, 12 и 13.",
        "Подсказка: Если",
        "Решение: Первый способ.Пусть окружность с центром O и радиусом r   вписана в прямоугольный треугольник ABC, в котором BC = a, AC = b – катеты,   а AB = c  –  гипотенуза. Если окружность касается отрезков BC, AC и AB   соответственно в точках K, L и M, то OKCL  –    квадрат со стороной r, поэтому BM = BK = BC – CK = a – r,   AM =AL =AC – CL = b – r, а т.к. AM + BM = AB, то   a – r + b – r = c. Отсюда находим, что",
        "Ответ: 2, 15, 3, 10."
    ],
    "57583": [
        "Теорема синусов",
        "Сложность: 2",
        "Классы: 9",
        "Условие: Точка",
        "Решение: Радиусы описанных окружностей треугольников"
    ],
    "116366": [
        "Радиусы вписанной, описанной и вневписанной окружности (прочее)",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: В треугольнике",
        "Решение: Докажем сначала следующее утверждение. Если в треугольник XYZ вписана окружность,   а x – расстояние от вершины X до касания окружности со стороной XY   и YZ = a, то x = p – a, где p – полупериметр треугольника.",
        "Ответ: 7."
    ],
    "35437": [
        "Равные треугольники. Признаки равенства (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Верно ли, что два треугольника ABC и A'B'C' равны, если AB =A'B', BC = B'C', и ∠A = ∠A'?",
        "Подсказка: См. задачу 53350.",
        "Ответ: Неверно."
    ],
    "35550": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Через фиксированную точку внутри окружности проводятся всевозможные пары взаимно перпендикулярных хорд.   Докажите, что сумма квадратов их длин – величина постоянная.",
        "Решение: Пусть R – радиус окружности, O – её центр, A – фиксированная точка, r = OA; две хорды перпендикулярны и проходят через A, x – расстояние от O до первой хорды, а y – до второй. Тогда x и y – проекции отрезка OA на две перпендикулярные прямые, содержащие данные хорды, значит, x² + y² = OA² = r². Далее, квадрат длины хорды, находящейся на расстоянии x от центра O, равен 4(R² – x²), квадрат длины второй хорды равен 4(R² – y²). Следовательно, сумма квадратов длин хорд равна 4(R² – x²) + 4(R² – y²) = 8R² – 4r²."
    ],
    "35634": [
        "Вписанные и описанные окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: От треугольника отрезали три треугольника, причём каждый из трёх разрезов коснулся вписанной в треугольник окружности. Известно, что периметры отрезанных треугольников равны P1, P2, P3. Найдите периметр исходного треугольника.",
        "Решение: Покрасим одним цветом отрезки касательных, проведённых к окружности из одной точки – всего получилось шесть пар равных отрезков касательных. В описанном шестиугольнике, образовавшемся после отрезания треугольников, три стороны, по которым сделаны разрезы, составлены из шести отрезков разных цветов. Оставшиеся три стороны также составлены из шести отрезков разных цветов. Следовательно, сумма длин трёх разрезов равна сумме трёх участков периметра исходного треугольника, не принадлежащих отрезанным треугольникам. Отсюда нетрудно увидеть, что периметр исходного треугольника равен сумме периметров отрезаемых треугольников.",
        "Ответ: P1 + P2 + P3."
    ],
    "57584": [
        "Теорема синусов",
        "Сложность: 2",
        "Классы: 9",
        "Условие: Выразите площадь треугольника",
        "Решение: По теореме синусов"
    ],
    "52439": [
        "Прямоугольный треугольник с углом в $30^\\circ$",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Гипотенуза AB прямоугольного треугольника ABC равна 2 и является хордой некоторой окружности. Катет AC равен 1 и лежит внутри окружности, а его продолжение пересекает окружность в точке D, причём CD = 3. Найдите радиус окружности.",
        "Решение: Катет AC равен половине гипотенузы AB, поэтому ∠A = 60°. Кроме того, AD = 2AB, поэтому угол ABD – прямой. Следовательно, AD – диаметр окружности.",
        "Ответ: 2."
    ],
    "52534": [
        "Равные треугольники. Признаки равенства (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что середины всех хорд данной длины, проведённых в данной окружности, лежат на некоторой окружности.",
        "Решение: Рассмотрим две отличные от диаметра равные хорды AB и A1B1 окружности с центром O. Пусть M и M1 – их середины. Треугольники AOB и A1OB1 равны по трём сторонам. Значит равны и их медианы OM и OM1."
    ],
    "52760": [
        "Средние пропорциональные в прямоугольном треугольнике",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В окружности радиуса R проведена хорда, равная R/2. Через один конец хорды проведена касательная к окружности, а   через другой – секущая, параллельная касательной. Найдите расстояние между касательной и секущей.",
        "Подсказка: Проведите диаметр через точку касания.",
        "Решение: Пусть AB – данная хорда, BC – отрезок данной секущей внутри окружности, M – точка пересечения AD и BC. Проведём диаметр AD через точку касания A. Тогда BC ⊥ AD и CM = MB. Из прямоугольного треугольника ABD находим, что AM·AD = AB², AM = AB²/AD = R/8.",
        "Ответ: R/8."
    ],
    "52827": [
        "Теорема синусов",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В параллелограмме",
        "Решение: Предположим, что точка",
        "Ответ: 2r² sin²α sin 2α."
    ],
    "52870": [
        "Отношение, в котором биссектриса делит сторону",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Хорды AB, AC и BC окружности равны соответственно 15, 21 и 24. Точка D – середина дуги CB. На какие части BE и EC делится хорда BC прямой AD?",
        "Решение: Поскольку точка D – середина дуги BC, прямая AD AE – биссектриса угла A треугольника BAC. Следовательно, BE : EC = AB : AC. Отсюда BE = 5/12·24 = 10, CE = 24 – 10 = 14.",
        "Ответ: 10 и 14."
    ],
    "53062": [
        "Конкуррентность высот. Углы между высотами.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Пусть AB – диаметр окружности, C – некоторая точка плоскости. Прямые AC и BC пересекают окружность в точках M и N соответственно. Прямые MB и NA пересекаютcя в точке K. Найдите угол между прямыми CK и AB.",
        "Решение: Заметим, что AN и BM – высоты треугольника ABC. Поскольку высоты треугольника пересекаются в одной точке, прямые CK и AB перпендикулярны.",
        "Ответ: 90°."
    ],
    "53209": [
        "Теорема косинусов",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В треугольнике ABC проведены медианы AM и BP. Известно, что ∠APB = ∠BMA, cos∠ACB = 0,8, BP = 1. Найдите площадь треугольника ABC .",
        "Решение: Точки A, B, M и P лежат на одной окружности, поэтому CM·CB = CP·CA, или 2CM² = 2CP². Следовательно, CM = CP, CA = CB, то есть треугольник ABC равнобедренный.     Пусть MC = x. По теореме косинусов 1 =   BP² = x² + 4x² – 2x·2x·&frac45;, то есть x² = 5/9. Значит, SABC = ½ AC·BC sin∠C = ½ (2x)²·&frac35; = 6/5 x² = &frac23;.",
        "Ответ: &frac23;."
    ],
    "53321": [
        "Признаки и свойства равнобедренного треугольника.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Даны два равнобедренных треугольника с общим основанием. Докажите, что их медианы, проведённые к основанию, лежат на одной прямой.",
        "Подсказка: В равнобедренном треугольнике медиана, проведённая к основанию, является высотой.",
        "Решение: Пусть AB – общее основание равнобедренных треугольников ABC  и ABC1, CM и C1M – медианы. Поскольку медиана равнобедренного треугольника, проведённая к основанию, является высотой, то CM и C1M – перпендикуляры к AB. Следовательно, точки C, C1 и M лежат на одной прямой (через данную точку можно провести только одну прямую, перпендикулярную данной)."
    ],
    "53326": [
        "Равные треугольники. Признаки равенства",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Точки A, B, C, D лежат на одной прямой. Докажите, что если треугольники ABE1 и ABE2 равны, то треугольники CDE1 и CDE2 тоже равны.",
        "Решение: Рассмотрим случай, когда точки E1 и E2 лежат по разные стороны от данной прямой.     Пусть A, B, C, D – последовательные точки на данной прямой.  Тогда треугольники AE1C и AE2C равны по двум сторонам (AE1 = AE2, AC – общая) и углу между ними   (∠E1AC = ∠E2AC). Поэтому CE1 = CE2.     Аналогично докажем, что DE1 = DE2. Следовательно, треугольники CDE1 и CDE2 равны по трём сторонам."
    ],
    "57633": [
        "Взаимоотношения между сторонами и углами треугольников (прочее)",
        "Сложность: 2",
        "Классы: 9",
        "Условие: Даны две пересекающиеся окружности радиуса",
        "Решение: Пусть"
    ],
    "53330": [
        "Равные треугольники. Признаки равенства",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Треугольники ABC и BAD равны, причём точки C и D лежат по разные стороны от прямой AB. Докажите, что:     а) треугольники CBD и DAC равны;     б) прямая CD делит отрезок AB пополам.",
        "Решение: Из равенства треугольников ABC и BAD следует, что AC = BD и AD = BC. Следовательно, треугольники CBD и DAC равны по трём сторонам.     Из равенства треугольников ABC и BAD следует также, что  ∠DAB = ∠CBA, а из равенства треугольников CBD и DAC – равенство углов DCB и CDA. Поэтому треугольники CMB и DMA равны (M – точка пересечения отрезков CD и AB). Следовательно, AM = MB."
    ],
    "53337": [
        "Равные треугольники. Признаки равенства",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите равенство треугольников по углу, биссектрисе и стороне, исходящим из вершины этого угла.",
        "Решение: Пусть AD и A1D1 – биссектрисы треугольников ABC и A1B1C1, ∠BAC = ∠B1A1C1, AD = A1D1, AB = A1B1.     Поскольку ∠BAD = ∠B1A1D1 (как половины равных углов), то  треугольники ABD и A1B1D1 равны по двум сторонам и углу между ними. Следовательно, ∠ADB = ∠A1D1B1.     Отсюда следует равенство углов ADC и A1D1C1. Поэтому треугольники ADC и   A1D1C1 равны по стороне и двум прилежащим к ней углам.     Значит, AC = A1C1 и треугольники ABC и A1B1C1 равны по двум сторонам (AB = A1B1 и AC = A1C1) и углу между ними (∠BAC = ∠B1A1C1)."
    ],
    "53380": [
        "Сумма углов треугольника. Теорема о внешнем угле.",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Найдите  сумму   углов   при   вершинах   самопересекающейся пятиконечной звезды.",
        "Подсказка: Примените теорему о внешнем угле треугольника.",
        "Решение: Обозначим вершины звезды последовательно: A1, A2, A3, A4, A5. Пусть M – точка пересечения отрезков A1A4 и A2A5, а N –  отрезков A1A3 и A2A5. Тогда угол A1MN – внешний  угол  треугольника MA2A4, а угол A1NM –  треугольника NA3A5. Поэтому ∠A1MN = ∠A2 + ∠A4, ∠A1NM = ∠A3 + ∠A5. Следовательно,   ∠A1 + ∠A2 + ∠A3 + ∠A4 + ∠A5 = ∠A1 + ∠A1MN + ∠A1NM = 180°.",
        "Ответ: 180°."
    ],
    "53413": [
        "Свойства биссектрис, конкуррентность",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Биссектрисы BB1 и CC1 треугольника ABC пересекаются в точке M, биссектрисы B1B2 и C1C2 треугольника   AB1C1 пересекаются в точке N.   Докажите, что точки A, M и N лежат на одной прямой.",
        "Решение: Поскольку биссектрисы треугольника пересекаются в одной точке, точки M и N лежат на биссектрисе угла A."
    ],
    "53472": [
        "Средняя линия треугольника",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Середины E и F параллельных сторон BC и AD параллелограмма ABCD соединены с вершинами D и B соответственно.   Докажите, что прямые BF и ED делят диагональ AC на три равные части.",
        "Решение: Так как BE = EC и BE || FD, то BEFD – параллелограмм. Пусть прямые BF и ED пересекают диагональ AC в точках N и M соответственно. Поскольку  BE = EC и BF || ED, то EM – средняя линия треугольника BCN, то есть NM = MC. Аналогично, NM = AN."
    ],
    "53547": [
        "Периметр треугольника",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Параллелограмм с периметром, равным 44, разделен диагоналями на четыре треугольника. Разность между периметрами двух смежных треугольников  равна 6. Найдите стороны параллелограмма.",
        "Подсказка: Разность между периметрами двух смежных треугольников равна разности двух соседних сторон параллелограмма.",
        "Решение: Обозначим соседние стороны параллелограмма через a и b  (a < b). Поскольку диагонали параллелограмма делятся точкой  пересечения пополам, то разность между периметрами двух смежных треугольников равна b – a. Из системы a + b = 22,  b – a = 6 находим b = 14, b = 8.",
        "Ответ: 14 и 8."
    ],
    "53603": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что диагонали четырёхугольника перпендикулярны тогда и только тогда, когда суммы квадратов его противоположных сторон равны.",
        "Подсказка: См. задачу 53602."
    ],
    "53605": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Рассмотрим два различных четырёхугольника с соответственно равными сторонами.   Докажите, что если у одного из них диагонали перпендикулярны, то и у другого тоже.",
        "Решение: См. задачу 53603."
    ],
    "53633": [
        "Теорема косинусов",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Найдите радиус наименьшего круга, в котором можно разместить треугольник со сторонами 7, 9 и 12.",
        "Подсказка: Данный треугольник тупоугольный.",
        "Решение: 7² + 9² < 127², поэтому данный треугольник тупоугольный. Следовательно, круг, построенный на его большей стороне как на диаметре, содержит этот треугольник.",
        "Ответ: 6."
    ],
    "57651": [
        "Взаимоотношения между сторонами и углами треугольников (прочее)",
        "Сложность: 2",
        "Классы: 9",
        "Условие: Найдите все треугольники, у которых углы образуют арифметическую прогрессию, а стороны: а)арифметическую прогрессию; б)геометрическую прогрессию.",
        "Решение: Если углы треугольника образуют арифметическую прогрессию, то они равны"
    ],
    "53662": [
        "Признаки и свойства равнобедренного треугольника.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Через вершины A и C треугольника ABC проведены прямые, перпендикулярные биссектрисе угла ABC и пересекающие прямые CB и BA в точках K и M соответственно. Найдите AB, если BM = 8, KC = 1.",
        "Решение: Пусть точка K расположена на стороне BC треугольника ABC. Треугольники ABK и MBC – равнобедренные (биссектриса, проведённая из вершины B, является высотой), поэтому AB = BK = BC – CK = 8 – 1 = 7.     Если точка K расположена на продолжении отрезка BC за точку  C, то аналогично находим, что AB = 9.",
        "Ответ: 7 или 9."
    ],
    "53695": [
        "Вписанные и описанные окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Два угла треугольника равны 40° и 80°. Найдите углы треугольника с вершинами в точках касания вписанной окружности со сторонами данного треугольника.",
        "Решение: Пусть углы A и B треугольника ABC равны соответственно 40° и 80°. Тогда ∠C = 60°.     Обозначим через A1, B1 и C1 точки касания вписанной окружности треугольника ABC со сторонами BC, AC и AB соответственно. Тогда   ∠AC1B1 = ½ (180° – 40°) = 70°, а ∠BC1A1 = ½ (180° – 40°) = 50°.     Следовательно, ∠A1C1B1 = 180° – 70° – 50° = 60°. Остальное аналогично.",
        "Ответ: 50°, 60°, 70°."
    ],
    "53707": [
        "Теорема синусов",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Остроугольный равнобедренный треугольник и трапеция вписаны в окружность. Одно основание трапеции является диаметром окружности, а боковые стороны параллельны боковым сторонам треугольника. Найдите отношение площадей трапеции и треугольника.",
        "Подсказка: Выразите площади трапеции и треугольника через радиус окружности и угол при основании равнобедренного треугольника.",
        "Решение: Пусть α – угол при основании BC равнобедренного треугольника ABC, R – радиус данной окружности, диаметр KL – большее основание равнобедренной трапеции KLMN, вписанной в окружность. Поскольку боковые стороны треугольника параллельны боковым сторонам трапеции, то углы при основании трапеции также равны α, то есть ∠NKL = ∠MLK = ∠MLP = ∠C = α.",
        "Ответ: 1 : 1."
    ],
    "53738": [
        "Признаки подобия",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Боковая сторона AB трапеции ABCD разделена на пять равных частей, и через третью точку деления, считая от точки B, проведена прямая, параллельная основаниям BC и AD. Найдите отрезок этой прямой, заключённый между сторонами трапеции, если BC = a и AD = b.",
        "Подсказка: Проведите диагональ трапеции.",
        "Решение: Пусть M – данная точка на AB (BM : AM = 3 : 2), MN – искомый отрезок. Тогда по теореме Фалеса CN : DN = BM : AM = 3 : 2.",
        "Ответ: 1/5 (2a + 3b)."
    ],
    "53744": [
        "Подобные треугольники",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В треугольнике ABC, стороны которого a, b и c даны,   проведена параллельно AC прямая MN так, что AM = BN. Найдите MN.",
        "Подсказка: Рассмотрите подобные треугольники.",
        "Решение: Обозначим AM = BN = x и найдём x, используя подобие треугольников BMN и BAC: c–x/c = x/a ⇒   x = ac/a+c.      Из того же подобия находим, что MN = xb/a = bc/a+c.",
        "Ответ: bc/a+c."
    ],
    "53756": [
        "Вспомогательные подобные треугольники",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В треугольник с основанием a и высотой h вписан квадрат так, что две его вершины лежат на основании треугольника, а две другие – на боковых сторонах.   Найдите сторону квадрата.",
        "Подсказка: См. решение задачи 111528.",
        "Ответ: ah/a+h."
    ],
    "53758": [
        "Отношения линейных элементов подобных треугольников",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В треугольник, у которого основание равно 30, а высота – 10, вписан прямоугольный равнобедренный треугольник так, что его гипотенуза параллельна основанию данного треугольника, а вершина прямого угла лежит на этом основании. Найдите гипотенузу.",
        "Подсказка: Используйте равенство отношений соответствующих высот к основаниям в подобных  треугольниках.",
        "Решение: Пусть вершины M и N гипотенузы находятся на сторонах соответственно AC и BC треугольника ABC, а вершина прямого угла K – на основании AB. Обозначим через x высоту треугольника MNK, проведённую из вершины K. Тогда MN = 2x.     Высоты подобных треугольников MCN и ACB, проведённые из  вершины C, относятся как основания MN и AB, то есть   10–x/10 = 2x/30. Следовательно, x = 6, MN = 2x = 12.",
        "Ответ: 12."
    ],
    "53761": [
        "Признаки подобия",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В параллелограмме ABCD сторона AB = 420. На стороне BC взята точка E так, что BE : EC = 5: 7, и проведена прямая DE, пересекающая продолжение AB в точке F. Найдите BF.",
        "Решение: Из подобия треугольников BFE и CDE следует, что BF : DC = BE : EC, то есть BF = 420·5/7 = 300.",
        "Ответ: 300."
    ],
    "53762": [
        "Признаки подобия",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: ABCD – данный параллелограмм. Через точку пересечения его  диагоналей проведена перпендикулярная к BC прямая, которая пересекает BC в точке E, а продолжение AB – в точке F.   Найдите BE, если AB = a, BC = b и BF = c.",
        "Подсказка: Если K – точка пересечения прямых EF и AD, то треугольники FBE и FAK подобны.",
        "Решение: Пусть O – точка пересечения диагоналей, K – точка пересечения прямых EO и AD, x – искомый отрезок. Отрезки KD и BE симметричны относительно точки O, поэтому KD = BE = x, а AK = AD – KD = b – x.     Из подобия треугольников FBE и FAK следует, что   BE : AK = BF : AF, или   Отсюда x = bc/a+2c.",
        "Ответ: bc/a+2c."
    ],
    "64792": [
        "Прямоугольный треугольник с углом в $30^\\circ$",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: В равнобедренном треугольнике АВС угол В равен 30°, АВ = ВС = 6. Проведены высота CD треугольника АВС и высота DE треугольника BDC.   Найдите ВЕ.",
        "Решение: DC = ½ BC = 3 (см. рис.). Кроме того, ∠DCB = 90° – ∠DBC = 60°, следовательно, CЕ = ½ DC = 1,5. Таким образом, ВЕ = ВС – СЕ = 4,5.",
        "Ответ: 4,5."
    ],
    "53763": [
        "Свойства медиан. Центр тяжести треугольника.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Дан треугольник ABC. На продолжении стороны AC за точку C  взята точка N, причём CN = AC; точка K – середина стороны AB.   В каком отношении прямая KN делит сторону BC?",
        "Решение: Пусть M – точка пересечения прямых KN и BC. В треугольнике ABN отрезки BC и NK – медианы. Поэтому BM : MC = 2 : 1.",
        "Ответ: 2 : 1, считая от точки B."
    ],
    "53769": [
        "Средняя линия треугольника",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: AA1 – медиана треугольника ABC. Точка C1 лежит на стороне AB, причём AC1 : C1B = 1 : 2. Отрезки AA1 и CC1 пересекаются в  точке M.   Найдите отношения AM : MA1 и CM : MC1.",
        "Решение: Первый способ. Через точку A1 проведём прямую, параллельную CC1 до пересечения с AB в точке K. A1K – средняя линия треугольника CBC1, поэтому CC1 = A1K, BK = KC1 = AC1.     Следовательно, MC1 – средняя линия треугольника A1AK1, значит,   MC1 = ½ A1K = ¼ CC1, а AM = MA1.",
        "Ответ: 1 : 1; 3 : 1."
    ],
    "53901": [
        "Сумма углов треугольника. Теорема о внешнем угле.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Продолжения двух противоположных сторон AB и CD четырёхугольника ABCD пересекаются под углом α, продолжения двух других противоположных сторон пересекаются под тем же углом. Докажите, что два угла в четырёхугольнике равны, и найдите разность двух других его углов.",
        "Подсказка: Воспользуйтесь теоремой о внешнем угле треугольника.",
        "Решение: Пусть прямые AB и CD пересекаются в точке M, а прямые AD и BC – в точке N, как показано на рисунке. Тогда внешние углы BAD и BCD треугольников ANB и CMB равны, та как два угла каждого из этих треугольников соответственно равны двум углам другого. Кроме того,  ABC = ∠BCM + α = (∠ADC + ∠DNC) + α = ∠ADC + α + α = ∠ADC + 2α.",
        "Ответ: 2α."
    ],
    "54042": [
        "Медиана, проведенная к гипотенузе",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Основание H высоты CH прямоугольного треугольника ABC  соединили с серединами M и N катетов AC и BC.   Докажите, что периметр четырёхугольника CMHN равен сумме катетов треугольника ABC.",
        "Решение: Медиана HM прямоугольного треугольника ACH равна половине  его гипотенузы AC, то есть HM = ½ AC. Аналогично HN = ½ BC. Поэтому  HM + NC + CM + CH = BC + AC."
    ],
    "54114": [
        "Признаки и свойства равнобедренного треугольника.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что сумма расстояний от произвольной точки, лежащей на основании равнобедренного треугольника, до боковых сторон постоянна.",
        "Решение: Пусть точка M лежит на основании AB равнобедренного треугольника ABC, AC = BC = a, ha и hb – расстояния от M до сторон BC и AC соответственно. Тогда 2SABC = 2SBCM + 2SACM = a(ha + hb), откуда ha + hb = SABC/a."
    ],
    "54181": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Стороны треугольника равны 10, 17, и 21. Найдите высоту, проведённую к большей стороне.",
        "Подсказка: См. задачу 54208.",
        "Ответ: 8."
    ],
    "54241": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Две стороны треугольника равны 25 и 30, а высота, проведённая к третьей, равна 24. Найдите третью сторону.",
        "Подсказка: Рассмотрите два возможных случая.",
        "Решение: Пусть в треугольнике ABC AB = 25, AC = 30, высота AD = 24. Тогда BD² = AB² – AD² = 49, CD² = AC² – AD² = 30² – 24² = 6·54 = 18².     Следовательно, BC = BD + DC = 7 + 18 = 25, если точка D находится на отрезке BC, и BC = DC – BD = 18 – 7 = 11, если вне его.",
        "Ответ: 25 или 11."
    ],
    "54242": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В треугольнике больший угол при основании равен 45°, а высота делит основание на отрезки, равные 20 и 21. Найдите большую боковую сторону.",
        "Подсказка: В треугольнике против большего угла лежит большая сторона.",
        "Решение: Пусть ∠A = 45°. Поскольку ∠A > ∠C, то BC > AB, то есть BC – большая боковая сторона. Значит, BD = AD = 20, BC² = BD² + DC² = 841 = 29².",
        "Ответ: 29."
    ],
    "54248": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В треугольнике ABC проведена высота AD. Докажите, что AB² – AC² = BM² – CM², где M – произвольная точка высоты AD.",
        "Подсказка: См. задачу 53602."
    ],
    "54265": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В треугольнике ABC известно, что AB = 3, высота CD = . Основание D высоты CD лежит на стороне AB и AD = BC. Найдите AC.",
        "Решение: Обозначим BC = AD = a. По теореме Пифагора a² = (3 – a)² + 3, откуда a = 2. Следовательно, AC² = 4 + 3 = 7.",
        "Ответ: ."
    ],
    "54655": [
        "Вспомогательные подобные треугольники",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Точки K и N расположены соответственно на сторонах AB и AC треугольника ABC, причём AK = BK и AN = 2NC.  В каком отношении отрезок KN делит медиану AM треугольника ABC?",
        "Решение: Пусть прямые AM и KN пересекаются в точке P.",
        "Ответ: 4 : 3."
    ],
    "54998": [
        "Признаки подобия",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Основание треугольника равно 36. Прямая, параллельная основанию, делит площадь треугольника пополам.   Найдите длину отрезка этой прямой, заключённого между сторонами треугольника.",
        "Подсказка: Отношение площадей подобных треугольников равно квадрату коэффициента подобия.",
        "Решение: Указанная прямая отсекает от данного треугольника подобный ему треугольник, площадь которого относится к площади данного как 1 : 2. Поэтому коэффициент подобия равен . Следовательно, длина искомого отрезка равна ·36 = 18.",
        "Ответ: 18."
    ],
    "55170": [
        "Сумма углов треугольника. Теорема о внешнем угле.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Внутри треугольника ABC взята точка M. Докажите, что угол  BMC больше угла BAC.",
        "Подсказка: Продолжите AM до пересечения со стороной BC.",
        "Решение: Продолжим AM до пересечения со стороной BC в точке K. Тогда ∠BMK > ∠BAM, ∠CMK > ∠CAM. Следовательно,   ∠BMC = ∠BMK + ∠CMK > ∠BAM + ∠CAM = ∠BAC."
    ],
    "55346": [
        "Теорема косинусов",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В ромбе ABCD угол при вершине A равен 60°. Точка N   делит сторону AB в отношении AN : BN = 2 : 1. Найдите тангенс угла DNC.",
        "Подсказка: Примените теорему косинусов.",
        "Решение: Пусть сторона ромба равна 3, искомый угол равен α. Тогда BN = 1, AN = 2.     Из треугольников NAD и NBC по теореме косинусов находим,  что DN² = 7, CN² = 13. Тогда  .     Следовательно, угол α – острый и",
        "Ответ: ."
    ],
    "55463": [
        "Ортоцентр и ортотреугольник",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что точки, симметричные точке пересечения высот (ортоцентру) треугольника ABC относительно прямых, содержащих его стороны, лежат на описанной окружности этого треугольника.",
        "Подсказка: Пусть H1 – точка пересечения продолжения высоты AA1 треугольника ABC с описанной окружностью. Докажите, что треугольник HBH1 – равнобедренный.",
        "Решение: Для прямоугольного треугольника утверждение очевидно.   Пусть ABC – остроугольный треугольник, H – точка пересечения его высот, H1 – точка пересечения продолжения отрезка AH за точку H с описанной окружностью треугольника ABC. Тогда ∠BH1H = ∠BH1A = ∠ACB = ∠BHH1 (стороны последних двух углов взаимно перпендикулярны).   Поэтому треугольник HBH1 – равнобедренный. Следовательно, перпендикуляр BC к его стороне HH1 проходит через середину отрезка HH1, то есть точка H1 симметрична точке H относительно прямой BC."
    ],
    "55433": [
        "Теорема синусов",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Две окружности с центрами",
        "Решение: См."
    ],
    "56454": [
        "Средняя линия треугольника",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На сторонеBC треугольника ABC взята точка A1 так, что BA1 : A1C = 2 : 1. В каком отношении медиана CC1 делит отрезок AA1?",
        "Подсказка: Проведите среднюю линию треугольника ABA1, параллельную AA1.",
        "Ответ: 3 : 1, считая от вершины A."
    ],
    "56464": [
        "Отрезки, заключенные между параллельными прямыми",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Одна из диагоналей вписанного в окружность четырёхугольника является диаметром.   Докажите, что проекции противоположных сторон на другую диагональ равны.",
        "Решение: Пусть AC – диаметр окружности, описанной около четырёхугольника ABCD. Опустим перпендикуляры AA1 и CC1 и OP на BD (O – центр описанной окружности; см. рис.). Ясно, что P – середина отрезкаBD. Прямые AA1, OP, CC1 параллельны и AO = OC, поэтому A1P = PC1. Так как P – середина BD, то  BA1 = DC1."
    ],
    "56465": [
        "Отрезки, заключенные между параллельными прямыми",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На основании AD трапецииABCD взята точка E так, что AE = BC. Отрезки CA и CE пересекают диагональ BD в точках O и P соответственно.   Докажите, что если BO = PD, то AD² = BC² + AD·BC.",
        "Решение: Так как BO = PD, то BC : AD = BO : OD = DP : PB = DE : EA. Поскольку EA = BC, то BC² = DE·AD = (AD – BC)AD = AD² – BC·AD."
    ],
    "56514": [
        "Треугольник, образованный основаниями двух высот и вершиной",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В остроугольном треугольнике ABC проведены высоты AA1,  BB1 и CC1. Докажите, что если A1B1 || AB и B1C1 || BC, то A1C1 || AC.",
        "Решение: Согласно задаче 52357 б)   B1A1C = ∠A. Так как A1B1 || AB, то ∠B1A1C = ∠B. Поэтому  ∠A = ∠B.    Аналогично ∠B = ∠C. Поэтому треугольникABC равносторонний и A1C1 || AC."
    ],
    "56523": [
        "Признаки и свойства равнобедренного треугольника.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Основание равнобедренного треугольника составляет четверть его периметра. Из произвольной точки основания проведены прямые, параллельные боковым сторонам. Во сколько раз периметр треугольника больше периметра отсечённого параллелограмма?",
        "Ответ: В 4/3 раза."
    ],
    "56528": [
        "Подобные треугольники (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На прямой l даны точки A, B, C и D. Через точки A и  B, а также через точки C и D проводятся параллельные прямые.  Докажите, что диагонали полученных таким образом параллелограммов (или их  продолжения) пересекают прямую l в двух фиксированных точках.",
        "Решение: Рассмотрим случай, когда точки A, B, C, D расположены именно в таком порядке. Пусть после проведения пар параллельных прямых образовался параллелограмм KLMN (см. рис.), причём прямая KM пересекает l в точке T. Проведём через точку K прямую m || l, пересекающую прямые AM и DM в точках P и Q соотвественно. Тогда точка T делит отрезок AD в отношении PK : KQ = AB : CD."
    ],
    "56533": [
        "Подобные треугольники (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Три прямые, параллельные сторонам данного треугольника, отсекают от него три треугольника, причём остается равносторонний шестиугольник.  Найдите длину стороны шестиугольника, если длины сторон треугольника равны a, b и c.",
        "Решение: Пусть сторона шестиугольника равна x. Из рассмотрения подобных треугольников получаем равенство ax/c + x + ax/b = a.",
        "Ответ: abc/ab+bc+ac."
    ],
    "56534": [
        "Подобные треугольники (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Три прямые, параллельные сторонам треугольника, пересекаются в одной точке, причем стороны треугольника высекают на этих прямых отрезки длиной x. Найдите x, если длины сторон треугольника равны a, b и c.",
        "Решение: Из рассмотрения подобных треугольников получаем равенство ax/c + x + ax/b = a.",
        "Ответ: abc/ab+bc+ac."
    ],
    "56831": [
        "Вписанные и описанные окружности",
        "Сложность: 3",
        "Классы: 8",
        "Условие: Пусть",
        "Решение: Лучи"
    ],
    "56832": [
        "Вписанные и описанные окружности",
        "Сложность: 3",
        "Классы: 8",
        "Условие: Докажите, что сторона",
        "Решение: Ясно, что"
    ],
    "34919": [
        "Вписанные и описанные окружности",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Обязательно ли равны два равнобедренных треугольника, у которых равны  боковые стороны и радиусы вписанных окружностей?",
        "Подсказка: Рассмотрите вытянутый по горизонтали  и вытянутый по вертикали треугольники.",
        "Решение: Зафиксируем некоторую окружность радиуса r и будем рассматривать  равнобедренные треугольники, описанные около этой окружности.  Такие треугольники однозначно задаются длиной высоты,  опущенной на основание равнобедренного треугольника.  Длина этой высоты может принимать любые значение из интервала  от 2r до бесконечности, причем длина боковой стороны треугольника  непрерывно зависит от длины высоты.  Если высота, опущенная на основание треугольника,  достаточно велика, то достаточно велика и боковая сторона.  Если высота достаточно мала (т.е. она чуть больше, чем 2r),  то боковая сторона также достаточно велика.  Поэтому если непрерывно изменять значение высоты от 2r до  бесконечности, то фиксированное достаточно большое значение длины  боковой стороны будет достигаться при двух разных   значениях длины высоты.",
        "Ответ: не обязательно."
    ],
    "56839": [
        "Вписанные и описанные окружности",
        "Сложность: 3",
        "Классы: 8",
        "Условие: Докажите, что точки, симметричные точке пересечения высот треугольника",
        "Решение: Пусть"
    ],
    "56847": [
        "Прямоугольные треугольники (прочее)",
        "Сложность: 3",
        "Классы: 8",
        "Условие: В треугольнике",
        "Решение: Пусть вписанная окружность касается стороны"
    ],
    "56848": [
        "Прямоугольные треугольники (прочее)",
        "Сложность: 3",
        "Классы: 8",
        "Условие: Пусть",
        "Решение: Так как"
    ],
    "56849": [
        "Прямоугольные треугольники (прочее)",
        "Сложность: 3",
        "Классы: 8",
        "Условие: Дана трапеция",
        "Решение: Пусть"
    ],
    "56850": [
        "Прямоугольные треугольники (прочее)",
        "Сложность: 3",
        "Классы: 8",
        "Условие: В равнобедренном треугольнике",
        "Решение: Пусть"
    ],
    "56851": [
        "Прямоугольные треугольники (прочее)",
        "Сложность: 3",
        "Классы: 8",
        "Условие: На медиане",
        "Решение: Прямая"
    ],
    "56857": [
        "Правильный (равносторонний) треугольник",
        "Сложность: 3",
        "Классы: 8",
        "Условие: Из точки",
        "Решение: По теореме Пифагора"
    ],
    "56858": [
        "Правильный (равносторонний) треугольник",
        "Сложность: 3",
        "Классы: 8",
        "Условие: Точки",
        "Решение: Пусть точка"
    ],
    "56860": [
        "Правильный (равносторонний) треугольник",
        "Сложность: 3",
        "Классы: 8",
        "Условие: Докажите, что если точка пересечения высот остроугольного треугольника делит высоты в одном и том же отношении, то треугольник правильный.",
        "Решение: Пусть"
    ],
    "56861": [
        "Правильный (равносторонний) треугольник",
        "Сложность: 3",
        "Классы: 8",
        "Условие: а) Докажите, что если",
        "Решение: а) Предположим, что треугольник"
    ],
    "35601": [
        "Конкуррентность высот. Углы между высотами.",
        "Сложность: 2",
        "Классы: 8",
        "Условие: Дан прямоугольный треугольник.    Впишите в него прямоугольник с общим прямым углом, у которого    диагональ минимальна.",
        "Подсказка: Диагональ не меньше высоты, опущенной из вершины прямого угла на    гипотенузу.",
        "Решение: Диагональ прямоугольника является наклонной, проведенной      из вершины прямого угла к     гипотенузе.     Следовательно, диагональ не меньше высоты, опущенной из вершины прямого угла на     гипотенузу, и наименьшее значение длины диагонали     достигается тогда, когда одна из диагоналей совпадает с высотой    треугольника."
    ],
    "56862": [
        "Правильный (равносторонний) треугольник",
        "Сложность: 3",
        "Классы: 8",
        "Условие: В треугольник",
        "Решение: Если"
    ],
    "56865": [
        "Треугольники с углами $60^\\circ$ и $120^\\circ$",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В треугольнике",
        "Решение: Согласно решению задачи"
    ],
    "56866": [
        "Треугольники с углами $60^\\circ$ и $120^\\circ$",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В треугольнике",
        "Решение: Пусть описанные окружности треугольников"
    ],
    "56871": [
        "Целочисленные треугольники",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Длины сторон треугольника— последовательные целые числа. Найдите эти числа, если известно, что одна из медиан перпендикулярна одной из биссектрис.",
        "Решение: Пусть"
    ],
    "56877": [
        "Сумма углов треугольника. Теорема о внешнем угле.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Треугольники ABC и A1B1C1 таковы, что их соответственные углы равны или составляют в сумме 180°.   Докажите, что в действительности все соответственные углы равны.",
        "Решение: В треугольникахABC и A1B1C1 не может быть двух пар соответственных углов, составляющих в сумме 180°, так как иначе их сумма равна 360° и третьи углы треугольников должны быть нулевыми.  Предположим теперь, что углы первого треугольника равны α, β и γ, а углы второго равны 180° – α, β и γ. Сумма углов двух треугольников равна 360°, поэтому 180° + 2β + 2γ = 360°, то есть β + γ = 90°. Следовательно, α = 90° = 180° – α."
    ],
    "56949": [
        "Подерный (педальный) треугольник",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Пусть",
        "Решение: Точки"
    ],
    "56978": [
        "Точка Лемуана",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Прямые",
        "Решение: По теореме синусов"
    ],
    "56979": [
        "Точка Лемуана",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Выразите длину симедианы",
        "Решение: Так как"
    ],
    "56980": [
        "Точка Лемуана",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Отрезок",
        "Решение: При симметрии относительно биссектрисы угла"
    ],
    "56981": [
        "Точка Лемуана",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Докажите, что если отрезок",
        "Решение: Согласно задаче"
    ],
    "52625": [
        "Вписанные и описанные окружности",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Около данного круга  опишите  равнобедренный  прямоугольный треугольник.",
        "Подсказка: Вершина прямого угла искомого  треугольника,  центр  данной окружности  и  точки  касания  с  катетами  являются   вершинами квадрата.",
        "Решение: Проведем  два  взаимно  перпендикулярных   радиуса   данной окружности. Получим точки касания с катетами.  Разделим  пополам большую из двух образовавшихся  дуг.  Получим  точку  касания  с гипотенузой."
    ],
    "57585": [
        "Теорема синусов",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Докажите, что",
        "Решение: По теореме синусов"
    ],
    "57586": [
        "Теорема синусов",
        "Сложность: 3",
        "Классы: 9",
        "Условие: В остроугольном треугольнике",
        "Решение: Втреугольнике"
    ],
    "57595": [
        "Теорема косинусов",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Длины сторон параллелограмма равны",
        "Решение: Пусть"
    ],
    "57596": [
        "Теорема косинусов",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Докажите, что медианы",
        "Решение: Пусть"
    ],
    "57601": [
        "Вписанная, описанная и вневписанная окружности; их радиусы",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Докажите, что",
        "Решение: Согласно задаче"
    ],
    "57602": [
        "Вписанная, описанная и вневписанная окружности; их радиусы",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Докажите, что",
        "Решение: Согласно задаче"
    ],
    "57603": [
        "Вписанная, описанная и вневписанная окружности; их радиусы",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Докажите, что",
        "Решение: Согласно задаче"
    ],
    "57604": [
        "Вписанная, описанная и вневписанная окружности; их радиусы",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Докажите, что",
        "Решение: Легко проверить, что"
    ],
    "57605": [
        "Вписанная, описанная и вневписанная окружности; их радиусы",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Докажите, что",
        "Решение: Согласно задаче"
    ],
    "57606": [
        "Вписанная, описанная и вневписанная окружности; их радиусы",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Докажите, что",
        "Решение: Согласно задаче"
    ],
    "35695": [
        "Теорема синусов",
        "Сложность: 2+",
        "Классы: 9",
        "Условие: В окружность вписаны две равнобедренные трапеции с соответственно параллельными сторонами. Докажите, что диагональ одной из них равна диагонали другой трапеции.",
        "Подсказка: Примените формулу a = 2R sin α.",
        "Решение: Пусть боковая сторона трапеции образует с меньшим основанием угол, равный α. Для обеих трапеций этот угол один и тот же, а диагональ равна произведению диаметра окружности на синус этого угла."
    ],
    "57617": [
        "Длины сторон, высот, медиан и биссектрис",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Докажите, что",
        "Решение: Так как"
    ],
    "57618": [
        "Длины сторон, высот, медиан и биссектрис",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Докажите, что длину биссектрисы",
        "Решение: а) Пусть продолжение биссектрисы"
    ],
    "57622": [
        "Синусы и косинусы углов треугольника",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Пусть α, β и γ - углы треугольника ABC. Докажите, что",
        "Решение: а) Складывая равенства"
    ],
    "57623": [
        "Синусы и косинусы углов треугольника",
        "Сложность: 3",
        "Классы: 9",
        "Условие: α, β и γ - углы треугольника ABC. Докажите, что",
        "Решение: Складывая равенства"
    ],
    "57624": [
        "Синусы и косинусы углов треугольника",
        "Сложность: 3",
        "Классы: 9",
        "Условие: α, β и γ - углы треугольника ABC. Докажите, что",
        "Решение: а) Ясно, что"
    ],
    "57625": [
        "Синусы и косинусы углов треугольника",
        "Сложность: 3",
        "Классы: 9",
        "Условие: α, β и γ - углы треугольника ABC. Докажите, что",
        "Решение: Теорему косинусов можно переписать в виде"
    ],
    "57628": [
        "Тангенсы и котангенсы углов треугольника",
        "Сложность: 3",
        "Классы: 9",
        "Условие: α, β и γ - углы треугольника ABC. Докажите, что",
        "Решение: Согласно задаче"
    ],
    "57629": [
        "Тангенсы и котангенсы углов треугольника",
        "Сложность: 3",
        "Классы: 9",
        "Условие: α, β и γ - углы треугольника ABC. Докажите, что",
        "Решение: Ясно, что"
    ],
    "57634": [
        "Взаимоотношения между сторонами и углами треугольников (прочее)",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Докажите, что если",
        "Решение: Согласно задаче"
    ],
    "57635": [
        "Взаимоотношения между сторонами и углами треугольников (прочее)",
        "Сложность: 3",
        "Классы: 9",
        "Условие: В треугольнике",
        "Решение: Опустим из точки"
    ],
    "52876": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Радиус окружности равен 13, хорда равна 10. Найдите её расстояние от центра.",
        "Решение: Диаметр, перпендикулярный хорде, делит её пополам. Поэтому квадрат искомого расстояния равен 13² – 5² = 12².",
        "Ответ: 12."
    ],
    "57636": [
        "Взаимоотношения между сторонами и углами треугольников (прочее)",
        "Сложность: 3",
        "Классы: 9",
        "Условие: В треугольнике",
        "Решение: Величины"
    ],
    "57644": [
        "Взаимоотношения между сторонами и углами треугольников (прочее)",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Окружность",
        "Решение: Пусть"
    ],
    "57653": [
        "Взаимоотношения между сторонами и углами треугольников (прочее)",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Вписанная окружность касается стороны",
        "Решение: Так как"
    ],
    "64324": [
        "Сумма углов треугольника. Теорема о внешнем угле.",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: Даны два треугольника. Сумма двух углов первого треугольника равна некоторому углу второго. Сумма другой пары углов первого треугольника также равна некоторому углу второго. Верно ли, что первый треугольник – равнобедренный?",
        "Решение: Предположим, что первый треугольник – неравнобедренный, α, β и γ – его углы, а суммы α + β и β + γ равны углам второго треугольника. Так как эти суммы не равны, то это – разные углы второго треугольника. Значит, сумма углов этого треугольника больше α + β + β + γ = 180╟ + β > 180╟, что невозможно.     Таким образом, первый треугольник – равнобедренный.",
        "Ответ: Верно."
    ],
    "64552": [
        "Треугольники с углами $60^\\circ$ и $120^\\circ$",
        "Сложность: 3",
        "Классы: ",
        "Условие: В треугольнике ABC угол C равен 75°, а угол B равен 60°. Вершина M равнобедренного прямоугольного треугольника BCM с гипотенузой BC расположена внутри треугольника ABC. Найдите угол MAC.",
        "Решение: Из условия следует, что ∠BAC = 45°. Проведём окружность с центром M и радиусом MB = MC. Так как ∠BMC = 90°, то большая дуга BC этой окружности является геометрическим местом точек, из которых хорда BC видна под углом 45°. Следовательно, вершина A принадлежит этой окружности. Значит, треугольник AMC – равнобедренный, и ∠MAC = ∠MCA = ∠BCA – ∠MCB = 75° – 45° = 30°.",
        "Ответ: 30°."
    ],
    "64561": [
        "Прямоугольные треугольники (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Полуокружность с диаметром AD касается катета BC прямоугольного треугольника ABC в точке М (см. рисунок).   Докажите, что AM – биссектриса угла BAC.",
        "Решение: Проведём радиус ОМ данной полуокружности (см. рис.). ОМ = ОА, следовательно, ∠ОАМ = ∠ОМА. Кроме того, ОМ ⊥ ВС, значит, ОМ || AC, поэтому ∠САМ = ∠ОМА. Таким образом, ∠ОАМ = ∠САМ, то есть AM – биссектриса угла BAC."
    ],
    "64901": [
        "Правильный (равносторонний) треугольник",
        "Сложность: 3",
        "Классы: 9,10,11",
        "Условие: Правильный треугольник со стороной 1 разрезан произвольным образом на равносторонние треугольники, в каждый из которых вписан круг.   Найдите сумму площадей этих кругов.",
        "Решение: Так как все правильные треугольники подобны, то у них отношение площади вписанного круга к площади треугольника одно и то же. Так как сумма площадей частей равна площади исходного треугольника, то и сумма площадей вписанных в них кругов равна площади круга, вписанного в исходный треугольник. Радиус круга, вписанного в данный треугольник, равен , а его площадь равна",
        "Ответ: π/12."
    ],
    "53305": [
        "Равные треугольники. Признаки равенства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Отрезки AB и CD пересекаются в точке O, которая является  серединой каждого из них. Чему равен отрезок BD, если отрезок AC = 10?",
        "Решение: Треугольник BOD равен треугольнику AOC по двум сторонам и  углу между ними. Поэтому BD = AC = 10.",
        "Ответ: 10."
    ],
    "65432": [
        "Признаки и свойства равнобедренного треугольника.",
        "Сложность: 3",
        "Классы: 8,9,10,11",
        "Условие: На сторонах АВ и АС равнобедренного треугольника АВС (АВ = АС) соответственно отмечены точки Ми N так, что АN > AM. Прямые MN и ВС пересекаются в точке K. Сравните длины отрезков MK и MB.",
        "Решение: Так как угол АСВ – внешний для треугольника CNK, то ∠B = ∠C > ∠NKC. В треугольнике BKM против большего угла лежит большая сторона, значит,  MK > MB.",
        "Ответ: MK > MB."
    ],
    "65961": [
        "Признаки и свойства равнобедренного треугольника.",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: В равнобедренном треугольнике АВС с основанием ВС проведена биссектриса CL. Докажите, что CL < 2BL.",
        "Решение: Проведём через точку L прямую, параллельную BC, M – точка пересечения этой прямой со стороной АС (см. рис.). Пусть ∠BCL = ∠MCL = γ,  тогда ∠MLС = ∠BCL = γ, так как LM || BC. Следовательно, треугольник MCL – равнобедренный: MC = ML. Кроме того, CMLB – равнобокая трапеция, значит, BL = MC.     Согласно неравенству треугольника CL < CM + ML = 2BL."
    ],
    "66288": [
        "Признаки и свойства равнобедренного треугольника.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Можно ли разрезать треугольник на три выпуклых многоугольника с попарно различным количеством сторон?",
        "Решение: На рисунке треугольник разрезан на треугольник, выпуклый четырёхугольник и выпуклый пятиугольник.",
        "Ответ: Можно."
    ],
    "66364": [
        "Прямоугольный треугольник с углом в $30^\\circ$",
        "Сложность: 3",
        "Классы: 7,8,9",
        "Условие: Из вершины прямого угла треугольника ABC проведена медиана СМ. Окружность, вписанная в треугольник САМ, касается СМ в её середине. Найдите угол ВАС.",
        "Решение: Обозначив через K, P и Н точки касания окружности со сторонами треугольника САМ (см. рис.), получим: AK = AP, CK = CH = MH = MP. Следовательно, АС = АМ. Кроме того, СМ = 0,5АВ = АМ.  Таким образом, треугольник САМ – равносторонний, значит, ∠ВАС = 60°.",
        "Ответ: 60°."
    ],
    "53306": [
        "Равные треугольники. Признаки равенства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Через середину отрезка AB проведена прямая, перпендикулярная прямой AB. Докажите, что каждая точка этой прямой одинаково удалена от точек A и B.",
        "Решение: Пусть O – середина отрезка AB, M – произвольная точка прямой, проходящей через точку O перпендикулярно прямой AB.     Если точка M совпадает с O, то всё доказано. Если точка M отлична от O, то треугольники MOA и MOB равны по двум сторонам и углу между ними   (∠MOA = ∠MOB = 90°). Следовательно, AM = BM."
    ],
    "77954": [
        "Вписанные и описанные окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Для выпуклого четырёхугольника",
        "Решение: Пусть"
    ],
    "78044": [
        "Вневписанные окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Дан",
        "Решение: Центр"
    ],
    "78187": [
        "Ортоцентр и ортотреугольник",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Дан треугольник ABC. Найти такую точку, что если её симметрично отразить от любой стороны треугольника, то она попадает на описанную окружность.",
        "Подсказка: См. задачу 55463.",
        "Ответ: Точка пересечения высот треугольника."
    ],
    "78273": [
        "Вписанные и описанные окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Дана прямая",
        "Решение: Для каждой точки"
    ],
    "78528": [
        "Вспомогательные равные треугольники",
        "Сложность: 3",
        "Классы: 7,8",
        "Условие: На отрезке AB выбрана произвольно точка C и на отрезках AB, AC и BC, как на диаметрах, построены окружности Ω1, Ω2 и Ω3. Через точку C проводится произвольная прямая, пересекающая окружность Ω1 в точках P и Q, а окружности Ω2 и Ω3 в точках R и S соответственно. Доказать, что PR = QS.",
        "Решение: Пусть K, L и M – центры окружностей Ω1, Ω2 и Ω3. Достаточно доказать, что KR = KS. Докажем, что треугольники LRK и MKS равны. Радиус  окружности Ω1 равен сумме радиусов окружностей Ω2 и Ω3, поэтому LR = MK   и LK = MS. Ясно также, что ∠RLK = ∠KMS = 180° – 2α, где α – угол между прямыми AB и PQ."
    ],
    "78823": [
        "Свойства медиан. Центр тяжести треугольника.",
        "Сложность: 3",
        "Классы: 8",
        "Условие: На плоскости проведены четыре прямые",
        "Решение: После параллельного переноса можно считать, что прямая"
    ],
    "86933": [
        "Свойства медиан. Центр тяжести треугольника.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что медианы тетраэдра (отрезки, соединяющие вершины с точками пересечения медиан противолежащих граней) пересекаются   в одной точке и делятся ею в отношении",
        "Решение: Докажем, что любые две медианы тетраэдра пересекаются и делятся точкой пересечения в  отношении"
    ],
    "102297": [
        "Теорема косинусов",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Прямая, проходящая через вершину основания равнобедренного треугольника, делит его площадь пополам, а периметр треугольника делит на части длиной 4 и 6. Найдите площадь треугольника и укажите, где лежит центр описанной окружности: внутри или вне треугольника.",
        "Ответ: а)"
    ],
    "53309": [
        "Равные треугольники. Признаки равенства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: На стороне AB треугольника ABC взята точка D, а на стороне A1B1 треугольника A1B1C1 взята точка D1. Известно, что треугольники ADC и A1D1C1 равны и отрезки DB и D1B1 равны. Докажите равенство треугольников ABC и A1B1C1.",
        "Решение: Из равенства треугольников ADC и A1D1C1 следуют равенства: AC = A1C1, AD = A1D1, ∠BAC = ∠B1A1C1.     Поскольку BD = B1D1, то  AB = AD + DB = A1D1 + D1B1 = A1B1.  Следовательно, треугольники ABC и A1B1C1 равны по двум сторонам и углу между ними."
    ],
    "102724": [
        "Периметр треугольника",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На стороне AC треугольника ABC отметили точку E. Известно, что периметр треугольника ABC равен 25 см, периметр треугольника ABE равен 15 см, а периметр треугольника BCE – 17 см. Найдите длину отрезка BE.",
        "Решение: 15 + 17 = PABE + PBCE = PABC + 2BE = 25 + 2BE. Следовательно, BE = (32 – 25) : 2 = 3,5.",
        "Ответ: 3,5 см."
    ],
    "107713": [
        "Свойства медиан. Центр тяжести треугольника.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Три равных треугольника разрезали по разноимённым медианам (см. рис. 1).  Можно ли из получившихся шести треугольников сложить один треугольник?",
        "Решение: См. рисунок 2.",
        "Ответ: Можно."
    ],
    "108029": [
        "Две пары подобных треугольников",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: При каком отношении оснований трапеции существует прямая, на которой шесть точек пересечения с диагоналями, боковыми сторонами и продолжениями оснований трапеции высекают пять равных отрезков?",
        "Решение: Пусть указанная прямая пересекает продолжение меньшего основания AB трапеции ABCD, в точке E, боковую сторону AD – в точке F, диагональ BD – в точке G, диагональ AC – в точке H, боковую сторону BC – в точке I, продолжение основния CD – в точке J. Положим CJ = 2. Из подобия треугольников CJH и AEH находим, что AE = 3, а из подобия треугольников AEF и DJF получаем DJ = 12. Отсюда CD = 10. Из подобия треугольников CJI и BEI следует, что BE = 8. Значит, AD = 5.",
        "Ответ: 1 : 2."
    ],
    "108035": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Длины сторон остроугольного треугольника – последовательные целые  числа.   Докажите, что высота, опущенная на среднюю по величине сторону, делит её на отрезки, разность длин которых равна 4.",
        "Решение: Пусть стороны треугольника равны n – 1, n и  n + 1, отрезки, на которые высота делит основание, – x и y, высота – h. (см. рисунок)."
    ],
    "108617": [
        "Средняя линия треугольника",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Точки",
        "Решение: Прямая"
    ],
    "108619": [
        "Вспомогательные равные треугольники",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Точка D взята на медиане BM треугольника ABC. Через точку D проведена прямая, параллельная стороне AB, а через точку C – прямая, параллельная медиане BM. Две проведённые прямые пересекаются в точке E. Докажите, что BE = AD.",
        "Подсказка: Через точку M проведите прямую, параллельную DE.",
        "Решение: Пусть прямая, проходящая через точку M параллельно DE, пересекает прямую CE в точке F. Тогда четырёхугольник MDEF – параллелограмм, поэтому  MF = DE. Треугольник MFC равен треугольнику ABM по стороне и двум прилежащим к ней углам. Значит, AB = MF = DE, а так как  AB || DE, то ABED – также параллелограмм. Следовательно, BE = AD."
    ],
    "53310": [
        "Равные треугольники. Признаки равенства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Отрезки AB и CD пересекаются в точке O. Докажите равенство  треугольников ACO и DBO, если известно, что ∠ACO = ∠DBO и BO = OC.",
        "Решение: Треугольники ACO и DBO равны по стороне (BO = OC) и двум прилежащим к ней углам."
    ],
    "108644": [
        "Медиана, проведенная к гипотенузе",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На стороне AC треугольника ABC выбрана точка D, причём DC = 2AD, O – центр вписанной окружности   треугольника DBC, E – точка касания этой окружности с прямой BD. Оказалось, что BD = BC. Докажите, что AE || DO.",
        "Решение: Пусть P – точка касания вписанной окружности равнобедренного   треугольника BDC со стороной CD. Тогда DE = DP = ½ CD = AD. Значит, медиана DE треугольника AEP равна половине стороны AP. Поэтому AE ⊥ PE, а так как DO ⊥ PE, то AE || DO."
    ],
    "108646": [
        "Вспомогательные подобные треугольники",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: M – точка пересечения диагоналей трапеции ABCD. На основании BC выбрана такая точка P, что ∠APM = ∠DPM.  Докажите, что расстояние от точки C до прямой AP равно расстоянию от точки B до прямой DP.",
        "Решение: Будем обозначать расстояние от точки X до прямой l через d(X, l). Заметим, что d(C, AP) = d(M, AP)·AC/AM,  d(B, DP) = d(M, DP)·DB/DM.     Но d(M, AP) = d(M, DP), так как PM – биссектриса угла APD. С другой стороны, из подобия треугольников BMC и DMA следует, что AM : MC = DM : MB. Значит, AC : AM = DB : DM. Отсюда следует утверждение задачи."
    ],
    "108653": [
        "Вспомогательные равные треугольники",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На сторонах AB и BC треугольника ABC отложены равные отрезки AE и CF соответственно. Окружность, проходящая через точки B, C, E , и окружность, проходящая через точки A, B, F , пересекаются в точках B и D. Докажите, что BD – биссектриса угла ABC.",
        "Решение: Четырёхугольник BCDE – вписанный, поэтому ∠FCD = ∠BCD = ∠AED.     Аналогично ∠DAE = ∠CFD. Значит, треугольники  CFD и EAD равны по стороне и двум прилежащим к ней углам. Высоты DP и DQ этих треугольников, проведённые из соответствующих вершин, равны, поэтому точка D равноудалена от сторон BA и BC угла ABC. Следовательно, BD – биссектриса этого угла."
    ],
    "108686": [
        "Отношение, в котором биссектриса делит сторону",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В выпуклом четырёхугольнике  ABCD  биссектрисы углов CAD и CBD пересекаются на стороне CD.   Докажите, что биссектрисы углов ACB и ADB пересекаются на стороне AB.",
        "Решение: Пусть биссектрисы углов CAD и CBD пересекаются в точке M, лежащей на стороне CD. Биссектриса треугольника делит его сторону на отрезки, пропорциональные двум другим сторонам, поэтому AD : AC = DM : MC = BD : BC. Значит, AD : BD = AC : BC. Если биссектрисы углов ADB и ACB пересекают сторону AB в точках N и N' соответственно, то AN : BN = AD : BD = AC : BC = AN' : BN'. Следовательно, точки N и N' совпадают."
    ],
    "108693": [
        "Признаки и свойства равнобедренного треугольника.",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Медианой пятиугольника ABCDE назовём отрезок, соединяющий вершину с серединой противолежащей стороны (A – с серединой CD, B – с серединой DE и т.д.). Докажите, что если четыре медианы выпуклого пятиугольника перпендикулярны сторонам, к которым они проведены, то таким же свойством обладает и пятая медиана.",
        "Решение: Заметим, что медиана пятиугольника перпендикулярна противолежащей   стороне тогда и только тогда, когда диагонали, проведённые из этой вершины, равны. Поэтому, если медианы, проведённые из вершин A, B, C и D перпендикулярны противолежащим сторонам, то AC = AD, BE = BD, CA = CE,  DB = DA.     Значит, CE = BE. Следовательно, медиана, проведённая из вершины E, также перпендикулярна противолежащей стороне."
    ],
    "108922": [
        "Вспомогательные равные треугольники",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В треугольнике ABC проведена биссектриса BL. Известно, что BL = AB. На продолжении BL за точку L выбрана точка K, причём ∠BAK + ∠BAL = 180°.   Докажите, что BK = BC.",
        "Решение: Обозначим ∠BLA = ∠A = α. Тогда ∠BLC = 180° – α = ∠BAK. Значит, треугольники BLC и BAK равны по стороне и двум прилежащим к ней углам. Следовательно, BK = BC."
    ],
    "108936": [
        "Признаки подобия",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: В трапеции ABCD с основаниями AD и BC угол при вершине A – прямой, E – точка пересечения диагоналей, F – проекция точки E на сторону  AB .   Докажите, что углы DFE и CFE равны.",
        "Решение: Из подобия треугольников BEC и DEA следует, что BC : AD = BE : ED, а из теоремы о пропорциональных отрезках – BF : AF = BE : ED. Поэтому  BC : AD = BF : AF. Значит, прямоугольные треугольники CBF и DAF подобны по двум сторонам и углу между ними. Следовательно,   ∠CFE = ∠BCF = ∠ADF = ∠DFE."
    ],
    "108941": [
        "Вневписанные окружности",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Пусть вневписанные окружности треугольника, касающиеся сторон",
        "Решение: Обозначим"
    ],
    "108954": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Дан остроугольный равнобедренный треугольник",
        "Решение: По теореме Пифагора"
    ],
    "109006": [
        "Теорема косинусов",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Стороны треугольника",
        "Решение: Преобразуем данное выражение:"
    ],
    "56826": [
        "Треугольники (прочее)",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: а) Докажите, что если в треугольнике медиана совпадает свысотой, то этот треугольник равнобедренный."
    ],
    "53311": [
        "Равные треугольники. Признаки равенства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Отрезки AC и BD пересекаются в точке O. Докажите равенство  треугольников BAO и DCO, если известно, что ∠BAO = ∠DCO и AO = OC.",
        "Решение: Треугольники BAO и DCO равны по стороне (AO = OC) и двум прилежащим к ней углам."
    ],
    "109072": [
        "Средняя линия треугольника",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Пусть",
        "Решение: Пусть"
    ],
    "53313": [
        "Равные треугольники. Признаки равенства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Треугольники ACC1 и BCC1 равны. Их вершины A и B лежат по разные стороны от прямой CC1.   Докажите, что треугольники ABC и ABC1 – равнобедренные.",
        "Решение: Из равенства треугольников ACC1 и BCC1 следует равенство соответствующих сторон: AC = BC и AC1 = BC1. Следовательно, треугольники ABC и ABC1 – равнобедренные."
    ],
    "53315": [
        "Равные треугольники. Признаки равенства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что у равных треугольников ABC и A1B1C1:     а) медианы, проведённые из вершин A и A1, равны;      б) биссектрисы, проведённые из вершин A и A1, равны.",
        "Решение: Пусть M и M1 – середины сторон BC и B1C1. Из равенства   треугольников ABC и A1B1C1 следует, что A1C1 = AC, ∠ACB = ∠A1C1B1, C1M1 = CM   (как половины равных отрезков C1B1 и CB). Поэтому треугольники ACM и A1C1M1 равны по двум сторонам и углу между ними. Следовательно, AM = A1M1.     Для доказательства равенства биссектрис применим признак равенства треугольников по стороне и двум прилежащим к ней углам."
    ],
    "53317": [
        "Равные треугольники. Признаки равенства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите признак равенства треугольников по углу, биссектрисе этого угла и стороне, прилежащей к этому углу.",
        "Решение: Пусть биссектриса A1D1 треугольника   A1B1C1 равна биссектрисе AD треугольника ABC, A1C1 = AC и ∠B1A1C1 = ∠BAC. Значит, треугольники A1C1D1 и ACD равны по двум сторонам и углу между ними (∠C1A1D1 = ∠CAD как половины равных углов). Следовательно, ∠D1C1A1 = ∠DCA, и треугольники A1B1C1 и ABC равны по стороне и двум прилежащим к ней углам."
    ],
    "53327": [
        "Равные треугольники. Признаки равенства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Два отрезка AB и CD пересекаются в точке O, которая  является серединой каждого из них. Докажите равенство треугольников ACD и BDC.",
        "Подсказка: См. решение задачи 53305."
    ],
    "53328": [
        "Равные треугольники. Признаки равенства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите равенство треугольников по двум сторонам и медиане, проведенной к одной из них.",
        "Решение: Пусть A1M1 и AM медианы треугольников A1B1C1 и ABC, AB = A1B1, BC = B1C1, AM = A1M1.    Из равенства треугольников ABM и A1B1M1 (по трём сторонам) следует равенство углов ABC и A1B1C1.  Поэтому треугольники ABC и A1B1C1 равны по двум сторонам и углу между ними."
    ],
    "53340": [
        "Равные треугольники. Признаки равенства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Даны два треугольника: ABC и A1B1C1. Известно, что AB = A1B1,AC = A1C1, ∠A = ∠A1. На сторонах AC и BC треугольника ABC взяты соответственно точки K и L, а на сторонах A1C1 и B1C1 треугольника A1B1C1 – точки K1 и L1 так, что AK = A1K1, LC = L1C1. Докажите, что KL = K1L1 и AL = A1L1.",
        "Решение: Треугольники ABC и A1B1C1 равны по двум сторонам и углу между ними. Поэтому ∠C = ∠C1. Значит, треугольники LCK и L1C1K1 равны по двум сторонам   (CK = AC – AK = A1C1 – A1K1 = C1K1, LC = L1C1) и углу между ними. Следовательно, KL = K1L1. Аналогично, AL = A1L1."
    ],
    "53383": [
        "Сумма углов треугольника. Теорема о внешнем угле.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: ABC – равнобедренный треугольник с основанием AC, CD – биссектриса угла C, ∠ADC = 150°. Найдите ∠B.",
        "Подсказка: Примените теорему о сумме углов треугольника.",
        "Решение: Пусть ∠A = ∠C = 2α. Тогда  ∠DCA = ∠BCD = α. По условию 2α + α  = 180° – 150°, откуда α = 10°. Следовательно, ∠B = 180° – 4α = 140°.",
        "Ответ: 140°."
    ],
    "53395": [
        "Сумма углов треугольника. Теорема о внешнем угле.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: На плоскости расположены четыре прямые (см. рисунок). Известны углы между некоторыми из них: α = 110°, β = 60°, γ = 80°.   Найдите углы между остальными парами прямых.",
        "Подсказка: Примените теорему о внешнем угле треугольника.",
        "Решение: По теореме о внешнем угле треугольника x = α – γ = 30°, z = β – x = 30°,   y = α – β = 50°.",
        "Ответ: 30°, 30°, 50°."
    ],
    "53396": [
        "Равные треугольники. Признаки равенства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: На сторонах BC и B1C1 равных треугольников ABC и A1B1C1 взяты соответственно точки M и M1,   причём BM : MC = B1M1 : M1C1.  Докажите, что AM = A1M1.",
        "Подсказка: Докажите равенство треугольников ABM и A1B1M1.",
        "Решение: Из равенства треугольников ABC и A1B1C1 следует, что ∠B = ∠B1 и AB = A1B1. Отрезки BM и B1M1 составляют одну и ту же часть соответственно от отрезков BC и B1C1, поэтому они равны. Значит, треугольники ABM и   A1B1M1 равны по двум сторонам и углу между ними. Следовательно, AM = A1M1."
    ],
    "56827": [
        "Треугольники (прочее)",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: Докажите, что биссектрисы треугольника пересекаются в одной точке."
    ],
    "53417": [
        "Равные треугольники. Признаки равенства",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Отрезки AB и CD пересекаются в точке O и делятся этой точкой пополам. Докажите, что AC || BD и AD || BC.",
        "Подсказка: Докажите, что ∠OAC = ∠OBD.",
        "Решение: Треугольники AOC и BOD равны по двум сторонам и углу между  ними (AO = BO и CO = DO по условию, а углы AOC и BOD равны как вертикальные), поэтому ∠OAC = ∠OBD. Прямая AB пересекает прямые AC и BD, причём накрест лежащие углы OAC и OBD равны. Следовательно, прямые AC и BD параллельны. Аналогично, AD || BC."
    ],
    "53444": [
        "Сумма углов треугольника. Теорема о внешнем угле.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: BK – биссектриса треугольника ABC. Известно, что ∠AKB : ∠CKB = 4 : 5. Найдите разность углов A и C треугольника ABC.",
        "Подсказка: Найдите углы AKB и CKB и воспользуйтесь теоремой о внешнем угле треугольника.",
        "Решение: Поскольку ∠AKB + ∠CKB = 180°, то ∠AKB = 80°, ∠CKB = 100°.     Пусть ∠ABK = ∠CBK = β. По теореме о внешнем угле треугольника 80° = ∠C + β, 100° = ∠A + β, ∠A – ∠C = 20°.",
        "Ответ: 20°."
    ],
    "53730": [
        "Вневписанные окружности",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что прямая, проходящая через центры вневписанных окружностей треугольника ABC, касающихся сторон AB и AC, перпендикулярна прямой, проходящей через центр вписанной окружности и вершину A.",
        "Решение: Пусть O1 и O2 – центры вневписанных окружностей треугольника ABC, касающихся сторон AB и AC. Точки O1 и O2 лежат на биссектрисе внешнего угла A, которая перпендикулярна биссектрисе угла A, проходящей через центр вписанной окружности."
    ],
    "53737": [
        "Признаки подобия",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Каждая из двух сторон треугольника разделена на семь равных частей; соответствующие точки деления соединены отрезками.   Найдите эти отрезки, если третья сторона треугольника равна 28.",
        "Подсказка: См. задачу 53736.",
        "Ответ: 4, 8, 12, 16, 20, 24."
    ],
    "53908": [
        "Признаки и свойства равнобедренного треугольника.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что равные хорды удалены от центра окружности на равные расстояния.",
        "Подсказка: Опустите перпендикуляры из центра окружности на данные хорды.",
        "Решение: Пусть AB и A1B1 – равные хорды окружности с центром O, не являющиеся диаметрами. Расстояния от центра окружности до этих хорд равны перпендикулярам OM и OM1, опущенным на хорды из центра окружности. Поскольку M и M1 – середины хорд, то AM = ½ AB = ½ A1B1 = A1M1.     Значит, прямоугольные треугольники AMO и A1M1O равны по катету и гипотенузе (радиус окружности). Следовательно, OM = OM1.     Если AB и A1B1 – диаметры, то утверждение очевидно."
    ],
    "54189": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Найдите диагональ прямоугольника со сторонами 5 и 12.",
        "Ответ: 13."
    ],
    "54193": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Найдите расстояние от центра окружности радиуса 10 до хорды, равной 12.",
        "Ответ: 8."
    ],
    "54304": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Один из катетов прямоугольного треугольника на 10 больше другого и на 10 меньше гипотенузы. Найдите гипотенузу этого треугольника.",
        "Решение: Пусть первый катет равен x. Тогда второй катет равен x – 10, а гипотенуза равна x + 10. По теореме Пифагора (x + 10)² = x² + (x – 10)², откуда x = 40. Следовательно, x + 10 = 50.",
        "Ответ: 50."
    ],
    "54656": [
        "Отношения линейных элементов подобных треугольников",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что отношение периметров подобных треугольников равно коэффициенту подобия.",
        "Решение: Пусть треугольник A1B1C1 подобен треугольнику ABC с коэффициентом k. Тогда  A1B1 = kAB, A1C1 = kA, B1C1 = kBC, поэтому  A1B1 + A1C1 + B1C1 = kAB + kAC + kBC = k(AB + AC + BC)."
    ],
    "56828": [
        "Теорема Пифагора (прямая и обратная)",
        "Сложность: 2",
        "Классы: 7,8",
        "Условие: На высоте AH треугольника ABC взята точка M. Докажите, что AB² – AC² = MB² – MC².",
        "Решение: См. задачу 53602."
    ],
    "56457": [
        "Средняя линия треугольника",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Докажите, что середины сторон произвольного четырёхугольника – вершины параллелограмма.   Для каких четырёхугольников этот параллелограмм является   прямоугольником, для каких – ромбом, для каких – квадратом?",
        "Решение: Пусть"
    ],
    "56481": [
        "Подобные треугольники (прочее)",
        "Сложность: 2+",
        "Классы: 9",
        "Условие: Концы отрезков AB и CD перемещаются по сторонам данного угла, причем прямые AB и  CD перемещаются параллельно; M – точка пересечения отрезков AB и CD. Докажите, что величина    остается постоянной.",
        "Решение: При перемещении отрезков AB и CD треугольник AMC  заменится на треугольник, подобный исходному. Поэтому величина AM/CM остается постоянной. Аналогично величина  BM/DM остается постоянной."
    ],
    "56510": [
        "Треугольник, образованный основаниями двух высот и вершиной",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: В треугольнике ABC проведены высоты BB1 и CC1. Докажите, что    а) касательная в точке A к описанной окружности параллельна прямой B1C1;     б) B1C1 ⊥ OA, где O – центр описанной окружности.",
        "Решение: а) Пусть l – касательная в точке A к описанной окружности.  Тогда ∠(l, AB) = ∠(AC, CB) = ∠(C1B1, AC1), а значит, l || B1C1."
    ],
    "61195": [
        "Свойства медиан. Центр тяжести треугольника.",
        "Сложность: 2+",
        "Классы: 10,11",
        "Условие: Докажите, что точка m = 1/3 (a1 + a2 + a3) является точкой пересечения медиан треугольника a1a2a3."
    ],
    "76424": [
        "Отношения линейных элементов подобных треугольников",
        "Сложность: 2+",
        "Классы: 9",
        "Условие: В треугольнике ABC из произвольной точки D на стороне AB  проведены две прямые, параллельные сторонам AC и BC, пересекающие BC и AC соответственно в точках F и G. Доказать, что сумма длин описанных окружностей треугольников ADG и BDF равна длине описанной окружности треугольника ABC.",
        "Решение: Радиусы (а значит, и длины) описанных окружностей подобных треугольников ADG, DBF и ABC пропорциональны соответственным сторонам, поэтому все следует из равенства AD + DB = AB."
    ],
    "86488": [
        "Признаки и свойства равнобедренного треугольника.",
        "Сложность: 2+",
        "Классы: 7,8",
        "Условие: Через вершины А и С треугольника АВС проведены прямые, перпендикулярные биссектрисе угла АВС. Они пересекают прямые СВ и ВА в точках К и М соответственно. Найдите длину АВ, если ВМ = 8 см, KC = 1 см и АВ > ВС.",
        "Решение: См. задачу",
        "Ответ: 9 см."
    ],
    "86515": [
        "Признаки и свойства равнобедренного треугольника.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: В выпуклом четырёхугольнике ABCD точки E, F и G – середины сторон AB, BC и AD соответственно, причём GE ⊥ AB, GF ⊥ BC. Найдите угол ACD.",
        "Решение: Так как каждый из отрезков GE и GF является одновременно высотой и медианой в треугольниках AGB и BGC соответственно (см. рис.), то  DG = AG = BG = CG. Следовательно, G – центр окружности, описанной около данного четырёхугольника. ∠ACD = 90°, так как это вписанный угол, опирающийся на диаметр окружности.",
        "Ответ: 90°."
    ],
    "108608": [
        "Признаки и свойства равнобедренного треугольника.",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Медиана AD, высота BE и биссектриса CF треугольника ABC пересекаются в точке O. Известно, что BO = CO.  Докажите, что треугольник ABC равносторонний.",
        "Решение: Поскольку треугольник BOC равнобедренный, то его медиана OD является высотой, поэтому AD – высота (и медиана) треугольника ABC. Значит,  AB = AC, а O – точка пересечения высот треугольника ABC. Тогда и биссектриса CF является его высотой. Поэтому и AC = BC."
    ],
    "53431": [
        "Сумма углов треугольника. Теорема о внешнем угле.",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Углы треугольника относятся как 2 : 3 : 4. Найдите отношение  внешних углов треугольника.",
        "Решение: Так как внешний угол равен сумме двух внутренних, то внешние углы относятся как (2 + 3) : (2 + 4) : (3 + 4).",
        "Ответ: 5 : 6 : 7."
    ],
    "115587": [
        "Вспомогательные подобные треугольники",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Площадь трапеции ABCD равна 405. Диагонали пересекаются в точке O, отрезки, соединяющие середину P основания AD с вершинами B и C, пересекаются с диагоналями трапеции в точках M и N. Найдите площадь треугольника MON, если одно из оснований трапеции вдвое больше другого.",
        "Решение: Пусть AD = 2BC (рис. слева). Тогда SACD : SBAC = 2 : 1, то есть SACD = &frac23; SABCD = 270, SAОD = &frac23; SACD = 180.     Четырёхугольники ABCP и BCDP – параллелограммы, поэтому M и N – середины BP и CP.     Так как OA : OC = 2 : 1, то OM : OA = 1 : 4. Аналогично ON : OD = 1 : 4.     Значит, треугольники MON и AOD подобны с коэффициентом ¼. Следовательно, SMON = 1/16 SAOD = 45/4.",
        "Ответ: 45/4 или 36/5."
    ],
    "116143": [
        "Прямоугольный треугольник с углом в $30^\\circ$",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: В окружности провели диаметр AB и параллельную ему хорду CD, так, что расстояние между ними равно половине радиуса этой окружности (см. рис.). Найдите угол CAB.",
        "Решение: Пусть O – центр данной окружности, а K –   основание перпендикуляра, опущенного из O на CD (см. рис.).   Тогда в прямоугольном треугольнике OCK катет OK вдвое меньше гипотенузы OC, следовательно, ∠OCK = 30°. Поскольку CD || AB, то ∠AOC =   ∠OCK = 30°. Треугольник AOC – равнобедренный, поэтому ∠CAO = ∠ACO = (180° – 30°) : 2 = 75°.",
        "Ответ: 75°."
    ],
    "116493": [
        "Синусы и косинусы углов треугольника",
        "Сложность: 2+",
        "Классы: 10,11",
        "Условие: Про углы треугольника ABC известно, что    и   .  Найдите величину угла C.",
        "Решение: Первый способ. Возведём оба равенства в квадрат и сложим. Получим   4 = 2 + 2 (sin A cos B + cos A sin B) = 2 + 2 sin (A + B). Следовательно,   sin (A + B) = 1, то есть A + B =  90°.",
        "Ответ: 90°."
    ],
    "35425": [
        "Прямоугольный треугольник с углом в $30^\\circ$",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: Укажите неравносторонний треугольник, который можно разделить на три равных  треугольника.",
        "Подсказка: Ищите нужный треугольник среди прямоугольных треугольников.",
        "Решение: Искомый треугольник - прямоугольный с углами 30"
    ],
    "35658": [
        "Взаимоотношения между сторонами и углами треугольников (прочее)",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Дан треугольник со сторонами 2, 3, 4.  Найдите радиус наименьшего круга,  из которого можно вырезать этот треугольник.",
        "Подсказка: Это не всегда описанная около треугольника окружность.",
        "Решение: Заметим, что этот треугольник - тупоугольный.  Поэтому он помещается в окружность, построенную на наибольшей  стороне, как на диаметре (радиус этой окружности равен 2).  С другой стороны, из круга радиуса, меньшего 2, нельзя вырезать  данный треугольник, поскольку сторона длины 4 должна быть не  меньше диаметра круга.",
        "Ответ: 2.00"
    ],
    "52616": [
        "Вписанные и описанные окружности",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Гипотенуза прямоугольного треугольника равна 4  м.  Найдите радиус описанной окружности.",
        "Подсказка: Центр   окружности,    описанной    около    прямоугольного треугольника, совпадает с серединой гипотенузы.",
        "Решение: Центр   окружности,    описанной    около    прямоугольного треугольника, совпадает с серединой  гипотенузы.  Следовательно, радиус окружности равен половине гипотенузы, т. е. 2 м.",
        "Ответ: 2 м."
    ],
    "53435": [
        "Сумма углов треугольника. Теорема о внешнем угле.",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Угол треугольника равен сумме двух других его углов. Докажите, что треугольник прямоугольный.",
        "Подсказка: Воспользуйтесь теоремой о сумме углов треугольника.",
        "Решение: Пусть α, β и α + β – углы треугольника. Тогда α + β + (α + β) = 180°,   откуда α + β = 90°."
    ],
    "35612": [
        "Прямоугольные треугольники (прочее)",
        "Сложность: 2+",
        "Классы: 9,10",
        "Условие: Бесконечный коридор ширины 1 поворачивает под прямым углом.    Докажите, что можно подобрать проволоку так, чтобы расстояние между    ее концами    больше 4, и чтобы ее можно было протащить через этот    коридор.",
        "Подсказка: Изогните проволоку в дугу окружности.",
        "Решение: Картинка показывает, что если изогнуть проволоку в виде четверти    окружности, то ее можно будет протащить через поворот коридора.     В этом случае нетрудно посчитать длину хорды AB, стягивающей    проволоку.     Положим AX=OX=OY=AY=x. По условию XT=1 - это ширина коридора.    OA=OT=1+x. Из треугольника OXA получаем теперь, что    (1+x)"
    ],
    "35687": [
        "Правильный (равносторонний) треугольник",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: По стороне правильного треугольника катится окружность радиуса,    равного его высоте. Докажите, что угловая величина дуги,    высекаемой на окружности сторонами треугольника, всегда равна 60",
        "Подсказка: Рассмотрите угол между пересекающимися хордами, лежащими на прямых,    содержащих стороны треугольника.",
        "Решение: Пусть окружность катится по стороне BC треугольника ABC.    Тогда угол BAC равен полусумме двух дуг, равных 60"
    ],
    "54133": [
        "Средняя линия треугольника",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Точки",
        "Подсказка: Соедините середины",
        "Решение: Пусть",
        "Ответ: 3."
    ],
    "53455": [
        "Правильный (равносторонний) треугольник",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Докажите, что биссектрисы равностороннего треугольника делятся точкой пересечения в отношении 2 : 1, считая от вершины треугольника.",
        "Подсказка: Эти биссектрисы являются и медианами."
    ],
    "56830": [
        "Вписанные и описанные окружности",
        "Сложность: 2+",
        "Классы: 7,8,9",
        "Условие: На сторонах",
        "Решение: Пусть"
    ],
    "57593": [
        "Теорема косинусов",
        "Сложность: 2+",
        "Классы: 9",
        "Условие: Докажите, что",
        "Решение: По теореме косинусов"
    ],
    "57594": [
        "Теорема косинусов",
        "Сложность: 2+",
        "Классы: 9",
        "Условие: Докажите, что",
        "Решение: По теореме косинусов"
    ],
    "57599": [
        "Вписанная, описанная и вневписанная окружности; их радиусы",
        "Сложность: 2+",
        "Классы: 9",
        "Условие: Докажите, что:",
        "Решение: Пусть вписанная окружность касается стороны"
    ],
    "57600": [
        "Вписанная, описанная и вневписанная окружности; их радиусы",
        "Сложность: 2+",
        "Классы: 9",
        "Условие: Докажите, что:",
        "Решение: а) Согласно задаче"
    ],
    "57613": [
        "Длины сторон, высот, медиан и биссектрис",
        "Сложность: 2+",
        "Классы: 9",
        "Условие: Докажите, что",
        "Решение: Ясно, что"
    ],
    "57614": [
        "Длины сторон, высот, медиан и биссектрис",
        "Сложность: 2+",
        "Классы: 9",
        "Условие: Докажите, что",
        "Решение: Так как"
    ],
    "57615": [
        "Длины сторон, высот, медиан и биссектрис",
        "Сложность: 2+",
        "Классы: 9",
        "Условие: Докажите, что",
        "Решение: Достаточно заметить, что"
    ],
    "57616": [
        "Длины сторон, высот, медиан и биссектрис",
        "Сложность: 2+",
        "Классы: 9",
        "Условие: Докажите, что",
        "Решение: Согласно задаче"
    ],
    "53917": [
        "Сумма углов треугольника. Теорема о внешнем угле.",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: Через точку  A , лежащую на окружности с центром O, проведены диаметр AB и хорда AC. Докажите, что угол BAC вдвое меньше угла BOC.",
        "Решение: BOC – внешний угол равнобедренного треугольника AOC. По  теореме о внешнем угле треугольника ∠BOC = ∠OAC + ∠OCA = 2∠OAC = 2∠BAC."
    ],
    "57619": [
        "Синусы и косинусы углов треугольника",
        "Сложность: 2+",
        "Классы: 9",
        "Условие: Пусть α, β и γ - углы треугольника ABC. Докажите, что",
        "Решение: а) Пусть"
    ],
    "57620": [
        "Синусы и косинусы углов треугольника",
        "Сложность: 2+",
        "Классы: 9",
        "Условие: α, β и γ - углы треугольника ABC. Докажите, что",
        "Решение: а) Перемножая равенства"
    ],
    "57621": [
        "Синусы и косинусы углов треугольника",
        "Сложность: 2+",
        "Классы: 9",
        "Условие: α, β и γ - углы треугольника ABC. Докажите, что",
        "Решение: Складывая равенства"
    ],
    "77937": [
        "Вписанные и описанные окружности",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: В",
        "Решение: Пусть"
    ],
    "116514": [
        "Тригонометрические соотношения в прямоугольном треугольнике",
        "Сложность: 2+",
        "Классы: 10,11",
        "Условие: Три сферы попарно касаются внешним образом, а также касаются некоторой плоскости в   вершинах прямоугольного треугольника с катетом 1 и противолежащим углом 30°.   Найдите радиусы сфер.",
        "Подсказка: Если окружности радиусов r и R касаются внешним образом, то отрезок   их общей внешней касательной, заключённый между точками касания равен   .",
        "Решение: Пусть ABC – прямоугольный треугольник, в котором ∠C = 90°,   ∠A = 90°, BC = 1. Тогда AB = 2,   . Обозначим через x, y и z   радиусы сфер с центрами O1, O2 и O3,   касающихся плоскости треугольника ABC в точках A, B и C   соответственно и попарно касающихся между собой внешним образом (рис.1).",
        "Ответ: ответ"
    ],
    "35645": [
        "Правильный (равносторонний) треугольник",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Стороны синего и зеленого правильных треугольников соответственно  параллельны.  Периметр синего треугольника равен 4, а периметр зеленого  треугольника равен 5.  Найдите периметр шестиугольника, полученного в пересечении этих  треугольников.",
        "Подсказка: Сумма периметров синего и зеленого треугольников равна сумме  периметров шести маленьких треугольников, окаймляющих шестиугольник.",
        "Решение: Заметим, что сумма периметров синего и зеленого треугольников равна сумме   периметров шести маленьких правильных треугольников, окаймляющих   шестиугольник. Каждая сторона шестиугольника составляет 1/3 от   периметра   соответствующего треугольника. Поэтому периметр шестиугольника   равен одной трети от суммы периметров синего и зеленого   треугольников, т.е. равен 3.",
        "Ответ: 3.00"
    ],
    "52632": [
        "Вписанные и описанные окружности",
        "Сложность: 2+",
        "Классы: 8,9",
        "Условие: Сторона ромба равна 8 см, острый угол  равен 30",
        "Подсказка: Диаметр вписанного круга равен высоте ромба.",
        "Решение: Диаметр вписанного круга  равен  высоте  ромба,  а  высота, опущенная из вершины  на  противоположную  сторону,  есть  катет прямоугольного треугольника, лежащий против угла в 30",
        "Ответ: 2 см."
    ]
}