{
    "57709": [
        "Свойства суммы, разности векторов и произведения вектора на число",
        "Сложность: 2",
        "Классы: 9",
        "Условие: Докажите, что точка",
        "Решение: Точка"
    ],
    "57701": [
        "Неравенства с векторами",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Даны точки",
        "Решение: Пусть"
    ],
    "57712": [
        "Свойства суммы, разности векторов и произведения вектора на число",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Точки",
        "Решение: Пусть"
    ],
    "78052": [
        "Подобные треугольники",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Дан треугольник ABC. На сторонах AB, BC, CA взяты соответственно точки C1, A1, B1 так, что AC1 : C1B = BA1 : A1C = CB1 : B1A = 1 : n. На сторонах A1B1, B1C1, C1A1 треугольника A1B1C1 взяты  соответственно точки C2, A2, B2 так, что A1C2 : C2B1 = B1A2 : A2C1 = C1B2 : B2A1 = n : 1. Доказать, что A2C2 || AC, C2B2 || CB,   B2A2 || BA.",
        "Решение: Пусть    Тогда      В полученном выражении коэффициенты при a и c равны. Кроме того, a + b + c = 0, поэтому вектор  пропорционален b, то есть   A2C2 || AC.     Для остальных прямых доказательство аналогично."
    ],
    "34959": [
        "Пирамида (прочее)",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Можно ли расставить на ребрах 5-угольной пирамиды стрелки, так что  сумма всех образовавшихся 10 векторов была бы равна 0.",
        "Подсказка: Спроектируйте векторы на прямую, перпендикулярную основанию  пирамиды.",
        "Решение: Спроектируем векторы на прямую, перпендикулярную основанию  пирамиды и рассмотрим сумму проекций векторов.  Вклад векторов, принадлежащих основанию пирамиды, равен  0. Каждый вектор, идущий вдоль боковой стороны, проектируется в  вектор длины h, где h - высота пирамиды. Однако сумма пяти  коллинеарных векторов длины h не может равняться нулевому вектору,  поскольку 5 - нечетное число  (длина суммы этих пяти векторов равна kh, где k - нечетное число)."
    ],
    "57713": [
        "Свойства суммы, разности векторов и произведения вектора на число",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Через точку",
        "Решение: Пусть"
    ],
    "78545": [
        "Неравенства с векторами",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Из точки",
        "Решение: Отложим все векторы"
    ],
    "56471": [
        "Отрезки, заключенные между параллельными прямыми",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: На сторонах AB, BC, CD и DA выпуклого четырёхугольника ABCD взяты соответственно точки P, Q, R и Sб O – точка пересечения отрезков PR и QS.   Докажите,что если AP : AB = DR : DC и AS : AD = BQ : BC, то и SO : SQ = AP : AB, PQ : PR = AS : ;AD.",
        "Решение: Пусть AP : AP = α, AS: AD = β. Достаточно доказать, что    Но    аналогично    Таким образом, все следует из равенства    эквивалентному очевидному"
    ],
    "57083": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Правильный n-угольник A1...An вписан в окружность радиуса R с центром O,   ei = , x =  – произвольный вектор.   Докажите, что  Σ (ei, x)² = ½ nR²·OX².",
        "Решение: Пусть Bi – проекция точки X на прямую OAi. Тогда (ei, x) = (,  + ) = (, ) = ±R·OBi. Точки B1, ..., Bn лежат на окружности с диаметром OX и являются  вершинами правильного n-угольника при n нечётном и вершинами n/2-угольника, взятыми по два раза, при n чётном (см. задачу 56549). Поэтому Σ OBi² = n/2 OX² (см. задачу 57080)."
    ],
    "57714": [
        "Свойства суммы, разности векторов и произведения вектора на число",
        "Сложность: 3",
        "Классы: 9",
        "Условие: На сторонах",
        "Решение: Сложив равенства"
    ],
    "78135": [
        "Треугольники (прочее)",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Внутри треугольника ABC взята точка O. На лучах OA, OB и OC построены векторы единичной длины.   Доказать, что сумма этих векторов имеет длину, меньшую единицы.",
        "Решение: Пусть ,  и  – построенные векторы единичной длины."
    ],
    "55367": [
        "Разложение вектора по двум неколлинеарным векторам",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Пусть",
        "Решение: Рассмотрим сумму векторов"
    ],
    "57717": [
        "Вспомогательные проекции",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Точка",
        "Решение: Пусть"
    ],
    "57085": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Расстояние от точки X до центра правильного n-угольника равно d, r – радиус вписанной окружности n-угольника.   Докажите, что сумма квадратов расстояний от точки X до прямых, содержащих стороны n-угольника, равна n(r² + ½ d²).",
        "Решение: Пусть e1, ..., en — единичные векторы, направленные из центра O правильного n-угольника в середины его сторон; x = . Тогда расстояние от точки X до i-й стороны равно |(x, ei) – r|. Поэтому искомая сумма равна  ((x, ei)² – 2r(x, ei) + r²) =  (x, ei)² + nr². Согласно задаче 57083  (x, ei)² = ½ nd²."
    ],
    "57088": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 9",
        "Условие: а) Правильный n-угольник A1...An  вписан в окружность радиуса 1 с центром O; ei = , u –  произвольный вектор.  Докажите, что  (u, ei)ei = ½ nu.",
        "Решение: а) Пусть  Опустим из точки M перпендикуляры MBi на прямые OAi.     Точки B1, ..., Bn лежат на окружности с диаметром OM и являются вершинами правильного n-угольника при n нечётном и вершинами правильного n/2-угольника, взятыми по два раза, при n чётном (см. задачу 56549). Поэтому утверждение следует из задачи 55373 б)."
    ],
    "78017": [
        "Геометрические неравенства",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Даны четыре прямые",
        "Решение: Пусть"
    ],
    "78798": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Доказать, что можно расставить в вершинах правильного n-угольника  действительные числа x1, x2, ..., xn, все отличные от 0, так, чтобы для любого правильного k-угольника, все вершины которого являются вершинами исходного n-угольника, сумма чисел, стоящих в его вершинах, равнялась 0.",
        "Решение: Проведём через центр O правильного многоугольника   A1...An прямую l, не проходящую через его вершины. Пусть xi равно проекции вектора    на прямую, перпендикулярную l. Тогда все xi отличны от нуля. Сумма чисел xi, стоящих в вершинах правильного k-угольника, равна нулю, поскольку равна нулю соответствующая сумма векторов  (см.задачу 55373 а).."
    ],
    "108252": [
        "Векторы (прочее)",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Найдите наименьшую возможную длину суммы семи единичных векторов с неотрицательными координатами на плоскости",
        "Решение: Пусть",
        "Ответ: 5.00"
    ],
    "115912": [
        "Поворотная гомотетия",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: На сторонах треугольника",
        "Решение: Пусть"
    ],
    "58310": [
        "Индукция в геометрии",
        "Сложность: 5",
        "Классы: 8,9,10,11",
        "Условие: На прямой даны точки",
        "Решение: Докажем сначала требуемое утверждение при"
    ],
    "57681": [
        "Векторы сторон многоугольников",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: а) Докажите, что из медиан треугольника можно составить треугольник.",
        "Решение: а) Пусть"
    ],
    "56878": [
        "Свойства симметрии и центра симметрии",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Внутри треугольника ABC взята произвольная точка O и построены точки A1, B1 и C1, симметричные O относительно середин сторон BC, CA и AB. Докажите, что треугольники ABC и A1B1C1 равны и прямые AA1, BB1 иCC1 пересекаются в одной точке.",
        "Решение: Ясно, что  =  и    = , поэтому  = . Аналогично  =  и  = , то есть треугольники ABC и A1B1C1 равны. Кроме того, ABA1B1 и ACA1C1 – параллелограммы.  Значит, отрезки BB1 и CC1 проходят через середину отрезка AA1."
    ],
    "108546": [
        "Метод координат на плоскости",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите, что координаты точки пересечения медиан треугольника есть средние арифметические соответствующих координат вершин треугольника.",
        "Решение: Пусть A(x1, y1), B(x2, y2) и C(x3, y3) – вершины  треугольника, M(x0, y0) – точка пересечения его медиан."
    ],
    "108600": [
        "Ортоцентр и ортотреугольник",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Треугольник ABC вписан в окружность. Точка A1 диаметрально противоположна точке A, точка A0 – середина стороны BC, точка A2 симметрична точке A1 относительно точки A0. Точки B2 и C2 определяются аналогично. Докажите, что точки A2, B2 и C2 совпадают.",
        "Решение: Точки A2, B2 и C2 совпадают с ортоцентром H треугольника ABC – см. решение задачи 108949."
    ],
    "115460": [
        "Параллелограмм Вариньона",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: В выпуклом четырёхугольнике",
        "Решение: Пусть",
        "Ответ: пополам."
    ],
    "78490": [
        "Ортогональная (прямоугольная) проекция",
        "Сложность: 4",
        "Классы: 7,8",
        "Условие: Дан произвольный треугольник",
        "Решение: Пусть"
    ],
    "32109": [
        "Построение треугольников по различным точкам",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Восстановите а) треугольник; б) пятиугольник по серединам его \tсторон.",
        "Решение: а) Пусть ABC – искомый треугольник, A', B', C' – данные середины его сторон BC, CA и AB соответственно (рис. слева). Тогда AB || A'B', BC || B'C',   AC || A'C'.    Через точку A' проведём прямую a || B'C', через точку B' – прямую b || A'C', через точку C' – прямую c || A'B'. Треугольник ABC, ограниченный прямыми a, b и c, будет искомым.     Действительно AC'A'B' и BC'B'A' – параллелограммы. Поэтому AC' = B'A' = C'B, то есть C' – середина стороны AB. Аналогично B' – середина AC, а A' – середина BC.     Задача имеет единственное решение во всех случаях, когда данные три точки не лежат на одной прямой."
    ],
    "108959": [
        "Вневписанные окружности",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Вневписанные окружности касаются сторон AB и AC треугольника ABC в точках P и Q соответственно. Точка L – середина PQ, точка M – середина BC. Точки L1 и L2 симметричны точке L относительно  середин отрезков BM и CM соответственно. Докажите, что L1P = L2Q.",
        "Решение: Как известно, BP = CQ (см. задачу 55483). Положим  = b,  = c. Точки L и M – середины отрезков PQ и BC, поэтому  = ½ (b + c).   Отрезки BL1 и CL2 равны и параллельны отрезку LM.     Вектор  равен полусумме равных по модулю векторов b и  c, значит, он образует равные углы с этими векторами (диагональ ромба делит его угол пополам), то есть параллелен биссектрисе угла BAC. Поэтому и прямые BL1 и CL2 образуют равные углы с прямыми AB и AC соответственно. Следовательно, ∠PBL1 = ∠QCL2. Треугольники PBL1 и QCL2 равны по двум сторонам и углу между ними, следовательно, PL1 = QL2."
    ],
    "116597": [
        "Векторы (прочее)",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: На плоскости нарисованы n > 2 различных векторов   a1, a2, ..., an с равными длинами. Оказалось, что все векторы –a1 + a2 + ... + an,  a1 – a2 + a3 + ... + an, a1 + a2 + ... + an–1 – an также имеют равные длины. Докажите, что a1 + a2 + ... + an = 0.",
        "Решение: Отложим векторы 2a1, ..., 2an из одной точки: пусть    Тогда все точки A1, ..., An различны и лежат на окружности ω с центром O. Пусть s = a1 + ... + an. По условию, все векторы s – 2ai имеют одну и ту же длину r. Рассмотрим такую точку S, что     Поскольку    все точки A1, ..., An лежат на окружности Ω с центром S и радиусом r.    Итак, окружности ω и Ω имеют n > 2 общих точек. Это значит, что они совпадают, а тогда и их центры совпадают, то есть s = 0."
    ],
    "57084": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Найдите сумму квадратов расстояний от вершин правильного n-угольника, вписанного в окружность радиуса R, до произвольной прямой, проходящей через центр многоугольника.",
        "Решение: Пусть e1, ..., en – векторы, идущие из центра данного n-угольника в его вершины;   x – единичный вектор, перпендикулярный прямой l. Искомая сумма равна  (ei, x)² = ½ nR² (см. задачу57083)."
    ],
    "57086": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Докажите, что сумма квадратов длин проекций сторон правильного n-угольника на любую прямую равна ½ na², где a – сторона n-угольника.",
        "Решение: Пусть x – единичный вектор, параллельный прямой l, ei = . Тогда квадрат длины проекции стороны AiAi+1 на прямую l равен (x, ei)². Согласно задаче 57083 (x, ei)² = ½ na²."
    ],
    "57087": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Правильный n-угольник A1...An вписан в окружность радиуса R; X – точка этой окружности. Докажите, что",
        "Решение: Пусть a = , ei = . Тогда XAi4 = |a + ei|4 = (|a|² + 2(a, ei) + |ei|²)² = 4(R² + (a, ei))² = 4(R4 + 2R²(a, ei) + (a, ei)²).  (a, ei) = (a, ei) = 0. Согласно задаче 57083 (a, ei)² = ½ nR4, поэтому искомая сумма равна nR4 + 2nR4 = 6nR4."
    ],
    "57525": [
        "Экстремальные свойства треугольника (прочее)",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Среди всех треугольников, вписанных в данную окружность, найдите тот, укоторого максимальна сумма квадратов длин сторон.",
        "Решение: Пусть"
    ],
    "76451": [
        "Геометрические интерпретации в алгебре",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Доказать, что cos 2π/5 + cos 4π/5 = – ½.",
        "Подсказка: Эта сумма равна половине суммы из задачи  85241 б) при n = 5."
    ],
    "78103": [
        "Четырехугольники (прочее)",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: В выпуклом четырёхугольнике ABCD точка M – середина диагонали AC, точка N – середина диагонали BD. Прямая MN пересекает стороны AB и CD в точках M' и N'. Доказать, что если MM' = NN', то BC || AD.",
        "Решение: Предположим, что прямые AD и BC не параллельны. Тогда MN не параллельна BC (в противном случае MN содержит средние линии треугольников BCD и ABD, то есть BC || AD).    Пусть M'', K, N'' – середины сторон AB, BC, CD  соответственно. Как видно из сказанного выше, M' ≠ M'' и N' ≠ N''. Ясно, что  = ½  =  и  = . Поэтому M'M'' || N'N''. Следовательно, KM || AB || CD || KN, то есть M = N. Противоречие (из условия ясно, что эти точки различны)."
    ],
    "78244": [
        "Теория игр (прочее)",
        "Сложность: 4+",
        "Классы: 9,10,11",
        "Условие: Играют двое; один из них загадывает набор из целых чисел (",
        "Решение: Покажем, что задуманный набор можно определить, задав  всего один вопрос. Именно, достаточно взять"
    ],
    "78498": [
        "Площадь треугольника (прочее)",
        "Сложность: 5",
        "Классы: 9,10,11",
        "Условие: Дан произвольный треугольник",
        "Решение: Пусть"
    ],
    "57089": [
        "Правильные многоугольники",
        "Сложность: 5+",
        "Классы: 9",
        "Условие: Докажите, что если число n не является степенью простого числа, то существует выпуклый n-угольник со сторонами длиной 1, 2,..., n, все углы которого равны.",
        "Решение: Пусть e0, ..., en–1 – векторы сторон правильного n-угольника. Достаточно доказать, что, переупорядочив эти векторы, можно получить такой набор векторов {a1, ..., an}, что kak = 0.     Число n по условию можно представить в виде n = pq, где p и q взаимно просты. Докажем, что набор   {e0, ep, ..., e(q–1)p; eq, eq+p, ..., eq+(q–1)p, ...; e(p–1)q+p, ..., e(p–1)q+(q–1)p}, где все номера берутся по модулю n, – искомый.     Заметим сначала, что если xq + yp ≡ x'q + y'p (mod pq), то x ≡ x' (mod p) и y ≡ y' (mod q), поэтому в рассматриваемом наборе каждый из векторов e0, ..., en–1 встречается ровно один раз.     Концы векторов eq, eq+p, ..., eq+(q–1)p с общим началом образуют правильный q-угольник, поэтому их сумма равна нулю. Кроме того, векторы e0, ep, ..., e(q–1)p переходят в eq, eq+p, ..., eq+(q–1)p, при повороте на угол φ = 2π/p. Поэтому если e0 + 2ep + ... + qe(q–1)p = b, то   (q + 1)eq + (q + 2)eq+n + ... + 2qeq+(q–1)p = q(eq + ... + eq+(q–1)p) + eq + 2eq+p + ... + qeq+(q–1)p = Rφb, где Rφb – вектор, полученный из вектора b поворотом на угол φ.     Аналогичные рассуждения показывают, что для рассматриваемого набора векторов kak = b + Rφb + ... + R(p–-1)φb = 0."
    ],
    "57710": [
        "Свойства суммы, разности векторов и произведения вектора на число",
        "Сложность: 2",
        "Классы: 9",
        "Условие: Дано несколько точек идля некоторых пар (",
        "Решение: Возьмем произвольную точку"
    ],
    "110807": [
        "Принцип крайнего  (прочее)",
        "Сложность: 5+",
        "Классы: 9,10,11",
        "Условие: На плоскости даны точки",
        "Решение: Выберем на плоскости начало координат"
    ],
    "56846": [
        "Вписанные и описанные окружности",
        "Сложность: 8+",
        "Классы: 9,10,11",
        "Условие: Медианы треугольника",
        "Решение: Пусть"
    ],
    "108594": [
        "Экстремальные точки треугольника",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что сумма квадратов расстояний от точки",
        "Решение: Пусть"
    ],
    "108604": [
        "Существование определенного интеграла",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: На сторонах AB, BC и AC треугольника ABC взяты точки P, M и K так, что отрезки AM, BK и CP пересекаются в одной точке и  Докажите, что P, M и K – середины сторон треугольника ABC.",
        "Решение: Заметим (рис. слева), что"
    ],
    "55373": [
        "Поворот помогает решить задачу",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Пусть О – центр правильного многоугольника A1A2A3...An, X  – произвольная точка плоскости. Докажите, что:   a)",
        "Подсказка: Если при повороте на угол, не кратный 360°, относительно начала вектор переходит сам в себя, то этот вектор – нулевой.",
        "Решение: а) Обозначим    При повороте на угол  вокруг точки O точка Ai переходит в точку Ai+1 (1 ≤ i ≤ n – 1), а точка An – в точку A1. Поэтому вектор a при таком повороте переходит сам в себя. Следовательно, a = 0."
    ],
    "85241": [
        "Суммы числовых последовательностей и ряды разностей",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Докажите следующие равенства:",
        "Решение: а) См. в)."
    ],
    "57004": [
        "Прямая Эйлера и окружность девяти точек",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Углы треугольника ABC удовлетворяют соотношению sin²A + sin²B + sin²C = 1.   Докажите, что его описанная окружность и окружность девяти точек пересекаются под прямым углом.",
        "Решение: Из условия следует, что cos²A + cos²B + cos²C = 2. Из задачи 57622 б) видим, что cos A cos B cos C = – ½.     Пусть H – ортоцентр, K – середина стороны BC, O и J – центры описанной окружности и окружности девяти точек, R – радиус описанной окружности, тогда радиус окружности девяти точек равен R/2.      Согласно задаче 57694 OH² = R²(1 – 8 cos A cos B cos C) =  5R². Из задачи 108006 следует, что OJ² = ¼ OH² = R2 + (R/2)², то есть квадрат расстояния между центрами двух окружностей равен сумме квадратов их радиусов. Это и значит, что окружности пересекаются под прямым углом."
    ],
    "57082": [
        "Правильные многоугольники",
        "Сложность: 4",
        "Классы: 9,10",
        "Условие: Докажите, что сумма расстояний от произвольной точки X до вершин правильного n-угольника будет наименьшей, если X – центр n-угольника.",
        "Решение: Пусть Xk – образ точки X при повороте  относительно центра O данного n-угольника A1...An, переводящем Ak   в A1. При этом повороте отрезок AkX переходит в A1Xk.  Следовательно, A1X + ... + AnX = A1X1 + ... + A1Xn. А так какn-угольник X1...Xn правильный, то  + ... +  = n (см. задачу57077),  а значит, A1X1 + ... + A1Xn ≥ n."
    ],
    "57685": [
        "Векторы сторон многоугольников",
        "Сложность: 3+",
        "Классы: 8,9,10",
        "Условие: Сумма четырех единичных векторов равна нулю. Докажите, что их можно разбить на две пары противоположных векторов.",
        "Решение: Из данных векторов можно составить выпуклый четырехугольник. Длины всех сторон этого четырехугольника равны1, поэтому он— ромб; пары его противоположных сторон дают требуемое разбиение."
    ],
    "79360": [
        "Квадратичные неравенства (несколько переменных)",
        "Сложность: 4",
        "Классы: 11",
        "Условие: Дано 8 действительных чисел: a, b, c, d, e, f, g, h. Доказать,  что хотя бы одно из шести чисел ac + bd, ae + bf, ag + bh, ce + df, cg + dh, eg + fh неотрицательно.",
        "Решение: Рассмотрим на плоскости четыре вектора (a, b), (c, d), (e, f) и (g, h). Один из углов между этими векторами не превосходит 360° : 4 = 90°. Скалярное произведение соответствующих векторов неотрицательно, а данные шесть чисел являются скалярными произведениями всех пар наших четырёх векторов."
    ],
    "78140": [
        "Индукция в геометрии",
        "Сложность: 4+",
        "Классы: 9,10,11",
        "Условие: Бесконечная плоская ломаная",
        "Решение: Заметим, что координаты вектора"
    ],
    "57702": [
        "Неравенства с векторами",
        "Сложность: 3+",
        "Классы: 9",
        "Условие: Докажите, что из пяти векторов всегда можно выбрать два так, чтобы длина их суммы не превосходила длины суммы оставшихся трех векторов.",
        "Решение: Рассмотрим пять векторов"
    ],
    "57730": [
        "Псевдоскалярное произведение",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Докажите, что:",
        "Решение: а) Если"
    ],
    "57731": [
        "Псевдоскалярное произведение",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: Пусть",
        "Решение: Пусть"
    ],
    "57732": [
        "Псевдоскалярное произведение",
        "Сложность: 3+",
        "Классы: 8,9",
        "Условие: а) Докажите, что",
        "Решение: а) Ясно, что"
    ],
    "78255": [
        "Векторы (прочее)",
        "Сложность: 3+",
        "Классы: 11",
        "Условие: Известно, что",
        "Решение: Во-первых, заметим, что каждому комплексному числу можно сопоставить вектор на комплексной плоскости. Поэтому можно считать, что дано"
    ],
    "78264": [
        "Векторы (прочее)",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Точки",
        "Решение: Без ограничения общности можно считать, что"
    ],
    "79431": [
        "Векторы",
        "Сложность: 3+",
        "Классы: 9",
        "Условие: На сторонах треугольника",
        "Решение: Заметим, что"
    ],
    "79503": [
        "Неравенства с векторами",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Докажите, что ни для каких векторов",
        "Решение: Возведём данные неравенства в квадрат и почленно сложим их все (учитывая, что  для произвольного вектора"
    ],
    "78504": [
        "Неравенства с векторами",
        "Сложность: 4",
        "Классы: 9,10,11",
        "Условие: Из центра правильного 25-угольника проведены векторы во все его вершины.   Как надо выбрать несколько векторов из этих 25, чтобы их сумма имела наибольшую  длину?",
        "Решение: Пусть мы уже выбрали требуемым способом несколько векторов; и  – их сумма. Проведём через центр O 25-угольника прямую l, перпендикулярную вектору   . Предположим, что среди выбранных векторов содержится вектор , лежащий на прямой l или по другую сторону от прямой l, чем вектор . Если мы исключим этот вектор из числа выбранных, то новая сумма будет иметь большую длину. Действительно, треугольник OAS – прямоугольный или тупоугольный, и значит, SA > OS, но  SA = | – |. Предположим ещё, что в число выбранных векторов не вошёл какой-либо вектор , лежащий по ту же сторону от прямой l, что и вектор . Присоединим этот вектор к числу выбранных; новая сумма будет иметь большую длину: рассмотрим параллелограмм OBВ'S; треугольник OB'S – тупоугольный и OВ' > OS, но  OB' = | + |.  Мы видим, что в число выбранных векторов должны войти любые двенадцать, идущие подряд (угол между крайними векторами меньше 180°, а при добавлении тринадцатого вектора этого угол становится больше развёрнутого)."
    ],
    "55376": [
        "Разложение вектора по двум неколлинеарным векторам",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Точки",
        "Решение: Пусть"
    ],
    "57686": [
        "Векторы сторон многоугольников",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Пусть",
        "Решение: Пусть"
    ],
    "57692": [
        "Скалярное произведение. Соотношения",
        "Сложность: 4",
        "Классы: 9",
        "Условие: а) Пусть",
        "Решение: а) Выразим все входящие вуказанную формулу векторы через"
    ],
    "57693": [
        "Скалярное произведение. Соотношения",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Пусть",
        "Решение: Докажем, что"
    ],
    "57694": [
        "Скалярное произведение. Соотношения",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Докажите, что",
        "Решение: Ясно, что"
    ],
    "57695": [
        "Скалярное произведение. Соотношения",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Пусть",
        "Решение: Достаточно рассмотреть случай, когда длины сторон многоугольника"
    ],
    "57696": [
        "Скалярное произведение. Соотношения",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Пусть",
        "Решение: Пусть"
    ],
    "57697": [
        "Скалярное произведение. Соотношения",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Дан четырехугольник",
        "Решение: Пусть"
    ],
    "57698": [
        "Скалярное произведение. Соотношения",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Точки",
        "Решение: Фиксируем произвольную точку"
    ],
    "57703": [
        "Неравенства с векторами",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Десять векторов таковы, что длина суммы любых девяти их них меньше длины суммы всех десяти векторов. Докажите, что существует ось, проекция на которую каждого из десяти векторов положительна.",
        "Решение: Обозначим данные векторы"
    ],
    "57704": [
        "Неравенства с векторами",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Точки",
        "Решение: Пусть"
    ],
    "57705": [
        "Неравенства с векторами",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Дано восемь вещественных чисел",
        "Решение: Рассмотрим на плоскости четыре вектора ("
    ],
    "57711": [
        "Свойства суммы, разности векторов и произведения вектора на число",
        "Сложность: 4",
        "Классы: 8,9,10",
        "Условие: Внутри треугольника",
        "Решение: Пусть"
    ],
    "57715": [
        "Свойства суммы, разности векторов и произведения вектора на число",
        "Сложность: 4",
        "Классы: 9",
        "Условие: Четырехугольник",
        "Решение: Пусть"
    ],
    "57733": [
        "Псевдоскалярное произведение",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Три бегуна",
        "Решение: Пусть вначальный момент, т.е. при"
    ],
    "57734": [
        "Псевдоскалярное произведение",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: По трем прямолинейным дорогам спостоянными скоростями идут три пешехода. Вначальный момент времени они не находились на одной прямой. Докажите, что они могут оказаться на одной прямой не более двух раз.",
        "Решение: Пусть"
    ],
    "57682": [
        "Векторы сторон многоугольников",
        "Сложность: 3",
        "Классы: 8,9,10",
        "Условие: Стороны треугольника",
        "Решение: Пусть"
    ],
    "57735": [
        "Псевдоскалярное произведение",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Решите спомощью псевдоскалярного произведения задачу",
        "Решение: Пусть"
    ],
    "108897": [
        "Скалярное произведение. Соотношения",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Пусть",
        "Решение: Поскольку"
    ],
    "115330": [
        "Векторы помогают решить задачу",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Внутри треугольника",
        "Решение: Пусть"
    ],
    "115721": [
        "Векторы помогают решить задачу",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Докажите, что разность квадратов соседних сторон параллелограмма меньше произведения его диагоналей.",
        "Решение: Пусть"
    ],
    "57687": [
        "Векторы сторон многоугольников",
        "Сложность: 5",
        "Классы: 8,9,10",
        "Условие: Дано",
        "Решение: Отложим данные векторы от одной точки и, идя по часовой стрелке, занумеруем их по порядку:"
    ],
    "57688": [
        "Векторы сторон многоугольников",
        "Сложность: 5",
        "Классы: 9",
        "Условие: Даны четыре попарно непараллельных вектора, сумма которых равна нулю. Докажите, что из них можно составить: а)невыпуклый четырехугольник; б)самопересекающуюся четырехзвенную ломаную.",
        "Решение: Согласно задаче"
    ],
    "57699": [
        "Скалярное произведение. Соотношения",
        "Сложность: 5",
        "Классы: 9",
        "Условие: Докажите, что  ввыпуклом",
        "Решение: Пусть"
    ],
    "78001": [
        "Векторы сторон многоугольников",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Из произвольной внутренней точки",
        "Решение: Если мы повернём указанные векторы на"
    ],
    "57706": [
        "Неравенства с векторами",
        "Сложность: 5",
        "Классы: 9",
        "Условие: На окружности радиуса1 сцентром",
        "Решение: Докажем это утверждение по индукции. Для"
    ],
    "57716": [
        "Свойства суммы, разности векторов и произведения вектора на число",
        "Сложность: 5",
        "Классы: 9",
        "Условие: Четырехугольник",
        "Решение: Пусть"
    ],
    "57718": [
        "Вспомогательные проекции",
        "Сложность: 5",
        "Классы: 9",
        "Условие: Выпуклый 2",
        "Решение: Пусть"
    ],
    "57719": [
        "Вспомогательные проекции",
        "Сложность: 5",
        "Классы: 9",
        "Условие: Пусть",
        "Решение: Изменив нумерацию данных векторов и при необходимости меняя вектор"
    ],
    "57722": [
        "Метод усреднения",
        "Сложность: 5",
        "Классы: 9,10",
        "Условие: Даны два набора векторов",
        "Решение: Введем систему координат"
    ],
    "57723": [
        "Метод усреднения",
        "Сложность: 5",
        "Классы: 9,10",
        "Условие: Докажите, что если один выпуклый многоугольник лежит внутри другого, то периметр внутреннего многоугольника не превосходит периметра внешнего.",
        "Решение: Сумма длин проекций сторон выпуклого многоугольника на любую прямую равна удвоенной длине проекции многоугольника на эту прямую. Поэтому сумма длин проекций векторов сторон на любую прямую для внутреннего многоугольника не больше, чем для внешнего. Следовательно, согласно задаче"
    ],
    "57736": [
        "Псевдоскалярное произведение",
        "Сложность: 5",
        "Классы: 8,9",
        "Условие: Точки",
        "Решение: Пусть"
    ],
    "57737": [
        "Псевдоскалярное произведение",
        "Сложность: 5",
        "Классы: 8,9",
        "Условие: Дан треугольник",
        "Решение: Пусть"
    ],
    "57700": [
        "Скалярное произведение. Соотношения",
        "Сложность: 5+",
        "Классы: 9",
        "Условие: Ввыпуклом четырехугольнике сумма расстояний от вершины до сторон одна ита же для всех вершин. Докажите, что этот четырехугольник является параллелограммом.",
        "Решение: Пусть"
    ],
    "57720": [
        "Вспомогательные проекции",
        "Сложность: 5+",
        "Классы: 9",
        "Условие: Пусть",
        "Решение: Для доказательства равенства векторов достаточно проверить равенство их проекций (сучетом знака) на прямые"
    ],
    "57721": [
        "Вспомогательные проекции",
        "Сложность: 5+",
        "Классы: 9",
        "Условие: Пусть",
        "Решение: Пусть вписанная окружность касается сторон"
    ],
    "57724": [
        "Метод усреднения",
        "Сложность: 5+",
        "Классы: 9,10",
        "Условие: Сумма длин нескольких векторов на плоскости равна",
        "Решение: Если сумма длин векторов равна"
    ],
    "57725": [
        "Метод усреднения",
        "Сложность: 5+",
        "Классы: 9,10",
        "Условие: Докажите, что если длины всех сторон идиагоналей выпуклого многоугольника меньше",
        "Решение: Обозначим проекцию многоугольника на прямую"
    ],
    "57689": [
        "Векторы сторон многоугольников",
        "Сложность: 6",
        "Классы: 9",
        "Условие: Даны четыре попарно непараллельных вектора",
        "Решение: Согласно задаче"
    ],
    "57690": [
        "Векторы сторон многоугольников",
        "Сложность: 6",
        "Классы: 9",
        "Условие: Ввыпуклом пятиугольнике",
        "Решение: Пусть диагональ"
    ],
    "57707": [
        "Неравенства с векторами",
        "Сложность: 6",
        "Классы: 9",
        "Условие: Пусть",
        "Решение: Докажем сначала, что если"
    ],
    "57726": [
        "Метод усреднения",
        "Сложность: 6",
        "Классы: 9,10",
        "Условие: На плоскости даны четыре вектора",
        "Решение: Согласно   задаче"
    ],
    "57684": [
        "Векторы сторон многоугольников",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Из точки, лежащей внутри выпуклого",
        "Решение: После поворота на"
    ],
    "57738": [
        "Псевдоскалярное произведение",
        "Сложность: 6",
        "Классы: 8,9",
        "Условие: Пусть",
        "Решение: Пусть"
    ],
    "57739": [
        "Псевдоскалярное произведение",
        "Сложность: 6",
        "Классы: 8,9",
        "Условие: Ввыпуклом пятиугольнике",
        "Решение: Пусть"
    ],
    "57708": [
        "Неравенства с векторами",
        "Сложность: 6+",
        "Классы: 9",
        "Условие: Из точки",
        "Решение: Можно  считать,  что сумма"
    ],
    "57727": [
        "Метод усреднения",
        "Сложность: 6+",
        "Классы: 9,10",
        "Условие: Внутри выпуклого",
        "Решение: Согласно задаче"
    ],
    "57728": [
        "Метод усреднения",
        "Сложность: 6+",
        "Классы: 9,10",
        "Условие: Длина проекции замкнутой выпуклой кривой на любую прямую равна1. Докажите, что ее длина равна",
        "Решение: Длина кривой— предел периметров вписанных внее многоугольников. Рассмотрим вписанный многоугольник спериметром"
    ],
    "57729": [
        "Метод усреднения",
        "Сложность: 6+",
        "Классы: 9,10",
        "Условие: Дано несколько выпуклых многоугольников, причем нельзя провести прямую так, чтобы она не пересекала ни одного многоугольника ипо обе стороны от нее лежал хотя бы один многоугольник. Докажите, что эти многоугольники можно заключить вмногоугольник, периметр которого не превосходит суммы их периметров.",
        "Решение: Докажем, что периметр выпуклой оболочки всех вершин данных многоугольников не превосходит суммы их периметров. Для этого достаточно заметить, что по условию проекции данных многоугольников на любую прямую покрывают проекцию выпуклой оболочки."
    ],
    "55374": [
        "Пятиугольники",
        "Сложность: 2",
        "Классы: 8,9",
        "Условие: В выпуклом  пятиугольнике ABCDE с  единичными  сторонами середины P, Q сторон AB, CD и  середины S, T сторон BC, DE соединены отрезками PQ и ST. Пусть M и N – середины отрезков PQ  и ST. Найдите длину отрезка MN.",
        "Решение: См. задачу",
        "Ответ: 1/4."
    ],
    "35775": [
        "Стереометрия (прочее)",
        "Сложность: 2+",
        "Классы: 10,11",
        "Условие: Существует ли отличный от куба шестигранник, у которого все грани являются  равными ромбами?",
        "Подсказка: На любой тройке некомпланарных векторов, отложенных от одной точки,   можно построить параллелепипед.",
        "Решение: Отложим от одной точки O пространства три равных по длине вектора  a=OA, b=OB, c=OC, попарные углы между которыми равны и отличны от   90"
    ],
    "57691": [
        "Скалярное произведение. Соотношения",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Докажите, что если диагонали четырехугольника",
        "Решение: Пусть"
    ],
    "34961": [
        "Геометрические неравенства (прочее)",
        "Сложность: 3",
        "Классы: 9,10,11",
        "Условие: Дано 8 действительных чисел: a,b,c,d,,e,f,g,h.  Докажите, что хотя бы одно из 6 чисел  ac+bd, ae+bf, ag+bh, ce+df, cg+dh, eg+fh неотрицательно.",
        "Подсказка: Используйте векторы.",
        "Решение: Рассмотрим на плоскости 4 вектора с координатами  (a;b),(c;d),(e;f),(g;h). Указанные 6 чисел - попарные скалярные  произведения этих векторов.  Угол между некоторыми двумя векторами не превосходит  90"
    ],
    "35477": [
        "Прямоугольники и квадраты. Признаки и свойства",
        "Сложность: 3",
        "Классы: 9,10",
        "Условие: На плоскости нарисованы два квадрата - ABCD и KLMN       (их вершины перечислены против часовой стрелки).       Докажите, что середины отрезков AK, BL, CM, DN также       являются вершинами квадрата.",
        "Подсказка: Выразите векторы, задающие стороны серединного       квадрата через векторы, задающие стороны исходных       квадратов.",
        "Решение: Пусть точки P, Q, R, S - середины отрезков AK, BL, CM, DN       соответственно.       Запишем  следующие векторные равенства:       PQ=PA+AB+BQ;       PQ=PK+KL+LQ.       Сложим эти равенства; учитывая то, что векторы       PA и PK, а также векторы BQ и LQ взаимно обратны, получаем,       что 2PQ=AB+KL, или       PQ=(AB+KL)/2.       Аналогичным образом можно получить, что       QR=(BC+LM)/2.       Вектор BC получается из вектора AB поворотом на 90"
    ],
    "35556": [
        "Стереометрия (прочее)",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Известно, что в тетраэдре две пары скрещивающихся ребер    перепндикулярны. Докажите, что и третья пара скрещивающихся ребер    обладает этим свойством.",
        "Подсказка: Удобно использовать скалярное произведение векторов.",
        "Решение: Обозначим три вектора, идущие вдоль ребер, выходящих из одной вершины    тетраэдра, за a, b, c. Тогда векторы, идущие вдоль оставшихся    трех ребер, равны b-c, c-a, a-b.    Условие перпендикулярности двух векторов запишем как    равенство нулю скалярного произведения.    Таким образом, перпендикулярность двух пар скрещивающихся ребер    запишется как система двух равенств    (a,b-c)=0, (b,c-a)=0.    Раскроем эти равенства, используя свойство линейности     скалярного произведения:    (a,b)-(a,c)=0, (b,c)-(b,a)=0.    Сложив эти равенства, получаем (с учетом (a,b)=(b,a)):    (b,c)-(a,c)=0 или (b-a,c)=0,    что означает перпендикулярность для оставшейся пары     скрещивающихся ребер."
    ],
    "57079": [
        "Правильные многоугольники",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Точка A лежит внутри правильного десятиугольника X1...X10, а точка B — вне его. Пусть a =  + ... +  и b =  + ... + .   Может ли оказаться, что |a| > |b| ?",
        "Решение: Согласно задаче 55373   a = 10 и b = 10 – центр многоугольника X1...X10. Ясно, что если точка A расположена очень близко к вершине многоугольника, а точка B – очень близко к середине стороны, то AO > BO.",
        "Ответ: Может."
    ],
    "57080": [
        "Правильные многоугольники",
        "Сложность: 3",
        "Классы: 9",
        "Условие: Правильный многоугольник A1...An вписан в окружность радиуса R с центром O, X — произвольная точка.   Докажите, что  A1X² + ... + AnX² = n(R² + d²), где d = OX.",
        "Решение: Так как    то      (см. задачу 57077)."
    ],
    "111055": [
        "Метод координат",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На плоскости даны точки",
        "Решение: Поскольку прямые",
        "Ответ: 1:3, считая от точки"
    ],
    "111056": [
        "Метод координат",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: На плоскости даны точки",
        "Ответ: 1:3, считая от точки"
    ]
}