{
    "103008": [
        "Отношение объемов",
        "Сложность: 2",
        "Классы: 5,6",
        "Условие: Когда Гулливер попал в Лилипутию, он обнаружил, что там все вещи ровно в 12 раз короче, чем на его родине. Сможете ли Вы сказать, сколько лилипутских спичечных коробков поместится в спичечный коробок Гулливера?",
        "Подсказка: Заметьте, в Гулливерский спичечный коробок должно помещаться 12 лилипутских коробков в ширину, 12 — в длину и 12 — в высоту.",
        "Решение: В Гулливерском спичечном коробке должно помещаться 12 лилипутских коробков в ширину, 12 — в длину и 12 — в высоту. Всего 12·12·12=1728 коробков."
    ],
    "115940": [
        "Отношение объемов",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: В основании пирамиды объёма",
        "Решение: Пусть"
    ],
    "109164": [
        "Объем помогает решить задачу",
        "Сложность: 4+",
        "Классы: 10,11",
        "Условие: Если через точку",
        "Решение: Точка"
    ],
    "88301": [
        "Арифметика. Устный счет и т.п.",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Куб со стороной 1 м распилили на кубики со стороной 1 см и положили их в ряд (по прямой). Какой длины оказался ряд?",
        "Решение: Получим 100×100×100=1000000(см) или 10000м=10км."
    ],
    "30911": [
        "Задачи с неравенствами. Разбор случаев",
        "Сложность: 2",
        "Классы: 6,7",
        "Условие: Поместится ли все население Земли, все здания и сооружения на ней в куб с длиной ребра 3 километра?",
        "Решение: Объём такого куба 27·109 м³. Население Земли превышает 7·109 человек. Поэтому на каждого человека приходится меньше 4 м³. Можно предположить, что сооружений на человека приходится больше.",
        "Ответ: Не поместится."
    ],
    "87973": [
        "Арифметика. Устный счет и т.п.",
        "Сложность: 2",
        "Классы: 5,6,7",
        "Условие: Когда Гулливер попал вЛилипутию, он обнаружил, что там все вещи ровно в12раз короче, чем наего родине. Сможетели вы сказать, сколько лилипутских спичечных коробков поместится вспичечный коробок Гулливера?",
        "Подсказка: Обратите внимание: вГулливерский спичечный коробок должно помещаться 12лилипутских коробков вширину, 12— вдлину и12— ввысоту.",
        "Решение: Вгулливерском спичечном коробке должно помещаться 12лилипутских коробков вширину, 12— вдлину и12— ввысоту. Всего",
        "Ответ: 1728коробков."
    ],
    "87409": [
        "Объем параллелепипеда",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: В наклонном параллелепипеде проекция бокового ребра на плоскость основания равна 5, а высота равна 12. Сечение, перпендикулярное боковому ребру, есть ромб с площадью  24 и диагональю 8. Найдите боковую поверхность и объём параллелепипеда.",
        "Решение: Пусть",
        "Ответ: 260; 312."
    ],
    "87411": [
        "Объем призмы",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Площадь основания прямой треугольной призмы равна 4, площади боковых граней равны 9, 10 и 17. Найдите объём призмы.",
        "Решение: Пусть",
        "Ответ: 12.00"
    ],
    "30910": [
        "Объем шара, сегмента и проч.",
        "Сложность: 3",
        "Классы: 6,7",
        "Условие: Представьте себе, что Землю раскатали в колбаску так, чтобы она достала до Солнца.   Какой толщины будет эта колбаска? Постарайтесь ошибиться не более чем в 10 раз.",
        "Решение: Пусть R ≈ 6000 км – радиус Земли, R ≈ 150000000 км – расстояние от Земли до Солнца, r – радиус колбаски. Тогда πr²L = 4/3 πR³, откуда",
        "Ответ: ≈ 44 км."
    ],
    "35145": [
        "Тетраэдр (прочее)",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Существует ли тетраэдр, высоты которого равны 1, 2, 3 и 6?",
        "Подсказка: Выразите площади граней тетраэдра через его объем и длины высот.",
        "Решение: Предположим, что такой тетраэдр существует. Обозначим через V его объём, а через S1, S2, S3, S4 – площади граней. Тогда 3V = S1 = 2S2 = 3S3 = 6S4. Отсюда S1 = S2 + S3 + S4. Однако в любом тетраэдре сумма площадей трёх граней больше площади четвёртой грани (пространственный аналог неравенства треугольника). Действительно, проекции трёх граней на четвёртую полностью покроют четвёртую грань, а площадь проекции грани меньше площади самой грани. Противоречие.",
        "Ответ: Не существует."
    ],
    "86988": [
        "Объем тетраэдра и пирамиды",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Известно, что в некоторую пирамиду можно вписать шар. Докажите, что объём этой пирамиды равен трети произведения радиуса этого шара на полную поверхность пирамиды.",
        "Решение: Соединив центр"
    ],
    "87412": [
        "Объем призмы",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Основанием прямой призмы служит равнобедренная трапеция",
        "Решение: Пусть",
        "Ответ: 906.00"
    ],
    "87256": [
        "Частные случаи тетраэдров (прочее)",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Основание пирамиды – равнобедренный треугольник с основанием 6 и высотой 9. Каждое боковое ребро равно 13. Найдите объём пирамиды.",
        "Решение: Пусть",
        "Ответ: 108.00"
    ],
    "87270": [
        "Конус",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Два равных конуса имеют общую высоту. Плоскости их оснований параллельны. Докажите, что объём общей части конусов равен  четверти объёма каждого из них.",
        "Решение: Пусть"
    ],
    "87271": [
        "Конус",
        "Сложность: 3",
        "Классы: 8,9",
        "Условие: Докажите, что объём конуса равен третьей части произведения боковой поверхности на расстояние от центра основания до образующей.",
        "Решение: Пусть"
    ],
    "87429": [
        "Объем круглых тел",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Найдите объём конуса, у которого площадь боковой поверхности равна",
        "Решение: Пусть",
        "Ответ: 12.00"
    ],
    "87435": [
        "Объем тетраэдра и пирамиды",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Боковое ребро правильной треугольной пирамиды наклонено к  плоскости основания под углом",
        "Ответ: 6.00"
    ],
    "87418": [
        "Четырехугольная пирамида",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Основанием пирамиды служит параллелограмм, соседние стороны которого равны 9 и 10, а одна из диагоналей равна 11. Противоположные боковые рёбра равны и каждое из больших рёбер равно",
        "Решение: Пусть",
        "Ответ: 200.00"
    ],
    "87420": [
        "Частные случаи параллелепипедов (прочее)",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Основанием прямого параллелепипеда служит параллелограмм, один из углов которого равен",
        "Решение: Пусть",
        "Ответ: 12.00"
    ],
    "87428": [
        "Прямоугольные параллелепипеды",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: В основании прямоугольного параллелепипеда лежит квадрат со стороной",
        "Решение: Пусть диагональ",
        "Ответ: 72.00"
    ],
    "109368": [
        "Подобие",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Высота пирамиды равна 3, площадь основания равна 9. Найдите  объём призмы, одно основание которой принадлежит основанию  пирамиды, а противоположное основание является сечением пирамиды  плоскостью, проходящей на расстоянии 1 от вершины.",
        "Решение: Пусть",
        "Ответ: 2.00"
    ],
    "110233": [
        "Отношение объемов",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Пусть",
        "Ответ: 5.00"
    ],
    "86961": [
        "Объем тетраэдра и пирамиды",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Докажите, что из боковых граней четырёхугольной пирамиды, основанием которой служит параллелограмм, можно составить треугольную пирамиду, причём её объём вдвое меньше объёма   исходной четырёхугольной пирамиды.",
        "Решение: Пусть"
    ],
    "110318": [
        "Объем тела равен сумме объемов его частей",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: В вершинах единичного квадрата восставлены к его плоскости перпендикуляры и на них по одну сторону от плоскости квадрата взяты точки на расстояниях 3, 4, 6 и 5 от этой плоскости (в порядке обхода). Найдите объём многогранника, вершинами которого являются указанные точки и вершины квадрата.",
        "Решение: Пусть ABCD – единичный квадрат, а A1, B1, C1 и D1 – указанные точки на перпендикулярах к его плоскости, причём AA1 = 3, BB1 = 4, CC1 = 6, DD1 = 5.      Продолжим перпендикуляры до отрезков AA2 = BB2 = CC2 = DD2 = 9. Заметим, что A1B1C1D1 – паралелограмм (например, потому что середины отрезков A1C1 и B1D1 совпадают). Следовательно, точки A1, B1, C1, D1 лежат в одной плоскости, которая делит паралеллепипед ABCDA2B2C2D2 на две равные фигуры. Поскольку объем указанного паралеллепипеда равен 9, то объем каждой из половинок равен 9/2.",
        "Ответ: 4,5."
    ],
    "110321": [
        "Куб",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Внутри куба с ребром, равным 10, рассматриваются следующие  множества точек:   а) точки, удалённые на расстояние, не превышающее 1, ровно от трёх  граней куба;   б) точки, удалённые на расстояние, не превышающее 1, ровно от двух  граней куба;   в) точки, удаленные на расстояние, не превышающее 1, ровно от одной  граней куба.   Найдите объём тел, состоящих из этих точек.",
        "Ответ: Ю) 8; А) 96; Б) 384."
    ],
    "110420": [
        "Объем тела равен сумме объемов его частей",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Пусть",
        "Решение: Пусть"
    ],
    "111145": [
        "Объем тела равен сумме объемов его частей",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Выпуклый многогранник",
        "Решение: Пусть",
        "Ответ: 13.00"
    ],
    "111146": [
        "Объем тела равен сумме объемов его частей",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Выпуклый многогранник",
        "Ответ: 13"
    ],
    "111314": [
        "Объем помогает решить задачу",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Докажите, что если",
        "Решение: Пусть"
    ],
    "111315": [
        "Объем помогает решить задачу",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: На грани",
        "Решение: Пусть"
    ],
    "115389": [
        "Неравенства с объемами",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: На левую чашу весов положили два шара радиусов3 и5, ана правую— один шар радиуса8. Какая из чаш перевесит? (Все шары изготовлены целиком из одного и того же материала.)",
        "Решение: Заметим, что два меньших шара, если их поставить рядом, поместятся внутрь большого. Значит, их суммарный объем меньше.",
        "Ответ: Перевесит правая чаша весов."
    ],
    "78127": [
        "Правильный тетраэдр",
        "Сложность: 4",
        "Классы: 11",
        "Условие: Точка",
        "Решение: Опустим из точки"
    ],
    "86994": [
        "Касательные к сферам",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В треугольной пирамиде",
        "Решение: Пусть",
        "Ответ: 36.00"
    ],
    "87029": [
        "Площадь сечения",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Объём пирамиды",
        "Решение: Поскольку секущая плоскость проходит через середины противоположных рёбер тетраэдра, она делит его объём пополам. Пусть секущая плоскость пересекает ребро",
        "Ответ: 3.00"
    ],
    "87081": [
        "Параллельный перенос",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Один фермер сварил сыр в виде неправильной пятиугольной призмы, а другой — в виде правильной четырёхугольной  пирамиды, высота которой в два раза меньше стороны  основания. Ночью мыши отъели от всех вершин этих многогранников все частицы сыра, которые находились  на расстоянии не больше 1 см от соответствующей вершины. У съеденных кусков сыра не было общих частиц. Какой из фермеров понёс больший ущерб и во сколько раз его ущерб больше?",
        "Решение: На продолжении бокового ребра",
        "Ответ: Ущерб первого фермера в 4,5 раза больше ущерба второго."
    ],
    "108829": [
        "Касательные к сферам",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В основании треугольной пирамиды",
        "Ответ: 450.00"
    ],
    "110425": [
        "Сфера, касающаяся ребер или сторон пирамиды",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Дана пирамида",
        "Решение: Пусть",
        "Ответ: 48.00"
    ],
    "110426": [
        "Сфера, касающаяся ребер или сторон пирамиды",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Дана пирамида",
        "Ответ: 12.00"
    ],
    "110469": [
        "Сфера, вписанная в пирамиду",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Основанием пирамиды",
        "Решение: Обозначим",
        "Ответ: 126.00"
    ],
    "110470": [
        "Сфера, вписанная в пирамиду",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Основанием пирамиды",
        "Ответ: 88.00"
    ],
    "110471": [
        "Сфера, вписанная в пирамиду",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Основанием пирамиды",
        "Ответ: 105.00"
    ],
    "110472": [
        "Сфера, вписанная в пирамиду",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Основанием пирамиды",
        "Ответ: 84.00"
    ],
    "110492": [
        "Сфера, описанная около тетраэдра",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Дана треугольная пирамида, рёбра которой равны 2, 6, 6, 8, 8, 10. Найдите радиус описанной вокруг пирамиды сферы и объём пирамиды.",
        "Ответ: 5;"
    ],
    "109378": [
        "Объем тетраэдра и пирамиды",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Найдите объём треугольной пирамиды, пять рёбер которой равны  2, а шестое равно",
        "Решение: Пусть",
        "Ответ: 1.00"
    ],
    "110320": [
        "Объем тела равен сумме объемов его частей",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Каркас куба изготовлен из деревянных брусьев, сечением которых  является квадрат со стороной 1. Ребро куба равно 8. Найдите объём  каркаса.",
        "Ответ: 80.00"
    ],
    "110393": [
        "Объем помогает решить задачу",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Существует ли треугольная пирамида, высоты которой равны 1, 2,  3 и 6?",
        "Решение: Докажем, что площадь любой грани тетраэдра меньше суммы  площадей трёх остальных его граней. В самом деле, ортогональные  проекции на плоскость грани тетраэдра трёх остальных его граней  полностью покрывают эту грань, а площадь ортогональной проекции  треугольника на плоскость, ему не параллельную, равна площади  проектируемого треугольника, умноженной на косинус угла между этой  плоскостью и плоскостью проектируемого треугольника. Следовательно,  площадь грани тетраэдра меньше суммы площадей остальных трёх его  граней.   Предположим теперь, что существует тетраэдр, с высотами",
        "Ответ: Нет."
    ],
    "110408": [
        "Объем помогает решить задачу",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Площади граней",
        "Решение: Пусть биссекторная плоскость двугранного угла с ребром"
    ],
    "35491": [
        "Объем тетраэдра и пирамиды",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Докажите, что если расстояния между скрещивающимися рёбрами тетраэдра равны h1, h2, h3, то его объём не меньше &frac13; h1h2h3.",
        "Подсказка: Впишите тетраэдр в параллелепипед с высотами h1, h2, h3.",
        "Решение: Возьмём пару скрещивающихся ребер тетраэдра. Проведём через каждую из них плоскость, параллельную этим рёбрам. Проделав так с каждой парой скрещивающихся рёбер, получим шесть плоскостей, в пересечении которых образуется     параллелепипед, причем высоты этого параллелепипеда равны расстояниям между соответствующими скрещивающимися рёбрами тетраэдра. Отношение объёма тетраэдра к объёму параллелепипеда равно 1 : 3. Действительно, тетраэдр получается из параллелепипеда отрезанием четырёх угловых тетраэдров, каждый из которых имеет три ребра, совпадающие с тремя рёбрами параллелепипеда. Объем каждого из угловых тетраэдров равен &frac16; объёма параллелепипеда (площадь основания тетраэдра равна половине площади основания параллелепипеда, а их высоты совпадают). Поэтому достаточно показать, что объём параллелепипеда с высотами h1, h2, h3 не меньше чем  h1h2h3.      Введём стандартное обозначение вершин параллелепипеда – ABCDA'B'C'D'. Пусть h1 – расстояние между плоскостями ABCD и A'B'C'D', h2 – между плоскостями ADA'D' и BCB'C', h3 – между плоскостями ABA'B' и CDC'D'. Тогда AD ≥ h3, высота h, проведённая к стороне AD в параллелограмме ABCD, не меньше h2, площадь SABCD ≥ h2h3, а объём параллелепипеда равен SABCDh1 ≥ h1h2h3."
    ],
    "108835": [
        "Объем призмы",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Докажите, что объём треугольной призмы равен половине произведения площади боковой грани на расстояние от этой  грани до противолежащего ребра.",
        "Решение: Пусть"
    ],
    "76419": [
        "Объем тетраэдра и пирамиды",
        "Сложность: 3+",
        "Классы: 10,11",
        "Условие: Найти объём правильной четырёхугольной пирамиды, стороны основания которой",
        "Решение: Пусть длина бокового ребра равна"
    ],
    "76442": [
        "Объем тетраэдра и пирамиды",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: По двум скрещивающимся прямым скользят два отрезка. Доказать, что объём тетраэдра с вершинами в концах этих отрезков не зависит от положения последних.",
        "Решение: Покажем, что объём такого тетраэдра равен"
    ],
    "79484": [
        "Объем тетраэдра и пирамиды",
        "Сложность: 4",
        "Классы: 11",
        "Условие: Доказать, что если расстояния между скрещивающимися рёбрами тетраэдра равны",
        "Решение: Рассмотрим параллелепипед, образованный плоскостями, проходящими через рёбра  тетраэдра параллельно противоположным рёбрам. Объём тетраэдра составляет 1/3  объёма этого параллелепипеда (см. решение задачи"
    ],
    "87291": [
        "Отношение объемов",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Дана пирамида",
        "Ответ: 6.00"
    ],
    "110323": [
        "Объем призмы",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Докажите, что плоскость, пересекающая боковую поверхность  правильной",
        "Решение: Пусть"
    ],
    "110427": [
        "Объем тетраэдра и пирамиды",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: В основании пирамиды лежит прямоугольник. Все боковые рёбра равны. Плоскость пересекает боковые рёбра пирамиды, отсекая на них отрезки",
        "Решение: Пусть плоскость пересекает боковые рёбра"
    ],
    "110510": [
        "Объем помогает решить задачу",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Сторона основания",
        "Решение: 1) Пусть",
        "Ответ: 8;"
    ],
    "110511": [
        "Объем помогает решить задачу",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Диагональ основания",
        "Ответ: 8;"
    ],
    "87341": [
        "Объем тетраэдра и пирамиды",
        "Сложность: 3",
        "Классы: 10,11",
        "Условие: Основанием пирамиды",
        "Ответ: Пусть"
    ],
    "110738": [
        "Объем помогает решить задачу",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: (Теорема Бретшнейдера.)}Пусть противоположные рёбра тетраэдра равны",
        "Решение: Пусть"
    ],
    "110950": [
        "Отношение объемов",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: Точки",
        "Ответ: 1,"
    ],
    "111117": [
        "Объем помогает решить задачу",
        "Сложность: 4",
        "Классы: 10,11",
        "Условие: Докажите, что произведение длин двух противоположных рёбер тетраэдра, делённое на произведение синусов двугранных углов тетраэдра, соответствующих этим рёбрам, для данного тетраэдра постоянно (теорема синусов для тетраэдра}.",
        "Решение: Пусть"
    ],
    "111303": [
        "Отношение объемов",
        "Сложность: 4",
        "Классы: 8,9",
        "Условие: В правильной треугольной пирамиде",
        "Ответ: а)  ;  б)  ."
    ]
}